{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "sfn1pg",
            "title": "Why the hell are you still on layer one?!",
            "url": "https://www.reddit.com/r/ethereum/comments/sfn1pg/why_the_hell_are_you_still_on_layer_one/",
            "author": "mrcleansocks",
            "created_utc": 1643477546.0,
            "score": 578,
            "num_comments": 415,
            "subreddit": "ethereum",
            "selftext": "We're all moving squad, pack your bags, we're heading to the newfoundland of low fees, high security and decentralization.  If you're still making trades or buying NFTs on Layer one, you're burning money.\n\n***ROLLUPS ARE HERE***\n\nLayer 2 rollups are ready today!  Including [Loopring](https://loopring.org/), [zkSync](https://zksync.io/), [Optimistic Ethereum](https://www.optimism.io/), and [Arbitrum](https://bridge.arbitrum.io/).  No more of that sidechain/sister chain business, we can support Ethereum by moving our assets to any of these layer two chains and increasing Liquidity incentives.  The more of us on L2 the better the sandbox becomes.\n\n***FOR THE NEWBIES***\n\nFor those of you who are newbies and have never opened a crypto wallet, or those just doing small trades I'd recommend [Loopring Wallet](https://loopring.io/#/wallet) or [Argent Wallet](https://www.argent.xyz/) (powered by zkSync/starknet).  Both of these systems use smart wallets and make holding crypto stupid proof!  When these scaling solutions launch EVM smart contract, anybody will be able to have world class security for less than than a few dollars.\n\n***FOR THE OUT OF THE LOOP CRYPTO VETERANS***\n\nIf you're a bit more experienced, have some crypto savings or just want to continue interacting with Dapps, try bridging your funds to [Arbitrum](https://bridge.arbitrum.io/) or [Optimism](https://gateway.optimism.io/)!  Contract calls are roughly around $1 and make trading easy.  They do lack a bit of liquidity, BUT, the more of us that transfer to these L2 solutions, the more incentive there is for liquidity providers to move!\n\n***WE ALL NEED TO MOVE TO L2 IN ORDER TO INCENTIVIZE LIQUIDITY PROVIDERS TO MOVE!***\n\n\"*But mrcleansocks, all my funds are on binance and coinbase? how am i supposed to get to layer 2 without touching layer 1 gas fees?\"*\n\n**EASY!**\n\nYou need to go to [Layerswap](https://www.layerswap.io/)!  They will help you bridge your funds from CEX's to L2s!  No more dirty nasty layer one gas fees to stop you from being your own bank. SO GET ON IT!\n\nOn a twitter spaces call between Optimism, Arbitrum, zkSync, and Starknet, they all said that sub 1 cent transactions are coming!  We are on the verge of Layer 2 2022!!!! It's happening! We are scaling!  But we all need to get off layer one!  So get your shit together and let's roll squad, we're building the new world and it's on Layer two now!\n\n&#x200B;\n\nedit - Honestly, mods, we need a sticky post to address this. If you're too lazy, just pin this post so people can find their way to L2",
            "stickied": false,
            "comments": [
                {
                    "id": "hur4qd1",
                    "author": "Zarxrax",
                    "score": 25,
                    "created_utc": 1643483277.0,
                    "response": "I have a newbie question about layer 2s. Aren't each one of these basically completely different networks that are competing with each other (and secured by ethereum)?\n\nSo for instance, if I want to run a particular application or service, is that going to be on a specific L2, and then I will have to transfer funds over to THAT L2 in order to use the application? Or if I want to send money to a friend who is using an L2, I need to be on the same one? Or is that not how any of this works, and it doesn't really matter which one I choose, because they can interoperate with each other?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hurioz2",
                            "author": "NessDan",
                            "score": 3,
                            "created_utc": 1643489003.0,
                            "response": "Yes, the biggest kicker is that if a DAPP is on L1, it doesn't mean it's on L2 (or would ever be moved to L2.)",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hur8hz5",
                            "author": "levi97zzz",
                            "score": 8,
                            "created_utc": 1643484824.0,
                            "response": "yes the l2 is competing with each other, which is a good thing cause it will drive fee down. moving between l2 is pretty cheap since its a l2 to l2 tx, not l1 to l2",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hurkh2x",
                                    "author": "paddylov",
                                    "score": 7,
                                    "created_utc": 1643489753.0,
                                    "response": "How that a good thing? We are losing composability of smart contracts. It is a good for people who just stake of send money to each others perhaps",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "huruswi",
                                            "author": "NewChallengers_",
                                            "score": 1,
                                            "created_utc": 1643494106.0,
                                            "response": "But they all work with EVM, so it's easy to trade from Arbitrum to Loopring, for example. The only thing they don't share is liquidity together but maybe one day they can, so it really doesn't even matter. \n\nAlso, maybe one day one of them will really take over so we can get all ERC20 Uniswap pairs on L2 one day. We can dream...",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hut19h7",
                                                    "author": "cakes",
                                                    "score": 2,
                                                    "created_utc": 1643513087.0,
                                                    "response": "\"maybe one day\" gives me absolutely no reason to use something right now",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hute2po",
                                                            "author": "levi97zzz",
                                                            "score": 2,
                                                            "created_utc": 1643519281.0,
                                                            "response": "idk man if anything you should take advantage of it right now. since the LP is not linked together between different l2 the apy for some pools on curve and uniswap on arbitrum is crazy good rn",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hus5vj9",
                                                    "author": "MikeB_bal",
                                                    "score": 1,
                                                    "created_utc": 1643498931.0,
                                                    "response": "It is nowhere near that simple.  Cross chain logic is not atomic and requires some serious overhead to make sure it's done in a trustless manner.  \n\n\\> so it's easy to trade from Arbitrum to Loopring\n\nbridging is not trading.  Any apps that abstract the underlying networks are still very much in the early phases.  There might be a couple apps that make use of cross chain liquidity but I would bet there are centralized elements to that.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "huuxtf1",
                                                            "author": "NewChallengers_",
                                                            "score": 1,
                                                            "created_utc": 1643555222.0,
                                                            "response": "I said \"trade\" when I should have said \"transfer.\" Like sending your AVAX USDC to MATIC  chain USDC. Then you going and using on apps or DEX pools on that chain once it's transferred. \n\nDon't deny how amazing all of this is",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hus4w55",
                            "author": "Elkinekt",
                            "score": 1,
                            "created_utc": 1643498491.0,
                            "response": "You need to bridge your funds to layer 2 using a trusted bridge like Optimism or Arbitrum bridge, but they cost a lot and it takes 7 days to get your money back in L1.\n\nI recommend you use a trustless bridge like xPollinate. It bridges instantly and directly between chains and doesn't involve any trust assumptions (like oracles/validators).",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "husocgb",
                    "author": "monkeyhold99",
                    "score": 19,
                    "created_utc": 1643507191.0,
                    "response": "Lol OP really has no idea what they're talking about here. \n\n1. It still costs money to bridge to L2, for example bridging assets other than ETH can cost well over $50 to get onto Arbitrum. \n2. L2s are brand new and could have bugs/vulnerabilities. \n3. Lack of liquidity on L2. \n4. Lack of decentralization on *numerous* L2's. \n5. Confusing UX. You think a newbie is going to have the technical know-how to bridge assets and then use them? Lol come on. \n\nL2s are a great start for now, but they have a LONG way to go.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huqysn2",
                    "author": "Crypto_Economist42",
                    "score": 17,
                    "created_utc": 1643480886.0,
                    "response": "Because these aren't battle tested to hold billions yet. \n\nBig money and DeFi will stay on L1 where fees are insignificant.\n\nL2s for low value txs, and need onramps",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hus79g7",
                            "author": "audigex",
                            "score": 3,
                            "created_utc": 1643499558.0,
                            "response": "Yeah this is me\n\nI’ll early adopt something when it costs me £100 and some effort, not when it could cost me thousands\n\nY’all like Layer 2 so much, go ahead and test it for me - I might join you when it has 5 years of proven history behind it",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hus989h",
                            "author": "icebuster7",
                            "score": 3,
                            "created_utc": 1643500426.0,
                            "response": "More like L2 is Beta and where lots of innovation is - “prod” is still L1 and will likely remain that way for the foreseeable future.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "huqxj8v",
                    "author": "dies_und_dass",
                    "score": 256,
                    "created_utc": 1643480385.0,
                    "response": "Don't have enough to pay gas to move to l2",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hur1c97",
                            "author": "frank__costello",
                            "score": 69,
                            "created_utc": 1643481903.0,
                            "response": "Deposit your ETH into Binance, then withdraw to Arbitrum",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hur456t",
                                    "author": "sadwetsoap",
                                    "score": 44,
                                    "created_utc": 1643483040.0,
                                    "response": "Yes, or you can just start a transaction by manually setting a low gas fee (ex: 40-50 gwei) and leave there for days, eventually it will execute on a dead time/day",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "huraid2",
                                            "author": "engela2",
                                            "score": 22,
                                            "created_utc": 1643485619.0,
                                            "response": "Does it cost money to cancel the transaction if it does not go through for a week and you run out of patience?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hurklrq",
                                                    "author": "T0Bii",
                                                    "score": 15,
                                                    "created_utc": 1643489808.0,
                                                    "response": "[deleted]",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hurxctm",
                                                            "author": "mastermilian",
                                                            "score": 23,
                                                            "created_utc": 1643495209.0,
                                                            "response": "The future of money(tm).",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hut8qwq",
                                                                    "author": "booi",
                                                                    "score": 0,
                                                                    "created_utc": 1643516657.0,
                                                                    "response": "So pretty much the same as now. (Canceled check fee, returned check fee, ACH fee, overdraft fee, low balance fee, monthly fee just because lol, fuck you fee)",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "huthdh6",
                                                                            "author": "mastermilian",
                                                                            "score": 0,
                                                                            "created_utc": 1643521073.0,
                                                                            "response": "If that is the case, why move?\nBank would at least refund me if my funds got stuck in their network.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hurjxbk",
                                                    "author": "16withScars",
                                                    "score": 5,
                                                    "created_utc": 1643489520.0,
                                                    "response": "It doesn't cost anything because you can just replace the pending tx with a new tx by bidding a higher gas.\nhttps://www.youtube.com/watch?v=6EcJNCapRq8\nGood tutorial on how to do that.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hus07do",
                                                    "author": "elmosworld37",
                                                    "score": 24,
                                                    "created_utc": 1643496450.0,
                                                    "response": "Since the others beat around the bush: yes, you will lose money on a canceled transaction. It's incredibly dumb.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "huslm00",
                                                            "author": "Cute_Platypus_5989",
                                                            "score": -5,
                                                            "created_utc": 1643505991.0,
                                                            "response": "Yes i lost over 500$ in fees for failed transactions. It is stupid.\nI now don't bother using eth based transactions.\nETH is for people that have a lot of money. Like spending 10 to 100k per transaction.\nI believe this was the plan of ETH to begin with.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "huv1gta",
                                                            "author": "16withScars",
                                                            "score": 0,
                                                            "created_utc": 1643556785.0,
                                                            "response": "What you mean is \"failed transaction\", not \"cancelled transaction\".",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hurm79x",
                                                    "author": "vishwasrathi",
                                                    "score": -2,
                                                    "created_utc": 1643490478.0,
                                                    "response": "Reset Metamask and pending transaction will disappear without costing gas\n\nEdit: resetting Metamask does not mean uninstall and reimport with keys.. there is a button in the settings that does it..",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "husrjva",
                                            "author": "CatastrophicLeaker",
                                            "score": 3,
                                            "created_utc": 1643508635.0,
                                            "response": "If you set your gwei to 40, you'll be waiting five months.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "husymga",
                                            "author": "Dieselpump510",
                                            "score": 2,
                                            "created_utc": 1643511844.0,
                                            "response": "Is it a for sure that it will go thru eventually??",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "husj558",
                                    "author": "Tham3rr",
                                    "score": 6,
                                    "created_utc": 1643504889.0,
                                    "response": "Don't have enough to pay gas to move to binance",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hur3p7x",
                                    "author": "mrcleansocks",
                                    "score": 2,
                                    "created_utc": 1643482861.0,
                                    "response": "This 100%",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hus8g3y",
                                    "author": "Maswasnos",
                                    "score": 1,
                                    "created_utc": 1643500084.0,
                                    "response": "Did this with crypto.com the other day and it saved me like 20 bucks, highly recommended.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hush8hn",
                                    "author": "gonzaloetjo",
                                    "score": 1,
                                    "created_utc": 1643504016.0,
                                    "response": "Have money stuck in Argentina l1. Need like 300 to take out of there. Gg on gas prision.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "husjlxv",
                                    "author": "punis1",
                                    "score": 1,
                                    "created_utc": 1643505093.0,
                                    "response": "This took one day for me as they were saying “network unavailable please try later” lol",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "huwfhy0",
                                    "author": "Ok_Tomorrow3281",
                                    "score": 1,
                                    "created_utc": 1643575948.0,
                                    "response": "moving ETH to binance will cost ETH gas fee too LOL",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hureoz0",
                                    "author": "SecretaryImaginary44",
                                    "score": -11,
                                    "created_utc": 1643487348.0,
                                    "response": "“Not your keys, not your coins”",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hurf8t4",
                                            "author": "frank__costello",
                                            "score": 9,
                                            "created_utc": 1643487576.0,
                                            "response": "You're only giving Binance your coins for a couple minutes, then you withdraw back to your keys on L2\n\nIf you don't trust Binance enough to hold your funds for 5 minutes, then just pay the extra $20 for one of the many decentralized bridges",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hurqrqh",
                                            "author": "Oheson",
                                            "score": 3,
                                            "created_utc": 1643492397.0,
                                            "response": "The year 2011 called and said they want their quote back.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hur8s3p",
                            "author": "pegcity",
                            "score": 7,
                            "created_utc": 1643484934.0,
                            "response": "Isn't it like 30 bucks?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hurd36w",
                            "author": "consciuoslydone",
                            "score": 10,
                            "created_utc": 1643486676.0,
                            "response": "Use LayerSwap like mentioned at the end of the post!! Super freaking cheap",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "huset6k",
                                    "author": "CSharpSauce",
                                    "score": 3,
                                    "created_utc": 1643502919.0,
                                    "response": "> LayerSwap \n\nis https://www.layerswap.io/ the correct URL?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hurq9ca",
                            "author": "Oheson",
                            "score": -1,
                            "created_utc": 1643492180.0,
                            "response": "Exactly why Layer 2's are overblown.  ETH already has tons of TVL.  You are then asking people to pay to move off of it using ETH and then figure out how to use some clunky Layer 2 solution that is not nearly as secure.\n\nLet ETH be ETH and provide high dollar, secure transactions and use other layer 1's for lower dollar transactions such as gaming micro-transactions.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hus2ork",
                                    "author": "Maswasnos",
                                    "score": 2,
                                    "created_utc": 1643497522.0,
                                    "response": "Why do that when we can leverage ETH's security to do low-cost transactions as well? Layer 2s are just as \"clunky\" as alt-L1s and mainnet are, maybe even less so with smart wallets like Argent leading the way. \n\n> not nearly as secure.\n\nI'd say a rollup like zkSync is maybe 95% as secure as mainnet ETH today, and improving every day as it grows its track record. That's plenty for me to trust it with my main on-chain stack. Already better security than any alt-L1 I can think of sans Bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hus694o",
                            "author": "HeadMembership",
                            "score": 1,
                            "created_utc": 1643499102.0,
                            "response": "Classic Eth.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hur0rk1",
                            "author": "layer3exchange",
                            "score": 1,
                            "created_utc": 1643481672.0,
                            "response": "There are fiat on-ramps straight to L2, Layerswap let's you swap from the centralized exchanges to your L2 account, and we (layer3exchange) are working on a system to bridge small amounts of ETH to/from the rollups with a more \"web2\" traditional service.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hurfubd",
                            "author": "-spooky_ghost",
                            "score": 1,
                            "created_utc": 1643487819.0,
                            "response": "I think he is making a joke guys 😅",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hutwjsd",
                            "author": "EffectiveConcern",
                            "score": 1,
                            "created_utc": 1643531325.0,
                            "response": "😹👆🏻",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "huu520v",
                            "author": "mvev",
                            "score": 1,
                            "created_utc": 1643537928.0,
                            "response": "I wouldn't do it.  Vitalik  should have made this transaction cost free. Kind of crooked to have gas fees on something you had to fix.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "huz8i39",
                            "author": "Yalnix",
                            "score": 1,
                            "created_utc": 1643625651.0,
                            "response": "I'll be honest if you can't afford the gas to transfer to L2 you probably have no reason to be On Chain anyway.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "huzgu03",
                                    "author": "OllieZaen",
                                    "score": 1,
                                    "created_utc": 1643631614.0,
                                    "response": "Very Factorio eske!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hus1ssf",
                            "author": "A__Keyboard",
                            "score": 0,
                            "created_utc": 1643497136.0,
                            "response": "You can withdraw to BSC or polygon USDC/USDT/WETH and use [xpollinate.io](https://xpollinate.io) to bridge to Arbitrum/Optimism and it will cost you less than 10$. If you bridge WETH from BSC/Polygon, you will receive Native ETH on Both Arbitrum/Optimism",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hus61um",
                            "author": "HungryPhezzani",
                            "score": 0,
                            "created_utc": 1643499010.0,
                            "response": "There's [teleportr](https://portr.xyz/) for that. It's pretty cheap.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "huqz3sy",
                    "author": "PouItrygeist",
                    "score": 20,
                    "created_utc": 1643481010.0,
                    "response": "The people still on L1 ethereum are looking for liquidity not cheap fees.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hurmjv9",
                            "author": "mrcleansocks",
                            "score": 3,
                            "created_utc": 1643490624.0,
                            "response": "Liquidity goes to where the users are, if the users want cheap fees, the liquidity follows.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i00kus5",
                                    "author": "Ecolibriums",
                                    "score": 1,
                                    "created_utc": 1646857076.0,
                                    "response": "Liquidity stays where the trading fees are, and if L1 still proves to have more volume, even marginally, than the fragmented L2s, that's where LPs will stay.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hut1kf4",
                                    "author": "PouItrygeist",
                                    "score": 0,
                                    "created_utc": 1643513234.0,
                                    "response": "Yes but that has not happened yet.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "huv1oi5",
                                            "author": "16withScars",
                                            "score": 1,
                                            "created_utc": 1643556871.0,
                                            "response": "It has. Uniswap on arbitrum, zigzag on zksync, dydx on starknet... to name a few. A lot of defi is moving to L2.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "huxm2bi",
                            "author": "sayamemangdemikian",
                            "score": 1,
                            "created_utc": 1643592149.0,
                            "response": "yup.  what's the point of low gas fee if I missed selling /buying opportunity\n\nand also security. no support for ledger I dont trust any L2 yet.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hurhi73",
                    "author": "praiseullr",
                    "score": 6,
                    "created_utc": 1643488510.0,
                    "response": "So I’ve used some L2’s but it always seems like I’m only able to bridge ETH and perhaps certain specific tokens. \n\nIs there actually a way to move mainnet NFTs to and from those chains? Or are you proposing we just abandon transacting with the big, more-liquid, famous NFTs on mainnet and instead transact with small less-famous, low liquidity NFT projects that were launched on (and afaik are locked on) specific L2’s? \n\nIf we can move a bored ape or wrapped cryptopunk to arbitrum and then back to mainnet I’d love to hear how. If not, then engaging with lesser projects and much smaller markets is a bit of a tough sell and not quite the obvious cure-all that you seem to be implying it is IMO.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huqxxg1",
                    "author": "espresso_chain",
                    "score": 25,
                    "created_utc": 1643480540.0,
                    "response": "I still come across people who are waiting for L1 gas fees to come down.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hur133m",
                            "author": "Meanmanjr",
                            "score": 4,
                            "created_utc": 1643481800.0,
                            "response": "The transfer fee of Ethereum will go down, right?  Once there are the 64 or however many extra shards.  I assume the NFTS / Smart Contract fees will remain the same.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hur19gw",
                                    "author": "frank__costello",
                                    "score": 16,
                                    "created_utc": 1643481871.0,
                                    "response": "> The transfer fee of Ethereum will go down, right?\n\nOn L1: no\n\n> Once there are the 64 or however many extra shards\n\nThese shards will make L2 much cheaper, but won't affect L1",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hur55mw",
                                            "author": "sadwetsoap",
                                            "score": 12,
                                            "created_utc": 1643483453.0,
                                            "response": "Actually sharding will make fees lower on L1, it doesn't care who the user is. \n\nThe thing is assuming the number of users and chains will grow eventually also fees will do, so at the end things will equalize.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hur5jm6",
                                                    "author": "frank__costello",
                                                    "score": 21,
                                                    "created_utc": 1643483615.0,
                                                    "response": "> Actually sharding will make fees lower on L1\n\nExecutable sharding has been removed from the roadmap\n\nThe current plan is data sharding, which only allows dumping data (which is exactly what rollups need), but doesn't give any extra capacity for normal transactions\n\nThe only way that sharding helps with L1 fees is that rollups will stop taking up so much space on the main shard",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hur5whq",
                                                            "author": "espresso_chain",
                                                            "score": 2,
                                                            "created_utc": 1643483764.0,
                                                            "response": "bingo",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hur6bq5",
                    "author": "g_squidman",
                    "score": 185,
                    "created_utc": 1643483938.0,
                    "response": "Literally nothing I want to do with crypto can be done with any of these Layer 2s. The NFTs I want to buy are on Layer 1, ImmutableX, and Tezos. The ENS names I need to re-register or want to gift to people are on Layer 1. The DAOs I want to participate in governance on are on Layer 1.\n\nAll of these Layer 2 protocols are entirely useless to anyone who actually wants to do something with blockchain besides mindlessly speculating on like a dozen tokens that are already on Coinbase anyway.\n\nEvery time I see these posts I have to ask, like, \"do you actually use this stuff?\"\n\nThey want to make L2s cheaper with EIP-4488. I think we should consider the opposite. Let's hike up the gas costs for swaps and kick these dumb speculators onto Layer 2 so the rest of us can actually use this thing.\n\nEdit: holy shit, if your fiat on-ramp costs more than gas fees do, it's not a fiat on ramp. Stop this madness.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "huricre",
                            "author": "latetot",
                            "score": 54,
                            "created_utc": 1643488861.0,
                            "response": "ImmutableX is a layer2",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hurkysx",
                            "author": "frank__costello",
                            "score": 11,
                            "created_utc": 1643489962.0,
                            "response": "Chicken & egg problem\n\nProjects aren't deploying on L2s because most users are on L1, and users are on L1 because projects are there\n\nToken incentives fix this 😁",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "huscfhi",
                                    "author": "xfactoid",
                                    "score": 2,
                                    "created_utc": 1643501857.0,
                                    "response": "Buy the zip",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "huroi5m",
                            "author": "MinimalGravitas",
                            "score": 42,
                            "created_utc": 1643491444.0,
                            "response": "> All of these Layer 2 protocols are entirely useless to anyone who actually wants to do something with blockchain besides mindlessly speculating on like a dozen tokens that are already on Coinbase anyway\n\nNo offence but this is nonsense, so much of the DeFi ecosystem is already available on L2s. Infact the only important dApps I use that aren't on a rollup yet are AAVE and Alchemix. Everything else: Curve, Balancer, Synthetix, dYdX, Lyra is on at least one.\n\nI'm sympathetic to your point about ENS names, but really how often do you need to buy or re-register those...?\n\nFor DAOs the majority of governance just involves signing transactions, so no fee and so again it can stay on L1 (though the POAPs you might get for attending meetings etc. will be on the XDAI sidechain).\n\nAnd as for NFTs, you literally listed ImmutableX as one of the places you buy NFTs... which runs on StarkWare's L2!\n\nIt sounds more like you've decided not to like rollups for some reason and are letting that bias cloud your view of reality. You can't do everything on L2s yet, but the extract of your comment I quoted above is just factually wrong.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hurr8ke",
                                    "author": "g_squidman",
                                    "score": -7,
                                    "created_utc": 1643492593.0,
                                    "response": "No, you ARE the speculator I'm complaining about. I'm not here to make money. I don't care about Aave and Curve and Balancer and stuff. So much of what's driving up gas costs for me is people making thirteen different lending calls, swaps, and liquidity staking and then swap back into reverse index pancake yam coins with 15% APY then margin call into double triple flash loan for fee reward token incentive THEN zigzag back into a double algorithmic stablecoin upsidedown Italian sex-move squeeze for an extra 6.3% native dollar coin return and by the time you bridge back out to fiat you've made 27 cents after gas costs. We need to tax the shit out of this. THIS is what's nonsense.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hus0hu2",
                                            "author": "Hanzburger",
                                            "score": 14,
                                            "created_utc": 1643496575.0,
                                            "response": "> So much of what's driving up gas costs\n\nThat's pretty hilarious because whenever there's gas spikes and you check the gas leaderboard, 99% of the time it's from NFTs lol. So it sounds like \"you\" (NFT users) are jacking up gas prices.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hus0oom",
                                                    "author": "g_squidman",
                                                    "score": -3,
                                                    "created_utc": 1643496657.0,
                                                    "response": "I'd love to see some research on this to be honest. You might be right. I just don't know for sure.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "husyim3",
                                                            "author": "Hanzburger",
                                                            "score": 8,
                                                            "created_utc": 1643511794.0,
                                                            "response": "Whenever you see a gas spike, check https://ultrasound.money/, set it to 5min or 1hr and look at the gas leaderboard. It'll show you what the biggest gas users are.\n\nRight now it's some NFT called Global Citizens that burnt 24.5 ETH in gas in the past 5min, followed by open sea with 4.5 ETH, which is followed by normal ETH transfers at 2 ETH. This is pretty typical and shows clearly what is driving gas prices up, and it's by a wide margin.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hut12e8",
                                                                    "author": "g_squidman",
                                                                    "score": 3,
                                                                    "created_utc": 1643512995.0,
                                                                    "response": "You're right, at the bottom it even breaks it down by NFTs vs DeFi and it's about even.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "huruhg9",
                                            "author": "mrcleansocks",
                                            "score": 6,
                                            "created_utc": 1643493971.0,
                                            "response": "“Italian sex move squeeze” made me lol",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "husdf87",
                                            "author": "FaceDeer",
                                            "score": 5,
                                            "created_utc": 1643502306.0,
                                            "response": "I'm saddened that this masterpiece of bafflegab got downvoted.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "husgaav",
                                                    "author": "ambyent",
                                                    "score": 1,
                                                    "created_utc": 1643503589.0,
                                                    "response": "I did my part to help get it back to 0 lol",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hurwn0v",
                                            "author": "MinimalGravitas",
                                            "score": 3,
                                            "created_utc": 1643494895.0,
                                            "response": "> upsidedown Italian sex-move squeeze for an extra 6.3%\n\nThat's my favourite dApp!!\n\n> We need to tax the shit out of this.\n\nIt's already taxed like everything else: the ENS airdrop you got for having registered names counts as Income, the difference in buying and selling price for my ERC20s or your ERC721s just counts as Capital Gains. You'll get no objection from me for paying taxes, the NHS has had a ridiculous couple of years with the pandy and the country's coffers must be running low after supporting so many people through furlough etc. As per the Gitcoin catchphrase: Public goods are good.\n\nIn fact, thinking of that, even if you have no interest in anything DeFi related it still is false to claim that there is nothing you can do on L2s, because I always make my Gitcoin Grant donations via zkSync, a ZK Rollup.\n\nPlus you haven't addressed the point that ImmutableX runs on an L2!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hus0btv",
                                                    "author": "g_squidman",
                                                    "score": 2,
                                                    "created_utc": 1643496503.0,
                                                    "response": "Oh I don't mean like TAXED taxed, although I do appreciate the attitude. So much of the regulations coming down the line are gonna be in response to weirdos who are in crypto just to avoid taxes. I do appreciate that. \n\nI meant like the protocol should \"tax\" these sorts of DeFi actions that make up a lot of blockspace. There's these arbitrage bots that will spend $600 in gas fees if it makes them $601 in returns at the end. If we made it more expensive to use these lending and staking and swapping dApps, if it cost more gas to make those kinds of actions, there'd be more block space for the kinds of things I want to do. \n\nI don't think I need to respond to the other points, because I'm not principally against L2s or anything. I like ImmutableX a lot. It sucks that it costs so much for me to withdraw my enormous airdrop to a place where I can actually spend it on rent. As an L2, I think it's quite successful, and a better example than anything OP mentioned. Mintable lets you mint straight to ImmutableX, and I wish more of my artist friends would use it. It's great.\n\nI admit, I didn't know Gitcoin worked on zkSync. You're exactly right that that's another thing I really want to use blockchain for. I knew they worked on Polygon, but I've been a bit apprehensive about Polygon sidechain, so I haven't gone that route yet. I'll look into zkSync for the next Gitcoin round, cause that's really important to me.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "husqhur",
                                    "author": "skaag",
                                    "score": 1,
                                    "created_utc": 1643508156.0,
                                    "response": "If I want an L2 with an easy on-ramp and off-ramp, and the ability to mint NFTs cheaply, what would you recommend? I think LoopRing isn’t ready yet.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "huvg8t5",
                                            "author": "cestbondaeggi",
                                            "score": 2,
                                            "created_utc": 1643562584.0,
                                            "response": "Optimism. Quixotic.io is the only functional NFT exchange on L2 in my opinion.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "huwo0jl",
                                    "author": "Ok_Tomorrow3281",
                                    "score": 1,
                                    "created_utc": 1643579064.0,
                                    "response": "I still confused between the grey area of what L2 can do and can't do.  \n\n\nIf there's NFT in ethereum network, can I transfer it with L2 fee?\n\nI deploy NFT in eth network in opensea, and I want to buy it using polygon network,   \nis it possible? or what's the best idea to make it less fee when trf eth-nft to other wallet, can u help to elaborate the steps? or how do I achieve this? I have read polygon docs but still confused af",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "huwti8l",
                                            "author": "MinimalGravitas",
                                            "score": 1,
                                            "created_utc": 1643581126.0,
                                            "response": "It depends on the security requirements of your NFT. Is it something really important like an ENS name, or is it something which wouldn't matter so much like a game item or something. Lower security requirements mean you can go with a lower security sidechain such as Polygon PoS or xDAI. Things that need higher security but where it wouldn't be the end of the world if they got locked up might be best suited for Validiums, such as ImmutableX. NFTs that need the absolute most security should deploy on L1 and stay on L1.\n\nI don't think it makes much sense to transfer ERC271s across chains/L2s, but that might be my lack of imagination as to why you would want to.\n\n> If there's NFT in ethereum network, can I transfer it with L2 fee?\n\nIf it's on Ethereum mainnet you will need to pay the Ethereum mainnet fee to move it.\n\n> I deploy NFT in eth network in opensea, and I want to buy it using polygon network,\nis it possible? \n\nThe scenario doesn't make sense, why pay the high gas cost of Ethereum and then throw away that security by moving it onto Polygon, if you're happy with it being on Polygon then surely it makes a lot more sense to deploy there directly?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "huydrre",
                                                    "author": "Ok_Tomorrow3281",
                                                    "score": 1,
                                                    "created_utc": 1643604146.0,
                                                    "response": ">I don't think it makes much sense to transfer ERC271s across chains/L2s, but that might be my lack of imagination as to why you would want to.\n\nobviously because of the fee and other usage, my nft project deployed on ETH-net but it will be used for game, and people alrready bought it.  \n\n\nand team have deployed additional NFT to polygon-net. I thought it possible by bridging the eth-nft to polygon-net first, but  found no way.  \n\n\nis there no way to fix this? or make it simpler with  the fee?\n\n  \nbut  I already plan my next project on solana, cause they are not confusing and soo much cheapeer",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hurddwj",
                            "author": "mrcleansocks",
                            "score": 21,
                            "created_utc": 1643486799.0,
                            "response": "DAOs need to migrate to L2. Start petitioning the developers who have made your DAO tooling to move to L2, and yes, I do use this stuff. I spent literally $1000 on gas this week, I’m fucking done. It’s time to move to L2",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "huricj8",
                                    "author": "NessDan",
                                    "score": 10,
                                    "created_utc": 1643488858.0,
                                    "response": "You want us to convince DAOs to move to L2s? They would have to launch on *each and every L2*, even the new ones as they come out - is it even worth it for them to have to deal with that hassle?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hurkr03",
                                            "author": "T0Bii",
                                            "score": 14,
                                            "created_utc": 1643489870.0,
                                            "response": "[deleted]",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hurkqqh",
                                            "author": "mrcleansocks",
                                            "score": 7,
                                            "created_utc": 1643489867.0,
                                            "response": "L2s will be interoperable and part of a larger EVM",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "huryxho",
                                                    "author": "Vapor20",
                                                    "score": 15,
                                                    "created_utc": 1643495896.0,
                                                    "response": "The detail is in the \"will be\". I think that answers the title of your post then",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hurdv0d",
                            "author": "FaceDeer",
                            "score": 7,
                            "created_utc": 1643486999.0,
                            "response": "Hear hear. I'm not going to gripe about projects being too slow to move to L2, L2s are still quite new and it takes time to reengineer things like this. Some of these projects never expected to need to move to an L2 and aren't necessarily built to manage it, so it's understandable.\n\nSo sure, keep reminding the devs to focus on getting their stuff onto L2, and remind people who gripe about L1 fees that L2 solutions are the coming solution for that. But don't *chew people out* for not moving to L2 yet. These things take time to mature.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hurgpqq",
                                    "author": "thedannyfrank",
                                    "score": 4,
                                    "created_utc": 1643488181.0,
                                    "response": "Yeah he comes off as a bit of a denialist...nothing I really want to do has moved over to L2 yet",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hurn6gn",
                            "author": "robotfightandfitness",
                            "score": 2,
                            "created_utc": 1643490890.0,
                            "response": "This. Convex is where? That’s the layer I’ll be on",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hurndsy",
                            "author": "Taykeshi",
                            "score": -4,
                            "created_utc": 1643490975.0,
                            "response": "Moonbeam fixes this (?)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "husennr",
                                    "author": "frank__costello",
                                    "score": 1,
                                    "created_utc": 1643502850.0,
                                    "response": "Lol no",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hur3vbj",
                    "author": "civilian_discourse",
                    "score": 5,
                    "created_utc": 1643482930.0,
                    "response": "I’m waiting for zksync and/or starknet",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hurfxfc",
                            "author": "frank__costello",
                            "score": 4,
                            "created_utc": 1643487854.0,
                            "response": "You'll probably wait a while for them to develop a large ecosystem\n\nWhy not move to Arbitrum today, then use an L2 bridge like Hop to move to zksync/starnet when ready?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hus3xu3",
                                    "author": "civilian_discourse",
                                    "score": 2,
                                    "created_utc": 1643498073.0,
                                    "response": "I don’t think so, there’s a lot of developers waiting for zkrollups as well. A large portion of the developer community feels that zk rollups are the real long term solution, so building on optimistic rollups feels temporary and like wasted time. I think you’ll see a much larger migration from L1 to L2 after zksync and starknet go live and have a little time to mature than we did with any optimistic rollup. It’s easy to forget because a huge portion of the crypto community has no patience, but the folks who have been around the longest and generally folks who are more conservative when making investment moves have plenty of patience to wait an extra year.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hus89ma",
                                            "author": "2mjolk",
                                            "score": 2,
                                            "created_utc": 1643500006.0,
                                            "response": "concur, zero knowledge proofs are solid. From what i know it's mainly the evm implementations that are taking time. It's the immutability and verifiable security that need to be guaranteed, not to mention the consensus algo's which are amongst the hardest things to solve. Besides money/token transactions there is a lot of interest from industry for ssi, data verifiability (imagine iot devices like for example  trackers in shipping containers posting to a dif sidetree which via l2 gets recorded on ethereum network so the data becomes ownable and verifiable, untamperable, there are a lot of anti fraud applications of decentralised blockchain)\n What i'm seeing now is a lot of shit around permissioned chains etc but it's bs imo. If it's not really decentralised whats the point..you can store a merkle tree in a regular db as well.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "husamdj",
                                            "author": "frank__costello",
                                            "score": 1,
                                            "created_utc": 1643501056.0,
                                            "response": "StarkNet has been live since November, but it needs to build a whole new ecosystem (new language support, new tooling, new wallets).\n\nArbitrum and Optimism are fully EVM compatible, so apps can easily deploy there",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "husrrao",
                                                    "author": "civilian_discourse",
                                                    "score": 1,
                                                    "created_utc": 1643508726.0,
                                                    "response": "An alpha is live, that doesn’t count. It’s for developers only.\n\nNethermind has developed WARP for converting solidity to Cairo.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "huqs8x3",
                    "author": "dmpldr",
                    "score": 4,
                    "created_utc": 1643478263.0,
                    "response": "From Github it seems that Layerswap this is not based on smart contracts? Correct? So how can it be secure?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "huqtynm",
                            "author": "mrcleansocks",
                            "score": 8,
                            "created_utc": 1643478949.0,
                            "response": "They are a ramp provider.  You transfer funds to them and then they transfer funds to your L2 wallet for a fee.  You really only need to use it if you're trying to go from CEX to optimistic rollups like Arbitrum + Optimism since they don't have many fiat onramps. Loopring and Argent have their own fiat onramps that are quick and easy.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "huqydc2",
                                    "author": "bossrabbit",
                                    "score": 3,
                                    "created_utc": 1643480715.0,
                                    "response": "How does that work? How is it different or cheaper than bridging funds yourself?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "huqyywj",
                                            "author": "Maswasnos",
                                            "score": 7,
                                            "created_utc": 1643480955.0,
                                            "response": "I haven't personally used layerswap, but I imagine they maintain liquidity on these exchanges and on the layer 2s. When you use their service, they take your ETH into their exchange account and then send you that amount on the layer 2 minus their system fee. \n\nI imagine when there's enough of an imbalance between their L2 accounts and exchange accounts, they initiate an on-chain withdrawal and the large gas fees are essentially socialized across all the people who used the service. Then they bridge the funds themselves to top-up their L2 balances.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hurir5n",
                                                    "author": "bossrabbit",
                                                    "score": 3,
                                                    "created_utc": 1643489028.0,
                                                    "response": "That makes sense now, thanks!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hur2l7y",
                                            "author": "layer3exchange",
                                            "score": 1,
                                            "created_utc": 1643482407.0,
                                            "response": "The bridge contracts are expensive, no matter how much you want to transfer. What Layerswap does (and our strategy as well) is to keep liquidity on both ends of the trade, so that we can aggregate the transfers and then only make one \"larger\" bridge transfer to balance things out.\n\nThe part that layerswap does not do and we are working on is the *off-ramp*. We want to have the ability for users to send ETH on the Optimistic Roll-ups and transfer the funds instantly to the base layer, with no waiting time and at a fraction of the cost of the contract calls.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hur6xlw",
                    "author": "BoGGy5m4ll5",
                    "score": 16,
                    "created_utc": 1643484187.0,
                    "response": "Cause there is no decentralized L2",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hurthjy",
                            "author": "Dear_Newo_Ikkin",
                            "score": 2,
                            "created_utc": 1643493546.0,
                            "response": "Loopring is decentralized I believe?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "huu8u0p",
                                    "author": "llort_lemmort",
                                    "score": 2,
                                    "created_utc": 1643540838.0,
                                    "response": "[Nope](https://l2beat.com/projects/loopring/)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "huqxg3n",
                    "author": "PinkPuppyBall",
                    "score": 7,
                    "created_utc": 1643480350.0,
                    "response": "* [Fiat onramps and bridges.](http://ethl2s.com)\n* [L2 news.](https://l2.news/)\n* [L2 overview.](https://l2beat.com/)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huqzoux",
                    "author": "wavy_d3",
                    "score": 3,
                    "created_utc": 1643481244.0,
                    "response": "we need aave on L2",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hur7pii",
                            "author": "Arscinio",
                            "score": 2,
                            "created_utc": 1643484502.0,
                            "response": " Are there any Lending platforms on layer two?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hurfts9",
                                    "author": "frank__costello",
                                    "score": 2,
                                    "created_utc": 1643487813.0,
                                    "response": "https://hundred.finance/",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hurzo05",
                            "author": "frozengrandmatetris",
                            "score": 2,
                            "created_utc": 1643496214.0,
                            "response": "it's on a ETH sidechain if that will hold you over for now. I used it plenty",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hurc9zr",
                    "author": "grmpfpff",
                    "score": 3,
                    "created_utc": 1643486342.0,
                    "response": "You might burn money on L1, but you also don't have to worry about your coins. It's a price I'm willing to pay.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hurykr3",
                    "author": "Sylv__",
                    "score": 3,
                    "created_utc": 1643495743.0,
                    "response": "Because of the additional risks, see https://l2beat.com/?view=risk",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hus4xcr",
                    "author": "sqrrl22",
                    "score": 3,
                    "created_utc": 1643498506.0,
                    "response": "Honestly, everything gets more and more difficult. Everyone is coming up with new things that I fail to understand. It‘s like a fix for another fix for another fix. I simply want to pay my coffee with my phone irl while paying with eth and low fees. 😵‍💫",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hus9gph",
                    "author": "okaydredre",
                    "score": 3,
                    "created_utc": 1643500531.0,
                    "response": "Gas costs are too high to get my liquidity off Layer 1. Not worth it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hur0szc",
                    "author": "choledocholithiasis_",
                    "score": 7,
                    "created_utc": 1643481688.0,
                    "response": "I understand L2 lowers gas fees tremendously, but if we are to expect small businesses and mainstream to adopt this ecosystem (rather than just for speculation trading). We need to be able to explain and justify the cost of withdrawing/depositing to and from their local fiat currency. At the moment, it’s unlikely the vendor or local electric company will accept ETH or MATIC/LRC,…\n\nRight now, are there any providers that convert fiat directly into L2, or do you always have to buy ETH (gas fee + exchange fee) then convert it into L2 (which then incurs another fee, albeit small). Same question for withdrawing.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "huroxvf",
                            "author": "MinimalGravitas",
                            "score": 4,
                            "created_utc": 1643491630.0,
                            "response": "> Right now, are there any providers that convert fiat directly into L2,\n\nYes, Binance and Crypto 'dot' Com both allow direct withdrawal to Arbitrum I think.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "huv5ah7",
                                    "author": "GR4V1T1TY",
                                    "score": 1,
                                    "created_utc": 1643558324.0,
                                    "response": "You are correct and it costs 4 $ to transfer USDC 🤷‍♂️",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "huquas3",
                    "author": "levi97zzz",
                    "score": 6,
                    "created_utc": 1643479086.0,
                    "response": "Use hop as well, they will probably airdrop token at some point in the future",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hur349e",
                    "author": "data_diver",
                    "score": 7,
                    "created_utc": 1643482622.0,
                    "response": "Is LRC the only zkrollup we can currently invest directly in?  I want to diversify.  \nSorry for the ignorant question but googling this just leads to people explaining why ____ insert random token is going to benefit from arbitrum.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hurk1co",
                            "author": "BradfordLee",
                            "score": 3,
                            "created_utc": 1643489567.0,
                            "response": "L2beat.com great website about L2 options",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "husldtq",
                                    "author": "data_diver",
                                    "score": 1,
                                    "created_utc": 1643505890.0,
                                    "response": "Thanks this is a great resource.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hurj9fy",
                            "author": "NessDan",
                            "score": 3,
                            "created_utc": 1643489242.0,
                            "response": "From what I know: [ZKSync](https://zksync.io/) and [Starknet](https://starkware.co/starknet/) are the two big Ethereum-based ones that I know of - neither have a coin right now.\n\n[Mina](https://minaprotocol.com/) is a non-Ethereum L1 using ZK technology - but it's not available in the US and as far as I can see. it's still in an early stage (unsure if it even supports smart contract functionality.) I was interested in it after reading this blog post: [“The entire Mina blockchain is about 22kb – the size of a couple of tweets.”](https://minaprotocol.com/blog/22kb-sized-blockchain-a-technical-reference)",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hus1ial",
                            "author": "Datacruncha",
                            "score": 3,
                            "created_utc": 1643497011.0,
                            "response": "Matic token will be used for polygon's zkrollups.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hur3pe1",
                            "author": "ManVsWater",
                            "score": 1,
                            "created_utc": 1643482863.0,
                            "response": "Look into immutable x.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "huquj3b",
                    "author": "cryptofuturebright",
                    "score": 11,
                    "created_utc": 1643479180.0,
                    "response": "Thoughts on Polygon?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "huqy37c",
                            "author": "-Fors-",
                            "score": 44,
                            "created_utc": 1643480603.0,
                            "response": "Polygon runs on a sidechain which is inferior to L2/rollups, they know this and have acquired rollups but until they go live and users move there, it's still a sidechain.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "huqzfod",
                            "author": "j1mmie",
                            "score": 7,
                            "created_utc": 1643481143.0,
                            "response": "Debating whether or not to launch my next project on Polygon. OpenSea and Decentraland support it pretty seamlessly, but no other L2’s yet. So I feel like rollups haven’t really been adopted by consumers yet.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hur1jld",
                                    "author": "Wisgood",
                                    "score": 10,
                                    "created_utc": 1643481985.0,
                                    "response": "Same situation. Matic is just so accessible I think that's what I'll do, and we gotta have faith they'll enable zk L2 bridging compatible with the others at least by the time average eth users figure out how to l2. I just don't expect my users to know how to purchase optimism yet but matic has enough adoption already that it's usable, and when they add the roll-up functionality i think that'll be the place to be.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hurnrui",
                                    "author": "Taykeshi",
                                    "score": 1,
                                    "created_utc": 1643491138.0,
                                    "response": "What about an EVM-combatible chain on cosmos or polkadot? Interoperability and all that.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hur1cma",
                            "author": "ManyArtichoke",
                            "score": 16,
                            "created_utc": 1643481907.0,
                            "response": "Polygon has 3 validators that control more than 50% of the network. That's all I need to know.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hur56l5",
                                    "author": "frank__costello",
                                    "score": 17,
                                    "created_utc": 1643483465.0,
                                    "response": "Nobody is pretending that Polygon is decentralized\n\nPolygon is basically BSC, but more aligned with the Ethereum community",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hur5g2j",
                                    "author": "Wisgood",
                                    "score": 4,
                                    "created_utc": 1643483574.0,
                                    "response": "Very fair point. This is the biggest critique. But yet, when they enable their roll-up, that gives our smart contracts the full security of Eth regardless of the Matic network's possible point of failure. Plus, bridging is coming to Harmony and Cosmos, so if polygon goes f up then we can just move our contracts elsewhere.\n\nCentralization sucks but it's necessary for scaling at this stage in the tech, especially for developers who need the bandwidth. At least poly is not a walled garden, and they do provide a valuable service for side-chain computation to write on the main chain (which, faster cheaper computation is desperately needed until The Surge, and still useful after). If they push off their Zkrollup functionality too long then that becomes a power grab red flag though, but i doubt this'll happen given their recent investments.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "huqwb0c",
                            "author": "jrozyki",
                            "score": 2,
                            "created_utc": 1643479894.0,
                            "response": "My biggest \"meh\" about polygon is that when they faced to much traffic on their network the only solution they came up with was to increase the block size. It worked of course but what when the traffic rise again? And then again and so on. They can't increase the block size forever. And as far as i know they have no better plans of solving the problem :/  But i didn't check it in some time so please correct me if i am wrong",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hus0lxq",
                                    "author": "frozengrandmatetris",
                                    "score": 6,
                                    "created_utc": 1643496624.0,
                                    "response": "polygon devs worked with the sunflower farm devs to make the contract more efficient. there isn't really any solution for anyone spamming any EVM chain right now. if you spam any EVM chain enough it will make fees go up.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hus0ngp",
                                            "author": "TheSunflowerSeeds",
                                            "score": -1,
                                            "created_utc": 1643496643.0,
                                            "response": "Sunflower seeds have a mild, nutty flavor and a firm but tender texture. They’re often roasted to enhance the flavor, though you can also buy them raw.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "husrpxd",
                                                    "author": "j1mmie",
                                                    "score": 2,
                                                    "created_utc": 1643508709.0,
                                                    "response": "New favorite bot",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "husy5am",
                                    "author": "tyrilu",
                                    "score": 1,
                                    "created_utc": 1643511616.0,
                                    "response": "What is the problem with increasing the block size?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hut00ud",
                                            "author": "jrozyki",
                                            "score": 2,
                                            "created_utc": 1643512509.0,
                                            "response": "Lets put it that way, you need to water your plants every hour, but the nearest river is half an hour trip from where you are. Till this point you just had to take a normal bucket and there would be enough water for all the plants. But you just bought new plants and you have to water them too. So you take a bigger bucket. No problem. But then you bought more plants - bigger bucket still okay. But if you would do it multiple times at some point you won't be able to carry the enormous bucket you need to water everything you have. \nThe same thing might be the problem with bigger and bigger blocks. The nodes just won't have power or storage space to deal with them and block won't be processed.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hut6fpg",
                                                    "author": "tyrilu",
                                                    "score": 3,
                                                    "created_utc": 1643515530.0,
                                                    "response": "I see. So increasing block size increases the performance floor for a node, decreasing decentralization.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "huqu3tg",
                    "author": "TylerDurdenStock",
                    "score": 2,
                    "created_utc": 1643479007.0,
                    "response": "Nice",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hur01df",
                    "author": "Maswasnos",
                    "score": 2,
                    "created_utc": 1643481379.0,
                    "response": "10/10 would recommend the Argent zkSync app. Such a great interface and they're constantly adding new pairs to trade through their partnership with ZigZag.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hur0z14",
                    "author": "MrVodnik",
                    "score": 2,
                    "created_utc": 1643481755.0,
                    "response": "Sadly, still no Bancor V3, Curve crveth high reward pools, Convex, most of AAVE collateral coins, sushi staking and... many more high APY and top  quality projects. These are still based on L1. Lazy devs don't want us to use their tools :( so while I am mostly on L2s already, I still have some position on L1.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hur7j6h",
                    "author": "Firm_Wrap8645",
                    "score": 2,
                    "created_utc": 1643484431.0,
                    "response": "Loopring is the only Zero knowledge rollup I know of so far. But you can proof me wrong on this. Arbitrum does optimistic rollups.\n\nhttps://m.youtube.com/watch?v=XW0QZmtbjvs\n\nIf you skip to the rollups part Vitalik Buterin explains it quiet well. \n\nIn the short term optimistic rollups might have a benefit but in the long run I see ZK rollups as the more promising approach. \nHope this helps anyone",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hurg8d2",
                            "author": "frank__costello",
                            "score": 8,
                            "created_utc": 1643487980.0,
                            "response": "> Loopring is the only Zero knowledge rollup I know of so far\n\nThere's many more:\n\n* StarkNet\n* ZKSync\n* Aztec\n* Hermez\n* dYdX (for perp trading)\n* ImmutableX (for NFTs)\n\nAnd probably lots more coming soon",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hurj5aw",
                                    "author": "Firm_Wrap8645",
                                    "score": 4,
                                    "created_utc": 1643489194.0,
                                    "response": "Actually, thats great, thanks for proving me wrong",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hur9m3m",
                    "author": "the_morol",
                    "score": 2,
                    "created_utc": 1643485259.0,
                    "response": "Because most of the opportunities are on layer 1…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hura722",
                    "author": "0xf3e",
                    "score": 2,
                    "created_utc": 1643485492.0,
                    "response": "I would love to swap everything to L2, but here are the things holding me back:\n\n1. ~~Layerswap doesn't work with Metamask~~ I figured I need a L2 bridge\n2. Layerswap maximum amount is 0.15 ETH\n3. ~~Where can I find trustworthy L2 bridges?~~ -> https://mirror.xyz/ethmaxitard.eth/iyCAlOexgQKOvoSAAk4utYGEdnESOKb5HstM2_LaqL4\n4. Which L2 rollup to use?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hurtxrz",
                            "author": "PinkPuppyBall",
                            "score": 3,
                            "created_utc": 1643493739.0,
                            "response": ">Which L2 rollup to use?\n\nArbitrum has the most activity right now, so its a good place to start.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hurfeyy",
                    "author": "fnetma",
                    "score": 2,
                    "created_utc": 1643487645.0,
                    "response": "Harmony is a Layer 1. That competes with L2s.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hurfx1c",
                    "author": "Chompa94",
                    "score": 2,
                    "created_utc": 1643487850.0,
                    "response": "Big up VEVE moving from GO to ETH L2 (IMX)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hurm6gt",
                    "author": "BajaBlastMtDew",
                    "score": 2,
                    "created_utc": 1643490469.0,
                    "response": "Because L2 is way to complicated to sue for me and I'm assuming others. Like I have eth on hardware wallet and some exchanges and have no idea on how to get it to L2 and everything I read about just sounds like overcomplicated mess",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hurun2t",
                            "author": "PinkPuppyBall",
                            "score": 2,
                            "created_utc": 1643494037.0,
                            "response": "It behaves the same way as L1 from a user experience perspective. If your exchange is crypto.com, binance.com or huobi.ma then you can just withdraw to Arbitrum and use your hardware wallet with metamask as usual.  Like the [Arbitrum blockchain explorer](https://arbiscan.io/), looks familiar, no? :)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hurp7df",
                    "author": "StreeterGM",
                    "score": 2,
                    "created_utc": 1643491740.0,
                    "response": "As soon as AAVE is on Arbitrum, I'm moving.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hurspne",
                    "author": "mcy33zy",
                    "score": 2,
                    "created_utc": 1643493214.0,
                    "response": "banking on starknet doing big things",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hurufqv",
                    "author": "admljhnsn",
                    "score": 2,
                    "created_utc": 1643493950.0,
                    "response": "aren't these just splitting the ecosystem into a bunch of separate islands?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hus20ec",
                    "author": "Iron0ne",
                    "score": 2,
                    "created_utc": 1643497226.0,
                    "response": "Fractured eco system that still requires L1 to move between L2s.  They might as well be alt coins.  Oh you want an NFT over on that L2, oh that will be $300 in fees on L1.  Want to move over to this L2 to LP, awe shucks $400 on L1.   But hey you still have to pay multiple dollar fees on Arbitum.\n\nIts a fucking joke they need to fix the fees on L1, full stop, top priority.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hus27zr",
                            "author": "mrcleansocks",
                            "score": 1,
                            "created_utc": 1643497317.0,
                            "response": "L2s will be interoperable. There is already liquidity and bridges for some L2s",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hus90tr",
                    "author": "No-Professional5221",
                    "score": 2,
                    "created_utc": 1643500331.0,
                    "response": "This whole thing seems like a mess. Hard to imagine any real adoption by the public at large as things stand now",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "husjkew",
                    "author": "gamerbike",
                    "score": 2,
                    "created_utc": 1643505074.0,
                    "response": "I need aave v3 on arbitrum, with a way to teleport my current aave positions",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hussu0d",
                            "author": "Old-Landscape2",
                            "score": 1,
                            "created_utc": 1643509213.0,
                            "response": "Is this doable? I would love to \"teleport\" my positions from Mainnet to Polygon, for example. If it's just a matter of bridging the aTokens, then it'll be possible.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "huulk9s",
                                    "author": "gamerbike",
                                    "score": 1,
                                    "created_utc": 1643549308.0,
                                    "response": "on aave v2 you cant, I hope there is a way on aave v3",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hut1fmb",
                    "author": "SalomonCrypto",
                    "score": 2,
                    "created_utc": 1643513170.0,
                    "response": "Because even though I’m 100% confident it’s possible to withdraw from a layer 2 directly on eth, I have yet to see a reliable way to do it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huqr6n1",
                    "author": "guy_w_dijon_on_shirt",
                    "score": 5,
                    "created_utc": 1643477838.0,
                    "response": "Arbitrum is the future, the team is well funded and knows what they’re doing. Recommend looking into Arbitrum first",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hus1ipv",
                            "author": "Hanzburger",
                            "score": 14,
                            "created_utc": 1643497016.0,
                            "response": "Arbitrum is now, zkrollups are the future",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "huwupon",
                                    "author": "Ok_Tomorrow3281",
                                    "score": 1,
                                    "created_utc": 1643581566.0,
                                    "response": "can u explain more why?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "huxpczs",
                                            "author": "Hanzburger",
                                            "score": 1,
                                            "created_utc": 1643593493.0,
                                            "response": "Arbitrum is an optimistic rollup. Those are inferior to zkrollups and are more of a stop gap short term solution.\n\nAn optimistic rollup relies on a valid until proven invalid model, hence the name opportunistic,  while a zkrollup is proven valid by a mathematically.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "huqyd9w",
                    "author": "MakeMuricaGreat",
                    "score": 5,
                    "created_utc": 1643480715.0,
                    "response": "There is one big question remaining. If L2 is as good as L1, why isn't L2 L1?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hur2npk",
                            "author": "Wisgood",
                            "score": 8,
                            "created_utc": 1643482435.0,
                            "response": "Because L2 inherits the security from L1. l2 requires L1 to work, because it functions as basically a compression and consolidation algorithm to run the computations away from main chain and then only writes the resulting hash to Eth/L1 where the security is decentralized and nearly infallible. (Someone correct me if I'm wrong)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hurmlwb",
                                    "author": "MakeMuricaGreat",
                                    "score": 0,
                                    "created_utc": 1643490648.0,
                                    "response": "And? Why can't this compression and consolidation be done at L1? You have the validators who already compress the transactions into blocks, why stop there if it's so good?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hurtnvx",
                                            "author": "PinkPuppyBall",
                                            "score": 6,
                                            "created_utc": 1643493621.0,
                                            "response": "Rollups move computation (and state storage) off-chain, but keep some data per transaction on-chain. To improve efficiency, they use a whole host of fancy compression tricks to replace data with computation wherever possible. The result is a system where scalability is still limited by the data bandwidth of the underlying blockchain, but at a very favorable ratio: whereas an Ethereum base-layer ERC20 token transfer costs ~45000 gas, an ERC20 token transfer in a rollup takes up 16 bytes of on-chain space and costs under 300 gas.\n\nThe fact that data is on-chain is key. Putting data on-chain and having consensus on that fact allows anyone to locally process all the operations in the rollup if they wish to, allowing them to detect fraud, initiate withdrawals, or personally start producing transaction batches. The lack of data availability issues means that a malicious or offline operator can do even less harm (eg. they cannot cause a 1 week delay), opening up a much larger design space for who has the right to publish batches and making rollups vastly easier to reason about. And most importantly, the lack of data availability issues means that there is no longer any need to map assets to owners, leading to the key reason why the Ethereum community is so much more excited about rollups than previous forms of layer 2 scaling: rollups are fully general-purpose, and one can even run an EVM inside a rollup, allowing existing Ethereum applications to migrate to rollups with almost no need to write any new code.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hus3fxb",
                                                    "author": "Wisgood",
                                                    "score": 1,
                                                    "created_utc": 1643497852.0,
                                                    "response": "This is a really good explanation of how rollups enable exponential scaling. Thank you.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "huu3vxn",
                                                    "author": "MakeMuricaGreat",
                                                    "score": 1,
                                                    "created_utc": 1643537012.0,
                                                    "response": "So computation and storage are moved off-chain. Good.\nNow the questions are:\n\n1. If that off-chain storage is lost do you still have your money?\n\n2. If your money is lost then who cares if the L1 is decentralised and secure?\n\n3. If your money isn't lost when the L2 dies, then who needs the L2, just do the L2's job as part of the normal validation and block-forming on L1?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "huu5w2t",
                                                            "author": "PinkPuppyBall",
                                                            "score": 1,
                                                            "created_utc": 1643538583.0,
                                                            "response": "You should probably read this https://www.reddit.com/r/ethereum/comments/pmvbbh/addressing_common_rollup_misconceptions/",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "huu6hxh",
                                                                    "author": "MakeMuricaGreat",
                                                                    "score": 1,
                                                                    "created_utc": 1643539058.0,
                                                                    "response": "> https://www.reddit.com/r/ethereum/comments/pmvbbh/addressing_common_rollup_misconceptions/\n\nI am well versed in tech and have already read this along with the actual papers. Nothing answers these questions.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "huukcnk",
                                                                            "author": "PinkPuppyBall",
                                                                            "score": 1,
                                                                            "created_utc": 1643548640.0,
                                                                            "response": "Rollups off-load heavy computation from the main chain to a chain with much higher computational demand. With fraud/validity proofs the main chain can be sure that the L2 followed the rules with very little computation.\n\nMain chain is fully decentralized and easy to participate in because the hardware requirements are reasonable. L2 is not necessarily easy to participate in, but the proofs make sure that they cannot cheat.\n\nSolana is an example of the architecture you're thinking of. Its basically an L2 without an L1. Immense hardware requirements. Difference is that its not possible for you to verify that solana is following the rules. You *have* to trust that the few people running nodes are honest. It has been suggested that [solana should simply pivot towards becoming a rollup on Ethereum](https://np.reddit.com/r/solana/comments/paspos/solanas_endgame_becoming_an_ethereum_rollup/). \n\nDoes this answer your question?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "huux65x",
                                                                                    "author": "MakeMuricaGreat",
                                                                                    "score": 1,
                                                                                    "created_utc": 1643554934.0,
                                                                                    "response": "Doesn't answer the question at all. Let's focus on this: Rollups off-load heavy computation from the main chain to a chain with much higher computational demand.\n\nFirst of all, there is no \"heavy computation\" on the chain anyway. The computation is done by the miners/validators. Since the L2 computers will have to do that that \"heavy computation\" why not do it as L1 miners/validators?\n\nI understand the point of the compressed proof in batched transactions, but again fail to see why not have the L1 validators/miners batch a bunch of transactions and compress them to a single hash if that's enough? The L2 validators (or sequencers) have the same job as the block producers on L1. Just produce compressed blocks on L1 if they are so good. It just makes no sense that L2 is as secure as L1 but somehow L2 is so much better in thruput.\n\nSolana is basically ditching old state quickly. Am I to understand that L2 is simply going to ditch the old state? And if so then that's proof it's nowhere near as secure as L1. Further that also suggests that the user of the L2 must always keep their receipts as keys if they want to exit the rollup which makes it so much harder to use properly as designed, at that point might as well use Solana.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hur1ue8",
                            "author": "frank__costello",
                            "score": 7,
                            "created_utc": 1643482106.0,
                            "response": "Because L2s still need an L1",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "huqzb6x",
                            "author": "Maswasnos",
                            "score": 9,
                            "created_utc": 1643481092.0,
                            "response": "Because if L2 were L1, it wouldn't have any of the advantages it has as an L2.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hurmvz9",
                                    "author": "MakeMuricaGreat",
                                    "score": 6,
                                    "created_utc": 1643490766.0,
                                    "response": "Sure, but what are disadvantages of L2 and if L2 is inferior what's point of maintaining an L1 layer for features that are lost at L2? Nobody wants to answer this question.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hus1xzv",
                                            "author": "Hanzburger",
                                            "score": 6,
                                            "created_utc": 1643497198.0,
                                            "response": "Layer 2, as the name implies, is built on Layer 1. You can't have L2 without L1.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hurzbf5",
                                            "author": "Maswasnos",
                                            "score": 1,
                                            "created_utc": 1643496064.0,
                                            "response": "I'm not sure I understand the question. What disadvantages of L2 are you referring to? I'm not aware of any features \"lost\" at L2; if anything you get *more* features because the compute resources are orders of magnitude greater than can be had at L1, even on a centralized chain like BSC or Solana. \n\nThe point of an Ethereum EVM-compatible L2 is to provide a turing-complete blockchain that leverages mainnet for security. This allows it to use higher-end hardware and provide more throughput than a maximally-decentralized L1 can offer while still maintaining the transaction integrity offered by that L1. The main problem with L2s is that they start out relatively centralized and therefore could be subject to censorship, but that's a fairly easy problem to solve.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "huqxpvf",
                    "author": "maxingoja",
                    "score": 2,
                    "created_utc": 1643480457.0,
                    "response": "Don’t  forget Metis (https://www.metis.io), fairly new, but quickly growing and it works great! Really refreshing compared to L1",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huqy6kr",
                    "author": "Jacobsendy",
                    "score": 2,
                    "created_utc": 1643480641.0,
                    "response": "I'm a big fan of privacy solutions but I personally don't subscribe to Layer 2 roll ups. There is always going to be issues with latency and high chances of front-running which is one of the things I'm particularly concerned about, especially with Aztec. I know about others like Railgun which is entirely layer 1 eliminating the opportunities of front-running since everything is executed on the block. In my opinion, that's a major advantage",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huslecu",
                    "author": "42069qwertz42069",
                    "score": 2,
                    "created_utc": 1643505897.0,
                    "response": "I have my eth on a hardwarewallet, why should i fiddle around with stupid swaps and shit that sound like a retard named it?\n\nI hodl all the way, no need to danger my bag with stupid software.\n\nLook around in the sub and read how many people get screwed because they dont know what they do.\n\nWhy should i interact with a user unfriendly bs?\n\nAnd yes, i have no idea about L2, because i always feard using metamask and other stuff because i know many people that got screwed.\n\nEdit: now downvote me, i dont care.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "husqnnk",
                            "author": "mrcleansocks",
                            "score": 0,
                            "created_utc": 1643508229.0,
                            "response": "I think this is a pretty reasonable position. My thought is that holding your assets on an L2 smart contract wallet like Argent with multiple Gaurdians, one of which could be your hardware wallet, is exponentially safer than just having a hardware wallet. \n\nIf you haven’t looked into the Smart Wallets, you definitely should. I wouldn’t be surprised if they become the norm in the next year or two as we see millions onboarded.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hur4ozc",
                    "author": "hodlstonkstendies",
                    "score": 1,
                    "created_utc": 1643483261.0,
                    "response": "Loopring is by far the best one",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hurtob1",
                            "author": "legitcrypto",
                            "score": 2,
                            "created_utc": 1643493626.0,
                            "response": "💯",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hur2d18",
                    "author": "SealofOuroboros",
                    "score": 1,
                    "created_utc": 1643482314.0,
                    "response": "OP is missing another big L2 key player, Polygon.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hur8c59",
                    "author": "ghfsigiwaa",
                    "score": 1,
                    "created_utc": 1643484759.0,
                    "response": "I dont care cause im a hodler. And also the fact that many dapps still dont support these side chains  or rollups",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hura593",
                    "author": "thecaramelbandit",
                    "score": 1,
                    "created_utc": 1643485471.0,
                    "response": "Are the L2s, like.... compatible with each other? Can you pay from Loopring to Arbitrum or main net?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hurgcmp",
                            "author": "frank__costello",
                            "score": 3,
                            "created_utc": 1643488030.0,
                            "response": "Most of them are, you can use Hop Protocol to move between Arbitrum and Optimism, and there's another bridge that lets you move between Arbitrum and ZKSync\n\nLoopring doesn't have any bridges, since it's not a general-purpose L2",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hurmr29",
                                    "author": "BitsAndBobs304",
                                    "score": 3,
                                    "created_utc": 1643490710.0,
                                    "response": "still waiting for bridges to and from immutable =(",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hus6fdo",
                                            "author": "Maswasnos",
                                            "score": 1,
                                            "created_utc": 1643499182.0,
                                            "response": "I think long-term Immutable (and the other StarkEx apps) will become an L3 connected to StarkNet L2, which should allow for extremely cheap bridging.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hurbt7r",
                    "author": "jzia93",
                    "score": 1,
                    "created_utc": 1643486146.0,
                    "response": "Yeah except...it's not that easy.\n\nNot all chains have identical EVMs.\n\nNot all protocols have deployed across the different L2s....\n\nTry developing a DApp and having it work the same on FTM, AVAX, Polygon, LRC, (good luck, you'll need 4 implementations)\n\nL1 to L2 is improving but it is NOT a completely cost free move",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "huruyf8",
                            "author": "PinkPuppyBall",
                            "score": 2,
                            "created_utc": 1643494172.0,
                            "response": "It is that easy on L2's with[ EVM equivalence, Optimism for example](https://medium.com/ethereum-optimism/introducing-evm-equivalence-5c2021deb306).",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "huta830",
                                    "author": "jzia93",
                                    "score": 1,
                                    "created_utc": 1643517372.0,
                                    "response": "Deployment in isolation is fine. Managing the fact that you have different protocols and liquidity is the hard part. It's much more of an ecosystem thing.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hurena2",
                    "author": "SecretaryImaginary44",
                    "score": -1,
                    "created_utc": 1643487328.0,
                    "response": "This is a very long way of writing “Ethereum is completely incapable of fulfilling its original purpose”",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hurf5c6",
                            "author": "mrcleansocks",
                            "score": 3,
                            "created_utc": 1643487537.0,
                            "response": "On the contrary, Ethereum is becoming larger and more ambitious. These systems augment and increase its scaling capabilities by becoming modular.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "huqxuha",
                    "author": "Scipio_Americana",
                    "score": 1,
                    "created_utc": 1643480508.0,
                    "response": "Inability to easily DCA or add to your investment is the main obstacle. Does anyone know if I can send CEL from Loopring L2 straight to my Celsius account?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hurfzxv",
                            "author": "frank__costello",
                            "score": 3,
                            "created_utc": 1643487884.0,
                            "response": "Message Celsius and ask them to add L2 support",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hus0zsy",
                                    "author": "frozengrandmatetris",
                                    "score": 3,
                                    "created_utc": 1643496789.0,
                                    "response": "all centralized services need to be pressed more to adopt these solutions. it is no longer acceptable for any of them to only support ETH mainnet and nothing else.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "huswr69",
                                    "author": "Scipio_Americana",
                                    "score": 1,
                                    "created_utc": 1643510978.0,
                                    "response": "So no then. Helpful response.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hur3wk3",
                    "author": "FewMagazine938",
                    "score": 1,
                    "created_utc": 1643482944.0,
                    "response": "Okay im new to crypto...how do i use something like uniswap or something similar to buy a token that is only listed on those exchanges? The fees on uniswap are crazy....so how do i go around this?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hurg33b",
                            "author": "frank__costello",
                            "score": 3,
                            "created_utc": 1643487919.0,
                            "response": "Uniswap is already on Arbitrum and Optimism\n\nYou just need to add those chains to your Metamask\n\n(note that liquidity is much lower on L2s than L1, but that will improve over time)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hur5r6y",
                    "author": "_tronald_dump_2020_",
                    "score": 1,
                    "created_utc": 1643483703.0,
                    "response": "My broker only has the mainnet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hur7clx",
                    "author": "Icedcool",
                    "score": 1,
                    "created_utc": 1643484358.0,
                    "response": "Most secure investment, if you got the cheddar.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huraj4d",
                    "author": "Accomplished-Loss-21",
                    "score": 1,
                    "created_utc": 1643485627.0,
                    "response": "I assume this isn't achievable if you've staked all your ethereum on exchanges?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huraqfh",
                    "author": "iAmEeRg",
                    "score": 1,
                    "created_utc": 1643485709.0,
                    "response": "Ok that’s great, but I was wondering what is the incentive to hold ETH if L2 become popular? Say loopring for example, the way I understand it is, in layman’s term, that they bundle all of the transaction into a single one and split transaction costs between the participants, correct? That is what allows significantly lower gas fees. So, in essence the small fries such as ourselves won’t be needing ETH. That is, with this scaling approach, the demand for eth wouldn’t be as high. So, the price for eth wouldn’t  “blow up”. Am I full of shit here? I don’t shit about fuck, so please pardon my ignorance",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hurggh7",
                            "author": "frank__costello",
                            "score": 4,
                            "created_utc": 1643488075.0,
                            "response": "Most L2s still use ETH for fees\n\nPlus, ETH is still a great store-of-value, and the best collateral in DeFi",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hurk3ez",
                    "author": "Brrrapitalism",
                    "score": 1,
                    "created_utc": 1643489591.0,
                    "response": "Do you need to convert your ETH to another coin such as LRC to use these? What are the implications for wallet to wallet transfer of ETH once on a layer 2?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hurkr0m",
                    "author": "_ArtosisCurse_",
                    "score": 1,
                    "created_utc": 1643489870.0,
                    "response": "Thank you, great post!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hurljtw",
                    "author": "meregizzardavowal",
                    "score": 1,
                    "created_utc": 1643490207.0,
                    "response": "Well, to get my coins out of exchanges I need to use layer one..",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hurnpeb",
                            "author": "mrcleansocks",
                            "score": 2,
                            "created_utc": 1643491110.0,
                            "response": "Read the bottom of the post. Layerswap",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hurp7hi",
                                    "author": "meregizzardavowal",
                                    "score": 1,
                                    "created_utc": 1643491741.0,
                                    "response": "I guess I’ll Google Optimism, Arbitrum, zkSync and Starknet. \n\nAre they as rock solid and immutable as Ethereum? I trust Ethereum. It has years of proven use. It’s unlikely to have a major weakness or be rug pulled. I guess I have to build up to that level of trust with one of these third party layer 2 solutions.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hurs2xd",
                                    "author": "meregizzardavowal",
                                    "score": 1,
                                    "created_utc": 1643492950.0,
                                    "response": "Initial thoughts:\n\nGenerally, I follow the advice of “not your keys, not your coins”. This has long been good advice to mitigate against trusting third parties. I guess L2 gives you some other form of keys, not the L1 keys - sounds risky. (the explainer videos I watched were a bit abstract and didn’t go into the detail of the real world implantation)\n\n\nOptimism sounds risky. I have a burden to prove fraud? What if I don’t know how to do this? Perhaps I only know how to prove unsophisticated attempts at fraud, but sophisticated ones go right by me. Concerning. \n\nZK rollups sound more promising from my initial reading, but I still remain cautious. How much real world field testing do these solutions have? Am I going to find in five years time I can’t retrieve my funds because the protocol had a flaw in it? At least L1 has been through its infancy period and critical weaknesses have had time to be found. \n\n\nSo yeah I guess these are my general hesitations for using L2. It feels a bit too distant from the real funds, and I need to trust some new technology layer that has had far less usage than L1. Perhaps after hundreds of billions of dollars have been transferred and stored on L2 for the long term, like L1, I would be more confident",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hurtozx",
                                            "author": "mrcleansocks",
                                            "score": 2,
                                            "created_utc": 1643493634.0,
                                            "response": "Argent and Loopring are both zkRollups and inherit security from L1. If the system explodes you can still eject your money from the systems because they are tied up in an L1 smart contract that uses zero knowledge proofs to secure your funds. If you’re nervous about security, those are the best options.\n\nIt’s like the eject button in a flight seat lol",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hurwzd3",
                    "author": "Demnod",
                    "score": 1,
                    "created_utc": 1643495045.0,
                    "response": "This makes no sense for NFTs… you didn’t describe a single way to buy or sell on L2s…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hus25s0",
                    "author": "AESTHTK",
                    "score": 1,
                    "created_utc": 1643497291.0,
                    "response": "It's optimism time!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hus6vri",
                    "author": "scientic",
                    "score": 1,
                    "created_utc": 1643499386.0,
                    "response": "Because how else am I going to complain about gas prices?!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hus8yuy",
                    "author": "Jc_28",
                    "score": 1,
                    "created_utc": 1643500307.0,
                    "response": "Why do I need to move it if it’s just sat in a HW wallet?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "husdl3p",
                    "author": "PengShuaiFengShui",
                    "score": 1,
                    "created_utc": 1643502381.0,
                    "response": "Good design doesnt require l2",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huse8zh",
                    "author": "Chasethemac",
                    "score": 1,
                    "created_utc": 1643502672.0,
                    "response": "Don't tell me how to live my life.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "husgs86",
                    "author": "UncomfortableDunker",
                    "score": 1,
                    "created_utc": 1643503811.0,
                    "response": "Man I just wanna hodl my eth by staking it ok",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "husj08t",
                            "author": "mrcleansocks",
                            "score": 1,
                            "created_utc": 1643504829.0,
                            "response": "Argent wallet has staking via Lido on L2",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "huskrrn",
                                    "author": "UncomfortableDunker",
                                    "score": 1,
                                    "created_utc": 1643505610.0,
                                    "response": "All my eth is locked up on Kraken. What's better about staking via Lido on Argent wallet? I'd like to keep staking after eth 2.0 is fully rolled out, so I'm just checking out all the options",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "huslcol",
                    "author": "ProfessionalCloud928",
                    "score": 1,
                    "created_utc": 1643505875.0,
                    "response": "solving gas fees by eth 2.0 is just an illusion; gas fees will never be solved",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "husm7de",
                    "author": "Swole_Bodry",
                    "score": 1,
                    "created_utc": 1643506243.0,
                    "response": "Is there any development into ZK Snark layer 2 scaling on Ethereum? I haven’t heard much about that and I think it would be EXTREMELY valuable to Ethereum",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "husmko1",
                    "author": "Romytens",
                    "score": 1,
                    "created_utc": 1643506405.0,
                    "response": "I know it makes sense to use the word Newfoundland in reference to new tech, but… Newfoundland is anything but new tech. Like warp back in time. A lot of them didn’t get internet until a few years ago. Didn’t get cable TV service til like 2000.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "husptoj",
                    "author": "Janx__Spirit",
                    "score": 1,
                    "created_utc": 1643507853.0,
                    "response": "Pro tip, use celer to bridge to L2. Best of class, secure and inexpensive.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "husvz40",
                    "author": "iIllli1ililI11",
                    "score": 1,
                    "created_utc": 1643510626.0,
                    "response": "If I wanted to buy a nft on opensea, is it the same nft when i purchase with loopring?\n\nIs the availability the same? Ie pirate monkey 1337 which I read went for 42.69 eth?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "husx7ta",
                    "author": "black_vigil",
                    "score": 1,
                    "created_utc": 1643511186.0,
                    "response": "I moved everything to L2 VeVe web app to be ready for land etc and paid a fraction of a GO token to do it... no eth no issue.. why isn't everyone doing this?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hut08l7",
                    "author": "account4cryptopostin",
                    "score": 1,
                    "created_utc": 1643512611.0,
                    "response": "The ecosystem isn't there and proven yet. Hopefully this is the year.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hut0n41",
                    "author": "timm-e",
                    "score": 1,
                    "created_utc": 1643512799.0,
                    "response": "Does coinbase support L2?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hut45ge",
                    "author": "mathaiser",
                    "score": 1,
                    "created_utc": 1643514453.0,
                    "response": "Why does this read as an Ad more than friendly advice.  I’m more weary now than I was before I read this.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hut5iaw",
                            "author": "mrcleansocks",
                            "score": 1,
                            "created_utc": 1643515098.0,
                            "response": "Lol. I’m just tryna help bro",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hutcg4h",
                    "author": "yesidarenasff",
                    "score": 1,
                    "created_utc": 1643518466.0,
                    "response": "I don't understand your take though. So I should leave QANplatform and go for loopring? Will I be able to validate nodes while using my phone? Will I be able to build on loopring using python? Will I be able to scale through the threats of quantum computers to blockchain technology? These and many more are the reasons why, I will be using layer 1.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hutkpfc",
                    "author": "randomish_walk",
                    "score": 1,
                    "created_utc": 1643523020.0,
                    "response": "Anyone have a list of all the CEXs that allow direct offramping into ethereum L2s?\n\nAnd separately, can we all petition our favorite CEX providers to allow offramping to layer 2? I’ll be penning a letter to Coinbase and expect them to reply in a few months, in line with their typical turnaround times as of late",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huttfq8",
                    "author": "crazyhankie",
                    "score": 1,
                    "created_utc": 1643528987.0,
                    "response": "How can I stake on L2?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hutuypr",
                    "author": "pegcity",
                    "score": 1,
                    "created_utc": 1643530133.0,
                    "response": "I was until a few hours ago, sent my 500k worth of weth to l2, it worked right?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huu1qrf",
                    "author": "daxtaslapp",
                    "score": 1,
                    "created_utc": 1643535328.0,
                    "response": "Lol I'm honestly not sure why there isn't a tutorial pinned to this subreddit. Everyone is too busy fighting, and not focused on helping each other get into L2",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "huvi1a2",
                            "author": "Ok_Tomorrow3281",
                            "score": 1,
                            "created_utc": 1643563275.0,
                            "response": "because L2 still pricey as fk, it only reduces the cost but still overr 1 dollar (mostly $20+) while other chain already in cents",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "huw77w3",
                                    "author": "daxtaslapp",
                                    "score": 1,
                                    "created_utc": 1643572860.0,
                                    "response": "No it's not lol. L2 costs less than $1 to transact as long as you're on L2. The issue is that there aren't enough popular dapps. $20+ is on L1 stop spreading misinformation. If you don't know something just don't say it like it's fact",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "huu23jo",
                    "author": "daxtaslapp",
                    "score": 1,
                    "created_utc": 1643535604.0,
                    "response": "We need more L2 dapps to make use of the low fees. Right now a lot of people are into NFTs (whether you like it or not I don't care) and marketplaces like opensea are mostly L1 so that in itself makes L2 still not popular",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huu31zr",
                    "author": "iwakan",
                    "score": 1,
                    "created_utc": 1643536353.0,
                    "response": "At the moment none of the L2s are completely decentralized. They have also not been battle-tested as much as the base layer and can thus contain bugs etc.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huudy1y",
                    "author": "zerohistory",
                    "score": 1,
                    "created_utc": 1643544586.0,
                    "response": "Best of us are building Level 2 and 3.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huuh9zb",
                    "author": "PizzzabyAlfredo",
                    "score": 1,
                    "created_utc": 1643546816.0,
                    "response": "This post has that \"if you ain't at the gym then where the fuck you atttttt\" vibes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huuro64",
                    "author": "MillennialBets",
                    "score": 1,
                    "created_utc": 1643552441.0,
                    "response": "Because there just isn’t the same liquidity on uni swap and other platforms on L2 like there is on L1. The argument sounds great in theory, but in reality the money and platforms just have not moved over yet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huury61",
                    "author": "Lookmaiamkool",
                    "score": 1,
                    "created_utc": 1643552570.0,
                    "response": "Thank you all, for once again helping me into the time-machine. Thank  you all for never leaving me in the past. My brothers and sisters.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huus4va",
                    "author": "Shaogong12",
                    "score": 1,
                    "created_utc": 1643552657.0,
                    "response": "Sorry OP, but I consider such a post (urging people to move money to L2s) highly immoral. You should at least mention that most L2s are in beta state and have huge [risks](https://www.reddit.com/r/ethereum/comments/rrxowm/question_on_l2_security/) (such as admins having the possibility to steal funds)!\n\nI do think that rollups are a promising technology, but as of today, I'd actually say the security of most L2s is no better than leaving money on an exchange.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huvhebj",
                    "author": "NevilleHarris",
                    "score": 1,
                    "created_utc": 1643563030.0,
                    "response": "Question: Are the Binance withdrawals to Arbitrum cheaper than bridging funds from your own wallet to L2? \n\nIn other words, should we be telling friends with their funds on places like Coinbase/BlockFi/etc (save the anti exchange rant) to panic move their funds to L2 or just wait for the eventual L2 withdrawal option like Binance? Should non-technical crypto holders stay chillin on exchanges?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huvjp8m",
                    "author": "Ok_Tomorrow3281",
                    "score": 1,
                    "created_utc": 1643563903.0,
                    "response": "lack of guidance to use it in smart contract, all guides i found only moving my funds ETH to L2 (WETH).\n\nhow about a bridging guide for developer? and for other things?\n\nin opensea I publish 100 NFT in eth network as a character, and now i publish the NFT for weapon in polygon. I'm still confused to combined them.\n\nalso all NFT in opensea, if I publish NFT in ETH network, how do I or other people buy it in ETH (L2) polygon?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huvtqpm",
                    "author": "Tenoke",
                    "score": 1,
                    "created_utc": 1643567707.0,
                    "response": "I just checked layerswap but it only allows me to move ETH off Binance and not my erc20 tokens which is what I'd like to move.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "huwk1pe",
                            "author": "mrcleansocks",
                            "score": 1,
                            "created_utc": 1643577611.0,
                            "response": "I’ve read binance may also have their own L2 bridge. Might be worth looking into",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "huwrj5f",
                    "author": "lemacfeast",
                    "score": 1,
                    "created_utc": 1643580392.0,
                    "response": "Is there an alternative to ENS on any level 2 solution? Or is it possible to mint an ENS on level 2 somehow?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huxf70y",
                    "author": "sayamemangdemikian",
                    "score": 1,
                    "created_utc": 1643589398.0,
                    "response": "do L2 support ledger?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "huxqri6",
                            "author": "mrcleansocks",
                            "score": 1,
                            "created_utc": 1643594048.0,
                            "response": "Yes. Argent wallet will let you set up a ledger as one of your gaurdians",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "huxgaww",
                    "author": "noNSFWcontent",
                    "score": 1,
                    "created_utc": 1643589846.0,
                    "response": "Which L2 has Aave on it?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "huxqtv6",
                            "author": "mrcleansocks",
                            "score": 1,
                            "created_utc": 1643594076.0,
                            "response": "Arbitrum is deploying aave soon",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hv3kruc",
                    "author": "northjayd",
                    "score": 1,
                    "created_utc": 1643694528.0,
                    "response": "This reads like a TV commercial for a used car dealer",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huqyaat",
                    "author": "r44b",
                    "score": -2,
                    "created_utc": 1643480681.0,
                    "response": "FTM",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hurkc4y",
                    "author": "A_solo_tripper",
                    "score": -3,
                    "created_utc": 1643489694.0,
                    "response": "Building on top of a high fee, low security, and centralized platform. \n\n#The irony",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hus78v1",
                            "author": "Maswasnos",
                            "score": 1,
                            "created_utc": 1643499551.0,
                            "response": "I think you're in the wrong sub, friend. ETH is the furthest thing from centralized and has some of the best security of any public blockchain.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "huskica",
                                    "author": "A_solo_tripper",
                                    "score": 0,
                                    "created_utc": 1643505492.0,
                                    "response": "> I think you're in the wrong sub, friend. ETH is the furthest thing from centralized and has some of the best security of any public blockchain.\n\nThe [eth comminity](https://www.reddit.com/r/ethereum/comments/s8117d/how_come_the_ethereum_community_hasnt_lowered_the/) already agreed that it is centralized. Yet, most couldn't admit that they are waiting on the devs to lower fees.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "huregbp",
                    "author": "doublejay1999",
                    "score": -1,
                    "created_utc": 1643487247.0,
                    "response": "this is really useful.\n\nwould have been even better to know before i sold out last week.  \n\ngood luck with eth.   it's no longer for me.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huregm1",
                    "author": "RazerPSN",
                    "score": 0,
                    "created_utc": 1643487251.0,
                    "response": "I might sound stupid but i don't trust L2 as much as i trust L1 with my money",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hurgisa",
                            "author": "mrcleansocks",
                            "score": 5,
                            "created_utc": 1643488102.0,
                            "response": "zkRollups have ethereum level security and provide escape hatches if the roll up fails. This means you can always force exit your funds, even if the L2 explodes",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hurld3z",
                    "author": "regalrecaller",
                    "score": 0,
                    "created_utc": 1643490130.0,
                    "response": "Well...I still think solana's layer 1 > any layer 2 built on top of eth. But I'm willing to be convinced otherwise",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hurmax2",
                            "author": "mrcleansocks",
                            "score": 3,
                            "created_utc": 1643490521.0,
                            "response": "Look into the security of zkRollups, they are the endgame for secure, scalable, and decentralized blockchains",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "huru4ls",
                            "author": "PinkPuppyBall",
                            "score": 1,
                            "created_utc": 1643493820.0,
                            "response": "https://medium.com/starkware/redefining-scalability-5aa11ffc5880",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hus3ad0",
                    "author": "Desperate_Blacksmith",
                    "score": 0,
                    "created_utc": 1643497785.0,
                    "response": "ETH needs to drop the \"SMART\" moniker, ye know *smart* contracts, *smart* wallets... there's nothing smart about them.\n\n&#x200B;\n\nTry mining directly to a \"smart\" contract wallet and see most of your earnings go up in smoke. Meanwhile Eth maxis are huffing their own farts thinking it's gods gift to society. \n\n&#x200B;\n\nFML",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}