{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uquer0",
            "title": "Transferring Wrapped Ethereum out of Coinbase Wallet",
            "url": "https://www.reddit.com/r/ethereum/comments/uquer0/transferring_wrapped_ethereum_out_of_coinbase/",
            "author": "Sonic992",
            "created_utc": 1652702808.0,
            "score": 3,
            "num_comments": 23,
            "subreddit": "ethereum",
            "selftext": "Hi guys,\n\nI have some WETH (wrapped ETH) in my Coinbase Wallet. The WETH is on the Polygon blockchain. I want to sell the WETH and was hoping someone could provide guidance on how I can do this? \n\nIt doesn’t seem possible to convert the WETH to ETH using Coinbase Wallet and I can’t transfer the WETH to my Coinbase account as there is no option to deposit WETH to Coinbase. I also can’t convert the WETH to any other coin such as USDT and then transfer the USDT to Coinbase - Coinbase Wallet says I needs for example $0.07 MATIC to proceed. I have some MATIC in my Coinbase account but the MATIC is on the Ethereum blockchain. \n\nIs there any way I can transfer the MATIC I have in my Coinbase account, which is on the Ethereum blockchain, to the Polygon blockchain to pay fees to convert the WETH to USDT? Or alternatively is there any other way that I can get the WETH out of Coinbase Wallet and sell it?\n\nAny advice would be much appreciated 😄",
            "stickied": false,
            "comments": [
                {
                    "id": "i8tsycb",
                    "author": "joan9568",
                    "score": 2,
                    "created_utc": 1652713696.0,
                    "response": "Crypto.com Exchange supports WETH :)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tzwey",
                            "author": "Sonic992",
                            "score": 1,
                            "created_utc": 1652716561.0,
                            "response": "Thank you : )",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8tvvvi",
                    "author": "HeavyMommyMilkers",
                    "score": 2,
                    "created_utc": 1652714920.0,
                    "response": "Use an exchange that uses both Ethereum and Polygon. KuCoin is my favorite",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tzywq",
                            "author": "Sonic992",
                            "score": 1,
                            "created_utc": 1652716589.0,
                            "response": "Thanks : )",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8tzlle",
                    "author": "bandoonparade",
                    "score": 2,
                    "created_utc": 1652716440.0,
                    "response": "I deal with this every week or so.\n\nStep 1: Buy MATIC on exchange that supports Polygon network withdrawals. I use crypto.com, but I'm sure there are others.\n\nStep 2: Withdraw MATIC to your wallet, making sure it's on the Polygon network and not ERC20.\n\nStep 3: use a DeFi exchange (I use uniswap) to convert your wETH to MATIC on the Polygon network. Gas fees should be <$0.01.\n\nStep 4: Send your new MATIC back to your exchange. Remember to keep some in your wallet so you can do this again later without repeating Steps 1 and 2. Convert it to whatever currency you want. \n\nRepeat Step 3-4 as often as you want. I usually wait until I get a few payouts from mining before converting.\n\nHope this helps. GL.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u07xe",
                            "author": "Sonic992",
                            "score": 1,
                            "created_utc": 1652716691.0,
                            "response": "Thanks very much for the detailed info : ) much appreciated",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8tirxh",
                    "author": "CrimsonFox99",
                    "score": 1,
                    "created_utc": 1652709276.0,
                    "response": "Use Polygon bridge to get your weth over to mainnet, then send to CB.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tjzhj",
                            "author": "Sonic992",
                            "score": 1,
                            "created_utc": 1652709834.0,
                            "response": "Thanks very much - I will have a look at this after work.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8tb2e2",
                    "author": "vostok81",
                    "score": -1,
                    "created_utc": 1652705460.0,
                    "response": "Don't believe the fed!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tc9ua",
                    "author": "goldcakes",
                    "score": 0,
                    "created_utc": 1652706086.0,
                    "response": "Any WETH deposited to Coinbase is converted to ETH automatically",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tceik",
                            "author": "Sonic992",
                            "score": 1,
                            "created_utc": 1652706154.0,
                            "response": "Thanks for you comment - so I can just transfer the WETH from Coinbase Wallet to my Coinbase account ETH address?\n\nI saw some comments saying that WETH disappeared when they tried to do this so I was reluctant!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ti6ok",
                                    "author": "Maswasnos",
                                    "score": 4,
                                    "created_utc": 1652708999.0,
                                    "response": "NO! DO NOT DO THIS! YOU WILL LOSE YOUR WETH!\n\nYour WETH is on the Polygon blockchain and Coinbase does NOT support deposits on Polygon.\n\nEdit: Had to get that out fast, I really hope you saw it. \n\nYou have to withdraw your WETH from the Polygon Network to Ethereum mainnet, and then you can transfer it to Coinbase. You will need some MATIC to perform the withdrawal to mainnet.\n\nI recommend trying Hop Network to accomplish this, I've used them before and they're reputable. You can go from WETH on Polygon to ETH on mainnet: \n\nhttps://app.hop.exchange/#/send\n\nONLY once you have ETH on mainnet should you send it to your Coinbase deposit address.\n\nEdit2: In fact you might be able to send it directly to your Coinbase deposit address by using the custom recipient field in Hop, but I haven't personally tried this.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8tjm1k",
                                            "author": "Sonic992",
                                            "score": 2,
                                            "created_utc": 1652709661.0,
                                            "response": "Hi thanks very much for your message.\n\nHow can I add some Matic on the polygon blockchain to my Coinbase Wallet?\n\nI have some Matic on the Eth blockchain in my Coinbase account. Is there any way in which I can transfer this Matic (on the eth blockchain) to my Coinbase Wallet as Matic on the polygon blockchain?\n\nMy WETH is basically stuck in Coinbase Wallet at the moment as I don’t know how to buy/transfer Matic (on the polygon blockchain) to Coinbase Wallet in order to pay gas fees to extract the WETH!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8tkutf",
                                                    "author": "Maswasnos",
                                                    "score": 1,
                                                    "created_utc": 1652710226.0,
                                                    "response": "The \"proper\" way would be to do this:\n\n1. Withdraw MATIC from Coinbase to Coinbase wallet on ETH mainnet\n2. Bridge MATIC to Polygon using Hop or the official Polygon bridge\n3. Use MATIC to bridge the WETH back to mainnet \n\nBut honestly it's probably easier to use something like MoonPay or Ramp.network to buy a little MATIC directly on Polygon. Then you can use that MATIC to transfer your WETH.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8tlexc",
                                                            "author": "Sonic992",
                                                            "score": 2,
                                                            "created_utc": 1652710475.0,
                                                            "response": "Thanks very much for your help and advice - I really appreciate it. \n\nIf I buy Matic (polygon network) through Moonpay, would I be able to deposit this Matic (on the polygon network) to my Coinbase Wallet?\n\nIf so, I would then have some Matic on the polygon network available in my Coinbase Wallet which would allow me to convert WETH to USDT and then send the USDT to my Coinbase account - which would be great 😄",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8tlo1p",
                                                                    "author": "Maswasnos",
                                                                    "score": 2,
                                                                    "created_utc": 1652710588.0,
                                                                    "response": "Yes, when you buy the MATIC it will ask for an address; put in the address of your Coinbase wallet NOT the deposit address you get from coinbase.com. \n\nAlso make sure you are buying MATIC on polygon, not on mainnet.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8tm3zq",
                                                                            "author": "Sonic992",
                                                                            "score": 2,
                                                                            "created_utc": 1652710787.0,
                                                                            "response": "Thanks very much - so the address for Moonpay should just be my general Coinbase Wallet address and not a specific Matic deposit address? \n\nI’ll make sure to buy Matic on Polygon network and not Matic on Eth main net.\n\nThanks very much again, I really appreciate the help. I was quite confused about how to extract the WETH but looks like I have a plan now 😄",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8tmays",
                                                                                    "author": "Maswasnos",
                                                                                    "score": 2,
                                                                                    "created_utc": 1652710869.0,
                                                                                    "response": "Yes, your general Coinbase wallet address should be the destination if you buy via MoonPay or a similar service. \n\nIf you have any questions during the process feel free to message me directly and I'll try to help out.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8tmml6",
                                                                                            "author": "Sonic992",
                                                                                            "score": 2,
                                                                                            "created_utc": 1652711010.0,
                                                                                            "response": "I really appreciate it - I will try and do this after work today and will let you know how I get on. Thanks very much again my good sir, have a great day 😄",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "i8tmzya",
                                                                                    "author": "Maswasnos",
                                                                                    "score": 2,
                                                                                    "created_utc": 1652711172.0,
                                                                                    "response": "Here's where it is in the wallet extension: \n\nhttps://i.imgur.com/RTgYoGq.png\n\nThat \"Ethereum\" address is what you want. Then make sure you send to it over the Polygon network, NOT mainnet or \"ERC-20\".",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "i8tnhs1",
                                                                                    "author": "Sonic992",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652711386.0,
                                                                                    "response": "Thanks very much, I’ll try and do this in a few hours after work 😄. I really appreciate you taking the time out to explain things and for your kind offer to assist if I have any questions during the process",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8tdf07",
                                    "author": "goldcakes",
                                    "score": 0,
                                    "created_utc": 1652706680.0,
                                    "response": "Yes. Start with 0.01 WETH, trust me it'll be unwrapped.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8tfg2v",
                                            "author": "Sonic992",
                                            "score": 1,
                                            "created_utc": 1652707691.0,
                                            "response": "Thanks for this - I’ll try it soon and let you know how I get on!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uqudoa",
            "title": "Avichal Garg of Electric Capital Explains How Ethereum Could Become a Third Digital Government (1.5-minute audio clip)",
            "url": "https://podclips.com/c/f7uGOR?ss=r&ss2=ethereum&d=2022-05-16",
            "author": "biohacker045",
            "created_utc": 1652702707.0,
            "score": 5,
            "num_comments": 3,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}