{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ldkrs8",
            "title": "My experience selling my first NFT artwork.",
            "url": "https://www.reddit.com/r/ethereum/comments/ldkrs8/my_experience_selling_my_first_nft_artwork/",
            "author": "robbanderson",
            "created_utc": 1612568943.0,
            "score": 157,
            "num_comments": 66,
            "subreddit": "ethereum",
            "selftext": "After major fomo hearing about how artists are turning to NFT's and making a killing, I decided I would do a little research and try my own creation just to see what the process is like. I felt like Rarible would be a good first place to start and hopefully stand out as a jewel among some of the crap. I already had some ethereum and had to transfer it to a wallet. That's the first fee. Whenever you transfer the stuff, it costs money. I connected my wallet, which practically serves as your profile and place where you keep collectibles as well as crypto. I picked a scan of a drawing that I liked and began the upload process. It's all pretty easy, but they don't really talk about how expensive it is to post things. This scales based on the  workload of the network. And now, it's crazy high. I spent about $60 to post after all the fees, and that's when it was pretty low. I was open to any transaction, I just wanted someone to have my art and see how it works, so I left the bid open. After I posted it to the gram, my friend placed a $1 bid! Cool! I'll take anything for the first time trying! Excited, I accepted and found that there was a $100 miner fee... again... to complete the bid. Now, I'm no business major, but none of this makes any sense. So I'm boiling this experience down to the following feelings/possibilities: right now it's too expensive to add your work because a lot of people are using the network to process things. Unless you have work that will sell enough to cover miner fees, it isn't worth it. There may be better websites to post on, but some of them require an application process. Could some sites be playing off the recent publicity and just trying to make a dime off the little guy through fees? How are so many things selling for so low? Fees, fees, and more fees. I once told myself I'd never pay to play again but I feel like I paid and got played... On purpose. Overall, I was happy to take a risk and learn some valuable lessons. Actually, I still haven't really learned much. But I did spend almost $200 to let my friend have a digital version of my art. Can we talk about how nice I am?",
            "stickied": false,
            "comments": [
                {
                    "id": "gm6pbaw",
                    "author": "dreftylefty",
                    "score": 13,
                    "created_utc": 1612575325.0,
                    "response": "Vast majority of NFT’s should be on second layers, with the option to be sent to layer 1 for ones of significant value",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hqdsvo8",
                            "author": "jpoe503",
                            "score": 1,
                            "created_utc": 1640761234.0,
                            "response": "What is a second layer?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqdswbu",
                                    "author": "wikipedia_answer_bot",
                                    "score": 2,
                                    "created_utc": 1640761247.0,
                                    "response": "**Second Layer were an English post-punk band formed in 1979 by Adrian Borland (vocals, guitar) and Graham Bailey (keyboards, bass guitar, drum programming), both members of the Sound.\n\n\n== History ==\nThe duo's first release was the Flesh as Property EP, released in 1979 by Tortch Records.**\n\nMore details here: <https://en.wikipedia.org/wiki/Second_Layer> \n\n\n\n*This comment was left automatically (by a bot). If I don't get this right, don't get mad at me, I'm still learning!*\n\n[^(opt out)](https://www.reddit.com/r/wikipedia_answer_bot/comments/ozztfy/post_for_opting_out/) ^(|) [^(delete)](https://www.reddit.com/r/wikipedia_answer_bot/comments/q79g2t/delete_feature_added/) ^(|) [^(report/suggest)](https://www.reddit.com/r/wikipedia_answer_bot) ^(|) [^(GitHub)](https://github.com/TheBugYouCantFix/wiki-reddit-bot)",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hr3rwv1",
                                    "author": "dreftylefty",
                                    "score": 2,
                                    "created_utc": 1641235028.0,
                                    "response": "second layer is a backpack blockchain (polygon, binance smart chain, etc), attached to the main super secure primary blockchian.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gm6pnan",
                    "author": "ediv_",
                    "score": 11,
                    "created_utc": 1612575503.0,
                    "response": "Sorry that sucked for you, but kudos for making the effort to try the whole thing out. Only as more people start playing with this are the pain points going to become highlighted and smoothed out.\n\nI think you can at least take solace in that you weren't played as  it seems like folks in all parts of the ecosystem are still trying to figure out how to make a profit.\n\nWe all hope upcoming changes will greatly improve the cost of doing business.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gm9hzyq",
                            "author": "robbanderson",
                            "score": 2,
                            "created_utc": 1612640960.0,
                            "response": "Agreed. Some friends were so excited to tell me about NFT's without having tried it themselves and I really wanted to know the truth and report back. Right now it seems like a place for already crypto-rich players. I'm sure as the mainstream catches on they'll figure out better, cheaper methods.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gqrp2a4",
                    "author": "artdeconstructed",
                    "score": 4,
                    "created_utc": 1615609540.0,
                    "response": "I just listed three items and feel similar to you. I'm viewing the cost as a lesson. The cost of doing a business. I paint traditionally and digitally. Traditionally I have been burned with art supplies that are crap or workshops that are not a good use of my time.  Each failure is a step towards success.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gm6dr55",
                    "author": "3168074",
                    "score": 8,
                    "created_utc": 1612569259.0,
                    "response": "Thanks for sharing your experience. I too was curious about how this process worked and what type of initial investment is required to get started. Seems like it’s not worth it for the average person to try right now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gm6pj4h",
                    "author": "dreftylefty",
                    "score": 7,
                    "created_utc": 1612575440.0,
                    "response": "Actually any programmers out there? The posting and bidding process should be on L2, with the winning bidder having the option to withdraw to layer 1",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "googxb1",
                    "author": "bpaul24",
                    "score": 2,
                    "created_utc": 1614234984.0,
                    "response": "Thanks for sharing. I have been researching it the past few days. I’m pretty sure I can make some cool 3D art but just don’t get why anyone would buy it. I have seen some crap sell though so idk.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gpcssbx",
                            "author": "robbanderson",
                            "score": 5,
                            "created_utc": 1614640866.0,
                            "response": "Maaan, reflecting back I have a lot of thoughts on NFT's. I'm still undecided where I stand, and still open despite some bias. I want artists to be successful, but I also want deeper, meaningful work that inspires. We're jumping on board to test the waters especially after seeing it become so lucrative to a select few. Royalties, authenticity, are all very appealing. But does it make people create the best work? Do NFT's bring life and energy to the world? Is it sustainable? What is the energy impact of a single transaction? Does anyone else get slight ponzi scheme/ gamification vibes? Regardless, if you make your success with it, I'm rooting for you. But make your art well and stand for something, don't do it just because of NFT money.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gpd3tp7",
                                    "author": "bpaul24",
                                    "score": 1,
                                    "created_utc": 1614646702.0,
                                    "response": "This is a whole new world to me.  I can see a lot of uses and potential for this but just like anything it will grow and mature through the garbage and growing pains.  How useful will it be to different industries beyond the initial hype is hard to say.  For myself I would may use if for 3D art I make in Blender or 3Dmax and music tracks I make already.  Not necessarily to make money but perhaps as a way to better protect copy right infringement.  I don't understand why it has been so lucrative for some items just to collect but whatever makes people happy.  I may create a few items and play around with it in the name of education and discovery.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gqj6wy7",
                                    "author": "foreignredcars",
                                    "score": 1,
                                    "created_utc": 1615436522.0,
                                    "response": "You're right about the part where art should come from a deeper place within, art made for the purpose of gaining money and/or attention is less genuine and the artist doesn't get to decide what makes your dick hard. Art deserves a better source for the sake of its own well being.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gmagojx",
                    "author": "bomtom1",
                    "score": 2,
                    "created_utc": 1612651549.0,
                    "response": "Did you try any other NFT marketplaces? Did you stumble across a summary of all existing markets?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gmaouye",
                            "author": "robbanderson",
                            "score": 2,
                            "created_utc": 1612654346.0,
                            "response": "I checked out opensea, MakersPlace, super rare, nifties.... opensea is community based like Rarible and the others are curated and require a submission to get reviewed. Not sure what you mean by summary, but it seems opensea lists NFT's from a wide variety of places you can create them.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "grce740",
                                    "author": "willard720",
                                    "score": 5,
                                    "created_utc": 1616068044.0,
                                    "response": "Mintable has no gas fees.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gm91ag3",
                    "author": "troyboltonislife",
                    "score": 1,
                    "created_utc": 1612633791.0,
                    "response": "Yup. Not surprising. Layer 1 is very expensive right now. As Layer 2 progresses everything will get cheaper.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gt3ggwn",
                            "author": "iTand22",
                            "score": 1,
                            "created_utc": 1617325752.0,
                            "response": "I'm trying to learn more about all this before deciding if wanna try selling some pictures I've taken. What's the difference between Layer 1 and Layer 2?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gt3hip8",
                                    "author": "troyboltonislife",
                                    "score": 3,
                                    "created_utc": 1617326367.0,
                                    "response": "Layer 1 are transactions processed directly on ethereum blockchain. Layer 2 is like a side chain where transactions are cheaper. Basically, ethereum transactions are so expensive because every computer on the blockchain has to process the transaction. That’s layer 1. Layer 2 is usually a more centralized computer processing the transaction and then using fancy math and algorithms it’s guaranteed to be legit and pushed on chain onto Layer 1. Like a bunch of transactions are batched together and processed together and then pushed to ethereums layer 1. This cuts down on costs because all the computers on layer 1 just have to verify one transaction which is the one batch and not the hundreds of different transactions in that batch. Sorry that’s the best I can do explaining if you need to understand more then I’d suggest google but you do need a bit of a basic understanding on how blockchain works.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gt3uxjo",
                                            "author": "iTand22",
                                            "score": 3,
                                            "created_utc": 1617334412.0,
                                            "response": "Interesting. Thank you for the information. That was a better explanation than I could find in basic Google search.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gm7bvh0",
                    "author": "i_have_chosen_a_name",
                    "score": 0,
                    "created_utc": 1612588260.0,
                    "response": "I am working on getting a fork of counterparty to work on Bitcoin Cash. We will then reboot the entire counterparty system since augustus 2018.  All trades made since then will be roled back to when BTC and BCH forked. Counterparty is really dead because high fees killed it. \n\nNon Fungible Tokens are possible on the Simple Ledger Protocol which is  indeed extremely simply but does not scale at all.\n\nStill, right now there is a lot of room for growth on the BCH chain. \n\nAs an Ethereum user I hope the fees problem will soon be solved. As a musician and artist I can't wait for them to solve it. So I am going to create my own market by getting the bitcoin cash counter party fork to work. And then I will create my own NFT assest and tell everybody that used to trade on counterparty that they can trade again if they are okay with  a roll back to august 2018.\n\nSince most of their assets are untradable because high fees killed their markets they will probably be really happy that I am rebooting their markets. \n\n\nIf anybody wants to try out SLP the easiest way is through https://memo.cash\n\nFor 1 cents you can create 10 NTF tokens.\n\nAfter rebooting counterparty and getting trades going, once people are making money I will simply tell them that everything is going to migrate from counterparty to SLP.\n\nSince I will be paying for running the counterparty servers they will have no choise to follow if they still want to trade.\n\nThen counterparty is official dead and the NFT scene on SLP is kickstarted by all the[ rare pepe traders](https://www.artnome.com/news/2018/1/23/rare-pepe-wallet-the-birth-of-cryptoart) and many more. T hey have not traded in years, they will be happy to be trading again!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gmagf0y",
                            "author": "bomtom1",
                            "score": 1,
                            "created_utc": 1612651455.0,
                            "response": "Who was involved in the original counterparty?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gwbupr0",
                            "author": "msGNU",
                            "score": 1,
                            "created_utc": 1619721616.0,
                            "response": "lol BCH is shitcoin cash\n\nof course there are low mining fees on a blockchain where idiots think a zero conf transaction is acceptable 😂",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gwc6gqh",
                                    "author": "i_have_chosen_a_name",
                                    "score": 1,
                                    "created_utc": 1619726140.0,
                                    "response": "Idiots like Satoshi Nakamoto? \n\nhttps://bitcointalk.org/index.php?topic=423.20",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "grux9iw",
                    "author": "activemotionpictures",
                    "score": 1,
                    "created_utc": 1616448960.0,
                    "response": "If $1 has a $60 gas and a $100 commission (from the gallery seller as third man), how much is a $400 artwork sold in commission's fee?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gu7t2kv",
                    "author": "Real_Organization_52",
                    "score": 1,
                    "created_utc": 1618197198.0,
                    "response": "Wish I would have read this before posting 4 of my work today on the Rarible site. I already had to pay close to 45$ for each of them but I didn't know that there would be a 100$ fee on top of that. Oh well, it really is a learning experience and hopefully, my work gets seen. Thank you for sharing your experience by the way!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gyvpqs9",
                            "author": "robbanderson",
                            "score": 1,
                            "created_utc": 1621551411.0,
                            "response": "Every bit of experimentation will have it's lessons. I'm sorry you burned through some money. I think as more people experience it for themselves and do the research, the world will wake up to the marketing scam that crypto truly is. If you want your work to be seen, there are far more practical alternatives like live painting, showing your work at a park, hosting a studio day where you keep your paintings, volunteering art lessons at a community center, etc. Hope this helps!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "h6t028p",
                            "author": "NoPantsMagee",
                            "score": 1,
                            "created_utc": 1627457309.0,
                            "response": "$40 for each thing you uploaded??",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gyxlqqj",
                    "author": "Sobieski526",
                    "score": 1,
                    "created_utc": 1621597738.0,
                    "response": "Thanks for sharing your experience!  \n\nHave you or anyone else here tried creating artwork with RARI token? I am wondering what are the fees on that?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjc7kxx",
                    "author": "robbanderson",
                    "score": 1,
                    "created_utc": 1636063187.0,
                    "response": "NFT's make me cringe these days. Don't care anymore. Good luck y'all!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hkq8iqy",
                            "author": "iambrandonfury",
                            "score": 1,
                            "created_utc": 1636989952.0,
                            "response": "experience was that bad hey? im super new to NFT, bout to try my luck.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hn1nj5o",
                    "author": "PaulineStyrene",
                    "score": 1,
                    "created_utc": 1638519832.0,
                    "response": "are you still doing requests?  My brown tabby called Ellie loves to ride in a bubble back pack -- we call it the space capsule. shes quite the celebrity in it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "holv68f",
                    "author": "Vaches",
                    "score": 1,
                    "created_utc": 1639543516.0,
                    "response": "Thank you so much for sharing this. I’m an artist, and for the last hour I’ve been looking into whether creating NFTs would be a worthwhile way to boost my income. I found a lot of how to create & upload tutorials, but next to none on the selling experience. You’ve saved my ass from doing the same experiment",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hq5hiek",
                            "author": "robbanderson",
                            "score": 2,
                            "created_utc": 1640617131.0,
                            "response": "I'm glad my experience helped inform your direction. Most NFT art looks like and feels like every other NFT art. All of them are an attempt at an income boost, and for the ones that are successful, makes you feel the FOMO and obscures the deep creative drive to be authentic. Keep doing your thing and try to find problems in your community that require artistic solutions, like a mural for a school, album art for a friend, a t shirt design for your favorite local shop. Your immediate surroundings are the best places to invest your creative time, not the beeple dystopia.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hq62gb8",
                                    "author": "Vaches",
                                    "score": 1,
                                    "created_utc": 1640626121.0,
                                    "response": "You’re absolutely right :)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i6cuzsb",
                    "author": "LilliKelso",
                    "score": 1,
                    "created_utc": 1651030027.0,
                    "response": "Just updating that now you can mint your NFTs for free by using other blockchains like Polygon or Solana and many big marketplaces like Opensea are supporting these blockchains. TBH selling NFTs is not an easy task, there is lot of marketing required, new comers can do few things easily like sharing there NFTs on social media, creating a relevant community and listing them on NFT Launchpad's & NFT calendars like [nftrelease.app](https://nftrelease.app)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gm7i93a",
                    "author": "Entire-Ship-7488",
                    "score": -10,
                    "created_utc": 1612592918.0,
                    "response": "I dont understand why anyone would *want* digital art. Im an art major and frankly I avoided taking digital art courses for a while because its not like that shit is hard. The real skill comes in learning to master physical mediums. Digital art is nothing more than an approximate reproduction of the experience which is far less satisfying imo. \n\nIm going into a more technical field now which requires me to do digital art... but again, its just about learning the program. Again... not hard especially for anyone my generation and younger who have spent their whole lives in front of a computer and know how to pick techy things up right quick. \n\nAnd if youre doing real art and then photographing it... its a reproduction. If you bought that shit to hang on your wall, you will have to go to a special printer place to get it done to make it look like a real painting. Theres also other steps to it that typically artists do to give it a little extra. And its still not the original. Youre buying less no matter what. \n\nIdk guys, I love technology but I hate the obsession with trying to make everything real into virtual. We are not “transcending” by making a fake approximation of the real... we are volunteering to never see the truth and beauty in the universe. I mean the way people talk sometimes Its like they WANT the matrix to be real. Its not a better world, not a better life because we wont be in control. \n\nIm not religious or superstitious but there is something to this whole idea of “straying from gods light”. There are things in this life that are a gift given by no man... you can say it was a gift from god, from nature... from something beyond our power... and to let that be stolen from us is seriously going to hurt us.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gm7owpp",
                            "author": "WildRacoons",
                            "score": 2,
                            "created_utc": 1612598792.0,
                            "response": "It’s different, not so much a replacement for physical medium. It allows people to develop different skills, which are appreciated by different people. Much like how film photography didn’t kill oil paintings in the art world. New tech enables people to express themselves and see our world in different ways. If a digital piece touches me in some way, I may want to pay the artist, own it, or consume it in some way only the owner of the NFT can.\n\nMaybe you should think about why you feel so strongly about this.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gm82hsx",
                            "author": "silver_light",
                            "score": 2,
                            "created_utc": 1612612578.0,
                            "response": ">I dont understand why anyone would want digital art\n\nBut you understand why anyone would want digital money?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gm9fj1t",
                            "author": "robbanderson",
                            "score": 1,
                            "created_utc": 1612640016.0,
                            "response": "It's the effort and motivation behind something that's attractive. When it's attractive, it's art.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "grcein1",
                            "author": "willard720",
                            "score": 1,
                            "created_utc": 1616068276.0,
                            "response": "How about you try digital art before you assume how easy it is. Here's the thing: yes, face level, it's easier. But because of that, the standard goes up as does competition, making it much harder.  \n\n\nWith traditional painting, people are much more accepting of mistakes, but with digital art, there are digital artists who spent a decade on this craft to become perfect but they're a dime in a dozen.   \n\n\nIf it's so easy, then how can there be so many digital artists struggling to do it? I used to think it would be super easy but was surprised to find it taking me around two years to gain my normal traditional art skill back.   \n\n\nBut hey, since it's so easy, you should buy one! You'd absolutely would make a killing and could even use it to fund your normal paintings /s",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hlahtal",
                            "author": "messerpadfoott",
                            "score": 1,
                            "created_utc": 1637349254.0,
                            "response": "Also an artist, digital art is definitely an easier medium. I do both, and I do notice something is sort of lost in digital art, even with all the fancy brushes. But it doesn’t mean it’s not valuable, it’s just different. So the NFT thing does indeed make a lot of sense, but it seems a little hard to get into right now. \n\nArt is just philosophy, that’s why people can plaster a banana on a wall and it’s art, and that too is definitely easier than a whole painting. Art doesn’t even have to be attractive or pleasant. \nAlso it means that people don’t approach it from a craftsmanship POV anymore.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}