{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqww0o",
            "title": "Fruitful Debates - The Daily Gwei #482",
            "url": "https://thedailygwei.substack.com/p/fruitful-debates-the-daily-gwei-482",
            "author": "DailyGweiBot",
            "created_utc": 1652710287.0,
            "score": 3,
            "num_comments": 2,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8tlj0o",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1652710526.0,
                    "response": "tldr; Anthony Sassano had a constructive debate with macroeconomic analyst Lyn Alden on Twitter over the weekend. He discussed why constructive debates like this are very rare in the crypto community. Twitter is possibly the worst platform for debate in history. There's no room for nuance, random people join the thread and usually spout \"b******\", he said.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqwnnz",
            "title": "What’s The Point Of Staking For ETH 2.0 Anymore?",
            "url": "https://2030investments.substack.com/p/ethereum-staking-eth2-crypto-rewards/",
            "author": "TheFamousHesham",
            "created_utc": 1652709647.0,
            "score": 0,
            "num_comments": 4,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8tlj48",
                    "author": "coinfeeds-bot",
                    "score": 2,
                    "created_utc": 1652710528.0,
                    "response": "tldr; As a crypto-enthusiast, I decided very early on that I was going to be a HODLer. It made sense, therefore, that I would look for various ways to maximize the returns on my investments. One of my biggest mistakes as a “crypto-newbie” was staking my ETH on Binance for ETH 2.0.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqwoxc",
            "title": "Still Not Your Keys Mentality?",
            "url": "https://www.reddit.com/r/ethereum/comments/uqwoxc/still_not_your_keys_mentality/",
            "author": "MrDopple68",
            "created_utc": 1652709744.0,
            "score": 5,
            "num_comments": 6,
            "subreddit": "ethereum",
            "selftext": "I started with BTC but am now 25% ETH.\n\nI've always transferred my BTC to my Trezor due to all the dodgy exchanges and I rather keep my BTC safe than risk it for a bit of interest.\n\nI've now transferred my ETH to my Trezor, but wondering if I've done the right thing.\nI've heard that staking ETH is more common than for BTC due to the upcoming change to PoS.\n\nDo most here stake or self custody?\n\nAnd a really stupid question but if I keep my ETH on my Trezor will I have any issues when ETH 2.0 happens if I want to transfer some to an exchange to sell?\n\nThanks.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8tk4j2",
                    "author": "TimelessTitor",
                    "score": 5,
                    "created_utc": 1652709898.0,
                    "response": "No you’re good, the only thing that changes about the token is the underlying protocol, you can stake , buy and sell, or just hold your tokens all the same",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tk7tu",
                            "author": "MrDopple68",
                            "score": 2,
                            "created_utc": 1652709940.0,
                            "response": "Thanks.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8vm056",
                            "author": "marilketh",
                            "score": 1,
                            "created_utc": 1652740375.0,
                            "response": "Mixing the term token into a discussion about BTC and ETH can quickly confuse people.  The term staking has also become overloaded.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vlwyy",
                    "author": "marilketh",
                    "score": 1,
                    "created_utc": 1652740334.0,
                    "response": "\\> stake or self custody\n\nThis is not a \"what do other people do\" type of question.  This is a personal choice balancing the risks with your lifestyle.  Right now most staking is not liquid... it is locked away.  \n\nThere are many ways to keep your keys, and I also would not recommend anyone disclose the method they use.  Don't talk about your holdings!!!!",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqwtcv",
            "title": "Differences between stablecoins by collateral",
            "url": "https://www.reddit.com/r/ethereum/comments/uqwtcv/differences_between_stablecoins_by_collateral/",
            "author": "romanmazur",
            "created_utc": 1652710084.0,
            "score": 51,
            "num_comments": 37,
            "subreddit": "ethereum",
            "selftext": "At Wido, we tried to look at the differences between stablecoins as of May 1st, approximately 1 week before UST crashed.\n\nStablecoins achieve price stability through collateralisation. There are different types of collateral (cash or other crypto assets), let’s explore it for a few stablecoins – USDC, UST, DAI, FRAX and LUSD.\n\n# USDC\n\nhttps://preview.redd.it/gnkmj6lpguz81.png?width=1684&format=png&auto=webp&s=135b652023acbfd2ae857786db7a890bc7d98662\n\nIn the chart above, USDC stands out of the crew. As of May 1, 2022, there was 49B USDC issued, fully backed by US dollars.\n\nLet’s zoom in to better see the rest of the picture. We will purposefully keep UST for the end.\n\n&#x200B;\n\n# DAI\n\nhttps://preview.redd.it/lw3syd8wguz81.png?width=1682&format=png&auto=webp&s=bf9fcae6ab654c1c267848dd12ef0d2f654a2045\n\nDAI is an over-collateralized stablecoin, backed by various types of crypto collateral, most notably ETH, WBTC and USDC, as well as real-world assets such as real estate.\n\nAs of May 1, 2022, there was \\~ **8.46 billion** DAI in circulation backed by approximately **$13.14 billion** worth of collateral, most notably $5.96 billion worth of ETH and 4.37 billion USDC, resulting in a collateralization ratio of **155%**.\n\nNotably, as of May 1, 2022, there also was $1.29B worth of MKR (protocol market cap) that serves as a backstop to protect the dollar peg.\n\nSource [makerburn.com](https://makerburn.com/#/rundown), [coingecko.com](https://www.coingecko.com/en/coins/dai), [etherscan.io](https://etherscan.io/token/0x6b175474e89094c44da98b954eedeac495271d0f#tokenInfo), [https://defillama.com/protocol/makerdao/](https://defillama.com/protocol/makerdao/)\n\n# \n\n# FRAX\n\nhttps://preview.redd.it/qav35quzguz81.png?width=1684&format=png&auto=webp&s=7786b153fc5c6e354f1fad2bc470d05df1f6503f\n\nFRAX is an algorithmic stablecoin, partially backed by USDC stable-coin and FXS (Frax Share Token).\n\nAs of May 1, 2022, there was **2.7 billion** FRAX in circulation and the protocol’s collateralization ratio was sitting at **86.75%**, which equals approximately **$2.34 billion** in USDC collateral.\n\nThere also was $1.41B worth of FXS serving as a backstop to protect the dollar peg.\n\nSource: [frax.finance](https://app.frax.finance/), [coingecko.com](https://www.coingecko.com/en/coins/frax), [etherscan.io](https://etherscan.io/token/0x853d955acef822db058eb8505911ed77f175b99e#tokenInfo).\n\n# \n\n# Liquity USD\n\nhttps://preview.redd.it/mlht39p8huz81.png?width=1684&format=png&auto=webp&s=c8ade3a073d278bd4c00d9dc2578891437740efc\n\nLiquity USD is an over-collateralized stablecoin, backed by ETH.\n\nAs of May 1, 2022, there was **479 million** LUSD in circulation, backed by 364 thousand ETH worth approximately **$997 million**, resulting in a collateralization ratio of **208%**.\n\nNote: For Liquity, as per their docs, the LQTY token does not serve as a back-stopping mechanism.\n\nSource: [dune.com](https://dune.com/dani/Liquity), [coingecko.com](https://www.coingecko.com/en/coins/liquity-usd), [etherscan.io](https://etherscan.io/token/0x5f98805A4E8be255a32880FDeC7F6728C6568bA0#tokenInfo).\n\n&#x200B;\n\n# UST\n\nhttps://preview.redd.it/xa1vbzcdhuz81.png?width=1682&format=png&auto=webp&s=ab9ff9c3125824012d822550276d5f69becc1d51\n\nIn the case of UST, as of May 1, 2022, there was 18.56B of UST total issued.\n\nLFG collateral worth $1B consisted mostly of BTC. On top of that, there was $27.15B worth of Luna, which served as the backstop mechanism.\n\nSource: [terra.money](https://www.terra.money/), [coingecko.com](https://www.coingecko.com/en/coins/terra-luna).\n\n&#x200B;\n\n\\--\n\n&#x200B;\n\nDid you find this thread insightful? Add feedback in the comments.\n\nWe are currently running research on how people use stablecoins in DeFi. Support us by answering 7 short questions here: [https://forms.gle/kgbCiQp6a9BNwZXD6](https://forms.gle/kgbCiQp6a9BNwZXD6)\n\nYou can find the interactive chart at: [https://app.joinwido.com/stablecoin-collateralization](https://app.joinwido.com/stablecoin-collateralization)\n\nThis content was also [posted on Twitter](https://twitter.com/joinwido/status/1526199353903394816?s=20&t=SE8u9H6MmdOisOpwlApMsg).",
            "stickied": false,
            "comments": [
                {
                    "id": "i8tp0z3",
                    "author": "Maswasnos",
                    "score": 18,
                    "created_utc": 1652712047.0,
                    "response": "Good thread, thanks for putting this together. \n\nIt's worth noting that in UST's case, the value of the LUNA backing was intrinsically tied to confidence in UST. If UST is doing really well, LUNA also does well. However, when confidence in UST falters, so too does confidence in LUNA and the market cap will plummet as mass selloffs begin. Due to the redemption mechanism where LUNA is minted when UST is burned, this results in a hyperinflationary death spiral. \n\nThere was a nominal $27B market cap for LUNA before the de-peg, but in reality there was only a small fraction of that in real, accessible liquidity. DAI and LUSD are backed by ETH (and other things for DAI) which has much deeper liquidity and a market cap orders of magnitude higher than the circulating supply of DAI or LUSD. Confidence in ETH also isn't related to confidence in LUSD or DAI. \n\nFRAX is a little different and is attempting to create a \"fractional reserve algorithmic stablecoin\" where there is significant \"firm\" USDC backing and then a portion of backing from FXS. It's a much more conservative approach to what UST was trying to do, with much better backing. Approach with caution, but I have more confidence in FRAX's approach than UST's.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tph05",
                            "author": "romanmazur",
                            "score": 4,
                            "created_utc": 1652712235.0,
                            "response": "We tried to keep our opinions aside for this post. Thanks for adding your thoughts 👍",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8txzfv",
                            "author": "wood8",
                            "score": 1,
                            "created_utc": 1652715780.0,
                            "response": "Algorithm stablecoins doesn't make sense. It literally assume you can increase market cap by printing more money.\n\nWhen UST is $0.9, the algorithm will print $100 of LUNA for $90 of UST. They claim this incentivize swap UST into LUNA and drive UST's price up. However, it only work if LUNA's price stay unchanged.\n\nAsk a 5 year old, if you print more money, will the price of the money stay same and market cap goes up or the other way around.\n\nIf they are going to print LUNA whenever UST is less than $1, everyone will just sell LUNA when they see UST price start with zero.\n\nI mean, does anyone really believe when the price of a rock is less than $1000 I'll give you 50 trillion token XYZ which I can endlessly print can keep the price of a rock above $1000?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8u09r6",
                                    "author": "Maswasnos",
                                    "score": 1,
                                    "created_utc": 1652716711.0,
                                    "response": "Exactly. The backing asset *has* to have value of its own or else the stablecoin is worthless. Terra was attempting to do this by cultivating an L1 ecosystem with LUNA, but ultimately UST grew far too big far too quickly and the actual value in the ecosystem was negligible by comparison. The whole system was built on mercenary capital that fled at the first sign of trouble.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8vsf3y",
                                    "author": "Jeffy_Weffy",
                                    "score": 1,
                                    "created_utc": 1652743396.0,
                                    "response": "This doesn't mean algorithmic stablecoins don't make sense. Just, this particular algorithm. The algorithms behind LUSD and DAI seem fine to me, because they are backed by an independent coin (ETH, USDC) that has its own value independent of the stablecoin, and cannot be directly compromised by the stablecoin depegging.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8tunma",
                            "author": "Kombaiyashii",
                            "score": -2,
                            "created_utc": 1652714410.0,
                            "response": ">the value of the LUNA backing was intrinsically tied to confidence in UST. \n\nWasn't it an exploit which drained the UST peg? Sure, there was a bankrun on UST after but had the exploit not drained and broke the UST peg, nothing would happen.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tvjwd",
                                    "author": "Maswasnos",
                                    "score": 3,
                                    "created_utc": 1652714783.0,
                                    "response": "No exploit was involved; the LUNA/UST mechanism worked exactly as it was designed. It was just a flawed design and couldn't handle a depeg event at the same time that LUNA's value was dropping due to a broader bear market.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8tvsxt",
                                            "author": "Kombaiyashii",
                                            "score": 1,
                                            "created_utc": 1652714888.0,
                                            "response": "I heard it was a loan attack which caused the depeg, am I wrong?\n\nEdit-from the lack of response I assume that it was an exploit which caused the depeg, not lack of confidence in the system.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8uji8o",
                                                    "author": "Normal_Cranberry_526",
                                                    "score": 2,
                                                    "created_utc": 1652724351.0,
                                                    "response": "I'd add \"attack\" in quotes since the system handled as expected and this was a known vulnerability for quite some time. Add to that Do Kwon taunting people to try to exploit this and here we are",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8ulcqj",
                                                            "author": "Kombaiyashii",
                                                            "score": -2,
                                                            "created_utc": 1652725089.0,
                                                            "response": "So it was an exploit like I said above, not because of a lack of confidence in UST in a bear market like /u/Maswasnos tried to make out.\n\nIf the exploit was patched, the system would theoretically still be in tact.\n\nI'm not saying there won't be any issues in the future, I'm saying that what happened to luna doesn't disprove the algorithmic stablecoin model.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8ulotv",
                                                                    "author": "Maswasnos",
                                                                    "score": 4,
                                                                    "created_utc": 1652725221.0,
                                                                    "response": "> If the exploit was patched, the system would theoretically still be in tact.\n\nIf by \"patch\" you mean completely redesign the whole protocol to use real collateral instead of LUNA, then sure. There's no other way to look at it- the market lost confidence in UST and LUNA and the protocol death spiraled as a result. It doesn't matter if it was an \"attack\" or just regular market performance.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8umjn6",
                                                                            "author": "Kombaiyashii",
                                                                            "score": -4,
                                                                            "created_utc": 1652725563.0,
                                                                            "response": "It does matter if it's an attack because an attack is intentionally designed to not resemble regular market performance in order to create the hole.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8un7m2",
                                                                                    "author": "Maswasnos",
                                                                                    "score": 3,
                                                                                    "created_utc": 1652725832.0,
                                                                                    "response": "It *doesn't* matter if it's an \"attack\" because *that is regular market performance*. Finance is PVP; if your protocol or business can't withstand significant movements in capital your protocol or business *will fail*. UST was built on a fragile peg mechanism and it was broken by a turbulent market. If it didn't happen last weekend, it would have happened later on because the protocol was inherently unstable and insufficiently backed. \n\nIt's happened with algostables time after time, including to a *different* algostable run by Do Kwon. FRAX is pretty much the sole survivor out of all the \"algorithmic stablecoins\" and that's because it's a hybrid and 89% backed by USDC.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8uo2zw",
                                                                                            "author": "Kombaiyashii",
                                                                                            "score": -2,
                                                                                            "created_utc": 1652726183.0,
                                                                                            "response": ">It doesn't matter if it's an \"attack\" because that is regular market performance\n\nIt does matter because such an attack can be patched for.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i8umpj7",
                                                                    "author": "Normal_Cranberry_526",
                                                                    "score": 3,
                                                                    "created_utc": 1652725629.0,
                                                                    "response": "Like u/Maswasnos said, the \"patch\" would be a redesign. In a sense, this was coming, sooner or later, due to a inherent design flaw. Actually, ALL algo stablecoins have failed in the past, UST was just pumping more money for more time for longer",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8uo7t5",
                                                                            "author": "Kombaiyashii",
                                                                            "score": 1,
                                                                            "created_utc": 1652726237.0,
                                                                            "response": "Patch, redesign, it doesn't matter. Yes. You should design the fucking thing so it can't be exploited obviously lol.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i8wk8qa",
                                                                    "author": "BertTheBurrito",
                                                                    "score": 1,
                                                                    "created_utc": 1652757495.0,
                                                                    "response": "It really wasn’t an exploit. It effectively boils down to someone market sold a large amount of UST spread out over a period of time. \n\nCalling it an attack could be plausible, but it’s more just high level market tactics compounded by a flawed protocol",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ujo0g",
                    "author": "Allaun",
                    "score": 7,
                    "created_utc": 1652724414.0,
                    "response": "I'd like to point out USDC isn't backed 100% by US Dollars.\n\n[In July, it was revealed this was no longer the case, with Circle disclosing in an “attestation” from auditors Grant Thornton that cash made up just over 60% of USD Coin’s reserves. The other 40% was backed by various forms of debt securities and bonds.](https://www.cnbc.com/2021/08/23/crypto-usdc-stablecoin-to-change-reserves-composition.html)\n\n&#x200B;\n\nAn attestation is basically saying, I'm *REASONABLY* sure what they are saying is true.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w53o9",
                    "author": "gozunker",
                    "score": 5,
                    "created_utc": 1652749713.0,
                    "response": "Thanks for doing this. Anyone have insight on Gemini’s coin (GUSD)?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w8xto",
                            "author": "i_wake_up_at_12",
                            "score": 3,
                            "created_utc": 1652751641.0,
                            "response": "“Gemini is…regulated as a limited purpose trust company by the New York State Department of Financial Services.\n\nEach GUSD corresponds to a U.S. dollar held by Gemini in accounts at U.S. FDIC-insured bank accounts and money market funds holding short-term U.S. treasury bonds and maintained at a custodian.”\n\nGUSD is one:one - and essentially, FDIC insured. \n\nLink for source: https://www.gemini.com/dollar",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8w9zgf",
                                    "author": "gozunker",
                                    "score": 1,
                                    "created_utc": 1652752166.0,
                                    "response": "Awesome, thanks for confirming!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8v1k56",
                    "author": "Aiball09",
                    "score": 4,
                    "created_utc": 1652731693.0,
                    "response": "What about..... Tether lol. This is a great post to show the difference between the popular stable coins. At this point most people are looking at Tether for the next monster death spiral if it were to happen again.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v6y10",
                            "author": "Necroking695",
                            "score": 3,
                            "created_utc": 1652733897.0,
                            "response": "If tether death spirals, cryptos gono hit a full on crypto winter",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8tyow1",
                    "author": "hanniabu",
                    "score": 1,
                    "created_utc": 1652716069.0,
                    "response": "BTC Maxis: Maker's marketcap is equal to the bitcoin collateral. Coincidence? I think not...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8uhxqq",
                    "author": "RealUglyKid",
                    "score": 1,
                    "created_utc": 1652723739.0,
                    "response": "Can you please do Djed, never even heard of the frax",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vc264",
                    "author": "_ArtosisCurse_",
                    "score": 1,
                    "created_utc": 1652736008.0,
                    "response": "Damn, quality post",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8watje",
                    "author": "rach2bach",
                    "score": 1,
                    "created_utc": 1652752587.0,
                    "response": "Do tether, do tether! Ope... We can't ..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wc8ny",
                    "author": "nekonekodou",
                    "score": 1,
                    "created_utc": 1652753293.0,
                    "response": "BUSD?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wk15u",
                    "author": "Vonsoo",
                    "score": 1,
                    "created_utc": 1652757378.0,
                    "response": "What about [https://www.stably.io/usds/](https://www.stably.io/usds/) ?\n\nThey claim 1:1 backing by USD.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wnsm3",
                    "author": "drugv2",
                    "score": 1,
                    "created_utc": 1652759545.0,
                    "response": "Thanks for this post. It’ll give good insight to the newbies who don’t know what stablecoin should they hold.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ux9v5",
                    "author": "yndkings",
                    "score": -1,
                    "created_utc": 1652729948.0,
                    "response": "Based on that, I wouldn’t touch any of them. Musical chairs",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}