{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upkvf5",
            "title": "the only way the Ethereum would ever accomplish mainstream status is through this merge. Energy consumption will go down by 99% meaning that Ethereum will finally be able to experience mass mainstream adoption.",
            "url": "https://www.reddit.com/r/ethereum/comments/upkvf5/the_only_way_the_ethereum_would_ever_accomplish/",
            "author": "pihip2",
            "created_utc": 1652545826.0,
            "score": 400,
            "num_comments": 209,
            "subreddit": "ethereum",
            "selftext": "Some people are really underestimating what this merge means exactly. A lot of people know that it will definitely drive consumption WAY lower, but not many realize that this means Ethereum is going one step forward towards attaining mainstream status.\n\nAside from the fact that retail companies are pushing all in for eco-friendliness, these companies can’t operate on Ethereum as long as it's PoW.\n\nOf course, we still need to wait for sharding for Ethereum to actually start showing its real efficiency, but there are already enough scaling solutions to compensate for that in my opinion.\n\nThese scaling solutions and L2s aren’t playing. Polygon alone has already partnered with so many mainstream traditional companies like Ernst & Young, Dolce & Gabbana, Twitter, Instagram and most importantly Stripe which is a BIG step for crypto as a whole considering Stripe is the 6th largest Fintech company in the world and the 5th most used payment app in the US.\n\nAnd the fact that this company is using Ethereum (even if it’s through an EVM chain like Polygon) insights a lot of hope that Ethereum is on the right path toward mainstream adoption.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8lkjgu",
                    "author": "Thin-Course-4054",
                    "score": 252,
                    "created_utc": 1652549792.0,
                    "response": "I honestly don't think energy consumption was/is the barrier against mass mainstream adoption",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lvcxr",
                            "author": "frank__costello",
                            "score": 42,
                            "created_utc": 1652554731.0,
                            "response": "The people who hate crypto & NFTs because of the \"energy consumption\" will just move on to another reason to hate them\n\nIt's just an excuse",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lw85h",
                                    "author": "FaceDeer",
                                    "score": 20,
                                    "created_utc": 1652555132.0,
                                    "response": "Some of them, maybe. Others are genuine. And regardless, the other major PoW cryptocurrencies will continue to draw fire that Ethereum will no longer be receiving.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8mmamb",
                                    "author": "domotheus",
                                    "score": 5,
                                    "created_utc": 1652567252.0,
                                    "response": "The evolution of arguments surrounding crypto is a series of \"but it can theoretically do X in a few years\" on one side and a series of \"Yeah, well,\" ad hoc rebuttals on the other side when it's been a few years and X is here\n\nAnd the inevitable uninformed people who think crypto is no different than it was in 2013 when the only utility was buy low, hold and sell higher",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8nae2k",
                                    "author": "david-song",
                                    "score": 5,
                                    "created_utc": 1652579183.0,
                                    "response": "There will be plenty more excuses once decentralised systems are cheap and available enough. \"My kids bought Xanax through this website we can't block\", \"my partner spent our money on this unregulated gambling network\", \"someone stole all my videos and put them on this unblockable P2P hosting site\", \"this distributed Al Qaeda dapp is crowd-sourcing car bombs\", \"my tween is selling nudes to a paedo site that can't be blocked because it's an HTML doc that someone sent her\", \"our military secrets are up for sale to the highest bidder and nobody knows who is buying or selling them\", \"this dapp is a sophisticated organised criminal network that pays untraceable dividends to its shareholders, we're not even sure if it's the people or the code are the criminals\"\n\nWeb 3 be a long and bumpy road filled with all kinds of ills.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8nlsy7",
                                            "author": "pokemonisok",
                                            "score": 3,
                                            "created_utc": 1652585321.0,
                                            "response": "Oh god that's actually quite scary",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8lnkp3",
                            "author": "Dry-Hurry-7598",
                            "score": 85,
                            "created_utc": 1652551175.0,
                            "response": "Lol it’s more like wtf does eth do for the general public right now. But most off all developement of legitimate projects can’t commence whilst gas fees are this high",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ly8c6",
                                    "author": "Thin-Course-4054",
                                    "score": 19,
                                    "created_utc": 1652556075.0,
                                    "response": "lol kind of a good point. My best answer would be that Eth runs other popular layer 2 networks. If you like transacting with eth you should be using those instead of the L1 chain. I paid almost 200 to move 2k worth of eth yesterday 😅. I had no other option though cause i had to get it bridged off the terra network. RIP.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8m9adi",
                                            "author": "SirRandyMarsh",
                                            "score": 13,
                                            "created_utc": 1652561209.0,
                                            "response": "wtf I remember only paying .10 to send like 2k a few years ago… when did it get this bad?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8mfxw6",
                                                    "author": "epicoliver3",
                                                    "score": 4,
                                                    "created_utc": 1652564278.0,
                                                    "response": "When ppl started using it more but only so many transactions could go through",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8mjh07",
                                                    "author": "917redditor",
                                                    "score": 9,
                                                    "created_utc": 1652565920.0,
                                                    "response": "It's usually way cheaper, like $5-10. Gas prices get crazy during busy market days at peak times. \n\nEdit: currently $2",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8m2rfr",
                                            "author": "Dry-Hurry-7598",
                                            "score": 3,
                                            "created_utc": 1652558208.0,
                                            "response": "Damn Yh I can definitely see some good projects built once’s that happens that actually can be used by everyone cause quite frankly I can’t imagine say my parents paying $1.00 + $35 gas fee for a banana 😂😂 if they used a stablecoin for example",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8mjrzk",
                                                    "author": "917redditor",
                                                    "score": 3,
                                                    "created_utc": 1652566063.0,
                                                    "response": "Nobody's going to be using L1, that's the whole point. You'll use a regular debit card that's tied to an L2 stablecoin, **fees will be lower than VISA.**",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8nelaf",
                                                            "author": "lorenzomofo",
                                                            "score": 3,
                                                            "created_utc": 1652581343.0,
                                                            "response": "But currently different L2's cannot communicate with each other. If company A sells NFTs on Polygon and transaction fees are in MATIC and my wallet is on Loopring which accepts LRC, then I effectively cannot buy those NFTs without jumping through a bunch of hoops. This wasn't a problem before when everything was on L1.\n\nIt's the same situation on the web when eBay requires a Paypal account but I only have an Amazon wallet. But at least there was a common denominator which was Credit Cards that both accept.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8mqy7h",
                                    "author": "meregizzardavowal",
                                    "score": 4,
                                    "created_utc": 1652569425.0,
                                    "response": "I was under the impression that the merge doesn’t purport to reduce gas fees.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8nfdus",
                                            "author": "lorenzomofo",
                                            "score": 3,
                                            "created_utc": 1652581766.0,
                                            "response": "So you mean transaction fees will never fall below Visa/Mastercard fees?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8lsqb4",
                            "author": "Simple_Yam",
                            "score": 9,
                            "created_utc": 1652553523.0,
                            "response": "I would say that $50 fees are the barrier 😂 but I get what OP means.\n\nThe merge will open the doors for many wealthy investors that were either:\n- seeing the merge as very dangerous and wanted to wait on the sidelines until it happens, just to be sure\n- were under peer pressure to not be associated with eco-damaging industries",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lw0u8",
                                    "author": "FaceDeer",
                                    "score": 11,
                                    "created_utc": 1652555039.0,
                                    "response": "Good news, then. [L1 fees are $1.44 as of this writing, and L2 fees are as low as $0.01](https://l2fees.info/).",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8lvkto",
                                    "author": "Thin-Course-4054",
                                    "score": 6,
                                    "created_utc": 1652554833.0,
                                    "response": "Eth 2.0 is still going to have high fees. That's a fact. L2 networks are still the only real solution to have low fees and still be on the Ethereum network.   \n\n\nAlso, I don't think wealthy investors are concerned with being associated with eco-damaging industries lol. \n\nI'm bullish as ever on eth but I don't agree with OP on 2.0 being the catalyst for mainstream adoption.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8msbp5",
                            "author": "Westbrook_Level",
                            "score": 4,
                            "created_utc": 1652570058.0,
                            "response": "I disagree, there are a lot of people concerned about btc energy usage, as they should be.  At least that is the impression I get in real life and on the web outside of the cryptosphere.  I myself am certainly concerned about it.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8n27aa",
                            "author": "never_safe_for_life",
                            "score": 3,
                            "created_utc": 1652574930.0,
                            "response": "New technologies are often attacked for their energy use before it becomes clear what their value is. \n\nThere is no better example than early criticisms of the internet. “A lump of coal is burned every time a book is sold online” proclaimed Forbes:\n\nhttps://reddit.com/r/Bitcoin/comments/ubqdei/in_1999_media_attacked_the_internet_a_lump_of/\n\nThe problem is most people don’t see why cryptocurrencies have any value at all. Many think they are a scam, and one that burns a lot of energy to boot!\n\nI believe this changes when the world sees the benefit of a global, internet native, neutral money that can’t be controlled or corrupted. Most didn’t see the benefit of the internet until applications they used were built on top of it. Same with crypto.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lzi7f",
                    "author": "steevo",
                    "score": 7,
                    "created_utc": 1652556680.0,
                    "response": "When will this happen? Hearing about this since 2 years",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ltn8h",
                    "author": "OrigamiMax",
                    "score": 30,
                    "created_utc": 1652553938.0,
                    "response": "If you think energy consumption is what’s stopping the average person on the street from adopting ethereum, I’ve got a bridge right over here to sell you",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mc6ty",
                            "author": "PrawnTyas",
                            "score": 4,
                            "created_utc": 1652562547.0,
                            "response": "Agreed, people think NFT’s are bad for the environment. Most of those have no idea what Ethereum is.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lc5z8",
                    "author": "homrqt",
                    "score": 46,
                    "created_utc": 1652545998.0,
                    "response": "And the gas fees? That has certainly hindered adoption as well.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8llrxg",
                            "author": "pyr0phelia",
                            "score": 12,
                            "created_utc": 1652550357.0,
                            "response": "POS will do very little, if anything, to reduce the gas fees.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lnb10",
                                    "author": "Dry-Hurry-7598",
                                    "score": 3,
                                    "created_utc": 1652551048.0,
                                    "response": "If it’s taking this long to merge then I wonder how long sharding will take to come",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8lv65t",
                                            "author": "frank__costello",
                                            "score": 6,
                                            "created_utc": 1652554642.0,
                                            "response": "Executable sharding has been removed from the roadmap, replaced by data availability sharding, which will make L2s orders-of-magnitude cheaper",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8lcrn2",
                            "author": "pihip2",
                            "score": 38,
                            "created_utc": 1652546261.0,
                            "response": "I actually addressed that in the post...  \nAs I said, L2s are taking care of that plus sharding is on the way. It's a process",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ln7g4",
                                    "author": "Dry-Hurry-7598",
                                    "score": 3,
                                    "created_utc": 1652551003.0,
                                    "response": "Is on the way is a big understatement like a 7 year understatement",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8nl02z",
                                    "author": "Marc4770",
                                    "score": 3,
                                    "created_utc": 1652584859.0,
                                    "response": "it cost me too much to transfer to L2",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8ld2nq",
                                    "author": "homrqt",
                                    "score": 15,
                                    "created_utc": 1652546400.0,
                                    "response": "Sorry, I meant that the gas fees will have to come down first. The energy efficiencies alone will not allow mass mainstream adoption.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ln4id",
                                            "author": "TenBillionDollHairs",
                                            "score": 6,
                                            "created_utc": 1652550965.0,
                                            "response": "Mainstream won't use L1. Mainstream will use L2, so even if L1 gas fees remain high (which they should because there's a lot of demand), they don't notice because they are only paying for their tiny share of the L1 fees. \n\nL1 will have high fees, but it will be processing exponentially greater volumes of business on those same fees. User fees will decrease, but you want L1 fees to be high so people run nodes and so people can't clog or attack the network.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8lv1mv",
                                            "author": "frank__costello",
                                            "score": 4,
                                            "created_utc": 1652554583.0,
                                            "response": "L1 gas fees will never come down, L2 is the future (and the present) for cheap transactions",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8lk98z",
                                            "author": "DavidKens",
                                            "score": 6,
                                            "created_utc": 1652549662.0,
                                            "response": "Why does L1 gas matter for L2s?\n\nIn a mass adoption scenario CEXes have liquidity on L2s",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8ln9xs",
                                                    "author": "OTK22",
                                                    "score": 5,
                                                    "created_utc": 1652551034.0,
                                                    "response": "We need DEX’s, not CEX’s for mass adoption. Time and time again CEX’s have let their users down during bank runs. This delays mass adoption because it increase fear of system failure for the average person who doesn’t really understand the difference",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8lnl8d",
                                                            "author": "DavidKens",
                                                            "score": 7,
                                                            "created_utc": 1652551181.0,
                                                            "response": "I mean - we obviously need both CEXes and DEXes. \n\nMy point was that the on ramp to L2 does not require L1. The masses will be able to use their fiat to buy L2 tokens directly.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8ldtf4",
                                            "author": "pihip2",
                                            "score": 6,
                                            "created_utc": 1652546726.0,
                                            "response": "Oh okay. yeah, I get you but as I said it's all a process and we're already on the right path. The merge is a necessary part",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8lgkg2",
                            "author": "OtherDetective",
                            "score": 7,
                            "created_utc": 1652547975.0,
                            "response": "They will go down slightly after merge and drop drastically after sharding.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lvgz5",
                                    "author": "frank__costello",
                                    "score": 6,
                                    "created_utc": 1652554785.0,
                                    "response": "> They will go down slightly after merge\n\nThe increase in throughput will be so small, it won't be noticeable\n\nLet's not give people false hope\n\n> and drop drastically after sharding\n\nData sharding will make L2s cheaper, but won't affect L1 fees",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8lon9u",
                            "author": "lostharbor",
                            "score": 3,
                            "created_utc": 1652551652.0,
                            "response": "layer 2 solves that",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ltyjp",
                    "author": "Shaitan87",
                    "score": 16,
                    "created_utc": 1652554084.0,
                    "response": "It will solve some of the loudest fud at least, though I imagine the haters will just move on to a different aspect they don't like.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lu6jm",
                    "author": "esotericunicornz",
                    "score": 3,
                    "created_utc": 1652554184.0,
                    "response": "Low energy consumption does nothing to guarantee mass adoption 🧐",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mtq90",
                    "author": "GeneticsGuy",
                    "score": 3,
                    "created_utc": 1652570721.0,
                    "response": "The main barrier of entry is that you can accidentally lose all of your money easily. The biggest barrier of entry is the fact that  you can have a small clerical error with 1 number off and wire away the funda and have them gone forever.\n\nCrypto's barrier for entry has little to do with energy costs, imo.\n\nI get the point here, but this only solves the 1 social complaint about eco waste of crypto, nothing else. The mainstream not only won't care, they might not even be aware of the nature of mining.\n\nCrypto needs to be as easy as sending money to each other as services like Venmo and Zelle, without fear you might accidentally lose all your money. That's when madd market can happen. If it was that easy, people wouldn't care about the energy costs.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lim3t",
                    "author": "Boxman212",
                    "score": 10,
                    "created_utc": 1652548912.0,
                    "response": "The digital USD does pretty well.  Also I have a layer 2 protection  (if you will) in the form of what they call an American express card.  If I say ANYTHING is fraud they refund me.  Also I have what is called FDIC insurance with my bank and that helps too.  Oh yeah best of all I never have any transaction fees or failed transaction fees.  Also USD is pretty damn stable.  You should check it out.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m0te1",
                    "author": "TrymWS",
                    "score": 5,
                    "created_utc": 1652557294.0,
                    "response": "Energy consumption is not the problem with eco-friendlyness, that’s just a marketing tactic and diversion from the real culprits, the fossil fuel industry burning coal and gas for electricity and heat. Oil for cars, etc.\n\nWe don’t demand fossil fuels, we demand energy and transportation. It can be clean, and we can use orders of magnitude more energy with clean energy.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upml2a",
            "title": "Can what happened to Luna, happen to Ethereum?",
            "url": "https://www.reddit.com/r/ethereum/comments/upml2a/can_what_happened_to_luna_happen_to_ethereum/",
            "author": "slotia92",
            "created_utc": 1652550844.0,
            "score": 8,
            "num_comments": 63,
            "subreddit": "ethereum",
            "selftext": "Ive never owned any Luna and I'm not exactly sure what happened with but on the Luna sub, the attempted suicide posts are rising.\n\nI've always considered UST a scan and have a bit more trust in USDC. Not sure if what happened to Luna was direct effect of something sketchy happening with UST.\n\nWhile I understand that the basic principle of crypto is to only invest what you can afford to lose, it is still horrifying, the thought of an investment being wiped out overnight.\n\nMy question and please ELI5 is, can this happen to Ethereum? And this may be a very complex answer but I'm trying to have a conversation.\n\nTIA.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8lvte4",
                    "author": "frank__costello",
                    "score": 55,
                    "created_utc": 1652554942.0,
                    "response": "No, not possible\n\nLuna was an L1 blockchain with an algo-stablecoin built in\n\nEthereum is a neutral blockchain. People can build algo-stablecoins on top, but it doesn't affect the blockchain itself\n\nAlso, the LUNA token was designed in a way that it would inflate if the price of UST dropped, which is what lead to the crazy hyperinflation that drove the token to $0.\n\nEther is predictably issues, unplanned inflation of ETH is not possible",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lwubn",
                    "author": "Silver-Contribution9",
                    "score": 19,
                    "created_utc": 1652555423.0,
                    "response": "If you mean “can ETH go to zero” the answer is 100% yes, but yea it would be a different root cause",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8m5ee7",
                            "author": "bandoonparade",
                            "score": 7,
                            "created_utc": 1652559417.0,
                            "response": "This is the correct answer. It's highly unlikely, though. Luna is the first CC to complete collapse like this in over a decade of the industry existing, and it was at least somewhat predictable. ETH would have to have a crazy macro event occur for something like that to happen. Like the Merge would have to burn everyone's staked ETH or something else crazy.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lw29l",
                    "author": "Vigilias",
                    "score": 10,
                    "created_utc": 1652555057.0,
                    "response": "Not quite. \n\nHowever this was a well thought out attack by one of the biggest investment firms in existence. \n\nIf they threw their weight at anything they could do some short term damage. Can they take Eth with them like LUNA, probably not.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8md6j8",
                    "author": "road22",
                    "score": 4,
                    "created_utc": 1652563009.0,
                    "response": ">And this may be a very complex answer but I'm trying to have a conversation.\n\nConversation you shall have.\n\n3 Terminators from the future will come to our time and take over the bodies of Gary Gensler, Janet Yellen, and Jerome Powell.   They will have Quantum computing power and use the Ethereum network to control all futuristic weapons against us. \n\nIt is the OP destiny to create the resistance save us all.  The OP, will go to Korea, find Do Kwan playing some Squid Game in effort to save himself.  Do Kwan will do what he does best... crash things.  He will insert some malicious code that will crash the whole Ethereum network.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ltqan",
                    "author": "sefka",
                    "score": 3,
                    "created_utc": 1652553976.0,
                    "response": "I know this was an Ethereum-specific question, but it’s best to assume that any investment has the possibility of blowing up (albeit some with much less or near zero likelihood) and investing accordingly ie diversify.\n\nDiversification: https://www.investopedia.com/investing/importance-diversification/\nRisk of ruin: https://www.investopedia.com/terms/r/risk-of-ruin.asp\n\nAs for Ethereum, well, it’s not a literal checklist of the dictionary definition of “Ponzi scheme” as other coins and projects in the space are and have been, but that still doesn’t mean there isn’t some level of risk and there is not a good enough reason (that I’m aware of) to ever put all your eggs in one basket if you can avoid it.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uplzsw",
            "title": "dapp creator forum?",
            "url": "https://www.reddit.com/r/ethereum/comments/uplzsw/dapp_creator_forum/",
            "author": "Sagan-Man",
            "created_utc": 1652549058.0,
            "score": 3,
            "num_comments": 4,
            "subreddit": "ethereum",
            "selftext": "Hi, I'm a person who makes eth dapps.  \nBut, nobody here cares about or wants my self-promotion.  \n\n\nWanted to see if someone would point me to a community that wants to hear about the things eth dapp creators make. thanks!",
            "stickied": false,
            "comments": [
                {
                    "id": "i8lpakc",
                    "author": "YourBluntFriend",
                    "score": 3,
                    "created_utc": 1652551948.0,
                    "response": "Maybe r/ethdev is what you’re looking for?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uppre5",
            "title": "Vitalik himself said that the goal of Ethereum isn’t million-dollar pictures of monkeys, it’s to accomplish meaningful things in the world.",
            "url": "https://www.reddit.com/r/ethereum/comments/uppre5/vitalik_himself_said_that_the_goal_of_ethereum/",
            "author": "DeliciousNectarine8",
            "created_utc": 1652560336.0,
            "score": 1032,
            "num_comments": 141,
            "subreddit": "ethereum",
            "selftext": "I’m not against NFT art, after all its another integral part of the Ethereum ecosystem. However, I am against the HUGE amounts of resources that are being poured in the NFT market. Resources that will not result in anything of real utility or impact in the real world.\n\nVitalik’s vision is for Ethereum to be the portal which people will use to integrate themselves and their lifestyle into the digital world. His vision is for Ethereum to be able to solve real world problems and eventually, down the line, make decentralization the norm and end the tyranny of centralized authorities over our lives. I know this may sound a bit “poetic” right now but this is the real long term vision.\n\nThis is exactly why I love to see that there are indeed a select few projects that have been following this vision, a lot of which are DAOs which fits great with Vitalik's ideals. There are DAOs out there like BitDAO aiding this vision with more than $500 million ETH in their treasury being allocated toward expanding the DeFi space on Ethereum and improving its adoption rates. Crazy to think that a DAO is the 43rd largest ETH holder meaning that they truly do believe in the long term vision of Ethereum.\n\nHopefully we keep seeing more resources being allocated toward the utilitarian side of Ethereum cause this is the only way to prove that crypto will indeed solve everyday problems and make life all the better. All these billions of dollars combined can be put into much better use. But that's just my (and Vitalik's) personal opinion.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8nhfjm",
                    "author": "FaceDeer",
                    "score": 28,
                    "created_utc": 1652582866.0,
                    "response": "Okay, so there's an application of Ethereum that you're not fond of. That Vitalik is not fond of.\n\nThe fact that neither you nor Vitalik can stop people from using Ethereum for that application is *exactly* what Ethereum was meant to accomplish.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mkxxj",
                    "author": "Simple_Yam",
                    "score": 256,
                    "created_utc": 1652566616.0,
                    "response": "Yeah but one person will not decide how 1 billion people use a permissionless system. \nIf the endgoal of Ethereum is to host expensive monkey pictures, so be it, after all it's the userbase that decides its purpose.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mn61r",
                            "author": "OB1182",
                            "score": 57,
                            "created_utc": 1652567660.0,
                            "response": "This is the most important and interesting part.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8o0dth",
                            "author": "Lightspeedius",
                            "score": 6,
                            "created_utc": 1652594870.0,
                            "response": "No decision is being made.\n\nAnd it's not like there has to be one end goal. There can be endless different Ethereum platforms.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8mzm9p",
                            "author": "wind_dude",
                            "score": 13,
                            "created_utc": 1652573619.0,
                            "response": ">BitDAO\n\nIs it? Or is the monkey trainers? VCs, founders leading people down paths of easy rewards.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8p26wy",
                            "author": "mindoflines",
                            "score": 3,
                            "created_utc": 1652622856.0,
                            "response": ">If the endgoal of Ethereum is to host expensive monkey pictures, ~~so be it, after all it's the userbase that decides its purpose.~~ then Ethereum has no real use in the real world and will fail miserably.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8nslx9",
                            "author": "TeutonicTitan",
                            "score": 6,
                            "created_utc": 1652589418.0,
                            "response": "Based response.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8nuw2b",
                            "author": "morningbreakfast1",
                            "score": 6,
                            "created_utc": 1652590888.0,
                            "response": "Exactly, if million dollar monkeys is what people find useful in eth than so be it.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ofb4j",
                            "author": "DisorientedPanda",
                            "score": 3,
                            "created_utc": 1652607355.0,
                            "response": "Seems like not a lot of people get this. They want a permissions system but then get so wound up by JPEGs",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8nihgp",
                    "author": "Aeon_Nine",
                    "score": 8,
                    "created_utc": 1652583448.0,
                    "response": "It's not like we need his permission. 🤷🏻‍♂️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nvo1o",
                    "author": "g_squidman",
                    "score": 3,
                    "created_utc": 1652591417.0,
                    "response": "I think you can love NFTs and crypto art and all that stuff and still hate BAYC. What BAYC represents is kind of disgusting. All my NFTs are supporting artists I enjoy. It's not about being in an exclusive club that's locked to people who only have a lot of money. It's not a *licheral yacht club.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nr4yw",
                    "author": "xGsGt",
                    "score": 10,
                    "created_utc": 1652588501.0,
                    "response": "Ens are nfts\nMonkeys are not pictures, they are membership to a club\nYou can do software license with nfts.\n\nStop throwing shades to a market you don't know about",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mdseb",
                    "author": "H4y3s_",
                    "score": 30,
                    "created_utc": 1652563294.0,
                    "response": "I think NFT’s with useable applications are going to change the landscape of the world but yeh, an expensive picture of a monkey doesn’t make a whole lot of sense to me.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mf5ps",
                            "author": "DeliciousNectarine8",
                            "score": 19,
                            "created_utc": 1652563921.0,
                            "response": "I mean, NFT technology is actually very exciting. It has some of the most diverse use cases out of all other blockchain tehcnologies.  \n\n\nHowever, its kinda sad how that technology is being used just for hyperinflated JPEGs of monkey and pixels.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nh3ol",
                                    "author": "Stiltzkinn",
                                    "score": 7,
                                    "created_utc": 1652582683.0,
                                    "response": "> However, its kinda sad how that technology is being used just for hyperinflated JPEGs of monkey and pixels.\n\nI agree these avatars NFTs are trash but there are already other uses cases of NFTs in the wild, not wild popular but ENS is one.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8o9ism",
                                            "author": "KingInvalid96",
                                            "score": 3,
                                            "created_utc": 1652602375.0,
                                            "response": "Had the idea to mint NFTs out of color codes. Saw Vitalik shitting on the idea big time a couple months back.. kinda hard to guage the socially acceptable use cases.\n\nPeople shit on NFTs not realizing that websites, bar codes, tickets and social security numbers are just rudimentary NFTs.\n\nMy buddy spent an hour in Home Depot downloading the app just to get a lil military discount. A cryptographically secure military designation seems massively important, ubiquitous and pretty easy to implement",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8nht31",
                                    "author": "Keegan1948",
                                    "score": 4,
                                    "created_utc": 1652583071.0,
                                    "response": "Marl Cuban has some good thoights on this subject. He owns a few BAYC (you can find his wallet on opensea), and he's said in interviews that a lot of the popular NFTs we see today are proof of concept.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8mfdq5",
                                    "author": "H4y3s_",
                                    "score": 13,
                                    "created_utc": 1652564020.0,
                                    "response": "But it’s a start! A year ago hardly anyone outside of the cyptoverse knew what nft meant. It will grow fast and be adapted widely! Exciting time ahead!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8omfmt",
                                            "author": "Gaff_Gafgarion",
                                            "score": 7,
                                            "created_utc": 1652613333.0,
                                            "response": "it also could be that the current hype and bubble about NFT ape pictures and stuff could forever sour people to the NFT technology as a whole once the whole thing crashes down",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8nqjfy",
                            "author": "ShowerWide7800",
                            "score": 3,
                            "created_utc": 1652588130.0,
                            "response": "What is the difference between an NFt and a QR code?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mpe77",
                    "author": "ahungrylilsandwhich",
                    "score": 55,
                    "created_utc": 1652568702.0,
                    "response": "The only thing dumb about nfts is that people can't understand they're more than monkey pictures.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n4rdf",
                            "author": "BestCelery263",
                            "score": 19,
                            "created_utc": 1652576228.0,
                            "response": "They’re currently only used for monkey pictures.  If they have other uses, we haven’t seen the application yet.\n\nNo, counties are not switching their Recorder of Deeds to NFT’s.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nrcrq",
                                    "author": "xGsGt",
                                    "score": 26,
                                    "created_utc": 1652588632.0,
                                    "response": "Ens, software license, memberships, liquidity pool in uniswap, there are tons of great use cases for nfts",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8p359n",
                                            "author": "spicybright",
                                            "score": 11,
                                            "created_utc": 1652623325.0,
                                            "response": "Software and memberships are silly though, outside of the typical crypto-grift schemes.\n\nSoftware licenses are only recognized by the company that produces the software. And they can choose to honor it or give out new ones  to customers that lose it (as happens all the time). That doesn't need to be decentralized.\n\nMemberships have the same issue, unless it's some smart contract based thing.\n\nEverything I've seen so far is Elon Musk style futurism but with more scams.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8nh6si",
                                    "author": "FaceDeer",
                                    "score": 12,
                                    "created_utc": 1652582731.0,
                                    "response": "[Ethereum Name Service names are NFTs](https://docs.ens.domains/dapp-developer-guide/ens-as-nft).",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8niux9",
                    "author": "Keegan1948",
                    "score": 3,
                    "created_utc": 1652583653.0,
                    "response": "This post would be a lot stronger with quotes. It sounds like you're just putting a bunch of words into Vitalik's mouth without citing anything.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nytm9",
                    "author": "LEO_TROLLSTOY",
                    "score": 3,
                    "created_utc": 1652593681.0,
                    "response": "Its like bitching in the early days of cars that they are loud and completely missing the big picture. Just quit complaining and wait it out",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8o4soq",
                    "author": "Shadowys",
                    "score": 3,
                    "created_utc": 1652598380.0,
                    "response": "NFT are usable, its just that theres little people with real world experience working on it. \n\nNFTs can be used for online memberships, for recording purchase history, for customer loyalty programmes, insurance, etc theres a whole sector of fintech that can be used",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8oide9",
                    "author": "The_Avocado_Constant",
                    "score": 3,
                    "created_utc": 1652610011.0,
                    "response": "\"But, but, this isn't what Vitalik wanted!\"\n\nOh noooo! So, anyway...\n\nVitalik made something for anyone and everyone to build on. It doesn't matter one bit if someone makes something that he didn't envision as \"the goal.\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nd2ax",
                    "author": "RangersNation",
                    "score": 12,
                    "created_utc": 1652580538.0,
                    "response": "NFTs do solve real world problems. Their utility doesn’t just stop with digital art.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ob0n5",
                            "author": "saintPirelli",
                            "score": 3,
                            "created_utc": 1652603665.0,
                            "response": "Name one that isn't a problem within the ecosystem itself.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8oxxpt",
                                    "author": "Stiltzkinn",
                                    "score": 4,
                                    "created_utc": 1652620637.0,
                                    "response": "There are already mentioned in other comments, but even Vitalik has his own NFT as vitalik.eth",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8mt8ox",
                    "author": "UnkutThaLyrikal",
                    "score": 4,
                    "created_utc": 1652570489.0,
                    "response": "Life is what happens when you're making plans.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8n29am",
                    "author": "TheMessenger18",
                    "score": 6,
                    "created_utc": 1652574959.0,
                    "response": "Nfts were this cycles icos. Most everyone knew it was a scam but so many bought in anyways thinking they would dump before it all collapsed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8na5q5",
                    "author": "shala0",
                    "score": 4,
                    "created_utc": 1652579063.0,
                    "response": "and the million dollar monkey pics signify exactly that - a meaningful project. look up what Yuga Labs (BAYC) is trying to do. the owners of those pics know this too. the objective is to decentralize all industries by introducing NFTs/blockchain",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}