{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utv717",
            "title": "I'm doing research on the ideals and intent behind crypto, and I'm trying to find info on Ethereum. Can someone point me towards the right direction?",
            "url": "https://www.reddit.com/r/ethereum/comments/utv717/im_doing_research_on_the_ideals_and_intent_behind/",
            "author": "EdensAsmr",
            "created_utc": 1653051793.0,
            "score": 5,
            "num_comments": 15,
            "subreddit": "ethereum",
            "selftext": "Okay. The specific question is, *\"What are the ideals and intent behind cryptocurrency?\",* and right now I'm trying to find information on one of the main currencies I'll be focusing on which is, of course, Bitcoin and Ethereum. I need more info on Ethereum because except for one book I found, there is not much. Could someone please point me to the right place?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9coivt",
                    "author": "domotheus",
                    "score": 3,
                    "created_utc": 1653066562.0,
                    "response": "Vitalik's blog is a good starting point for some of the more social concepts in blockchains - at least according to him, but his vision has had a lot of influence on ETH over the years obviously. Stuff like governance, legitimacy, coordination, etc.\n\nhttps://vitalik.ca/categories/philosophy.html",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bsh0d",
                    "author": "bandoonparade",
                    "score": 5,
                    "created_utc": 1653053675.0,
                    "response": "https://ethereum.org",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9do0xm",
                            "author": "idk-though1",
                            "score": 1,
                            "created_utc": 1653082530.0,
                            "response": "More specific: Ethereum white paper which is found in the link above",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9btvxd",
                    "author": "MinimalGravitas",
                    "score": 2,
                    "created_utc": 1653054289.0,
                    "response": "If you want to understand some of the ideals behind Ethereum you might find it useful to listen to interviews with the people who are building it. Bankless have a podcast series called 'Layer 0' where they interview developers, contributors and even Vitalik's dad. These may help you get inside the heads of the builders a little bit.\n\nThe network itself is neutral, in fact that is one of the core values I guess, alongside decentralization, trustlessness, permissionlessness and the other goals that evolved from the original cypherpunk vision that gave birth to Bitcoin.\n\nFor a book I'd recommend Camilla Rossi's The Infinite Machine. It gives a great overview of the origin story of Ethereum .",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bvlwq",
                            "author": "EdensAsmr",
                            "score": 1,
                            "created_utc": 1653055026.0,
                            "response": "Thank you for your input! (Sounds like a Dev bot now that I wrote that). Actually, the book I mentioned is Camilla Rossi's *The Infinite Machine.* Unfortunately, because I have to site most of the sources I use (I'm doing research for a school essay), I don't think I can use videos. I don't know how to cite from a video in MLA Format, and I don't think it is allowed. Thanks anyway, however!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bwtct",
                                    "author": "MinimalGravitas",
                                    "score": 3,
                                    "created_utc": 1653055537.0,
                                    "response": "Not sure about MLA format (or even what that stands for...) but in Harvard format it would be something like:\n\nHost Surname, Host Initial. (Year Published). Title. [podcast] Episode Title. Available at: http://Website URL [Accessed] Date Accessed.\n\nNot sure if that helps at all.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9colle",
                                    "author": "DAONOWBROWNC0W",
                                    "score": 1,
                                    "created_utc": 1653066592.0,
                                    "response": "If you're not \"allowed\" to use videos (first of all that's BS because there are plenty of primary source videos) then you can instead quote whoever is being interviewed/whatever the primary source is from the video. Eg, if Vitalik's dad made some statement, cite him as the source.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9c1acn",
                    "author": "Hang10Dude",
                    "score": 1,
                    "created_utc": 1653057373.0,
                    "response": "Thanks for doing this. I'm a nobody, but I have been in this space l for a long time. Happy to answer any questions, if you need a bit of qualitative data.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ckk6b",
                    "author": "flossraptor",
                    "score": 1,
                    "created_utc": 1653064992.0,
                    "response": "This might be hard to ascertain until you realize we like using new buzzwords like *permissionless* instead of uncool extra-old words like *liberty*.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ckzrl",
                            "author": "EdensAsmr",
                            "score": 2,
                            "created_utc": 1653065160.0,
                            "response": "??? I'm sorry but I do not understand what you mean.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}