{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v1lll9",
            "title": "Selling crypto to family members",
            "url": "https://www.reddit.com/r/ethereum/comments/v1lll9/selling_crypto_to_family_members/",
            "author": "WayTo1ETH",
            "created_utc": 1653986040.0,
            "score": 1,
            "num_comments": 8,
            "subreddit": "ethereum",
            "selftext": "Can I sell my BTC for fiat at market prices to friends (with split finances) or family members (shared finances)? \n\nAsking from a tax standpoint (living in Australia, but interested in any infos independent of country that could help me find more infos). \n\nAs an example let’s say I bought 1 BTC for 10k AUD couple of years ago and sell it to my wife (shared bank account). Am I allowed to do this. Obviously I would pay CGT tax on it. Now let’s say I sell it to a friend (not shared finances). Am I allowed to do that?\nLastly, the critical scenario. Let’s say bought 1 BTC at the ATH at 80k AUD and sell it to my wife now for 45k AUD. Can I claim a tax loss?\nThanks for any infos on why this is not a thing are welcomed. I assume there is some law prohibiting this.",
            "stickied": false,
            "comments": [
                {
                    "id": "ian4ret",
                    "author": "miika_rantala",
                    "score": 2,
                    "created_utc": 1653987319.0,
                    "response": "you can just sell it and buy it back tomorrow to claim a tax loss. i dont get why would you sell it to your wife",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ian4uhw",
                            "author": "miika_rantala",
                            "score": 2,
                            "created_utc": 1653987400.0,
                            "response": "well laws are also different. im from finland so that might explain.. but if the tax system is similar the first comment should do it",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ian4zxu",
                                    "author": "WayTo1ETH",
                                    "score": 1,
                                    "created_utc": 1653987541.0,
                                    "response": "Nice to know that this is how it works in finland. THanks for the answer!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ian4yst",
                            "author": "WayTo1ETH",
                            "score": 1,
                            "created_utc": 1653987512.0,
                            "response": "In Australia (and I think also in many other countries) this is considered wash sale and illegal. You would have to wait something like 6-12months before repurchasing to avoid wash sale ruling.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ian58le",
                                    "author": "miika_rantala",
                                    "score": 1,
                                    "created_utc": 1653987763.0,
                                    "response": "oh... in finland its 1 day xD",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ian9331",
                                    "author": "KoreanJesusFTW",
                                    "score": 1,
                                    "created_utc": 1653991233.0,
                                    "response": "... and very silly to do given that they will likely be in a public ledger (unless you used Tornado cash or swapping to a privacy coin like Monero but then again that's like shooting yourself on the foot -- very unnecessary). The whole point is to maintain records rather than lose them. Trying to hide for the sake of hiding will most likely land you being a person of interest to other government agencies that's not necessarily just related to crypto. That's when you probably should start reading memoirs of the late John McAffee -- he too should have just paid them taxes although a lot would disagree too so I will leave it at that.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ian8m2u",
                    "author": "KoreanJesusFTW",
                    "score": 1,
                    "created_utc": 1653990824.0,
                    "response": "Reddit is not really the best place to ask this question. You can call the ATO or your tax agent for a more specific advice.\n\nBut yeah... I'll bite.\n\nYou cannot claim capital losses against your personal income tax. If this is your plan which is the reason why you mentioned the example:\n\n> Let’s say bought 1 BTC at the ATH at 80k AUD and sell it to my wife now for 45k AUD. Can I claim a tax loss?\n\n... you are better off to simply pay the taxes due. You will need to possess all the hard records both on the acquisition and disposal of the asset. Note that they can do the due diligence and check the exchange you bought your assets from to cross reference if you are telling the truth in your records.\n\nNote that capital losses can only offset any capital gains (if you have any) and therefore the resulting amount that needs to be taxed.\n\nSomething for my fellow Aussies out there that dabbles in crypto: \"Just pay the taxes\". It's not worth the run-around. Just be glad that regardless which stupid political party wins an election, crypto is never banned here in Australia. As usual, instead of preventing access to it, education and open communication is the key. Aussie investors win - ATO also wins via taxes. You spend the gains here, the prices on the things you spend it on will have GST. So all up... Everyone's happy.\n\nEDIT: Do not forget your 50% reduction on CGT if you held the digital asset for more than 12 months. If you also acquired the asset through mining - spending it for personal use is tax-free. \n\nThese are all from the resources in the ATO website.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}