{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uulcho",
            "title": "So many whales buying up ETH right now. I’m not worried about the future of Ethereum",
            "url": "https://www.reddit.com/r/ethereum/comments/uulcho/so_many_whales_buying_up_eth_right_now_im_not/",
            "author": "DeliciousNectarine8",
            "created_utc": 1653133221.0,
            "score": 27,
            "num_comments": 21,
            "subreddit": "ethereum",
            "selftext": "I’m starting to see some people that are concerned and some even panicking about the current situation.\n\nI know that it’s very normal for people to be frustrated during these time. But still, I think that anyone investing in Ethereum should be far from worried.\n\nI won’t be talking about price action as we’ve all seen how consistent it is already. I’ll be talking more about the fundamentals and support that Ethereum has. Ethereum is probably the most reliable out of all chains and will always get the job done at the end of the day.\n\nThis is why I’m not too surprised seeing so many whales buying up ETH like its a running out. Look at Etherscan and check out the top 50 accounts and how much they’re stacking up. Bitdao alone has been adding more than 360 ETH on a DAILY basis and has already accumulated more than 500 million dollars worth of ETH in its treasury.\n\nYou can’t ignore all these whales and giant projects buying up huge amounts of ETH at a difficult time like this one. This makes me feel a lot more relieved about the future of Ethereum as a whole. The support is still there and its actually stronger than ever",
            "stickied": false,
            "comments": [
                {
                    "id": "i9fw4vy",
                    "author": "No_Thanks_3336",
                    "score": 8,
                    "created_utc": 1653134706.0,
                    "response": "Eth is going to start becoming scarce so this is the time to get you piece of the action.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fzdah",
                            "author": "I-love-pugs",
                            "score": 0,
                            "created_utc": 1653136802.0,
                            "response": "Legit question... How will Ethereum become scarce, or reach the desired 10k when it has an unlimited total maximum? I know there are lots of technical aspects I don't understand, but during the Doge craze that was always the big negative, unlimited supply, and yet it doesn't seem to enter the equation with the value of Ethereum. \n\nThanks.\n\n(In case it matters, I do have a tiny bit of Ethereum, and zero in Doge)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9g04ys",
                                    "author": "No_Thanks_3336",
                                    "score": 3,
                                    "created_utc": 1653137262.0,
                                    "response": "They are beginning to burn in preparation for POS.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9g0bfn",
                                    "author": "CrunchitizeMeCaptn",
                                    "score": 2,
                                    "created_utc": 1653137372.0,
                                    "response": "After the merge and a few updates, itll become deflationary and more ETH will be burned then created. Thr combination of these updates will be equivalent to a \"triple havening\".\n\nSomeone more technical can jump in",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9g1947",
                                            "author": "jcm2606",
                                            "score": 1,
                                            "created_utc": 1653137922.0,
                                            "response": "This, and in the months following the merge, no new ETH will be entering the supply, as all new ETH will be locked on the beacon chain.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9g1d6o",
                                            "author": "I-love-pugs",
                                            "score": 1,
                                            "created_utc": 1653137988.0,
                                            "response": "Thank you.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9g11iw",
                                    "author": "Traberjkt",
                                    "score": 1,
                                    "created_utc": 1653137797.0,
                                    "response": "The London Hard-Fork introduced burning transaction fees (ETH). Once the merge happens and we move from PoW -> PoS the issuance rate should decrease quite a bit which should lead to a deflationary asset. In other words we'll burn more eth in fees than what's being issued to those staking.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9fun8q",
                    "author": "hiyo3D",
                    "score": 10,
                    "created_utc": 1653133675.0,
                    "response": "Am I missing something? If so many whales are buying ETH, why is it still red?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fv7hh",
                            "author": "justswallowhard",
                            "score": 11,
                            "created_utc": 1653134073.0,
                            "response": "Cuz they are not panicking and buying small volumes, this is how u accumulate and DCA. Inflation contribute as well",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fvhfp",
                                    "author": "Either_Sign651",
                                    "score": 5,
                                    "created_utc": 1653134267.0,
                                    "response": "Exactly. They know exactly when to buy unlike us",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9fvbpl",
                            "author": "DeliciousNectarine8",
                            "score": 11,
                            "created_utc": 1653134156.0,
                            "response": "Because the entire market is red. People are panicking and selling left and right and this is the perfect time for whales to buy.  \n\n\nThey're notoriously known for this. That's how whales always make money. They buy cheap and dump on the market at ATH",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9fv8ep",
                    "author": "Ferdo306",
                    "score": -4,
                    "created_utc": 1653134090.0,
                    "response": "Stop shilling BitDAO in every post, thx",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fvlle",
                            "author": "DeliciousNectarine8",
                            "score": 7,
                            "created_utc": 1653134349.0,
                            "response": "I'm not..... It's legit one of the biggest largest daily ETH buyers. Literally the 41st largest ETH holder",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fvvgc",
                                    "author": "Ferdo306",
                                    "score": -2,
                                    "created_utc": 1653134533.0,
                                    "response": "You are, I can see it in your post history\n\nYou throw around a random premise and end up with something like *that's why projects like BitDao which is the biggest DAO are gonna be huge...*",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9fvirt",
                    "author": "CryptoAnarchyst",
                    "score": 0,
                    "created_utc": 1653134292.0,
                    "response": "Until they all dump it on us",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fzytw",
                    "author": "Own_Support_3402",
                    "score": 1,
                    "created_utc": 1653137159.0,
                    "response": "If you mean black rock then yeah 🤣👍🏽",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fxvt4",
                    "author": "Inviction_",
                    "score": 0,
                    "created_utc": 1653135857.0,
                    "response": "Whales can be a very bad thing too though",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fzleq",
                            "author": "TheFillth",
                            "score": 3,
                            "created_utc": 1653136935.0,
                            "response": "Yeah, like when they ate Pinocchio's dad!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uulcg3",
            "title": "What a security designation for ETH looks like.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uul8o3/regulation_two_birds_one_stone_my_dark_maximalism/?utm_source=share&utm_medium=web2x&context=3",
            "author": "Mallardshead",
            "created_utc": 1653133215.0,
            "score": 0,
            "num_comments": 6,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9h3082",
                    "author": "nootropicat",
                    "score": 6,
                    "created_utc": 1653155902.0,
                    "response": "Funny to see desperation creeping in. Indeed, the only way bitcoin can survive is if America bans everything else. While there are tokens that pass the Howey test, eth obviously doesn't, so eth itself has no chance of being banned.\n\nSomewhat ironically, anti-PoW laws are much, much more likely than any country banning ethereum while not banning bitcoin, especially in the EU. If you dream about governments using force to benefit you, you fully deserve to get crushed by the same force.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9harl1",
                            "author": "Mallardshead",
                            "score": -7,
                            "created_utc": 1653159626.0,
                            "response": "Nootropics haven't worked for you. A Luna type event might stir the wisdom out.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hhm7g",
                    "author": "mooremo",
                    "score": 5,
                    "created_utc": 1653162981.0,
                    "response": "How BTC maxis get from \"BTC is money without the need for government\" to \"the government should ban other cryptos\" is a mental leap I'll never understand...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ilu4f",
                            "author": "Perleflamme",
                            "score": 2,
                            "created_utc": 1653184087.0,
                            "response": "It's because the actual people behind BTC were actually behind crypto in general. These people have simply moved on. \n\nThe people you see nowadays on BTC are the ones who weren't for crypto in general but rather for their own gains, bag holders having zero-sum game mindset. I think Vitalik recently called them \"trolls\", notably regarding his talk about contradictions.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}