{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzmep2",
            "title": "Web 3.0 Dapps– The Path to Tomorrow’s Financial World",
            "url": "https://www.blockchainappfactory.com/blog/web-3-0-decentralized-applications-the-path-to-tomorrows-financial-world/?utm_source=Reddit&utm_medium=Post+-+28%2F05%2F2022&utm_campaign=vignesh",
            "author": "CrucialSir",
            "created_utc": 1653741242.0,
            "score": 12,
            "num_comments": 4,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iab4chu",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1653742828.0,
                    "response": "tldr; Web 3.0 DeFi (abbreviation for Decentralized Finance) Dapps are applications hosted by blockchains that allow users to perform financial operations such as lending, borrowing, mortgaging, loaning, and saving. These applications operate based on the concept of decentralization, which makes it impossible for anyone to steal user data.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uzmf89",
            "title": "Intro to an Intellectual Property Revolution: Lawyers, JPGs & Web3",
            "url": "https://readmy.substack.com/p/intro-to-an-intellectual-property?s=w",
            "author": "diditmakesound",
            "created_utc": 1653741294.0,
            "score": 11,
            "num_comments": 14,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iabwuj9",
                    "author": "flossraptor",
                    "score": 3,
                    "created_utc": 1653756897.0,
                    "response": "I read that and came away with zero information about how artists will capture more value than under the existing IP regime.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac667x",
                            "author": "HalFWit",
                            "score": 1,
                            "created_utc": 1653761312.0,
                            "response": "Same here.  The only analogy I can think of Linus Torvalds getting credit for Linux if it was an NFT?  He already does.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iac8im2",
                                    "author": "diditmakesound",
                                    "score": 1,
                                    "created_utc": 1653762447.0,
                                    "response": "I replied above but feel free to ask specific questions. I'm happy to answer. I try to be idealistic in a realistic kinda way.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iac7vzb",
                            "author": "diditmakesound",
                            "score": 1,
                            "created_utc": 1653762141.0,
                            "response": "Actually that could be a separate article. This was focused around the realities of IP in a globalized decentralized / anonymous world.\n\nSo, this sorta value was expected knowledge of the reader but maybe shouldn't have been.\n\nArtists have more ways to capture their value more directly. It'll depend on your medium but an obvious one is secondary sales. I've never seen artists and art houses have a more stable business model than a community of collectors--this used to be exclusive to the 1% and \"the best\" generally pre-determined by art houses (Sotheby's). \n\nEvery artist regardless of medium creates a community of collectors. NFTs will only continue to grow as artists find empowerment through it.\n\nEvery time their art is sold and resold, they earn a % in perpetuity. The revenue is also directly from their art rather than some abstraction like merch. Something you can build on: token-based governance, expansions/airdrops, distributions, etc.\n\nA big discussion is music rights. This is more of a platform discussion. Creating a system that will automatically pay the artist & NFT holders every time its played or commercially downloaded. Likely on an L2.\n\nThe biggest transition is from having many fans you make very little, if anything, from (Web2) to fostering a small community of ride-or-die fans that you grow with. How you grow that is liberated, considering the sales are on a smart contract compared to the limited options you have on, say, Instagram.\n\nYouTubers in-part fight all of this crypto stuff because they are the king of ad revenue. Most other forms of art necessitate a more direct payment & relation with their fans (as seen with Substack, Locals, etc).\n\nI should also mention that disruption != replacement. All of these things will exist and be further tools & options for all sorts of creative people to explore.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iab2aiz",
                    "author": "diditmakesound",
                    "score": 2,
                    "created_utc": 1653741615.0,
                    "response": "Submission statement:\n\nThis article is how Blockchains, anonymity, and the globalizing world necessarily will deal with intellectual property rights, along with how IP actually works in the real world today.\n\nIt describes the world we're moving toward as many are realizing this inevitability in the Web3 space. \n\nWhy IP doesn't work the way you think in practice anyways.\n\nLawyers are trying to force new technology into old institutions but I ask how do you protect IP from an anon in Bangladesh?\n\n>\"If you bag hold a Bored Ape, it makes sense to protect such a thing but the technology doesn’t afford you that.\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iab4c9n",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1653742824.0,
                    "response": "tldr; Artists have never been a more consequential technology to reclaim their value ever before. Artists have the open canvas of both their creative work and predictable technology to play with. What we give up in legal intellectual property protection we gain in real life security: a community of ride-or-die fans and reliable blockchain technology.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadgh25",
                    "author": "Mallardshead",
                    "score": 0,
                    "created_utc": 1653784003.0,
                    "response": "So basically a VC intranet and a worse situation than we currently have. \n\nweb2: you are the product\n\nweb3: you are the exit liquidity",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadl6dw",
                            "author": "diditmakesound",
                            "score": 3,
                            "created_utc": 1653786607.0,
                            "response": "I remember having to defend Ethereum against people like you many years ago.\n\nDo you have any rebuttals or questions about the actual article you're commenting on?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iadm72n",
                            "author": "fbdysurfer",
                            "score": 1,
                            "created_utc": 1653787174.0,
                            "response": "Bombs away BTC.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}