{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyzzj8",
            "title": "Is DeFi a facade? How CoinexSmartChain is changing the narrative",
            "url": "https://medium.com/@stretch0996/is-defi-a-facade-how-coinexsmartchain-is-changing-the-narrative-bad627cddd5f",
            "author": "OptimalBit5",
            "created_utc": 1653663301.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uz00ma",
            "title": "I've made a web and mobile application to easily manage your crypto wallet, including many customized charts and statistics updated real time. It's completely free and open source, check it out!",
            "url": "https://www.reddit.com/r/ethereum/comments/uz00ma/ive_made_a_web_and_mobile_application_to_easily/",
            "author": "Myphhz",
            "created_utc": 1653663388.0,
            "score": 2,
            "num_comments": 2,
            "subreddit": "ethereum",
            "selftext": "Hello! I hope posts like this are allowed, I'm sorry if it's not.\n\nAs the title states, I've been working full-time for about 4 months to make my own version of a crypto managing app since I really needed one, and the ones I've found were really limited or with a subscription fee.\n\nSo I've made mine completely from scratch. It's available as web application and mobile application on the Play Store.\n\nThe application is completely free and 100% open source. It retrieves data every second from Binance and calculates and display data regarding your investments. To use it, you need to create an account and record your transactions, then go to the dashboard page to see all the statistics.\n\nLet me know what you think and what can be improved! I'm open to all kinds of constructive feedback and suggestions. I hope this app can help you as well!\n\nHere are the links:\n\n[https://wwwallet.app](https://wwwallet.app/)\n\n[https://play.google.com/store/apps/details?id=com.wwwallet.app](https://play.google.com/store/apps/details?id=com.wwwallet.app)",
            "stickied": false,
            "comments": [
                {
                    "id": "ia77n52",
                    "author": "Myphhz",
                    "score": 1,
                    "created_utc": 1653663396.0,
                    "response": "If you're interested, here are the GitHub repositories with all the code. You can also host the website locally if you want  \nFrontend: https://github.com/Myphz/wwwallet-fe  \nBackend: https://github.com/Myphz/wwwallet-be  \nThis project was made using VueJS, MongoDB and Express",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uyzu5w",
            "title": "Pool Together Launches NFT Sale to Fund Ongoing Litigation",
            "url": "https://thedefiant.io/pooltogether-lawsuit-nfts/",
            "author": "TaliskyeDram",
            "created_utc": 1653662873.0,
            "score": 12,
            "num_comments": 6,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia7eqn0",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1653666319.0,
                    "response": "tldr; PoolTogether hopes to raise money for ongoing legal expenses through the sale of 'Pooly' NFTs.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahr5zg",
                    "author": "Perleflamme",
                    "score": 1,
                    "created_utc": 1653873570.0,
                    "response": "On top of never running any \"lottery\" themselves, I'm yet to see what legal definition is used to claim it's a lottery in the first place, since no one loses anything anyway. At most, it can be considered a gift of potential future profit, nothing more. \n\nSince when do you need any kind of license to gift anything? *Since when has gifting people become illegal?*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}