{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uy297b",
            "title": "Davos 2022 Plotting against the industry to coopt it with banks and surveillance",
            "url": "https://www.reddit.com/r/ethereum/comments/uy297b/davos_2022_plotting_against_the_industry_to_coopt/",
            "author": "samdane7777",
            "created_utc": 1653550744.0,
            "score": 1,
            "num_comments": 12,
            "subreddit": "ethereum",
            "selftext": "Letting bitcoin maxi's normalize the attack of web3 is by far the greatest failure of liberty and human freedom in crypto's entire history. These Regeanites sold us out to the Nsa. Stone cold. KYCed Web3 will be a human rights/freedom devoid Orwellian hellworld. Nothing but Trudeau bank siezure and political persecution in all 170 countries in the world.\n\nLike legitimately we're safer with cash and traditional community banks and brokers, than permissioned kyced eth layer 3 rollups with backdoor narcware run by Davos and the WEF and JP Morgan, the ODNI etc. It isn't even worth it. It's full China control grid firewall\n\nThere should be seperation of state and money. There should not be any ability of a liberal administrative state to prevent basic finance and commerce and to engage in confiscation for any reason, especially political persecution.\n\n\"well there's always a good reason, bad criminals, and so forth it must be done\"\n\n\"well some political dissidents may be extemist\"\n\nSo what you're saying is that crypto should just be like regular broker accounts where if the procedures of the law dictate it so in courts, you can be banned and precluded from services or have your money seized, you're deferring everything to western courts and procedures, a privilege 80 percent of the human population doesn't even have.\n\nThere is no point in pemissioned Web 3. No Point! This technology exists to nullify and exclude democracy and courts, it is a veto on any interference with voluntary human action in the informal economy, especially undeveloped nations.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia1hqjx",
                    "author": "armaver",
                    "score": 7,
                    "created_utc": 1653552339.0,
                    "response": "Doesn't really make sense to try to blame Bitcoiners for any of this. It was pretty clear that governments will want to tax and regulate crypto currencies, and that includes Bitcoin.\n\nAnd state issued coins have also been an inevitability pretty much from the first hour of Bitcoin. \n\nThere will always be possibilities to use web3 without any permission from governments. Depends on how many people want that and make use of it. They can only try to regulate, they can not control.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1zffc",
                    "author": "kwaker88",
                    "score": 3,
                    "created_utc": 1653566325.0,
                    "response": "Can you elaborate why you're blaming bitcoiners?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia24fvc",
                    "author": "Perleflamme",
                    "score": 1,
                    "created_utc": 1653569133.0,
                    "response": "Web3 is about decentralized interactions and trustlessness. If any kind of regulation can coerce it, then it's not Web3 to begin with. \n\nAttack Web3 all you want. What you'll simply can't be Web3.\n\n>There is no point in pemissioned Web 3. No Point!\n\nIndeed, there is no point in permissioned Web3, because Web3 is permissionless. Anything that is coerced into being permissioned isn't Web3.\n\n>This technology exists to nullify and exclude democracy and courts, it is a veto on any interference with voluntary human action in the informal economy, especially undeveloped nations.\n\nThen, no amount of coercion can distort Web3.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2790c",
                            "author": "Mallardshead",
                            "score": 1,
                            "created_utc": 1653570555.0,
                            "response": "I agree, *Web3* is a VC and CEX marketing phrase, just like DeFi, ultrasound money, Metaverse, 2.0, etcetera. The real versions of those things are coming, but unfortunately for ethereans, they won't be a vaporware/middleware clusterfuck of dapps with fun speculative tokens. Time for the author of this thread to grow up, I agree.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2ayru",
                                    "author": "Perleflamme",
                                    "score": 1,
                                    "created_utc": 1653572308.0,
                                    "response": "That's not what I said. Besides, Web3 necessarily is what you're trying to reject:\n\n>they won't be a vaporware/middleware clusterfuck of dapps with fun speculative tokens.\n\nWhat is making you think anyone can enforce the fact of not having all that? Your misunderstanding of trustlessness and decentralization? \n\nInstead, you'll have lots of scams, lots of tokens, lots of tools, lots of noise. And you'll have tools to sort through the noise and reach the signal. Because there's no way to prevent noise from existing anyway. All you can do is filtering it out, curating it to easily find what you're looking for.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia2e1oh",
                                            "author": "Mallardshead",
                                            "score": 1,
                                            "created_utc": 1653573662.0,
                                            "response": "The SEC can designate them securities. Such a thing would curtail exchange practices and exchanges are inseparable from shitcoins (like Eth). None of these shitcoins were born into a world where exchanges, stablecoins, and altcoins didn't exist. They can't actually survive without it, and were not designed to. Time for you to grow up too.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia28ccw",
                    "author": "BlankEris",
                    "score": 1,
                    "created_utc": 1653571084.0,
                    "response": "Ethereum is already captive and has been since inception. \n\nConsensys owns Infura & Metamask. JP Morgan, UBS, Mastercard own Consensys.\n\n99% of EVM transactions go through Consensys.\n\nDeFi is captured by VCs & banks.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2ekcu",
                            "author": "Mallardshead",
                            "score": 1,
                            "created_utc": 1653573883.0,
                            "response": "# 💯\n\nSuccinct and to the point.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia2fps1",
                            "author": "cosmic-comedy",
                            "score": 1,
                            "created_utc": 1653574379.0,
                            "response": "I know Bitcoin maxis like yourself wish that's true, but that has nothing to do with the blockchain itself. Light clients are available for people to run on their own, and other open source wallets are available.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia1g7b1",
                    "author": "samdane7777",
                    "score": -1,
                    "created_utc": 1653550983.0,
                    "response": "Imagine if the bitcoin maxis werent maxis and did not drag the industry down like this and had helped push a much more antigovernment version of web 3....but alas here we are...taking money from venture capital was always a deal with the devil, the future payment being your liberty, and the liberty of billions under terrible governments. We're building tools for authoritarians to track and persecute people with, instead of doing what groups like monero do.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia25txv",
                            "author": "Mallardshead",
                            "score": 1,
                            "created_utc": 1653569855.0,
                            "response": "Stop shitcoining and promoting VC marketing phrases.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}