{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utlknu",
            "title": "Buying Ethereum",
            "url": "https://www.reddit.com/r/ethereum/comments/utlknu/buying_ethereum/",
            "author": "sailing_to_the_stars",
            "created_utc": 1653021873.0,
            "score": 5,
            "num_comments": 16,
            "subreddit": "ethereum",
            "selftext": "I understand Bitcoin is the safest crypto, however, do you think I should keep my money in ETH? I've 65% ETH and 35% Bitcoin.If not, why? Posted this to Bitcoin sub too. Can you help me understand the risk associated with investing in Ethereum? Worst case scenario?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9aihbh",
                    "author": "ChemicalSalamander52",
                    "score": 13,
                    "created_utc": 1653022186.0,
                    "response": "Do you believe in the ethereum blockchain? If yes, then invest. If you don’t know what the ethereum blockchain is or what ETH does within the blockchain, then you should research it a bit until you understand what it is. Investing without researching is like masturbation, it feels good for a short time and you’re just fucking yourself.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ait2c",
                            "author": "sailing_to_the_stars",
                            "score": -1,
                            "created_utc": 1653022403.0,
                            "response": "Well, good answer. I definitely have Ethereum. In fact I own 65% ETH and 35% Bitcoin. But was wondering if I should increase my Bitcoin stash or invest in both of them equally.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9aoijq",
                                    "author": "ChemicalSalamander52",
                                    "score": 2,
                                    "created_utc": 1653026469.0,
                                    "response": "Personal choice. I know lots of people that keep 25-50% of their portfolio in BTC, the rest spread among alts including ETH. i am of the 50% BTC mindset, but to each their own.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9aqr00",
                    "author": "cosmic-comedy",
                    "score": 2,
                    "created_utc": 1653028175.0,
                    "response": "Did you get banned from /r/bitcoin for asking that question?\n\nIt's probably better that you go to /r/ethfinance for more substantial reasons why people would invest in Ethereum. This subreddit is full of trolls and maxis",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9aqui9",
                            "author": "sailing_to_the_stars",
                            "score": 2,
                            "created_utc": 1653028254.0,
                            "response": "Thank you. I don't care if I get banned from Bitcoin subreddit.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9at6jf",
                                    "author": "_JohnWisdom",
                                    "score": 1,
                                    "created_utc": 1653030137.0,
                                    "response": "We don’t do that on reddit. We rage and flame wherever we go and complain like whining bitches if we get banned",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9atco7",
                    "author": "shaggy_shiba",
                    "score": 1,
                    "created_utc": 1653030278.0,
                    "response": "Ethereum is riskier than Bitcoin because its implementing changes constantly. These changes are in search of solving as many use cases as possible, which will bring in more business, and value. Bitcoin is all about protecting the sanctity, and sheltering it from influences, leaving it untainted and safe.\n\nEthereum is aiming to be the AWS of crypto finance and decentralized internet. Bitcoin is aiming to be the most solid and hard currency ever to exist, *literally ever.*\n\nIn my opinion. Bitcoin is the 401k, Ethereum is the tech stocks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ait3i",
                    "author": "achimachim",
                    "score": -3,
                    "created_utc": 1653022403.0,
                    "response": "If u dont know, then stay with bitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9anuqq",
                            "author": "thenarcostate",
                            "score": 5,
                            "created_utc": 1653025972.0,
                            "response": "This is terrible advice. OP clearly states he already has ETH",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ap2l8",
                                    "author": "achimachim",
                                    "score": 2,
                                    "created_utc": 1653026880.0,
                                    "response": "Ok your right .. didnt read it completely. .. well btc is a question of beliefe100% , .. the believe and hope that someone else will pay for your btc more than you payed for it. .. thats about it. .. eth network, where eth coin is only a part of the functionality, is an instrinsic value, meaning you can do something with it. This decentraziled distributed ledger network provides trust for mulit parties in multi purposes. Cbdc, sytheic shares, token, transactions, and of course pay. .. giben that most big problems in our present world lead back to centralized entities, taken abusive advantage of their superiour power, and smaller entities seeking for a fair escape or option to that dominance, the field of usge for an establishes powerful neutral entitiy/network is indeed gigantic. That is what the world needs right now more than ever before. now: why eth snd not solana etc? .. well, decentralized network are not only a question of technical challenges. Its also a question of growing trust of a community which supports this network. .. and this comes only along by time and dignity if the commiting devs, coin holders, investors etc.. and this comes only by time.. and eth simpy is the one oldest which grew mature to reliable stage. .. the upcoming merge is the one major milestone to become the most powerful network.. proofing eth is logic, is reasonable, reliable and taking responsibilites to its vision and expectations..",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ap35k",
                                            "author": "Paid-Not-Payed-Bot",
                                            "score": 1,
                                            "created_utc": 1653026893.0,
                                            "response": "> than you *paid* for it.\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ajp2o",
                    "author": "bumper212121",
                    "score": -2,
                    "created_utc": 1653023006.0,
                    "response": "Worst case scenario they epically crash at some point and your money is gone.\n\nI hope this 35%/65% is still only a small part of your overall investment portfolio",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9amhui",
                            "author": "sailing_to_the_stars",
                            "score": 3,
                            "created_utc": 1653024975.0,
                            "response": "Yes. Sure.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ar7l7",
                    "author": "EnderWiII",
                    "score": 0,
                    "created_utc": 1653028540.0,
                    "response": "Bitcoin is the safest, for now. More and more people are switching to eth. It's why Bitcoin dipped so much harder than eth",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}