{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urrbfr",
            "title": "Introducing Polygon Nightfall Mainnet: Decentralized Private Transactions for Enterprise",
            "url": "https://blog.polygon.technology/introducing-polygon-nightfall-mainnet-decentralized-private-transactions-for-enterprise/",
            "author": "Gotigers811",
            "created_utc": 1652807738.0,
            "score": 23,
            "num_comments": 15,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8yvo2y",
                    "author": "Gotigers811",
                    "score": 5,
                    "created_utc": 1652807752.0,
                    "response": "What really interests me is that this is a partnership with EY, who is massive in the accounting world.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zzihx",
                    "author": "--Slipp3ry__Snak3--",
                    "score": 5,
                    "created_utc": 1652824182.0,
                    "response": "The zk/roll ups offers from polygon are extremely complex.  They literally have 4 different teams working on very overlapping products.  Just make a eth roll up that is fully EVM compatible using zkproofs and you 100% win.  Be arbitrum but with zk proofs and you win.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90cyej",
                            "author": "Crypto_Economist42",
                            "score": 3,
                            "created_utc": 1652830404.0,
                            "response": "They won't do it because they want to pump their own MATIC Token\n\nEth holders have no benefit from price appreciation of MATIC. No benefit from polygon chain being used\n\nNot sure why it's continually pumped here",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90ifs2",
                                    "author": "--Slipp3ry__Snak3--",
                                    "score": 1,
                                    "created_utc": 1652833070.0,
                                    "response": "A true layer 2 like abritrum or optiminism but using ZKProofs as it rolls up to big daddy ETH would be the winner, and who I'm waiting to invest in.  This way eth can scale both vertical (shards) and horizontal (Roll-ups).  I hear zksync and starkware are working on this, but I really do not trust the zksync team, just heard too many rumors.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90nuoa",
                                            "author": "nishinoran",
                                            "score": 5,
                                            "created_utc": 1652835608.0,
                                            "response": "The ideal wouldn't have a token to invest in, only ETH.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9193xj",
                                            "author": "glibbertarian",
                                            "score": 3,
                                            "created_utc": 1652846146.0,
                                            "response": "Seems like you have your horizontal and vertical confused.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i931z6k",
                                            "author": "Either-Advantage",
                                            "score": 0,
                                            "created_utc": 1652888094.0,
                                            "response": "Why aren't Nightfall and Polygon Hermez as an example a \"true L2\". Genuinely curious here as I personally trust the Polygon team way more than I'd ever trust the zksync team. Too many rumors is right.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i91n06h",
                                    "author": "AESTHTK",
                                    "score": 1,
                                    "created_utc": 1652855796.0,
                                    "response": "This comment is rubbish. They are already doing it.\n\nSee the announcement above 🙃\n\n(Polygon Hermez is their zkEVM version of Arbitrum)\n\nLayer 2 value accrues directly to layer 1. Interestingly Sandeep has mentioned they regret using Matic rather than ETH as the native token, so I don’t excpect them to repeat this on Layer 2 - it will be ETH.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i91thb9",
                                    "author": "jcm2606",
                                    "score": 1,
                                    "created_utc": 1652861469.0,
                                    "response": "Polygon Nightfall (or any of their other rollup projects, like Miden, Zero & Hermez) is not the same thing as Polygon PoS/Matic. PoS/Matic is a side chain that is completely separate to the Ethereum network, whereas Nightfall is a ZK rollup that settles its transactions on the Ethereum network.\n\nThis settlement requires Nightfall to pay for gas, which means that it directly benefits Ethereum users and ETH holders, as ETH *has* to be used to pay for that gas, ever since EIP1559 was introduced. Nightfall may allow users to pay for in-rollup fees using MATIC or some other token (though this is unlikely for the reason that AESTHTK outlined), but it'll have to convert back to ETH regardless.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i90q8u8",
                                    "author": "LinusThiccTips",
                                    "score": 0,
                                    "created_utc": 1652836739.0,
                                    "response": "Loopring lets you use any token to pay for gas, which is then burned. Most people using it pay for gas for LRC, it reduces supply and it good tokenomics. Why wouldn’t Polygon do the same? They can even enforce MATIC as the only gas currency if they want to.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zc5qg",
                    "author": "Wolfos9",
                    "score": 3,
                    "created_utc": 1652814426.0,
                    "response": "This is pretty damn cool.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i910hav",
                    "author": "user260421",
                    "score": 2,
                    "created_utc": 1652841592.0,
                    "response": "Polygon is so underrated! I think this is the future.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}