{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvymlu",
            "title": "StarkNet Roundup #17",
            "url": "https://swagtimus.substack.com/p/starknet-roundup-17?s=w",
            "author": "starknet_intern",
            "created_utc": 1653307419.0,
            "score": 1,
            "num_comments": 6,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9o9w5c",
                    "author": "starknet_intern",
                    "score": 1,
                    "created_utc": 1653307442.0,
                    "response": "Highlights:\n\n- Argent X for Firefox is live!\n\n- StarkNet fees are upon us! StarkNet Alpha was launched on Mainnet without a transaction fee. In version 0.8.0, fees are included but not enforced. Starting with version 0.9.0, fees will be enforced. 0.9.0 is getting ready to be shipped.\n\n- lots of twitter spaces & workshops of StarkNet projects.\n\n- StarkNet games are making waves with updates & performance tests - The Ninth, Eykar, Realms, MatchboxDAO.\n\n- Record number of StarkNet builders - over 30k starknet.js downloads and a new weekly record in downloads.\n\n- Miami Hackathon winners announced - PLAY 2 HELP: GameFi infra on StarkNet to help developers tokenize games. Also, congrats to @espejelomar and @haycarlitos for winning a StarkNet ecosystem prize with NumCairo. NumCairo is a library for numeric operations on arrays in Cairo, a foundation for Machine Learning.\n\n- UI improvements on ZigZag.\n\n- a small NFT collection on Ethereum decided to build their game(s) on StarkNet.\n\n- Are you a Cairo dev? There's a wishlist for Cairo features that you should probably take a look at and add to!\n\n- and lots more as usual!\n\nMake sure to check out the full post linked above. Thanks for reading, and I'll see you guys again next week!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ol2y3",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1653313540.0,
                    "response": "tldr; StarkNet Alpha was launched on Mainnet without a transaction fee. A new version of StarkNet Wallet is now available on both Chrome and Firefox stores. StarkNet.py v0.2.3 has been released. The StarkNet Launchpad held their weekly community call where they talked about the upcoming testnet.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}