{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvogco",
            "title": "Riddle me this, please",
            "url": "https://www.reddit.com/r/ethereum/comments/uvogco/riddle_me_this_please/",
            "author": "protagonist85",
            "created_utc": 1653267045.0,
            "score": 8,
            "num_comments": 40,
            "subreddit": "ethereum",
            "selftext": "Can someone explain why ethereum hashing power is at the all time high right now, DESPITE the merge announced in less than 3 months?\n\nIn POW >POS transition there is no use for all that hashing power. I find it puzzling. Thoughts?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9nb1tn",
                    "author": "Due_Opinion6626",
                    "score": 7,
                    "created_utc": 1653279671.0,
                    "response": "We also have full LHR unlocks now, so everyone's 3000 series GPU's are running full hash rate now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mnk2v",
                    "author": "techie_003",
                    "score": 10,
                    "created_utc": 1653267153.0,
                    "response": "I imagine everyone is mining what they can before POS merge\n\nEdit: I can also see alot of miners switching to ETC in days/weeks to come which requires nothing more then a currency & mining pool address change.. very little effort required and avoiding new OC/strap testing etc.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mrpcc",
                            "author": "mooremo",
                            "score": 14,
                            "created_utc": 1653269264.0,
                            "response": "ETC profitability would tank if they all switch. The network difficulty would surge, but the price likely won't. There's no demand for ETC. Some might switch, but I'd imagine most will exit mining.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9n2lua",
                                    "author": "caploves1019",
                                    "score": 2,
                                    "created_utc": 1653274819.0,
                                    "response": "Asics will have to move to etc or be scrapped...\n\nGPUs can move to etc, flux, or ergo. A very large contingent of GPU miners in the forums and various groups have stated ergo is their plan. \n\nMinersgonnamine.. not just exit. Lol.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ng84a",
                                            "author": "mooremo",
                                            "score": 2,
                                            "created_utc": 1653283146.0,
                                            "response": "I don't disagree. I'm just saying that mining ETC is not likely.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9na4j2",
                                    "author": "shaggy_shiba",
                                    "score": 1,
                                    "created_utc": 1653279092.0,
                                    "response": "This, but I think the price will get pushed down. The sell pressure from the miners will choke the chain to death.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ng5i8",
                                            "author": "mooremo",
                                            "score": 3,
                                            "created_utc": 1653283095.0,
                                            "response": "The chain is already dead.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ng6qj",
                                                    "author": "shaggy_shiba",
                                                    "score": -1,
                                                    "created_utc": 1653283118.0,
                                                    "response": "All the more reason. Short ETC.\n\nEven if the merge fails for whatever reason, and people flock eth, it'll go to cardano or some other l1",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9nvhkw",
                                                            "author": "frank__costello",
                                                            "score": 3,
                                                            "created_utc": 1653295978.0,
                                                            "response": "> it'll go to cardano\n\nLol people might flock to Solana or Avalanche or something, but nobody is \"flocking\" to Cardano",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9nwzmk",
                                                                    "author": "shaggy_shiba",
                                                                    "score": -1,
                                                                    "created_utc": 1653297364.0,
                                                                    "response": "yea probs. idk I dont really care haha",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9nln36",
                    "author": "Savage_X",
                    "score": 3,
                    "created_utc": 1653287214.0,
                    "response": "Not that complicated. https://www.whattomine.com/coins",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ntxwj",
                    "author": "LM-312",
                    "score": 3,
                    "created_utc": 1653294515.0,
                    "response": "Probably because LHR GPU have been \"defeated\": https://youtu.be/LgAr4Erm_4o",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9nvds2",
                            "author": "coinauditpro",
                            "score": 2,
                            "created_utc": 1653295878.0,
                            "response": "That is the reason, a lot of cards were LHR, and some of those cards were mining dual, or straight up mining other coins, so once ETH went 100% unlock it got way more profitable for those of us.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9mqoot",
                    "author": "DeliberateDonkey",
                    "score": 6,
                    "created_utc": 1653268753.0,
                    "response": "ETH is still the most profitable coin to mine, so I expect people will mine it right up until the end. Smart ones might get out early to try and sell their equipment while its value is still holding up, but I think the meme that PoW has been endlessly delayed will keep folks in the pool until the bitter end.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9oihat",
                    "author": "AdvocatusDiabo",
                    "score": 2,
                    "created_utc": 1653312243.0,
                    "response": "Easy, think at the margin. If you have GPUs, nothing today is better than mining Etheruem, so no reason to quite until after the merge. Thus, hash won't go down. Why would it go up? New GPUs, maybe from gamers that make extra while not gaming, or power users that have ultra-cheap electricity and think they can still profit by mining up to the merge and selling after.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mqcsc",
                    "author": "themanndalore",
                    "score": 5,
                    "created_utc": 1653268584.0,
                    "response": "Ethereum mining is done by mostly general purpose GPU's afaik.  If the block rewards are high, they'll mine it at max power until the day it switches.  Once it switches, they'll mine the next most profitable coin or sell their GPU's if the juice ain't worth the squeeze",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9muagk",
                            "author": "Perleflamme",
                            "score": 2,
                            "created_utc": 1653270538.0,
                            "response": "I'd probably sell a few days before the end, so as to find a buyer just before the market gets flooded and GPU prices tank. This probably means we'd see a curve of more and more GPU sellers before the final day and a price tanking within a few days (maybe more?) instead of within just one day.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ogr6z",
                                    "author": "Agentfish36",
                                    "score": 3,
                                    "created_utc": 1653311361.0,
                                    "response": "I think that's going to be well before \"the end\". My guess would be once they successfully fork the last testnet, they'll announce a merge date. You might have about a week after. Especially given mining profitability is only a few $$ per day.  It won't take a lot of volume to drastically shift prices down. So you'll have to bet that it's worth a huge decline in card value to mine $50 in eth.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9oyrax",
                                            "author": "HeatSeekingPanther",
                                            "score": 1,
                                            "created_utc": 1653319699.0,
                                            "response": "If hash rate really cliffs the threat of attack increases. For Eth's sake I hope these miners stay on to the last millisecond.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9pucjn",
                                                    "author": "Agentfish36",
                                                    "score": 2,
                                                    "created_utc": 1653333050.0,
                                                    "response": "Asics will be on until the last second I'm sure. I'm not sure what the math is on \"enough\" hash lower but I'd wager there's more hash in Asics on eth than total hash on a lot of other networks in total.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9mtzuv",
                    "author": "Perleflamme",
                    "score": 0,
                    "created_utc": 1653270388.0,
                    "response": "My thoughts: miners are becoming aware that it's finally the end. As such, they're also knowing their hardware won't have much value. So, they're overclocking it in a attempt to be more competitive against other miners.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9n8moz",
                            "author": "salanki",
                            "score": 4,
                            "created_utc": 1653278176.0,
                            "response": "No",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9n92qq",
                                    "author": "Perleflamme",
                                    "score": 3,
                                    "created_utc": 1653278447.0,
                                    "response": "Lol.\n\nYes, they are my thoughts, I can assure you. \n\nThe fact it's not your thoughts is completely expected.\n\nThough, did you have anything to bring to the discussion besides of the irrelevant fact you're expressing your pure negation? Because really, right now, you're not providing anything useful.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9n9s97",
                                            "author": "salanki",
                                            "score": 4,
                                            "created_utc": 1653278881.0,
                                            "response": "Overclocking doesn’t hurt the GPU (shorten the lifespan). Overclock too much will hurt stability, which means less revenue since your rigs will be crashing constantly. People will always run the clocks that give them the most hashrate while being stable.\n\nWhat you can do is add a bit of extra power, that might yield you some extra hash but use a lot more power. Given current power prices, and the fact that rigs and power distribution isn’t built with headroom to boost power usage by 30% per GPU, this is not likely either.\n\nThe explanation is simply that people have been buying GPUs and will be up to the very last moment, betting that PoS will keep getting delayed.\n\nSource: GPU Mined for 6 years. Operating 45,000 GPUs:",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9nabma",
                                                    "author": "Perleflamme",
                                                    "score": 2,
                                                    "created_utc": 1653279217.0,
                                                    "response": "Ok, thanks, didn't know that. \n\nYou provided much more interesting stuff. Thank you for participating.\n\nSo, rather than overclocking, it's about providing extra power for extra hashes.\n\n>Given current power prices\n\nWhat power prices? US power prices? China power prices? They're not the same. Retail power prices? Bargain power prices? They're not the same either.\n\nYour experience in one part of the world is vastly different from other parts of the world. Mining is a worldwide activity, not a local one.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9nb0c4",
                                                            "author": "salanki",
                                                            "score": 1,
                                                            "created_utc": 1653279647.0,
                                                            "response": "Energy prices all over the world are soaring right now, it’s fairly universal this moment actually. I guess probably still cheap in Russia since they now have surplus of gas due to restrictions.\n\nThe fact that mining rigs aren’t built with headroom is still going to be the part disqualifying that theory. When you are building 1,000 machines, you are not going to want to spend $100 or $50 extra for a beefier power supply, and larger transformers in your building etc just for the potential opportunity to push it harder if you want to. If people were pushing it, they would have started doing it last summer when profitability was through the roof, so you should have seen it increase then and staid steady.\n\nEven though on paper increasing your power cost by 50% to make 10%-15% extra revenue would have been profitable for many miners (including myself) we didn’t even consider spending the CapEx to rebuild everything to push more power. It’s a big project and if  price would have dropped we’d never make that money back.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9ndoyo",
                                                                    "author": "Perleflamme",
                                                                    "score": 0,
                                                                    "created_utc": 1653281403.0,
                                                                    "response": ">Energy prices all over the world are soaring right now, it’s fairly universal this moment actually.\n\nWe were talking about prices, not about increases in prices. What does it have to do with the topic, exactly? Prices increasing everywhere don't change anything to the ecosystem. Prices are still vastly different at different places of the world. \n\n>If people were pushing it, they would have started doing it last summer when profitability was through the roof, so you should have seen it increase then and staid steady.\n\nInvestors make decisions based on what they have at hand. They didn't know what would happen back then, you're relevantly saying it yourself. To have the surge in mining difficulty we're seeing now, it would need to be many more GPUs entering the market than what we generally see, even more so if electricity prices are even higher now than before. To me, there's something more than just people piling up GPUs. \n\nBut I think we're forgetting one aspect of the problem: the difficulty bomb. People know about it. They know it's different from beforehand because of it. And it will impact the mining difficulty more and more over time. Maybe there's something about that too, if at least psychological regarding miners themselves. \n\nBut again, that's only my thoughts. Feel free to add more if you find anything relevant.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9qt5vq",
                            "author": "tpark",
                            "score": 1,
                            "created_utc": 1653348834.0,
                            "response": "I think most GPU miners set things for best efficiency and stability.  A 3090 can generate about 125 megahash/second at say, 320 watts, but you can get 120 megahash for around 280 watts, so that might make more sense.  The full unlock made a big difference for LHR cards, but I think most miners had only a few of those.  As an example, a 3080 ti with the old, 71% unlock would get around 85 megahash/second, but with the 100 percent unlock it's about 118 megahash.  This helped a bit, but the majority of my cards are not LHR.\n\nI think that once the merge happens, used hardware prices will plunge.  I suspect profitability will plunge on other coins, since the mining power currently active will migrate to other platforms.\n\nI'm glad we had the extensions from the previous difficulty bombs.  There was always the expectation that Ethereum would always go proof of stake, but the delays have made it possible to mine far past the point where the initial capital investment has paid for itself. \n\nI have a locked rate of 7.54 cents/kWh, but after the fees and such it works out to around 15.00 cents/kWh (that's Canadian dollar BTW)  If that gets me about 0.42 Eth per month, so at the current price 2512.87 that gives me   1055.41 dollars.  Power is 558.00 or so, so that gives 497.41 after power.   When power costs come close to income, I think the GPU miners will drop off, then a while later the ASIC miners will drop off.  Maybe there will be a perfect storm of cheap hardware from miners, followed by the release of 4000 series GPUs so some lightly used (read: beaten like a rented mule) cards will be available at a reasonable price.  Once mining becomes unprofitable, I'll switch to something that is, or stop mining if nothing is available.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9myx81",
                    "author": "NinjAsylum",
                    "score": -5,
                    "created_utc": 1653272899.0,
                    "response": "Because the merge hasnt happened yet and most likely WONT happen for several more months (Dont believe their bullshit lies about being close.  We've heard that 25 times before).\n\nDo you think people are going to stop mining before it actually ends?  What kind of dumbass moron would do that?  You mine until the shit gets turned off.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9nl9wn",
                            "author": "domotheus",
                            "score": 4,
                            "created_utc": 1653286922.0,
                            "response": "several more months *is* close",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9mv1wu",
                    "author": "daxtaslapp",
                    "score": -1,
                    "created_utc": 1653270919.0,
                    "response": "In 3 months they said lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nr382",
                    "author": "ajnsd619",
                    "score": 1,
                    "created_utc": 1653291837.0,
                    "response": "Miners are working at fever pitch. Rosten on June 8th is a big deal. If that goes smoothly, the merge happens Aug/Sep - miners are well aware of this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9muzqa",
                    "author": "cryptosperm",
                    "score": -2,
                    "created_utc": 1653270889.0,
                    "response": "Remember POW rewards are 900% more than what POS rewards will be. Do you see this disconnect of valuation in your thinking?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9o5e5j",
                    "author": "Nate___1",
                    "score": -2,
                    "created_utc": 1653304430.0,
                    "response": "Because it's a scam",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}