{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuq08n",
            "title": "If L2 are very successful will ETH price fall?",
            "url": "https://www.reddit.com/r/ethereum/comments/uuq08n/if_l2_are_very_successful_will_eth_price_fall/",
            "author": "themrgq",
            "created_utc": 1653148621.0,
            "score": 0,
            "num_comments": 25,
            "subreddit": "ethereum",
            "selftext": "If all buy demand goes to L2 how does the eth token benefit? 2.0 isn't trying to solve gas prices, I believe Vitalik has been clear they will rely on L2 for that. But I just wonder what happens to eth prices at that point.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9go18j",
                    "author": "thestevenbeauty",
                    "score": 7,
                    "created_utc": 1653149067.0,
                    "response": "L2 is built on Ethereum. Ethereum is the settlement layer. Without Ethereum there are no L2’s",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gqa98",
                            "author": "themrgq",
                            "score": 2,
                            "created_utc": 1653150101.0,
                            "response": "So how does that positively impact the price of ethereum?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gqsj1",
                                    "author": "METAWillou",
                                    "score": 2,
                                    "created_utc": 1653150334.0,
                                    "response": "More people will transact using Ethereum because of the lower fees (L2s)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9gs9z6",
                                            "author": "themrgq",
                                            "score": 2,
                                            "created_utc": 1653151018.0,
                                            "response": "Correct me if I'm wrong but that's not transacting on ethereum. I can buy matic straight from cex and never touch eth. So matic uses the eth chain but that doesn't provide any incentive to buy eth.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9gsoo3",
                                                    "author": "Key-Cucumber-1919",
                                                    "score": 3,
                                                    "created_utc": 1653151202.0,
                                                    "response": "But the L2 itself uses Ethereum. You still pay Ethereum fees, or the cex does that for you.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9gt451",
                                                            "author": "themrgq",
                                                            "score": -1,
                                                            "created_utc": 1653151398.0,
                                                            "response": "In what way does matic pay a fee to eth? Genuine question since I don't know.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9gulo0",
                                                                    "author": "sheilag33",
                                                                    "score": 2,
                                                                    "created_utc": 1653152082.0,
                                                                    "response": "I may be wrong here, but I believe Polygon is a side chain as of now. The foundation is building separate L2 projects with an intention to turn the main chain into a true L2 in the future as well.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i9gur0r",
                                                                    "author": "ItsAConspiracy",
                                                                    "score": 2,
                                                                    "created_utc": 1653152149.0,
                                                                    "response": "I don't know the specifics of matic but in general, rollups store every transaction on L1 in compressed form, so somebody has to pay gas costs for that.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i9gveln",
                                                                    "author": "Kike328",
                                                                    "score": 1,
                                                                    "created_utc": 1653152441.0,
                                                                    "response": "Matic is not L2",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9gy3gl",
                                                                            "author": "mooremo",
                                                                            "score": 1,
                                                                            "created_utc": 1653153660.0,
                                                                            "response": "Polygon POS isn't a full L2.\n\nPolygon does have full L2s tho: \n\nhttps://polygon.technology/solutions/polygon-nightfall/\n\nhttps://polygon.technology/solutions/polygon-hermez/\n\nhttps://polygon.technology/solutions/polygon-miden/",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9gxt87",
                                                                    "author": "mooremo",
                                                                    "score": 1,
                                                                    "created_utc": 1653153534.0,
                                                                    "response": "Every time a roll-up or a side chain commits state to Ethereum that's a transaction and they have to pay gas in ETH to do so.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9gxpxp",
                                    "author": "thestevenbeauty",
                                    "score": 1,
                                    "created_utc": 1653153493.0,
                                    "response": "Most of the L2’s settle on Ethereum. So they have to make transactions on Ethereums base later, AKA buy eth and transact with it. Some of that also gets burned. So that makes it go up.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9gxxdx",
                                            "author": "themrgq",
                                            "score": 1,
                                            "created_utc": 1653153586.0,
                                            "response": "What's the biggest one? Matic currently the biggest but doesn't help eth so biggest that actually uses eth?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9gzcgc",
                                                    "author": "thestevenbeauty",
                                                    "score": 1,
                                                    "created_utc": 1653154219.0,
                                                    "response": "I would say optimism or arbitrum, but I don’t really know",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9gp9sq",
                    "author": "dumplingcompromise",
                    "score": 3,
                    "created_utc": 1653149636.0,
                    "response": "Since there’s more value per transaction, the average price paid to ethereum will also likely increase with l2 adoption.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9go6my",
                    "author": "Over-West-5050",
                    "score": 2,
                    "created_utc": 1653149136.0,
                    "response": "ETH won't fall, successful layer 2's will just take a larger portion of new money entering the space. Storing value in the token for the settlement layer of all these useful protocols will remain a very attractive investment.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gql49",
                            "author": "themrgq",
                            "score": 1,
                            "created_utc": 1653150238.0,
                            "response": "Why would buying eth because it's a settlement layer be an attractive investment? Just the very small staking rewards?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9grvx3",
                                    "author": "Over-West-5050",
                                    "score": 2,
                                    "created_utc": 1653150842.0,
                                    "response": "By crypto standards, staking rewards are low, but I see staking as similar to buying a government bond (a very stable, safe, and reliable investment) and when compared to that, ETH staking rewards are very attractive. Also, major institutions will be settling to ETH so the absolute societal necessity of ETH will provide great stability to its use and therefore make it an attractive investment for preserving wealth.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9gsm0m",
                                            "author": "themrgq",
                                            "score": 1,
                                            "created_utc": 1653151169.0,
                                            "response": "You can buy an ibond that yields way more than 4.5%. Why would major institutions settle in eth rather than a cheaper and faster L2?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9gtoyf",
                                                    "author": "Over-West-5050",
                                                    "score": 2,
                                                    "created_utc": 1653151666.0,
                                                    "response": "You can only purchase a maximum of $10,000 in ibonds per year. Major institutions would transact on layer 2, but settle to ETH because of its reliability. Speed and expense matter for transacting, but are much less of a factor when settling.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9gu4xa",
                                                            "author": "themrgq",
                                                            "score": 1,
                                                            "created_utc": 1653151869.0,
                                                            "response": "I mean if you're saying that transacting is much secure on eth than the L2 that's not super positive.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9gv08i",
                                    "author": "ItsAConspiracy",
                                    "score": 1,
                                    "created_utc": 1653152265.0,
                                    "response": "Because transaction fee revenue feeds back to all ETH holders in the form of fee burn, which is equivalent share buybacks in equities.\n\nRight now that's not so significant because issuance is higher the fee burn, making Ethereum like a company with negative earnings. But earnings will go positive as soon as we merge.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9gug6f",
                    "author": "RFV1985",
                    "score": 1,
                    "created_utc": 1653152011.0,
                    "response": "Ethereum L2s do put downward pressure on fees at the L1 level. However, L2s allow for far more ecosystem growth. That growth will make up for the loss of fee pressure over time and we’ll eventually get to a good equilibrium level of fees at the L1 level. Keep in mind that L2s do pay Ethereum fees, but they are far lower on a per user basis.\n\nAnother way to think about this is Apple cannibalizing their iPod business in favor of the iPhone. Sure, they lost money when the iPod went away but the iPhone brought in so much new revenue and ecosystem growth. That’s how I think about L2s.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gunh5",
                    "author": "ItsAConspiracy",
                    "score": 0,
                    "created_utc": 1653152104.0,
                    "response": "I think possibly yes in the short term, if the L2 share grows a lot faster than overall user growth. Later, we'll more than make it up on volume.\n\nAfter sharding, zkrollups will be able to handle around 100,000 tx/sec. If we're only doing a small fraction of that and not much on L1, there will be lots of unused block space and gas prices will plummet. On the other hand, if gas prices do plummet then more people will use L1, so this is sort of a self-limiting problem. Also, if usage is growing fast then we'll have lots of new people buying ETH even if they aren't spending it for gas immediately.\n\nLong-term, I don't think there's a world where we're doing anywhere near 100,000 tx/sec on Ethereum where the ETH price isn't sky-high.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uuq0ev",
            "title": "My small business now accepts Ethereum & other forms of crypto! 🥳",
            "url": "https://www.reddit.com/r/ethereum/comments/uuq0ev/my_small_business_now_accepts_ethereum_other/",
            "author": "HighOnGFUEL",
            "created_utc": 1653148636.0,
            "score": 66,
            "num_comments": 16,
            "subreddit": "ethereum",
            "selftext": " I'm very sorry if these kinds of posts aren't allowed here :( I'm just a college student trying to get some bills paid so I've decided to launch & start up my new business which now accepts Ethereum & other forms of crypto payments such as $BTC 😁 feel free to pick yourself a neat accessory any positive feedback means the world to me, have a blessed day & don't forget to hodl 😎💪 [Website](https://lampsgalore.shop/)",
            "stickied": false,
            "comments": [
                {
                    "id": "i9hjdn6",
                    "author": "xPurrpX",
                    "score": 4,
                    "created_utc": 1653163850.0,
                    "response": "Very nice! That's one of the things I want to accomplish: own a business and make it accept crypto as payment.\n\nI don't know how to start a successful business though...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hk19z",
                            "author": "HighOnGFUEL",
                            "score": 0,
                            "created_utc": 1653164177.0,
                            "response": "i appreciate the support 😄👏 but honestly i don’t know either 😅 im telling you as long as you get started && get the ball rolling you’ll learn along the way :) im always open to answering any questions as well 😄🙏",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9h6kbe",
                    "author": "Bochixa",
                    "score": 3,
                    "created_utc": 1653157583.0,
                    "response": "How do you deal with sales taxes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9h73lw",
                            "author": "HighOnGFUEL",
                            "score": 1,
                            "created_utc": 1653157846.0,
                            "response": "thanks sm for the question! 🙂 My website is hosted through Shopify so they store all my data , which I then use when I fill out my Tax forms for NJ, they come out my pocket 🙏",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hl36s",
                                    "author": "Bochixa",
                                    "score": 2,
                                    "created_utc": 1653164699.0,
                                    "response": "Ok . Thanks for the info. I’m a Tailor and I would like to start accepting crypto here in Canada.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hl6y6",
                                            "author": "HighOnGFUEL",
                                            "score": 1,
                                            "created_utc": 1653164751.0,
                                            "response": "Shopify works internationally, and provide you with all the information you’ll need tax wise ! :) best of luck to you & thank you for the support 😄👏 + I use coinbase commerce for crypto :)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9hnumz",
                                                    "author": "Bochixa",
                                                    "score": 2,
                                                    "created_utc": 1653166081.0,
                                                    "response": "Thank you very much again. I wish you the best for you and your business !",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9hvvyv",
                    "author": "NekkerBE",
                    "score": 3,
                    "created_utc": 1653170182.0,
                    "response": "Nice. Seen the exact post a week or two ago. Good advertising!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hvwuf",
                            "author": "haikusbot",
                            "score": 1,
                            "created_utc": 1653170195.0,
                            "response": "*Nice. Seen the exact*\n\n*Post a week or two ago.*\n\n*Good advertising!*\n\n\\- NekkerBE\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9h9cir",
                    "author": "El-Coco-No",
                    "score": 2,
                    "created_utc": 1653158934.0,
                    "response": "Nice! We’re doing the same thing at our tax office!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hjrhb",
                    "author": "EntireInflation8663",
                    "score": 2,
                    "created_utc": 1653164042.0,
                    "response": "Awesome bro🔥",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hk30e",
                            "author": "HighOnGFUEL",
                            "score": 0,
                            "created_utc": 1653164201.0,
                            "response": "appreciate that my guy 🙂💯",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9i19s0",
                    "author": "tofazzz",
                    "score": 2,
                    "created_utc": 1653172973.0,
                    "response": "ETH as a form of payment? Uh???\n\nCheck out $NANO",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9i1zub",
                            "author": "tsurutatdk",
                            "score": 1,
                            "created_utc": 1653173351.0,
                            "response": "Guess he's accepting other token as well like FWT, ICX or depends on his customers. It's good to also explore on other solid coins. The OP is just getting started.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9i247o",
                                    "author": "tofazzz",
                                    "score": 1,
                                    "created_utc": 1653173415.0,
                                    "response": "I understand that but I can’t see ETH being used as a form of payment when there are fees involved with it",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uupscs",
            "title": "Oracle History",
            "url": "https://www.reddit.com/r/ethereum/comments/uupscs/oracle_history/",
            "author": "sheilag33",
            "created_utc": 1653147951.0,
            "score": 5,
            "num_comments": 6,
            "subreddit": "ethereum",
            "selftext": "Hi all,\n\nI am currently trying to do some research on the history of blockchain oracles but am having trouble really finding anything concrete. Would appreciate if someone could point me in the right direction! Looking to answer questions like: What and when was the first oracle created? What protocols were around before chainlink came into play? How are newer protocols, like Chainlink, better / more efficient than earlier iterations?\n\nThanks in advance for any help!",
            "stickied": false,
            "comments": [
                {
                    "id": "i9i709a",
                    "author": "edmundedgar",
                    "score": 4,
                    "created_utc": 1653176020.0,
                    "response": "OK, here goes. \n\nIt starts with [this epic talk by Mike Hearn from 2012](https://www.youtube.com/watch?v=mD4L7xDNCmA) which introduces the concept to everyone.\n\nAt that point there were no oracles, so I built Reality Keys in 2013, and [released it in January 2014](https://bitcointalk.org/index.php?topic=423638.0). This was a system designed to work around Bitcoin limitations, where we'd produce pairs of public keys representing yes and no answers to a binary question and only reveal the private key for one of them. This was based on ideas by Mike Hearn and Peter Todd on a Bitcoin Talk thread that I can no longer find. It was hard to use because making smart contracts on Bitcoin is hell. We eventually reoriented the project to handle general human language questions answered on-chain instead of data APIs and dropped Bitcoin support, and the current incarnation is called [reality.eth](https://reality.eth.limo). \n\nLater in 2014 Thomas Kolinko and others built [Orisi](https://orisi.org/about) (not sure of the release date) which was an attempt to make an oracle with a more decentralized design.\n\nAlso in 2014 Paul Sztorc released the [Truthcoin](https://www.truthcoin.info/papers/truthcoin-whitepaper.pdf) whitepaper, which was a design for a game-theoretically robust trustless oracle. The core concepts in this were subsequently implemented by the [Augur](https://augur.net/) team for the oracle built into their prediction market system.\n\nEthereum went live in July, 2015. We had Devcon 1 that year and Thomas Bertani announced Oraclize, which was an Ethereum-native system where you could send a contract a request for some data and it would call it back with the result from some URL. (I'm not sure when he built it but it was live by Devcon 1.) They subsequently rebranded to [Provable](https://provable.xyz/).\n\nOnce Ethereum started to get traction everything went bananas and there were loads of new projects, notably [ChainLink](https://chain.link/).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9i01nh",
                    "author": "aaaanoon",
                    "score": 1,
                    "created_utc": 1653172335.0,
                    "response": "Check out Ergo's oracle tech. The founder was involved in chain link and improved upon it. It's early days but looks interesting. It might be a good route for your research.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}