{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usg5fc",
            "title": "Big btc & eth pump thanks to michael saylor",
            "url": "http://x2-crypto.io",
            "author": "anermik",
            "created_utc": 1652889471.0,
            "score": 0,
            "num_comments": 0,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "usg3ct",
            "title": "I'm building a design Studio as a Service for web3 builders. It's one flat monthly for unlimited design requests/revisions",
            "url": "https://www.reddit.com/r/ethereum/comments/usg3ct/im_building_a_design_studio_as_a_service_for_web3/",
            "author": "caligolae",
            "created_utc": 1652889309.0,
            "score": 5,
            "num_comments": 6,
            "subreddit": "ethereum",
            "selftext": "I'll just say that most web3 user interfaces suck.\n\nI believe that many people building in the crypto space aren't interested in lessons from the past. I get that breaking from old standards is core to the web3 DNA but are we really sure that *everything* should be a candidate for a “revolutionary” redesign?\n\nYes, the underlying technology might be able to do things that have never been imaginable before, but the average users don't quite get it, let alone use it.\n\nAs someone who's been living at the intersection of product design and crypto for the last 5 or so years, I thought this be an interesting opportunity to try making web3 UX suck a bit less.\n\nI'm excited to announce that I'm starting a small \"design studio a service\" (f that's even a thing) called [Openprest.com](https://openprest.com/). Starting at $799/mo (limited 30% off) with the [Starter plan](https://openprest.com/#pricing) for unlimited design requests, revisions, and brand, and at $1,299/mo with the [Advanced plan](https://openprest.com/#pricing) for real-time collaboration + code or no-code development (Tailwind/Nextjs / Webflow).\n\nThis is my humble attempt to narrow the chams between the wisdom of the recent past and the speed of the future. Creating web3 products that are useful and unique. That are beautiful and usable. And that brings new perspectives, but never at the expense of greater surface complexity.",
            "stickied": false,
            "comments": [
                {
                    "id": "i94uv3s",
                    "author": "Perleflamme",
                    "score": 2,
                    "created_utc": 1652914950.0,
                    "response": "Indeed, changing UX isn't UX best practices and current Web3 UX clearly is ill-suited. That's because the role of UX is to provide to users a clear way of interacting with tools. And the clearest way is what's easy to grasp from past knowledge. So, changing everything is never the way to go in UX. If there are changes, they need to be subtly added over time.\n\nGood initiative.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96vy8r",
                    "author": "AESTHTK",
                    "score": 1,
                    "created_utc": 1652960828.0,
                    "response": "Also post to: r/ethdevjobs",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96w2zn",
                            "author": "caligolae",
                            "score": 1,
                            "created_utc": 1652960910.0,
                            "response": "Thanks, will do.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}