{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utpfhm",
            "title": "My friend built this super user-friendly EVM tool for devs to have easier access to web3 data.",
            "url": "https://www.reddit.com/r/ethereum/comments/utpfhm/my_friend_built_this_super_userfriendly_evm_tool/",
            "author": "ginpunch",
            "created_utc": 1653037991.0,
            "score": 11,
            "num_comments": 4,
            "subreddit": "ethereum",
            "selftext": "We all know that it is not that easy for web3 developers(especially for front-end) to access and present Web3 data due to the infrastructure design of blockchains.\n\nTo resolve this issue, My friend [DIY](https://github.com/DIYgod) single-handedly came up with this human-friendly open-source project [Unidata](https://unidata.app/) a few days ago. We believe this tool will make Web3 data much easier to access and display for developers.\n\nDocs: [https://unidata.app/](https://unidata.app/)\n\nGitHub: [https://github.com/NaturalSelectionLabs/Unidata](https://github.com/NaturalSelectionLabs/Unidata)\n\nLet's take the most commonly used web3 data ETH NFT as an example to elaborate on the issue.\n\n1. The EIP-721 standard ETH NFT used has a very \"flexible\" format. An NFT image may use various fields, such as `image` `image_url` or `animation_url.` Depending on the publisher's preference, it might not even be an image at all; it could be a video, a 3D model, etc. The inconsistent formats cause a lot of problems for its front-end presentation.\n2. Getting all the Ethereum NFTs owned by a given address is also problematic. Ethereum's design requires you to read all the transaction records of that address to get all its Ethereum NFTs. This is an impossible task for the front-end, but can be partially solved by the various data indexing services currently available. However, the data returned by these services are in different formats, each having its own advantages and disadvantages, while each supports different chains. So how should we choose which one to use?\n\nTo address the first issue, Unidata has designed a series of user-friendly and uniform data specifications, divided into four sections - Profiles, Links, Assets, and Notes, and Ethereum NFTs fall under the Assets specification. With a fixed data format returned by Unidata, the front-end no longer has to do the troublesome work of adapting a confusing data format.\n\nUnidata currently supports Ethereum NFT and Solana NFT as well, and the data specifications for Ethereum NFT and Solana NFT are unified. In addition, Unidata will continue to support more Assets sources, all of which will also have unified specifications.\n\nOnce the first issue was solved, the second is easy: Unidata's approach is to unify and aggregate the data returned by the various services into the same format. For example, the OpenSea service supports the mainnet, the Alchemy service supports Polygon, the Moralis service supports BSC, Arbitrum, and fantom, and the POAP service supports POAP NFT for the Gnosis chain. With a single line of code from Unidata, you can use these services to get all the NFTs for mainnet, Polygon, BSC, Arbitrum, fantom, and POAP at the same time. An online demo can be seen [here](https://unidata.app/guide/assets/ethereum-nft/#live-demo).\n\nhttps://preview.redd.it/oz443og1ll091.png?width=1261&format=png&auto=webp&s=7eac64abb8261916c979077b8c93c82e511e8ef0\n\nUnidata currently supports not only Assets, but also Profiles, Links, and Notes sections. All the services and data sources currently supported can be seen in this [documentation](https://unidata.app/guide/#supported-sources).\n\n\\- [Assets](https://unidata.app/guide/assets/) currently support Ethereum NFT(mainnet, Polygon, BSC, Arbitrum, Fantom, Gnosis, POAP), Solana NFT, Alchemy, Solscan, Moralis, and OpenSea.\n\n\\- [Notes](https://unidata.app/guide/notes/) currently support Mirror Entry, Ethereum NFT Activity(mainnet, Polygon, BSC, Arbitrum, Fantom, Gnosis, POAP), RSS3.\n\n\\- [Profiles](https://unidata.app/guide/profiles/) currently support ENS, Crossbell, Infura.\n\n\\- [Links](https://unidata.app/guide/links/) currently support CyberConnect.\n\nMany more features are in progress and will be active very soon.\n\nPlease feel free to give my friend any feedback. He would like to welcome everyone to join Unidata's discord community and this opensource project.\n\nDiscord: [https://discord.com/invite/ggrfhdS9Fe](https://discord.com/invite/ggrfhdS9Fe)\n\nTwitter: [https://twitter.com/Unidata\\_](https://twitter.com/Unidata_)\n\n&#x200B;\n\nhttps://preview.redd.it/7t8e5goykl091.png?width=1800&format=png&auto=webp&s=a5cd05d6320f0199340f759244dd601e24afdb2f",
            "stickied": false,
            "comments": [
                {
                    "id": "i9b7k5z",
                    "author": "Peracinobw",
                    "score": 2,
                    "created_utc": 1653042281.0,
                    "response": "Man this is dope tbh. I really appreciate his work. If you wouldn't mind I recently came to know about a project called QANplatform where the dapos can be built with any programming languages and for that the devs gets royalties for life time. He might wanna take a look into this too. Pretty interesting.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9b8ae1",
                            "author": "ginpunch",
                            "score": 1,
                            "created_utc": 1653042851.0,
                            "response": "cool\\~ thank you for sharing this. I will tell him about it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9b8obm",
                                    "author": "Peracinobw",
                                    "score": 2,
                                    "created_utc": 1653043147.0,
                                    "response": "Anytime mate. I hope it really helps him to make some royalties for doing his job. Developing dapps is no joke. I guess it's kind of a passive income for the devs. The project is a quantum resistant blockchain so it would be futuristic too. Hope he enjoys his work while he gets to earn. Good luck 😄🙏",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}