{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvtji9",
            "title": "Frequently Asked Questions + Weekly Discussion Thread",
            "url": "https://www.reddit.com/r/ethereum/comments/uvtji9/frequently_asked_questions_weekly_discussion/",
            "author": "AutoModerator",
            "created_utc": 1653285611.0,
            "score": 22,
            "num_comments": 81,
            "subreddit": "ethereum",
            "selftext": "**Welcome to the Weekly Discussion. Please read the disclaimer, guidelines, and rules before participating.**\n\nRules:\n\n* All [sub rules](https://www.reddit.com/r/Ethereum/about/rules/) apply in this thread.\n* Discussion topics must be related to Ethereum.\n* Behave with civility and politeness. Do not use offensive, racist or homophobic language.\n* Comments will be sorted by newest first.\n\nUseful Links:\n\n* [Ethereum.org](https://ethereum.org)\n* [ETHMerge.com](https://ethmerge.com/)\n\n**Reminder**\n\n/r/ethereum is a community for discussing the technology, news, applications and community of Ethereum. **Discussion of the Ether price or trading is not allowed.** Please keep those discussions to [/r/ethfinance](https://www.reddit.com/r/ethfinance) and [/r/ethstaker](https://www.reddit.com/r/ethstaker).\n\n&#x200B;\n\n**Frequently Asked Questions**\n\n**Where's the best place to buy ETH?**\n\nThere are many centralized exchanges that support Ethereum. If you live in the US, the most popular exchanges are Coinbase, Gemeni and Kraken. Coinbase users can use Coinbase Pro for lower fees.\n\n**When is Eth2 launching?**\n\nEth2 is a marketing term used to represent a number of updates to Ethereum. The Eth2 proof-of-stake chain first launched in December 2020. \"The Merge\", which is the event that will fully switch Ethereum's consensus to proof-of-stake, is estimated to be ready in early 2022, although there is no exact timeline. Other updates, such as data shards, will follow that update.\n\nVisit [ethmerge.com](https://ethmerge.com/) to learn more about \"The Merge\".\n\n**Do I need to do anything to update to Eth2? Will Eth2 create a new token?**\n\nNo, ETH holders *never* need to take any action to keep holding ETH. Ethereum users will be unaffected by the Eth2 upgrade. And the Eth2 updates will not create any new tokens.\n\n**How can I stake my ETH?**\n\nThe best way to stake your ETH: by running your own validator.\n\n* Running your own validator requires a modern computer and 32 ETH. Visit /r/ethstaker for more details\n\n**Why are Ethereum transaction fees so high?**\n\nLike most blockchains, Ethereum fees are determined by supply-and-demand. The large demand to use Ethereum has pushed transaction fees quite high (however, fees were just a few cents only 2 years ago). Fees are especially high during market volatility, and during NFT drops.\n\n**What is being done to lower Ethereum transaction fees?**\n\nEthereum fees are reduced by using layer-2 rollups. Rollups are scaling solutions that allow for significantly cheaper transactions, while still maintaining Ethereum's security.\n\nAdditionally, Eth2's data shards will make rollups even cheaper.\n\nWhile rollups are cutting-edge technology being actively developed, a number are already live on Ethereum mainnet. Visit [l2beat.com](https://l2beat.com/) to learn more about rollups.\n\n**What's the best wallet for Ethereum?**\n\nThe most popular tool for using decentralized applications is Metamask. However, for security reasons, we recommend using a hardware wallet such as a Trezor or Ledger.\n\n&#x200B;\n\nAre there questions you'd like to see added? Leave a comment below.",
            "stickied": true,
            "comments": [
                {
                    "id": "i9nlv7t",
                    "author": "domotheus",
                    "score": 8,
                    "created_utc": 1653287398.0,
                    "response": "To any mods reading this, is there any way to get quality contributors on some sort of whitelist, protected from AutoMod's aggressive auto-removals? It's really disheartening to write several paragraphs answering a question in depth only to have it immediately removed, never to be seen. Especially while there are obvious scams, trolls and misinformation constantly making their way to the top and into every thread...\n\nIf so, I nominate these people:\n\n* /u/domotheus (myself)\n\n* /u/AESTHTK \n\n* /u/frank__costello\n\n* /u/cosmic-comedy \n\n* /u/Perleflamme \n\n* /u/cryptOwOcurrency\n\n* /u/mooremo \n\n* literally anyone who frequently participates in /r/ethfinance daily threads\n\nI may have forgotten some, I just did a quick scan basing myself on my personal RES upvote counts. Whitelisting these people would be an easy step in increasing the quality of the subreddit.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zltdp",
                            "author": "edmundedgar",
                            "score": 4,
                            "created_utc": 1653514710.0,
                            "response": "Thanks for those suggestions. I have been whitelisting people posting consistently good stuff when I see their posts getting eaten by the automoderator. I'd already added /u/Perleflamme a while back, and I just added the other accounts you suggested.\n\nHowever, I'm not sure if this actually does anything... People on the whitelist still seem to get automodded quite a bit regardless, I'm not sure if there's anything we can do about it...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2213w",
                                    "author": "domotheus",
                                    "score": 1,
                                    "created_utc": 1653567834.0,
                                    "response": "I see. Maybe reddit's spam filter is extra aggressive for crypto subreddits in general. I remember my own account getting shadowbanned the minute I got enough karma with it to start participating in crypto circles. Unforgiving lol",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9pehog",
                    "author": "StellarNoob",
                    "score": 1,
                    "created_utc": 1653326299.0,
                    "response": "Where is the best place to farm using my ETH ? There was a post here about the different options of farming ETH  but I can't find it anymore \n\nI am talking about farming and not staking",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qqneb",
                    "author": "52134682",
                    "score": 1,
                    "created_utc": 1653347597.0,
                    "response": "I've got 1K to purchase crypto with. Should I spend it on Ethereum or Bitcoin? Or should I split it and buy 500 Ethereum and the rest Bitcoin? Plans to hold it for a decade or two.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qxu0n",
                            "author": "Maswasnos",
                            "score": 2,
                            "created_utc": 1653351153.0,
                            "response": "I recommend you ask in the /r/ethfinance daily thread. This sub is more for tech talk and news, less for investment advice/chat.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9r5r1d",
                                    "author": "52134682",
                                    "score": 2,
                                    "created_utc": 1653355021.0,
                                    "response": "Will do. Thanks",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9qxv1s",
                                    "author": "sneakpeekbot",
                                    "score": 1,
                                    "created_utc": 1653351168.0,
                                    "response": "Here's a sneak peek of /r/ethfinance using the [top posts](https://np.reddit.com/r/ethfinance/top/?sort=top&t=year) of the year!\n\n\\#1: [🚨 BIG NEWS! 🚨 ETH will be used as crypto payments for 50,000 EV charging stations in Europe](https://i.redd.it/9jjw4hhgdg771.jpg) | [109 comments](https://np.reddit.com/r/ethfinance/comments/o7t7oc/big_news_eth_will_be_used_as_crypto_payments_for/)  \n\\#2: [I gave my dad 100 ETH 4 years ago for Father’s Day and now it’s currently worth ~$225,000 — when ETH hits $10,000 this year, I will have made my dad a millionaire.](https://i.redd.it/ua1tw2ybnh671.jpg) | [114 comments](https://np.reddit.com/r/ethfinance/comments/o4fhk3/i_gave_my_dad_100_eth_4_years_ago_for_fathers_day/)  \n\\#3: [Daily General Discussion - August 5, 2021](https://np.reddit.com/r/ethfinance/comments/oyakfh/daily_general_discussion_august_5_2021/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tw74e",
                    "author": "RazerPSN",
                    "score": 1,
                    "created_utc": 1653412981.0,
                    "response": "I need to store some tokens for long term, is L2 as safe as ETH chain?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ueakz",
                            "author": "Maswasnos",
                            "score": 2,
                            "created_utc": 1653420545.0,
                            "response": "I recommend you read through the warnings on https://l2beat.com/ to see what the drawbacks of current L2s are. \n\nNone of them have the same degree of security as mainnet Ethereum yet, but I would say zkSync and Loopring come fairly close.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ueu5b",
                            "author": "domotheus",
                            "score": 2,
                            "created_utc": 1653420776.0,
                            "response": "Go over to [l2beat](https://l2beat.com/) and click on any rollups to see their security aspects as they currently are. \n\nMy personal opinion is that if you're looking for a cold storage \"set and forget\" type thing, then Layer 1 is your safest bet with the best guarantee of your tokens still being easily available years from now without having to track L2 development. This safety and convenience is well worth the money you're gonna spend on gas.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9udc3l",
                    "author": "Gabon08",
                    "score": 1,
                    "created_utc": 1653420143.0,
                    "response": "Is Kraken a good place to buy Eth?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uedzr",
                            "author": "Maswasnos",
                            "score": 3,
                            "created_utc": 1653420585.0,
                            "response": "Kraken is OK but they don't support withdrawals via any rollups yet. FTX, Binance, and Crypto.com support Arbitrum and I think Binance supports Optimism now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9xxung",
                    "author": "Soulstar205",
                    "score": 1,
                    "created_utc": 1653490744.0,
                    "response": "Can I send a token from a polygon chain to an erc20 chain?\nWhat are the dangers of cross chain token transfers?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2ffo9",
                    "author": "cyclone8",
                    "score": 1,
                    "created_utc": 1653574258.0,
                    "response": "What effect, if any, will the extra hashrate speeding up the Ropsten docking have on testing for the merge on the mainnet? [Wenmerge's](https://wenmerge.com/) estimate has it occurring in just under 14 and three quarter hours, and [bordel.wtf](https://bordel.wtf)'s estimate is approximately 15 and three quarter hours.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia3fx4z",
                            "author": "domotheus",
                            "score": 3,
                            "created_utc": 1653588925.0,
                            "response": "Someone with a mining rig decided to troll by mining on ropsten and messing with gas limits. Devs will just pick a different TTD to push the ropsten merge back and that's it.\n\nOn mainnet it's not like someone can casually turn on a powerful rig and push the TTD earlier than devs want, since mining is so much more competitive over there. The worst that can happen is miners pull out to sell their GPU which would mean the TTD gets hit later than planned, and then a new TTD is just selected to keep the merge on schedule",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia4wt2v",
                    "author": "SouthernBoyChris",
                    "score": 1,
                    "created_utc": 1653612368.0,
                    "response": "General question about hardware wallets.\n\nHow are they more secure? What if you have a virus or something on your computer and insert your hardware wallet onto your PC won't it get hacked?\n\nI have been watching videos on this but they always say they can't be hacked remotely or over the internet or anything like that but never explain why. I'm generally just curious as to why.  I figured once they connect to the internet they become vulnerable just like everything else.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5c9fp",
                            "author": "jcm2606",
                            "score": 2,
                            "created_utc": 1653619945.0,
                            "response": "> How are they more secure?\n\nThey keep your seed phrase in a separate storage chip that's designed to be highly secure and resilient to both physical and digital attacks, and will use an SoC (System-on-Chip, basically a mini-computer that's held on a single chip or PCB) to accept unsigned transactions from an external device (ie your computer or phone) and sign them using your private key (which is based on your seed phrase), without the private key ever leaving the hardware wallet.\n\n> What if you have a virus or something on your computer and insert your hardware wallet onto your PC won't it get hacked?\n\nThis really depends on the exact hardware wallet, as different wallets will have different vulnerabilities. Theoretically it could be possible for a virus to exploit one of these vulnerabilities to push a compromised firmware onto the wallet (making it possible for the wallet to display a false destination address for a transaction, or things like this), but:\n1. The practicality of this form of attack varies between different wallet brands and wallet models, based on the vulnerabilities. In general I'd say that this isn't an issue, as malware needs to be specifically designed for a given wallet brand/model and may require some impractical techniques to fully compromise the wallet, but I'd also say that if you're worried about this, then you should do some research into whether a given wallet has any known vulnerabilities.\n2. This form of attack *probably* couldn't let the malware steal your seed phrase, as it's held within the separate storage chip that's designed to be resilient to both physical and digital attacks. This form of attack generally exploits vulnerabilities in the unsecure SoC, so at most it could compromise that and *maybe* issue requests to the secure storage chip, but the secure storage chip shouldn't ever send your seed phrase back to the unsecure storage chip. Think of some malware having your hardware wallet display your intended destination address, when in reality the destination address is actually one owned by the developer of the malware. That's the sort of stuff that's theoretically possible.\n\n>  I figured once they connect to the internet they become vulnerable just like everything else.\n\nIt's because the part that you want to keep safe (your seed phrase) is not accessible from the internet-connected device. To get the seed phrase, the internet-connected device would need to go through the unsecure SoC, then through the secure storage chip, which it's designed to defend against. Without having physical access to the device, this just isn't possible, hence the seed phrase considered to be invulnerable once it's in the secure storage chip. Though, having said that, a hardware wallet obviously doesn't protect against you giving your seed phrase away yourself, so obviously don't do that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5lbdb",
                                    "author": "SouthernBoyChris",
                                    "score": 1,
                                    "created_utc": 1653624790.0,
                                    "response": "Appreciate all that.\n\nOne last thing.\n\nCouldn't hackers just input random different key phrases to get access to wallets?  And I'm sure they could set up an automated system where it tries random phrases over and over. All automated.  So what's stopping them from doing that?   I'm sure there's millions of wallets around the world. Shouldn't be too hard to crack a few. After all it's only 12 to 18 words.\n\n\nReason I ask is because I watched a refresher video on how to set up a mobile wallet and move money in and out. And when you do the backup it generates 12 words or however many words. And then when you start typing those words after the first 3 letters it will even auto predict the word for you. And so all someone needs to know is those 12 words and boom they have full access to your funds.\n\nI'm sure hackers know which words each wallet uses so they can easily set up a bot that has a word list that uses all those words and inputs them all in random order X amount of times on repeat to try to crack wallets.\n\nSo what's stopping hackers from doing it?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia5nn47",
                                            "author": "jcm2606",
                                            "score": 2,
                                            "created_utc": 1653626193.0,
                                            "response": "I mean, sure, but a 12-word phrase has around 777,788,267,247,859,345,059,141,959,844,041,626,185 possible combinations, and a 24-word phrase has around 197,618,498,965,019,640,189,561,147,748,160,696,069,580,773,829,359,895,960,674,276,7068,384,079,188,241 possible combinations.\n\nIt's absolutely possible for an attacker to run through the BIP39 wordlist (the list of words that make up your 12- or 24-word phrase), grab random words and blindly generate private keys, but the chance that they strike gold and find an in-use phrase is **extremely** low, though there *are* people trying to \"break into\" wallets by randomly generating phrases.\n\nThe likelihood that you have your wallet broken into by someone who's just randomly generating phrases is one in 340,282,366,920,938,000,000,000,000,000,000,000,000 for a 12-word phrase, and one in 115,792,089,237,316,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000 for a 24-word phrase. For reference, the likelihood of flipping a coin 100 times and having it land on heads every single time is one in 1,267,650,600,228,230,000,000,000,000,000, or roughly 3.7 million times more likely than breaking into a wallet secured by a 12-word phrase (assuming my napkin math is correct).\n\n[Source for these figures.](https://www.blockplate.com/blogs/blockplate/can-someone-guess-my-bitcoin-seed-phrase)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia52g8h",
                    "author": "Asm00dean",
                    "score": 1,
                    "created_utc": 1653615140.0,
                    "response": "Where can I see my transaction fees when I buy Ether? It is not clearly stated in my transaction report. Also, every time I buy the price is about 10% higher than what the price seems to be at the time and I don’t understand why. \n\nI hope that it does not mean I pay 10% transaction fees every time I try to buy Ether?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia57551",
                            "author": "jcm2606",
                            "score": 2,
                            "created_utc": 1653617409.0,
                            "response": "Are you buying on a centralised exchange (cex) using fiat, or on a decentralised exchange (dex) by trading another token for ETH?\n\nIf the former, you're not being charged any fees by the network, you're being charged a fee by the exchange itself, since your purchase is handled entirely within the exchange's own database. The only time you're charged a fee by the network is if you then try to move your ETH off the exchange, into a personal wallet, since that involves transacting on the network.\n\nIf the latter, then your wallet software should give an estimate based on which dex you're using. Decentralised exchanges operate completely on the Ethereum network, so you're being charged a fee by the network itself, but this fee will always be the same, being based on how complex the dex is to operate, even if you purchased $10 worth of ETH, or $10k worth of ETH.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5jkun",
                                    "author": "Asm00dean",
                                    "score": 1,
                                    "created_utc": 1653623796.0,
                                    "response": "Thank you very much for the detailed answer! i am buying on a centralised exchange using fiat currency, so I guess I will have to read the fine prints to find what they are charging me.\n\ni didn’t know that fees would be charged for taking the ETH out to a wallet, this is good to know!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia5uca6",
                            "author": "Nonocoiner",
                            "score": 1,
                            "created_utc": 1653630708.0,
                            "response": ">every time I buy the price is about 10% higher than what the price seems to be at the time and I don’t understand why\n\nWhat exchange is this? You don't pay a 10% premium on any of the big exchanges. Are you maybe confusing € with $ price or something?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5ksr5",
                    "author": "Top-Engineering3027",
                    "score": 1,
                    "created_utc": 1653624497.0,
                    "response": "Can I create a private key/keystore for my eth address",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}