{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut2c0r",
            "title": "Lido's token (stETH) representing staked ETH on the platform has de-pegged significantly",
            "url": "https://www.reddit.com/r/ethereum/comments/ut2c0r/lidos_token_steth_representing_staked_eth_on_the/",
            "author": "Dnowell-",
            "created_utc": 1652963335.0,
            "score": 0,
            "num_comments": 15,
            "subreddit": "ethereum",
            "selftext": "\nCurrently trading at 0.98275065 to 1 ETH\n\nI don't see much talk about this but isn't this a really big red flag?\n\nWhat do you guys think is another UST incident coming our way or am I just over-reacting and this is normal - the token should re-peg soon enough/after the merge",
            "stickied": false,
            "comments": [
                {
                    "id": "i973ipg",
                    "author": "Maswasnos",
                    "score": 12,
                    "created_utc": 1652965095.0,
                    "response": "It's only a red flag if you've taken out a loan of ETH against your stETH, since the value of your collateral is falling in relation to the value of your loan and you could be liquidated. \n\nstETH is backed 1:1 by staked ETH, so there's really no reason it would depeg like UST did. The reason most staking derivatives *don't* trade 1:1 (BETH being the most notable) is because they aren't as useful as ETH and you're essentially paying a premium for liquidity while your actual ETH is locked away. LIDO has put a lot of funding and effort into keeping the stETH peg at 1:1 because it greatly incentivizes adoption of stETH, but trading between .95 and .99 is perfectly normal and frankly kind of expected. \n\nWhat really keeps these sorts of tokens close to 1:1 is the assurance that you'll be able to redeem the tokens at a 1:1 ratio once Shanghai launches sometime next year. As the tokens fall further away from 1:1, buying them is more and more appealing because you're essentially guaranteeing that you'll receive the difference in ETH post-Shanghai.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98m73j",
                            "author": "RusticScentedMale",
                            "score": 1,
                            "created_utc": 1652988010.0,
                            "response": "What if eth 2 is delayed some more years? Would we see the peg continuing to slip?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i98oxev",
                                    "author": "Maswasnos",
                                    "score": 4,
                                    "created_utc": 1652989128.0,
                                    "response": "First, we won't be seeing that. Second, I guess it could? Seems like a moot point though. \n\nLike, if the merge slips a few *years* this far along in the dev process with fully-functioning merge clients and all that, something is horribly wrong and we probably won't *ever* merge. In that case they'll probably just implement a way to retrieve staked ETH and LDO will be redeemable 1:1 again. \n\nBut really, this isn't worth worrying over. Mainnet shadowfork 5 went \"exceedingly well\" and Ropsten's merge config has already been put on Github. The Merge is coming, and barring any last-minute catastrophic bugs it's going to happen this year. Withdrawals from staking are somewhat trivial after that.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i973tts",
                    "author": "frank__costello",
                    "score": 8,
                    "created_utc": 1652965251.0,
                    "response": "It's a 1-way bridge. You can deposit into Lido, but you can't withdraw, only sell. So trading below 1:1 is expected\n\n> do you guys think is another UST incident coming our way\n\nNo, there's nothing about Lido that resembles UST at all",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9725tm",
                    "author": "WhoDidThat97",
                    "score": 6,
                    "created_utc": 1652964383.0,
                    "response": "Over reacting. It's a trade not a peg. If more people are after Eth and want to get out of staking it increases the supply of stETH, so the exchange rate fluctuates.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i973bnc",
                    "author": "Knurlinger",
                    "score": 1,
                    "created_utc": 1652964994.0,
                    "response": "it is 100% collateralized by ETH if you see it from that point of view, so go and buy stETH instead of ETH ;)\n\n&#x200B;\n\nI see 67% stETH in the curve pool, pretty sure we were at this point already in the past. Nothing to worry.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97564s",
                            "author": "cannedshrimp",
                            "score": 1,
                            "created_utc": 1652965918.0,
                            "response": "Not sure how you can call it 100% collateralized when the collateral is frozen in centralized accounts. And the asset that’s supposed to be collateralized is completely liquid. I’m not saying there IS a problem here, but a lot of the responses on this thread don’t instill a lot of confidence.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97f3tp",
                                    "author": "frank__costello",
                                    "score": 3,
                                    "created_utc": 1652970453.0,
                                    "response": "\"Collateral\" is probably the wrong word, \"backed\" is more accurate.\n\nstETH is 100% backed by ETH, there's just some trust assumptions in the companies that operate the validators. Similar trust assumptions to USDC, which is 100% backed by cash and cash equivelants.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}