{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uts8xx",
            "title": "Ethereum devs tip The Merge will occur in August ‘if everything goes to plan’ 🙌",
            "url": "https://v.redd.it/w8bugen96m091",
            "author": "Stealthex_io",
            "created_utc": 1653045144.0,
            "score": 881,
            "num_comments": 218,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9c69ji",
                    "author": "ThomasMoane",
                    "score": 7,
                    "created_utc": 1653059364.0,
                    "response": "RemindMe! In August 2022",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bbuhg",
                    "author": "Funny_Umpire_1594",
                    "score": 52,
                    "created_utc": 1653045243.0,
                    "response": "Buy more eth 🔝",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bd1wx",
                            "author": "DCC808",
                            "score": 2,
                            "created_utc": 1653045964.0,
                            "response": "Wen they tell you to buy that's wen u sell 😎",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ds1i2",
                                    "author": "DigStock",
                                    "score": 8,
                                    "created_utc": 1653084398.0,
                                    "response": "Since you're telling me to sell, I'll buy.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9c07wx",
                            "author": "Hang10Dude",
                            "score": 0,
                            "created_utc": 1653056939.0,
                            "response": "Wise.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bwo9d",
                    "author": "henkgaming",
                    "score": 8,
                    "created_utc": 1653055477.0,
                    "response": "Note that they are now saying this about 3 months prior. Before, they made the prediction way way further in the future. As such; even if they need twice the amount of time it’s happening this year",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cf75c",
                            "author": "UsernameIWontRegret",
                            "score": 2,
                            "created_utc": 1653062899.0,
                            "response": "I mean I’ve been hearing this for two years now so…",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9cfxyl",
                                    "author": "henkgaming",
                                    "score": 2,
                                    "created_utc": 1653063192.0,
                                    "response": "Yea although this time we've had succesful shadow forks and June 8 we're forking Ropsten, evidence is building up",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9cgw56",
                                            "author": "UsernameIWontRegret",
                                            "score": -2,
                                            "created_utc": 1653063566.0,
                                            "response": "I will believe it when I see it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9cpwu0",
                                                    "author": "JCmollyrock420",
                                                    "score": 4,
                                                    "created_utc": 1653067123.0,
                                                    "response": "Reading comments like this add to my belief that the merge is no where close to being priced in.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9dq57u",
                                            "author": "Nonocoiner",
                                            "score": 0,
                                            "created_utc": 1653083511.0,
                                            "response": "Note that the 8th of june is a rough estimate. This is because the upgrade will be triggered by the accumulated difficulty, and from what I understand the difficulty on Ropsten varies a lot.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9cx1bl",
                                    "author": "TheNuogat",
                                    "score": 2,
                                    "created_utc": 1653070151.0,
                                    "response": "Except you haven't..",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9bme1u",
                    "author": "RevolutionaryLand230",
                    "score": 11,
                    "created_utc": 1653050891.0,
                    "response": "Please for the love of god.. may these geniuses bring me luck and good fortune",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bmf5n",
                            "author": "haikusbot",
                            "score": 16,
                            "created_utc": 1653050906.0,
                            "response": "*Please for the love of*\n\n*God.. these geniuses bring me*\n\n*Luck and good fortune*\n\n\\- RevolutionaryLand230\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bcz4y",
                    "author": "TyroneThePug",
                    "score": 17,
                    "created_utc": 1653045918.0,
                    "response": "🧢",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cjzaq",
                            "author": "PM_ME_ONE_EYED_CATS",
                            "score": -2,
                            "created_utc": 1653064768.0,
                            "response": "🚫🧢",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bhkdi",
                    "author": "rhetorical_twix",
                    "score": 23,
                    "created_utc": 1653048463.0,
                    "response": "At this point ethereum might drop on the merge. Some of us trapped in locked up stakes have been in hell.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bjhwh",
                            "author": "Uplink84",
                            "score": 67,
                            "created_utc": 1653049464.0,
                            "response": "Staking is locked for a period after the merge as well I thought. But anyhow I think you should be happy you are locked, protects you from panic selling",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bueh2",
                                    "author": "Gravy_Vampire",
                                    "score": 29,
                                    "created_utc": 1653054510.0,
                                    "response": "You thought correctly. 6 months lockup followed by an exit queue.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9bzrly",
                                    "author": "rhetorical_twix",
                                    "score": 5,
                                    "created_utc": 1653056756.0,
                                    "response": "An indefinite lockup period isn't necessarily good for you just because it \"protects you from panic selling\".  It's not like crypto owners are all 15 years old and have to be protected from themselves. \n\nCoinbase lowered the interest rate it was paying on (locked) stakes when the amount of incoming stakes leveled out. Now Coinbase has declared that people who have coins on deposit with them have a non-secured interest in those coins and Coinbase can use the deposits to pay off other creditors first in case of bankruptcy, etc. \n\nI just want to sever my relationship with Coinbase in light of what I feel is its behavior that is disadvantageous to me, and I'm unable to do that. I wouldn't mind transferring my stake to another company. That's why I am fed up with the lockup.\n\nBut I am getting fed up with the whole situation with Coinbase and the lengthy merge delays. So I might get out based on things seeming to be sketchy and in some cases predatory. IDK that the community is managing the professional ethics side well.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9cxvki",
                                            "author": "ballsonyah",
                                            "score": 16,
                                            "created_utc": 1653070538.0,
                                            "response": "Not defending coinbase as they have plenty they could improve upon but there is a lot of factual errors in this post. Everyone who stakes with them was aware of the terms and warnings before they staked no one is being duped for failing to read their ToS, they were very explicit about lockup and that there was no timeline for withdrawals. Coinbase didn’t just lower yield because they could, deposits to the beacon chain keep on increasing pushing yields down for everyone.  Depositors at every CEX and traditional institutions adhere to those same rules and are at the end of the line for payback if a default occurs, this is industry standard and nothing unique to coinbase, unless their deposits are sipc/fdic insured.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9cykq6",
                                                    "author": "rhetorical_twix",
                                                    "score": 0,
                                                    "created_utc": 1653070858.0,
                                                    "response": "Thanks for your response. I'll take that into consideration. But I think they did gamify their interface and have not been the best platform compared to others in how they are administering their lockup.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9cw0h5",
                                            "author": "theantirobot",
                                            "score": 4,
                                            "created_utc": 1653069687.0,
                                            "response": "Your comment makes it clear you don’t know how bankruptcy works.  In the case of bankruptcy a company doesn’t choose which debts to pay.  The point of bankruptcy is they can’t pay debts.  Then courts / judges divvy up what is left.  Since there is no precedent for a crypto broker going bankrupt, is conceivable but unlikely that a judge would make an anti consumer ruling and give customer funds to debt holders.  \n\nIt’s the courts / judges that would be the bad guy.  Not coinbase",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9cy4p2",
                                                    "author": "rhetorical_twix",
                                                    "score": 0,
                                                    "created_utc": 1653070655.0,
                                                    "response": "My comment is basically self explanatory where I used the term \"unsecured creditor\". I can't take the time to explain what that means in a bankruptcy if you don't know what that means. A company can define for the courts who their secured creditors are and who they aren't. A bankruptcy court may or may not accept their definition, but this is how Coinbase is choosing to define its depositors. \n\nMaybe you should check the headlines on this issue last week. Google \"coinbase bankruptcy\" and click on the \"news\" tab.\n\nHere, I'm going to give you a link to an article.\n\nhttps://www.barrons.com/articles/coinbase-stock-earnings-bankruptcy-51652484501\n\nNow I'm going to disable inbox replies on all my comments in here because the replies I'm getting are whack.\n\nYou can say that the merge dragging on together with how platforms like Coinbase are exposing customers to risk with lower returns during the lengthy lockup isn't going to drive people out of Ethereum, but I think it will based on my own personal experience.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9c5jd1",
                            "author": "Theoretical_Action",
                            "score": 5,
                            "created_utc": 1653059074.0,
                            "response": "Christ why is this sentence so hard to read?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9c6ir1",
                                    "author": "rhetorical_twix",
                                    "score": 3,
                                    "created_utc": 1653059467.0,
                                    "response": "There were extra words & missing punctuation. I had just woken up. Fixed it for you.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9c75ds",
                                            "author": "Theoretical_Action",
                                            "score": 2,
                                            "created_utc": 1653059719.0,
                                            "response": "Oh wow thanks, that makes way more sense. Sorry I had also just woken up so neither of our brains were working lol",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9c85t5",
                            "author": "Cryptolution",
                            "score": 5,
                            "created_utc": 1653060119.0,
                            "response": ">Some of us trapped in locked up stakes have been in hell.\n\nAw you poor poor baby! You put up a capital commitment to a system whereby you would receive rewards for a extended time that was clearly expressed and your not happy with the decision you made?\n\nSuch hell! So much poors!\n\nPretty sure getting paid isnt hell drama queen.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9e4kcf",
                                    "author": "ExistentialStench",
                                    "score": 2,
                                    "created_utc": 1653090630.0,
                                    "response": "You sound simple",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9c8tkz",
                                    "author": "rhetorical_twix",
                                    "score": -1,
                                    "created_utc": 1653060384.0,
                                    "response": "Coinbase dropped down the \"reward\" (a.k.a. interest) significantly once the incoming stakes leveled off. We were locked up so couldn't do anything about that. Now it has declared that staked coins are its property and people who have staked it are unsecured creditors so that if it goes bankrupt or something it can use our staked coins to pay off its debt. Again, this is after we got locked up, so we're basically trapped in this evolving (deteriorating) Coinbase situation. It's starting to look like a predatory & unethical situation & I would like to transfer my stake to another, more ethical company with more history in the crypto community.\n\n> Aw you poor poor baby! \n\n> Such hell! So much poors!\n\n> Pretty sure getting paid isnt hell drama queen.\n\n?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9cdm9l",
                                            "author": "Sal_T_Nuts",
                                            "score": 6,
                                            "created_utc": 1653062278.0,
                                            "response": "Dropping APY is part of Ethereum's design: more people staking -> lesser rewards. Everybody that wants to stake ETH knows that it will be locked up, that rewards will fall and that they will unlock 6 months after the merge. This has nothing to do with Coinbase and everything with you not reading the full disclaimers. The amount of people staking is shooting up in anticipation of the merge so yes APY is declining faster.\n\nCoinbase has to lower because staking rewards are declining. They are not a charity, you choose to accept their cut of the deal and now you are mad that they are not enabling withdrawals. They simply can't!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ckans",
                                                    "author": "PM_ME_ONE_EYED_CATS",
                                                    "score": 5,
                                                    "created_utc": 1653064889.0,
                                                    "response": "I was elected to lead, not read!!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9e5gcb",
                                            "author": "Perleflamme",
                                            "score": 0,
                                            "created_utc": 1653091094.0,
                                            "response": ">Coinbase dropped down the \"reward\"\n\nThey didn't. You're just showing you don't understand at all what's happening and what you did when staking.\n\nCoinbase is giving to you exactly as much as before, taking from it exactly the same percentage as before. It's just the Ethereum reward that is self-regulated and, as such, dropping as more people stake. This is completely independent from Coinbase.\n\nCoinbase isn't a very nice player, but you are either a FUDer or a completely ignorant market actor. Next time, DYOR, properly, because not doing so properly is entirely on you.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9e8qgp",
                                                    "author": "rhetorical_twix",
                                                    "score": 0,
                                                    "created_utc": 1653092834.0,
                                                    "response": "Your attitude is not helpful. It's just the kind of response one would get from people when you have fallen for a sleazy scam. \n\nThis whole set of Coinbase b.s. is really turning out to be consistent with an environment consistent with what some people who call crypto a scam have been saying. \n\nI believe there are people who are not scammers in the community, but you wouldn't know it from the responses in this thread. Seriously, you're not helping with your trashy comment. You clearly didn't read my issues with coinbase because a lot of people have issues with it. \n\n/disabling inbox replies and blocking",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ea0vu",
                                                            "author": "Perleflamme",
                                                            "score": 1,
                                                            "created_utc": 1653093526.0,
                                                            "response": ">Your attitude is not helpful. It's just the kind of response one would get from people when you have fallen for a sleazy scam.\n\nAbsolutely not. Read again.\n\nI clearly said Coinbase isn't a very nice player, not that they're scammers. They aren't scammers. It's just you who didn't DYOR properly and are spreading misinformation about them and blaming others for your own misunderstanding of the situation you've put yourself in.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9e497v",
                            "author": "nvnehi",
                            "score": 0,
                            "created_utc": 1653090471.0,
                            "response": "Of course it will.\n\nThe merge is priced in. People will capitalize on latecomers, and FOMOers, and there will a steep sell off, and those people will rebuy at a lower amount… unless they don’t, because inflation, and interest rates are rising to an unsettling amount in which case they will hold on to a more stable asset or invest in a business.\n\nPrices always jump high with big changes before falling to a level lower than prior to the change because people always try to time the market.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9dt0s6",
                            "author": "Kike328",
                            "score": 1,
                            "created_utc": 1653084870.0,
                            "response": "You knew this could happen",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9c3j5w",
                    "author": "pico020",
                    "score": 7,
                    "created_utc": 1653058267.0,
                    "response": "Fuck it, I'll buy some more",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9coh0u",
                    "author": "Icy_Juice_8521",
                    "score": 2,
                    "created_utc": 1653066540.0,
                    "response": "With Ethereum nothing ever goes to plan. These guys are so smart but can't keeps dates and plans on track to save their lives",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cv3mt",
                    "author": "wsbfan1123",
                    "score": 2,
                    "created_utc": 1653069279.0,
                    "response": "Lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cva89",
                    "author": "fatedwanderer84",
                    "score": 2,
                    "created_utc": 1653069360.0,
                    "response": "Be still my beating heart.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d2ukd",
                    "author": "billionairelass",
                    "score": 2,
                    "created_utc": 1653072863.0,
                    "response": "Can't fecking wait to get my staked ethereum off coinbase 😑",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9djr1n",
                    "author": "Nathan-McAlpin",
                    "score": 2,
                    "created_utc": 1653080543.0,
                    "response": "No doubt now, def August, fer realz.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dnyxq",
                    "author": "franleplant",
                    "score": 2,
                    "created_utc": 1653082506.0,
                    "response": "Last year they said that Q1 2022 was the target, I don’t know what to think about this",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bgcjz",
                    "author": "STACKlNSATS",
                    "score": 51,
                    "created_utc": 1653047824.0,
                    "response": "I’ll let you in on the secret: Nothing is going as planned.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bhj1l",
                            "author": "namtaru_x",
                            "score": 230,
                            "created_utc": 1653048443.0,
                            "response": "I love this subreddit, because most people here actually have no idea about anything related to Ethereum.\n\nLast two shadow forks went perfect.\n\nEdit: ah, this is a troll account. And it has top comment. Says everything you need to know about the state of this subreddit.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bli7d",
                                    "author": "Nonocoiner",
                                    "score": 40,
                                    "created_utc": 1653050463.0,
                                    "response": "I think this is very bullish for ETH!\n\nAll these ignorant posts indicate that the upcoming supply shock, and the PoSitive narrative of the switch to proof of stake, are not priced in yet.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bu93n",
                                            "author": "Gravy_Vampire",
                                            "score": 25,
                                            "created_utc": 1653054447.0,
                                            "response": "This. Thank you STACKINSATS for using your lies to keep my buys low",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9cdc7z",
                                                    "author": "cosmic-comedy",
                                                    "score": 7,
                                                    "created_utc": 1653062167.0,
                                                    "response": "Yup, thanks /u/stackinsats for causing information asymmetry for us folks who are in the know. Gives us better prices to buy into before the merge kicks in.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9e0ts0",
                                            "author": "durtywaffle",
                                            "score": 2,
                                            "created_utc": 1653088717.0,
                                            "response": "I'm trying to understand, since gas fees won't change until sharding, how does POS change the fundamental value or create buy pressure for eth?  Is it just because miners aren't selling anymore to pay for electricity?   Does the merge not introduce tail risk that needs to be priced in?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9e4bae",
                                            "author": "Vinsu_",
                                            "score": 2,
                                            "created_utc": 1653090501.0,
                                            "response": "Global markets are shit, love or hate eth, it's a speculative asset and it's going to suffer in a risk on environment. Nothing is priced in, or going to be, for a minute",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9cp04e",
                                    "author": "JCmollyrock420",
                                    "score": 5,
                                    "created_utc": 1653066754.0,
                                    "response": "r/Ethereum upvoting bitcoin maxis concern trolling, it really doesn’t get more classic.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9bmsiz",
                                    "author": "FaceDeer",
                                    "score": 27,
                                    "created_utc": 1653051084.0,
                                    "response": "It's weird how many comments in threads on this subreddit are just people dumping on Ethereum, often ignorantly. I welcome debate and criticism but there has to be something meaningful to it for it to be interesting.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9brtod",
                                            "author": "AimHighTimeFlies",
                                            "score": 24,
                                            "created_utc": 1653053391.0,
                                            "response": "I think most active participants in this sub are trolls from other crypto spaces. People who actually follow/know Ethereum for the most part just lurk here.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9bsftu",
                                                    "author": "FaceDeer",
                                                    "score": 9,
                                                    "created_utc": 1653053661.0,
                                                    "response": "I haven't got numbers to back it up, of course, just anecdotal recollections, but it didn't used to be that way. I wonder if the non-trolls went somewhere else or if the trolls simply became more numerous and vocal.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9btdxi",
                                                            "author": "namtaru_x",
                                                            "score": 6,
                                                            "created_utc": 1653054071.0,
                                                            "response": "Yes, we went somewhere else.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9bvdsq",
                                                            "author": "truesoul42",
                                                            "score": 3,
                                                            "created_utc": 1653054931.0,
                                                            "response": "I mostly moved to discord. Not as active on Ethereum reddits anymore.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9c35rn",
                                                                    "author": "Screwshank",
                                                                    "score": -7,
                                                                    "created_utc": 1653058121.0,
                                                                    "response": "Discord is CCP spyware in case you're out of the loop.\n\nConsidering Tencents stake in reddit I wouldn't doubt this site is sending information as well.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9di5pf",
                                                            "author": "sargontheforgotten",
                                                            "score": 3,
                                                            "created_utc": 1653079818.0,
                                                            "response": "We went to r/ethfinance check out the daily thread there.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9dn361",
                                                            "author": "baerbelleksa",
                                                            "score": 1,
                                                            "created_utc": 1653082093.0,
                                                            "response": "Yeah as a non-troll, when quality of this sub declined I began to check it less and less.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9dr720",
                                                                    "author": "cosmic-comedy",
                                                                    "score": 1,
                                                                    "created_utc": 1653084003.0,
                                                                    "response": "we're over in /r/ethfinance if you're interested",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9dr33u",
                                                            "author": "cosmic-comedy",
                                                            "score": 1,
                                                            "created_utc": 1653083951.0,
                                                            "response": "we are definitely in another subreddit, and some have also gone to Twitter",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9dwxzq",
                                                            "author": "JCmollyrock420",
                                                            "score": 1,
                                                            "created_utc": 1653086779.0,
                                                            "response": "This isn’t a very high density information sub for Ethereum. Check out r/ethfinance if you don’t already know about it.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9dxg2v",
                                                                    "author": "FaceDeer",
                                                                    "score": 2,
                                                                    "created_utc": 1653087027.0,
                                                                    "response": "I knew about it, but only years ago as the place to send the annoying price discussion people to keep this sub clear of that. Tables have turned I guess.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9dxva2",
                                                                            "author": "JCmollyrock420",
                                                                            "score": 1,
                                                                            "created_utc": 1653087235.0,
                                                                            "response": "The daily thread has some of the smartest people in the space commenting there. If you ever have any questions, people are always willing to answer them promptly. 10x better than this sub.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9ecoay",
                                                            "author": "Perleflamme",
                                                            "score": 1,
                                                            "created_utc": 1653094949.0,
                                                            "response": "Same. I went away for some time and, when I come back, there were trolls everywhere. \n\nI don't know what happened. But it seems pretty obvious the Ethereum network is now the focus of several people who're fearing it for its potential. And I'm not sure they're only BTC maxis. We also regularly see some crypto haters, here.\n\nMaybe it's that they know about the lack of control and hate it for the sake of it?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9c1anh",
                                                    "author": "pale_blue_dots",
                                                    "score": 3,
                                                    "created_utc": 1653057377.0,
                                                    "response": "Definitely noticed that, too.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9di1da",
                                                    "author": "sargontheforgotten",
                                                    "score": 2,
                                                    "created_utc": 1653079764.0,
                                                    "response": "People who know Ethereum are in r/ethfinance daily",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9d9g78",
                                            "author": "clutchtho",
                                            "score": -3,
                                            "created_utc": 1653075897.0,
                                            "response": "we were promised this in 2018 ser",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9d9p88",
                                                    "author": "FaceDeer",
                                                    "score": 3,
                                                    "created_utc": 1653076006.0,
                                                    "response": "Show me.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9dd38m",
                                                            "author": "clutchtho",
                                                            "score": -4,
                                                            "created_utc": 1653077519.0,
                                                            "response": "Vitalik was talking about switching to PoS back in 2015. Multiple sources talk about staking back in 2018. EIP-900 introduced a staking interface back in early 2018. \n\nHere's one source.\nhttps://www.reddit.com/r/ethereum/comments/aavujo/eth_20_staking_reward_cheatsheet/",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9dez2a",
                                                                    "author": "FaceDeer",
                                                                    "score": 5,
                                                                    "created_utc": 1653078372.0,
                                                                    "response": "None of which is a *promise*. Even now, the August prediction is just that - a prediction.\n\nPeople keep *imagining* that they were promised things. But it's always been clear to those of us paying attention that the process of switching to PoS has been a long series of experiments and new developments that have resulted in new discoveries and changes to the plans. That's not something you can firmly schedule ahead of time.\n\nSo yes, people dumping on Ethereum for not meeting some imaginary deadline are being ignorant. Ignorant of what was actually promised and ignorant of how software development projects like this proceed.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9diygu",
                                                                            "author": "clutchtho",
                                                                            "score": -7,
                                                                            "created_utc": 1653080182.0,
                                                                            "response": "Whatever you gotta tell yourself to sleep at night bro",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9ect1h",
                                                                                    "author": "Perleflamme",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653095019.0,
                                                                                    "response": "Not an argument. \n\nSame to you, I guess. Coping up with reality must be hard, sometimes. You'll get used to it, don't worry.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9bsu0i",
                                    "author": "DaveLLD",
                                    "score": 6,
                                    "created_utc": 1653053832.0,
                                    "response": "I mine Eth, and I'm still hearing people in those groups saying \"They've been saying this for years, PoS is not happening\".\n\nIt's crazy copeium / hopeium I guess.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bzxsg",
                                            "author": "domotheus",
                                            "score": 17,
                                            "created_utc": 1653056826.0,
                                            "response": "then once it happens they'll be like \"wtf they literally pulled the rugs on us poor miners without any kind of warning whatsoever\"",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9cvv78",
                                                    "author": "c0horst",
                                                    "score": -1,
                                                    "created_utc": 1653069622.0,
                                                    "response": "Well, we had fair warning, and knew it was happening, but it still feels like they're saying \"thanks for securing our network, now fuck off we don't need you.\"",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9d1a3h",
                                                            "author": "cosmic-comedy",
                                                            "score": 2,
                                                            "created_utc": 1653072119.0,
                                                            "response": "What else do you expect? \"Here, have extra ETH for helping us mine! Hope to see you stake\"?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9ddn8u",
                                                                    "author": "iLuvRachetPussy",
                                                                    "score": -2,
                                                                    "created_utc": 1653077774.0,
                                                                    "response": "Tbh the fact that Ethereum burns ETH instead of paying miners rubs me the wrong way. Every time I pay a crazy fucking gas fee I'm literally taking my hard earned money and throwing it in a black hole. \n\nI really can't fuck with it. I actually have slowly been selling all my ETH to the point that I'm at like 1 ETH left now. ETH used to be my biggest bag but I really can't justify using it. \n\nThere are more critiques I have for it than high gas fees.. Ethereum had a first mover advantage and actually welcomed centralization in many aspects (think metamask and open sea). It has routinely done stuff to make the biggest holders richer and has proven that it's not immutable. \n\nThe fact that NFTs and FTs require smart contracts just makes for more attack vectors. The fact that dapps can use your signature to retroactively drain your wallet is crazy  to me.\n\nI do think it's a Blockchain full of holes and that's personally why  I have reduced my holdings to a fraction of what used to be.\n\nYou guys can downvote me to oblivion but the fundamentals are fundamentals.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9edzsf",
                                                                            "author": "Perleflamme",
                                                                            "score": 1,
                                                                            "created_utc": 1653095663.0,
                                                                            "response": ">Tbh the fact that Ethereum burns ETH instead of paying miners rubs me the wrong way.\n\nIt's to prevent malevolent miners from exploiting a vulnerability.\n\nAs a benevolent miner, you're part of the network and need, just the same as everyone else, to be protected from vulnerabilities like this.\n\n>Ethereum had a first mover advantage and actually welcomed centralization in many aspects (think metamask and open sea).\n\nIt's not centralization. No one is preventing anyone else from using other tools. They're not centralizing: they're centralized tools, but can't prevent Ethereum from being decentralized.\n\nOf course, these tools are welcomed. A trustless network can't do anything but welcome everyone anyway.\n\n>It has routinely done stuff to make the biggest holders richer and has proven that it's not immutable.\n\nWrong. It's immutable. If not, please show me where has a block been mutated. Give a block number where there are two different block states. Clearly, you don't know what you're talking about.\n\n>You guys can downvote me to oblivion but the fundamentals are fundamentals.\n\nUnbacked claim. Fundamentals are fundamentals. What you've said is just misinformation. Not surprising people downvote you for it.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9d2p1t",
                                                                    "author": "c0horst",
                                                                    "score": -2,
                                                                    "created_utc": 1653072789.0,
                                                                    "response": "There's nothing they really can do at this point really, they've gone too far to back out now. Personally I would have rather they adopted a different strategy for moving to proof of stake, moving to a PoW/PoS Hybrid model and slowly phasing out proof of work, rather than dropping them completely all at once. \n\nYou can say, \"You should have sold all your graphics cards before the merge, you knew it was coming!\" but that's not really a fair argument, SOMEONE has to mine ETH right up until the merge. If everyone followed that advice the network hashrate would plummet and anyone who wanted could execute a 51% attack against it. Slowly phasing out miners would have been a fair and far more graceful way of approaching this.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9dlevu",
                                                                            "author": "datawarrior123",
                                                                            "score": 1,
                                                                            "created_utc": 1653081317.0,
                                                                            "response": "> its slow only, they have been predicting proof of stake for years, i start following ethereum since last 5 years and consistently hearing about POS is coming since then, if 5 years is not slow enough, i do not know what would be ?",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9edfh3",
                                                            "author": "Perleflamme",
                                                            "score": 1,
                                                            "created_utc": 1653095354.0,
                                                            "response": ">\"thanks for securing our network, now fuck off we don't need you\"\n\nThank you for securing our network, here is your self-regulated pay for it. \n\nNow, if you're interesting in continuing to secure the network and still be paid for it, there's a new way to do it: all these ETH you mined at a discount can now help you do the same as before, but without your huge electricity bills. \n\nYou welcome for the upgrade of your validator activities. Stay safe and stay tuned for new upgrades. \n\nAn ETH community member",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9dhvfa",
                                            "author": "phigo50",
                                            "score": 1,
                                            "created_utc": 1653079690.0,
                                            "response": "I saw someone say the other day that the devs \"don't even know how the merge is going to happen\". It's astonishing the lengths (or the depths, I guess) they're going to put their heads in the sand.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9djcys",
                                                    "author": "DaveLLD",
                                                    "score": 2,
                                                    "created_utc": 1653080369.0,
                                                    "response": "Cryptobros like that are why crypto has such a bad name.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9d9h5u",
                                            "author": "clutchtho",
                                            "score": -1,
                                            "created_utc": 1653075909.0,
                                            "response": "we were promised this in 2018 ser",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9bya59",
                                    "author": "Attygalle",
                                    "score": 0,
                                    "created_utc": 1653056149.0,
                                    "response": ">Says everything you need to know about the state of this subreddit.\n\nI'm not an active trader but I have considered again and again to take a small portion and go daytrading with it. The strategy would be simple - do the opposing thing of what this subreddit says. I'm pretty sure it would be profitable in the long run.\n\nTo be honest this is not just an ethereum thing. I don't follow wallstreetbets but I'm pretty sure the same strategy would go over there. And the two other crypto subs I follow, exactly the same story.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9d9gga",
                                    "author": "clutchtho",
                                    "score": 0,
                                    "created_utc": 1653075900.0,
                                    "response": "we were promised this in 2018 ser",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9dlpq0",
                                            "author": "datawarrior123",
                                            "score": 2,
                                            "created_utc": 1653081457.0,
                                            "response": "agreed, Vitalik himself acknowledged the failure to deliver POS in 2018 was one of the biggest setback in one of the  tweet stroms",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9e9akt",
                            "author": "flyfree256",
                            "score": 2,
                            "created_utc": 1653093139.0,
                            "response": "If you think it'll be delayed go [visit Polymarket](https://polymarket.com/market-group/ethereum-merge-pos) and quadruple all your money easily.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9e1tzo",
                            "author": "FreeFactoid",
                            "score": 1,
                            "created_utc": 1653089224.0,
                            "response": "Ratio'd lol",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9cim4h",
                            "author": "rqnyc",
                            "score": -7,
                            "created_utc": 1653064235.0,
                            "response": "Sell ETH now. I will worship BTC for not even trying",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9d1we9",
                            "author": "UnamazingHero",
                            "score": -8,
                            "created_utc": 1653072412.0,
                            "response": "The merge will happen in August 2058",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bga8j",
                    "author": "Blockchain_Benny",
                    "score": 2,
                    "created_utc": 1653047788.0,
                    "response": "Hold my beer",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c09ka",
                    "author": "substantialmission9",
                    "score": 3,
                    "created_utc": 1653056959.0,
                    "response": "Still an ETH newb here. When the merge happens will my current ETH be the ETH 2.0?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9c4j89",
                            "author": "mpbh",
                            "score": 13,
                            "created_utc": 1653058670.0,
                            "response": "There is no Eth 2.0",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9d9wxf",
                                    "author": "cohonan",
                                    "score": 2,
                                    "created_utc": 1653076099.0,
                                    "response": "Yup, this process for updating the protocol through a published EIP “Ethereum Improvement Proposal (or Plan or something)” is fundamentally no different than anything before. \n\nIt’s just a particularly substantive change that it has special branding that they are now trying to walk back because of the confusion.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9ce4l0",
                            "author": "WSox1235",
                            "score": 6,
                            "created_utc": 1653062475.0,
                            "response": "Yes, it transfers automatically",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9cit80",
                    "author": "Ok_Economics1981",
                    "score": 4,
                    "created_utc": 1653064312.0,
                    "response": "sure, *in august*\n\n**doesnt matters in which year you read this.**",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cn4qx",
                    "author": "Warm-Top-4816",
                    "score": 2,
                    "created_utc": 1653066007.0,
                    "response": "Lol, how many times have we hear \" if everything goes as planned\". Still have all my ETH staked though, been playing p2e like shiryo since I can't use it now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d4eci",
                    "author": "notdsylexic",
                    "score": 1,
                    "created_utc": 1653073595.0,
                    "response": "There is no way it’s launching in August. If someone wants to do the remind me thing on me, feel free too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bq8r0",
                    "author": "silvester2ish",
                    "score": -1,
                    "created_utc": 1653052693.0,
                    "response": "August? Fine. But which year???",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bs79n",
                            "author": "Jjabrahams567",
                            "score": 7,
                            "created_utc": 1653053558.0,
                            "response": "I was told last year",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9btr6b",
                    "author": "trychomie",
                    "score": -1,
                    "created_utc": 1653054232.0,
                    "response": "August …2024*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c6xuy",
                    "author": "daxtaslapp",
                    "score": -1,
                    "created_utc": 1653059636.0,
                    "response": "August 2024",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9d378e",
                            "author": "theSeanage",
                            "score": 2,
                            "created_utc": 1653073028.0,
                            "response": "They didn’t specify the year. So good chance that may be the date 😂",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9cz36y",
                    "author": "saucedonkey",
                    "score": 1,
                    "created_utc": 1653071097.0,
                    "response": "NB4 date gets moved back.    \n\n\nI'm optimistic and scooping up as much Ethereum as I can get my paws on.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c4ky1",
                    "author": "paper_bull",
                    "score": -2,
                    "created_utc": 1653058689.0,
                    "response": "Narrator: “it didn’t”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cg2um",
                    "author": "-spooky_ghost",
                    "score": -2,
                    "created_utc": 1653063245.0,
                    "response": "Cool so merge is in a couple of years then 👍",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9chh27",
                    "author": "mmisfittt",
                    "score": -2,
                    "created_utc": 1653063790.0,
                    "response": "Narrator: It didn’t go as planned.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cjygk",
                    "author": "TheWhizBro",
                    "score": -1,
                    "created_utc": 1653064759.0,
                    "response": "*yawn* doubt it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bka1x",
                    "author": "Bushmage",
                    "score": -5,
                    "created_utc": 1653049859.0,
                    "response": "Jesse what the hell are you talking about",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bkki3",
                    "author": "pard0nme",
                    "score": -5,
                    "created_utc": 1653050005.0,
                    "response": "If everything goes to plan .. . Ok...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bgf3s",
                    "author": "NorbeeNorbee",
                    "score": -7,
                    "created_utc": 1653047862.0,
                    "response": "Sounds like any other tuber that predicts btc will be 100bazilions in 1month",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cfh4c",
                    "author": "steven2410",
                    "score": 0,
                    "created_utc": 1653063007.0,
                    "response": "If i could, i’ll bet my money that ETH not coming anytime this year.  Too\nMany moving parts, too many pointa of failure",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9d3xt1",
                            "author": "KaiSosceles",
                            "score": 7,
                            "created_utc": 1653073379.0,
                            "response": "You absolutely can bet on this.\n\nhttps://polymarket.com/market-group/ethereum-merge-pos\n\nPut your money where your mouth is.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9d7g05",
                            "author": "ItsAConspiracy",
                            "score": 3,
                            "created_utc": 1653075008.0,
                            "response": "You could make that same point at any time up to the day before the merge, but that doesn't mean it will never happen.\n\nThey've been testing this over and over. There are 25 combinations of the five execution clients and five staking clients, and in their last test all 25 combinations worked without errors. \n\nAt some point you just have to accept that you've done everything you can, and ship the sucker.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9cznsj",
                    "author": "Alternative_Ad_1829",
                    "score": -2,
                    "created_utc": 1653071364.0,
                    "response": "😂😂😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bjp5v",
                    "author": "T1Pimp",
                    "score": -15,
                    "created_utc": 1653049565.0,
                    "response": "Haven't they been saying this since 2018?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bztdh",
                            "author": "domotheus",
                            "score": 6,
                            "created_utc": 1653056776.0,
                            "response": "Unfathomable to me that there are people browsing /r/ethereum who think the state of Ethereum PoS is exactly the same as it was in 2018 lol",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9c0gts",
                                    "author": "T1Pimp",
                                    "score": -8,
                                    "created_utc": 1653057042.0,
                                    "response": "LOL dude I was mining late 2016/early 2017. I'm fully aware. Doesn't make it not funny given the drumbeat of similar statements hasn't changed since then though. \n\nDon't be so vested that you can't take a joke.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9d3cak",
                                            "author": "incognito_red",
                                            "score": 5,
                                            "created_utc": 1653073095.0,
                                            "response": ">LOL dude I was mining late 2016/early 2017\n\nhow the fuck does that matter when you still sound just as ignorant as people who bought the top and are salty that the price is down",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9da9cs",
                                                    "author": "T1Pimp",
                                                    "score": -1,
                                                    "created_utc": 1653076252.0,
                                                    "response": "Aww your feelings got hurt? So sorry. 🖕",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9bkdy1",
                            "author": "STACKlNSATS",
                            "score": -5,
                            "created_utc": 1653049913.0,
                            "response": "Exactly why ‘if everything goes to plan’ is in quotes",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bmdcw",
                                    "author": "T1Pimp",
                                    "score": -5,
                                    "created_utc": 1653050882.0,
                                    "response": "Right? Long time eth miner and I really think Vitalik is crazy smart and truly thoughtful when it comes to this entire space and yet... I wish they'd just not even make statements like this anymore.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9cfhge",
                    "author": "thsonehurts",
                    "score": -3,
                    "created_utc": 1653063011.0,
                    "response": "Honestly the merge will probably never happen.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cq4ka",
                    "author": "Actually_A_Retard",
                    "score": -5,
                    "created_utc": 1653067209.0,
                    "response": "Whatever just hurry up so I can unstake and dump these bags on some other idiot. I just want my money back.\n\nYou guys are mad because it’s the truth. Have fun huffing copium.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bmdnp",
                    "author": "AlertElderberry",
                    "score": -5,
                    "created_utc": 1653050886.0,
                    "response": "Sure it will",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9creuq",
                    "author": "Salt_Adhesiveness161",
                    "score": 0,
                    "created_utc": 1653067731.0,
                    "response": "LMFAO",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d7tds",
                    "author": "letsworshipizeit",
                    "score": 0,
                    "created_utc": 1653075176.0,
                    "response": "…of 2027",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9beq0a",
                    "author": "Mallardshead",
                    "score": -27,
                    "created_utc": 1653046931.0,
                    "response": "Should be a fantastic sell-the-news event. Still have my eyes on $800 after that, the Beacon Chain unlock, and regulation. Buterin probably steps away following the merge as well. End of that era, but the shitcoinery lives on.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bfr4d",
                            "author": "asc9ybUnb3dmB7ZW",
                            "score": 7,
                            "created_utc": 1653047500.0,
                            "response": "RemindMe! One Year",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bfugk",
                                    "author": "RemindMeBot",
                                    "score": 1,
                                    "created_utc": 1653047550.0,
                                    "response": "I will be messaging you in 1 year on [**2023-05-20 11:51:40 UTC**](http://www.wolframalpha.com/input/?i=2023-05-20%2011:51:40%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/ethereum/comments/uts8xx/ethereum_devs_tip_the_merge_will_occur_in_august/i9bfr4d/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fethereum%2Fcomments%2Futs8xx%2Fethereum_devs_tip_the_merge_will_occur_in_august%2Fi9bfr4d%2F%5D%0A%0ARemindMe%21%202023-05-20%2011%3A51%3A40%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20uts8xx)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9bmwta",
                                    "author": "Simple_Yam",
                                    "score": 1,
                                    "created_utc": 1653051143.0,
                                    "response": "RemindMe! One Year",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9bfq3g",
                            "author": "RepulsiveBurrito",
                            "score": 11,
                            "created_utc": 1653047484.0,
                            "response": "Lol why would he leave if there’s more on the pipeline",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bg8is",
                                    "author": "Mallardshead",
                                    "score": -16,
                                    "created_utc": 1653047762.0,
                                    "response": "Why wouldn't he? The guy's grown up now. Eth is changing. There are other things he wants to do. Regulation could be worse if he's actively involved. We just saw the UniSwap devs all get sued in a class action, and there are rumors the merge was August branded because there was a firm looking for lead plaintiffs to sue ETH heads for the beacon chain lockup and delayed merge. That's the trouble with centralized shit though. Terra Luna probably also put some fear into Vitalik. Too much responsibility as a centralized figure. Perfect exit.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9di1ij",
                            "author": "phigo50",
                            "score": 2,
                            "created_utc": 1653079766.0,
                            "response": "Wow, your FUD has evolved. I was wondering what the new line would be after the merge has actually happened.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ecto5",
                                    "author": "Mallardshead",
                                    "score": 1,
                                    "created_utc": 1653095029.0,
                                    "response": "😁",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9bnink",
                            "author": "Simple_Yam",
                            "score": 5,
                            "created_utc": 1653051437.0,
                            "response": "The only era ending is Bitcoin having a higher marketcap than Ethereum lol\n\nA shiny rock vs the settlement layer of the internet of value.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bs78r",
                                    "author": "Mallardshead",
                                    "score": -6,
                                    "created_utc": 1653053558.0,
                                    "response": "That dominance chart doesn't look good for ETH. Looks like clear sailing back to 75% for BTC, and if stablecoins keep growing at the pace they are, I'm not sure ETH can even remain in the #2 spot. A reverse flippening. Shitcoin on shitcoin violence. A shitening. \n\n$800 is where you'll sell. I'll see you on Vitalik's Twitter hearting bailout replies.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bttha",
                                            "author": "Simple_Yam",
                                            "score": 7,
                                            "created_utc": 1653054259.0,
                                            "response": "How long do you think you can keep shilling btc to people until they realize there's nothing useful on it, 90% of the dev focus is on Ethereum and its dozens of L2s, the network's security is unsustainable and expensive which won't be fixed because the community can't agree on anything and its \"scaling solution\" that was supposed to be the killer of all altcoins since 2017 does not work properly unless managed by a centralized payments processor like cashapp?\n\nEthereum is the apex store of value that every family and institution will own, an asset backed by the base of all financial operations, with negative inflation and the ability to earn yield directly on it in a trustless manner all while securing the most valuable network on Earth.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9bvg8e",
                                                    "author": "Mallardshead",
                                                    "score": 0,
                                                    "created_utc": 1653054960.0,
                                                    "response": "Yet I run a LN node. It works flawlessly. Yet the LN nodes and liquidity is growing. Somehow LN mobile apps are near the top of all downloaded mobile apps every month. Countries, exchanges, businesses, looking to integrate. Something is certainly at odds with what you're saying. Your shitcoin doesn't have any legitimate scaling. It's a clusterfuck of dapps, bridges, and sidechains all with their own speculative tokens attached. It's a clown show that's so ridiculous even hard wallets get confused sometimes. ETH is a gas token. That gas token is used to to ferry centralized dapps. Wether it's the recent UniSwap class action lawsuit, Metamask blocking tx's, Infura blacking out entire countries, OpenSea seizing property, or Pancake Swap proudly banning \"Russian Invaders\", you'll make excuse after excuse after excuse on why the network is decentralized web3, ultrasound money, 2.0, DeFi, and metaverse...all VC marketing words. Centralized vaporware bullshit, so pathetic that nothing inside the network has established itself as money. Thus the 85% of network volume which comes from stablecoins.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9bfwff",
                            "author": "frank__costello",
                            "score": 1,
                            "created_utc": 1653047580.0,
                            "response": "EIP-1559 absolutely wasn't a \"sell the news event\", ETH rocketed after that update\n\nIt could go either way, but my feeling is that ETH is pricing-in some risk right now. If the merge is successful, the price should compensate for decreased risk.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9bwpa7",
                            "author": "Bigchrome",
                            "score": -1,
                            "created_utc": 1653055489.0,
                            "response": "Most interesting post on this thread getting downvoted. \n\nI'm deep in eth for the potential upside, but I tend to agree with you.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9by9wp",
                                    "author": "Mallardshead",
                                    "score": -1,
                                    "created_utc": 1653056146.0,
                                    "response": "Yes. I'd certainly advise an exit to bitcoin before the dominance chart goes back to 70%+ \n\nETH is in a world of trouble with regs, stablecoins, and issuance with PoS. That burn rate will not go as planned.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bzr6o",
                                            "author": "Bigchrome",
                                            "score": 0,
                                            "created_utc": 1653056751.0,
                                            "response": "I'm still optimistic, but appropriately hedged with Bitcoin for these reasons.\n\nThe pattern I see is that coins with \"tech\" fall victim to tech problems and tech narratives, and either nothing is ever good enough, or the best tech doesn't even matter anyway.\n\nSo the cynic in me holds a few BTC, and the optimist in me has a few nodes worth of ETH",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9c41p3",
                    "author": "laserkermit",
                    "score": 1,
                    "created_utc": 1653058473.0,
                    "response": "u/savevideo",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d9cbz",
                    "author": "clutchtho",
                    "score": 1,
                    "created_utc": 1653075850.0,
                    "response": "better 4 years late than never",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d9nr8",
                    "author": "solidepic",
                    "score": 1,
                    "created_utc": 1653075988.0,
                    "response": "This will be a most interesting time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9djlz5",
                    "author": "nousemercenary",
                    "score": 1,
                    "created_utc": 1653080479.0,
                    "response": "OMG! Can't wait. This will help with the crypto market recovery.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dpb97",
                    "author": "Darwing",
                    "score": 1,
                    "created_utc": 1653083126.0,
                    "response": "People don’t realize that literally nothing major is going to change when the merge happens, they just ship to their own servers for centralization\n\nNot only that you won’t be able to take out your staked Eth for a long time which hopefully will keep the price from tanking",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dsad3",
                    "author": "DigStock",
                    "score": 1,
                    "created_utc": 1653084517.0,
                    "response": "Its too early to be bullish",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dtv65",
                    "author": "Grammar_Mafia",
                    "score": 1,
                    "created_utc": 1653085273.0,
                    "response": "Eli5 does merge mean eth 2.0?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dvuf0",
                    "author": "Semperton",
                    "score": 1,
                    "created_utc": 1653086238.0,
                    "response": "Im out of the loop here, what is merging?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dykyb",
                    "author": "DogShitBurrito",
                    "score": 1,
                    "created_utc": 1653087592.0,
                    "response": "SHITCOIN",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dywyo",
                    "author": "bag_of_oatmeal",
                    "score": 1,
                    "created_utc": 1653087753.0,
                    "response": "ETH finally merging with Algo?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9e0eic",
                    "author": "Perleflamme",
                    "score": 1,
                    "created_utc": 1653088497.0,
                    "response": "Hey, like last year, except that it was for the London hard fork.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9e0zxh",
                    "author": "punx926",
                    "score": 1,
                    "created_utc": 1653088802.0,
                    "response": "All the miners just mad lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9e1gkj",
                    "author": "TheGreatest34567",
                    "score": 1,
                    "created_utc": 1653089035.0,
                    "response": "When will ETH gas fees be less than 1$?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9e1noi",
                    "author": "LATABOM",
                    "score": 1,
                    "created_utc": 1653089134.0,
                    "response": "Just never forget these people are by definition grifters. The only reason Ether is worth anything is because they created positive feelings about what is essentially nothing among the unwashed masses.\n\nEverything is fine. Ether is teh future. Perfect time to buy. You are part of the community who knows the truth. This is the smart thing to do. Terra/Luna has nothing to do with this. Don't worry don't worry don't worry. Buy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9e4q40",
                    "author": "lopezmr22",
                    "score": 1,
                    "created_utc": 1653090712.0,
                    "response": "If",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9e823t",
                    "author": "FLMan-",
                    "score": 1,
                    "created_utc": 1653092473.0,
                    "response": "The morgue",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9e9esw",
                    "author": "lordytoo",
                    "score": 1,
                    "created_utc": 1653093201.0,
                    "response": "The merge will happen intime to start the next bullrun.\nYou can call me nostradamus 2022.\nYw",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bhm2u",
                    "author": "BlankEris",
                    "score": -9,
                    "created_utc": 1653048489.0,
                    "response": "lmao",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9brg4e",
                    "author": "PenisPumpPimp",
                    "score": -8,
                    "created_utc": 1653053225.0,
                    "response": "Lmao ok",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bkjev",
                    "author": "Nonocoiner",
                    "score": -4,
                    "created_utc": 1653049990.0,
                    "response": "**IF**",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9drvlu",
                            "author": "Nonocoiner",
                            "score": 1,
                            "created_utc": 1653084320.0,
                            "response": "Okay, I get where the downvotes come from, but my point is that saying that \"the merge **will** occur in August\" sets expectations way to high, and a big IF seems appropriate here.\n\nThere might be a good chance it will happen in august, but we'll still have to wait and see how the upcoming testnet upgrades go.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9c7n56",
                    "author": "cjwin1977",
                    "score": -6,
                    "created_utc": 1653059917.0,
                    "response": "So this group of people just decides when this major change happens?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cb3c7",
                            "author": "NN300ZX",
                            "score": 1,
                            "created_utc": 1653061280.0,
                            "response": "I believe, though I may be wrong, this group of people is designing the changes and implementing them in test nets, and they think it is on track to go to the main net around August. So in a way, yes, these people decide when the change happens, in that they decide when it is ready and won't fuck up everything.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9buk82",
                    "author": "MeringueDifferent773",
                    "score": -12,
                    "created_utc": 1653054579.0,
                    "response": "FUCK YALL MERGE BITCH IM DOWN BAD IN ETH",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9csz8h",
                    "author": "EnderWiII",
                    "score": 0,
                    "created_utc": 1653068372.0,
                    "response": "There were fewer people in that room than at some of the crypto happy hours I've seen",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}