{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uq7ill",
            "title": "Seeking advice & informative resources to convince my father, a professional stock trader, to invest in ETH",
            "url": "/r/ethtrader/comments/uq7crn/seeking_advice_informative_resources_to_convince/",
            "author": "yvesclover",
            "created_utc": 1652625691.0,
            "score": 3,
            "num_comments": 3,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8pcgel",
                    "author": "AESTHTK",
                    "score": 3,
                    "created_utc": 1652627653.0,
                    "response": "Listen to the most recent Bankless episode with Hal Press:\n\nhttp://podcast.banklesshq.com/betting-the-fund-on-the-merge-hal-press-north-rock-digital\n\nNot only does he make an extremely compelling argument for Ethereum as an investment, he uses traditional stock valuation concepts to argue the case - it’s extremely relevant to your exact situation.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqckp6",
            "title": "Layer 2 in 2022: Are You Ready for Rollups, Bridges, New Apps, Life With Ethereum 2.0, and Layer 3?",
            "url": "https://www.reddit.com/r/ethereum/comments/uqckp6/layer_2_in_2022_are_you_ready_for_rollups_bridges/",
            "author": "Theodora765",
            "created_utc": 1652640309.0,
            "score": 127,
            "num_comments": 17,
            "subreddit": "ethereum",
            "selftext": "We all recall this is a pivotal year for Ethereum layer 2 (L2) solutions so what happens over the coming months will be critical in making decentralized finance (DeFi) work better, faster, and more reliably for a far greater number of users.  \n\nLast year saw L2 solutions roll out with great promise, increasing the number of decentralized apps across verticals such as exchanges, marketplaces, wallets, bridges, and more. Yet the growing user base and total value locked on Ethereum L2 were eclipsed by alternative layer 1 blockchains emerging to fill the market gaps that persisted such as Ethereum’s scalability issues.\n\n   With multiple apps deployed across chains, we are now seeing increasing fragmentation that adds complexity for end-users and detracts from the ultimate goal of making DeFi accessible for all. We have seen chains like smartchain develop cheap, fast and highly efficient solutions which helps launching of projects like Cake, Minosis, Xvs etc even more accesible.  Ethereum creator Vitalik Buterin has claimed that (L2s or) “rollups are in the short and medium-term, and possibly in the long term, the only trustless scaling solution for Ethereum”. \n\n We have seen this start to play out, with the total value locked (TVL) in layer 2 protocols such as StarkNet, Arbitrum, and Boba Network growing from USD 50 million to a high of USD 7 billion.  I look forward to what follows, do you think the L2 will be a total success?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8qjcb3",
                    "author": "moneycashdane",
                    "score": 8,
                    "created_utc": 1652646502.0,
                    "response": "#L222",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qbubh",
                    "author": "1moreOz",
                    "score": 52,
                    "created_utc": 1652643183.0,
                    "response": "A post about L2 not mentioning loopring or matic, interesting",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qg3pe",
                            "author": "frank__costello",
                            "score": 17,
                            "created_utc": 1652645070.0,
                            "response": "Don't worry, the shills will take care of it in the comments",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qljd6",
                                    "author": "Farge43",
                                    "score": 7,
                                    "created_utc": 1652647455.0,
                                    "response": "I know those are the popular ones. But is the hate for them purely due to people shilling because they got in at good entries and won’t stop talking about it? Or is there legitimate reason to not agree with one or both of the projects? \n\nIf so why? And also if so (or regardless) which are you intrigued by?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8qnub7",
                                            "author": "domotheus",
                                            "score": 9,
                                            "created_utc": 1652648438.0,
                                            "response": "Well I can't speak for my boy Frank, but for me it's slightly less annoying since Loopring is still a part of the overall ethereum ecosystem, and pays L1 for its security etc. So at least Loopring is ethereum-aligned and doesn't pretend it's gonna kill it. \n\nWhat *is* annoying however is the usual hype from crypto bros who barely understand what they're shilling, they just want line to go up. They show up whenever rollups are being discussed, and it's usually irrelevant as Loopring is still an application-specific rollup which doesn't help the guy trying to do the fun DeFi stuff beyond just trading coins. This 100% would not happen if Loopring didn't have a token and used ETH for its fees, like Arbitrum and Optimism. \n\nI understand they're working on a zkEVM, but until they deliver, Loopring doesn't deserve to be brought up all the time. Partnerships and what not, sure, that's cool and good for Loopring, but that's very rarely what the discussion is actually about when someone brings up LRC. It's just vague claims of it being the future of everything when there's EVM-compatible solutions working today.\n\nBut yes, nothing against Loopring per se. If they do deliver on a zkEVM then that'll actually be super cool and *then* it'll be worth to bring it up when people complain about gas fees being too expensive to play around with dapps, and I'll most likely bring it up myself as well.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8qneoi",
                                            "author": "frank__costello",
                                            "score": 11,
                                            "created_utc": 1652648249.0,
                                            "response": "Mind you, I don't hate the projects, just the people who mindlessly shill them.\n\nThe hate comes from the fact that they're lower-tier projects. Loopring is an application-specific rollup, and while they've announced work on a general-purpose rollup, they've shown no significant progress. Polygon has acquired a number of companies building rollups, but again, no firm progress.\n\nMeanwhile:\n\n* Arbitrum has been running for almost a year and has tons of usage\n* Optimism has also been running for a while, and is chasing Arbitrum's lead\n* StarkNet has been in mainnet-beta for months, the bridge went live last week, and we'll start seeing usage soon\n* ZKSync has a testnet for their V2 running now, so mainnet should be soon\n* Aztec has been running in production for over a year, mind you not a general-purpose rollup, but a fully private rollup is pretty cool by itself and will compete with projects like Monero and ZCash\n\nThe one thing that none of those projects have (yet) is a token. So shills will keep pumping LRC and MATIC and ignoring the most promising projects",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8qecz0",
                            "author": "biain",
                            "score": -12,
                            "created_utc": 1652644300.0,
                            "response": "Jesus get a grip. There's more than one Layer 2 and not every mention of layer 2 has to be an opportunity to pump loopring.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qes6b",
                                    "author": "1moreOz",
                                    "score": 7,
                                    "created_utc": 1652644488.0,
                                    "response": "Are you, offended? Lol i didnt say it was good or bad, i said it was interesting…",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8qbo97",
                    "author": "frank__costello",
                    "score": 16,
                    "created_utc": 1652643108.0,
                    "response": "These posts are weird",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qh7m9",
                            "author": "notdsylexic",
                            "score": 9,
                            "created_utc": 1652645559.0,
                            "response": "It’s written like a blog post… not a discussion post.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qmukf",
                                    "author": "frank__costello",
                                    "score": 6,
                                    "created_utc": 1652648007.0,
                                    "response": "It's written like a bot",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8r1fk9",
                                            "author": "lostharbor",
                                            "score": 1,
                                            "created_utc": 1652654486.0,
                                            "response": "It is a bit. I’ve noticed this with the NFT sun. There are constant pushes for “new” “unique” projects and every single post and hype comments username ends in three numbers\n\nThe post history says it all. Someone did log on for a couple of comments but all the posts are regurgitated take downs.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8qzuoo",
                    "author": "hopeiumisdopium",
                    "score": 1,
                    "created_utc": 1652653744.0,
                    "response": "Loopring will have its day, be your own bank!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8r8q1e",
                    "author": "sven_adams",
                    "score": 1,
                    "created_utc": 1652658047.0,
                    "response": "When ETH 3.0",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8r1729",
                    "author": "Frenchiie",
                    "score": 0,
                    "created_utc": 1652654374.0,
                    "response": "sorry but ethe and defi don't go together.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}