{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v1f7ds",
            "title": "Best avenue for staking ETH with my financial situation? Advice very appreciated!",
            "url": "https://www.reddit.com/r/ethereum/comments/v1f7ds/best_avenue_for_staking_eth_with_my_financial/",
            "author": "Strechepants",
            "created_utc": 1653961422.0,
            "score": 3,
            "num_comments": 12,
            "subreddit": "ethereum",
            "selftext": "Hello Ethereum reddit!  I have small amount of funds that I would like to stake.  My question is: what would be the best place to stake ETH taking gas fees and Coinbase’s current promotion into consideration.  \n\nPlease understand:\n\n(1)I have no plans to sell the holdings at any point, only add funds\n(2) Security and peace of mind are a priority of high yield\n\nI have never sent ETH off exchange and I do not hold any ETH yet, so I am not familiar with how much gas fees actually are and don’t know how much to expect to pay in gas.  To my understanding, and please forgive my lack of understanding, there is a base gwei amount required for each transfer.  My two current considerations:\n\n(1) stake ETH from cold storage (Rocketpool or LIDO), but to first consider whether the gas fees would outweigh the benefits of funding smaller amounts of USD on a recurring basis.  \n\nMy other option is to utilize Coinbase’s promotion (up to $50 free when staking up to $500 ETH).  With this method, I would not have funds on my own wallet, but I would avoid the gas fees and earn 3.75% APR.  The inability to access my ETH once deposited is not a concern.\n\nI am considering taking advantage of the $50 promo then weighing the cost-benefit of staking smaller amounts on a recurring basis thereafter.  \n\nI have so much to learn from this community and experience.  Thank you in advance for your time and insight.",
            "stickied": false,
            "comments": [
                {
                    "id": "iam6d6r",
                    "author": "Ilaypipe0012",
                    "score": 3,
                    "created_utc": 1653962961.0,
                    "response": "Careful following links. A lot of scams out there. Make sure if funds are stolen that Coinbase will refund you. Personally I like cold storage. My keys my crypto. But will those staking pools refund you if they suffer a hack? Gas is cheap at the moment. A couple bucks a transaction. If your sending $500+ obviously that won’t hurt to bad. I know you said you won’t sell but keep in mind funds are locked and even after merge comes eth cannot be unstaked for like 6 months after consensus layer becomes live. Even if price nukes it’s there for better or for worst.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iambf2o",
                            "author": "Perleflamme",
                            "score": 2,
                            "created_utc": 1653965614.0,
                            "response": "This. Ask for keywords and follow the known enough keywords through a web search. Stay skeptical and ensure you're only following secure websites.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iamxhv1",
                                    "author": "Strechepants",
                                    "score": 1,
                                    "created_utc": 1653980761.0,
                                    "response": "Could either of you elaborate what you mean by these scam “links” and to search by keywords?  I understand to be careful where I browse when surfing the web, but I take it that maybe there’s fake Rocketpool or Lido applications that will steal my ETH.    Or maybe people *ahem* dropping malicious links in a post like this *ahem*.\n\nPlease correct me if I’m misunderstood or missing anything.  There’s no worse feeling than getting played out my hard-earned money!  I thank you both for caring enough to help me avoid that.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iamzcrv",
                                            "author": "Ilaypipe0012",
                                            "score": 1,
                                            "created_utc": 1653982398.0,
                                            "response": "Could be either really. I’ve seen a lot of scams posts on here and the mods deal with them but this is a large subreddit. Also online you have to make sure you are loading in the 100% correct link. I haven’t staked so am unsure about requirements there for pool staking but if possible I’d send as little as possible and make sure it’s in the correct spot and always double check the transaction before you confirm. Sending money off exchange for the first time can be nerve wracking it goes from clicking buy eth to send to this contract address and make sure you are on the correct chain when doing so.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iamnagf",
                    "author": "alreadyreddituser",
                    "score": 2,
                    "created_utc": 1653972925.0,
                    "response": "$50 on $500 is 10% yield, just like that. Is there a minimum lockup on Coinbase to qualify - or would you be allowed to withdraw and move that as soon as staked ETH unlocks?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iamnmu9",
                            "author": "alreadyreddituser",
                            "score": 3,
                            "created_utc": 1653973165.0,
                            "response": "Kraken and Rocketpool both offer better rates/take a lower cut than Coinbase - but it would take years for them to even out that initial CB bonus if you’re looking to stake about $500.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iam49up",
                    "author": "ashtonlaszlo",
                    "score": 1,
                    "created_utc": 1653961883.0,
                    "response": "You should check out this [APY comparison tool](https://docs.google.com/spreadsheets/d/1vpBQI2DFUk7zXS4TCs9ZOnatvWHiYf5jHjKgKpfJG5Y/edit) I made. It might help you decide where to earn a yield in your ETH. Not all the platforms in this tool are *staking* but in terms of earning in-kind, compound interest, they deliver the same results.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamgigw",
                    "author": "StackinAndRackin",
                    "score": 1,
                    "created_utc": 1653968534.0,
                    "response": "Keep in mind Coinbase keeps 25% of your staking rewards for themselves. Kraken takes 15% for comparison.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iamz2no",
                            "author": "Strechepants",
                            "score": 1,
                            "created_utc": 1653982148.0,
                            "response": "This certainly a viable option.  I have yet to use Kraken, so I’ve not built the confidence in Kraken that I have with CB.\n\nIt looks like Kraken has lower fees than CB Pro.  I’m a US citizen, so it will be locked just like CB Pro.  \n\nThere’s one caveat: Coinbase gets my approval because I can see their financial position and performance (I do audits).  I’ll give Kraken some credit though because they’ve announced plans to go public.  \n\nThanks for your input.  If the decision is to stick with exchange staking, then I can see myself using Kraken or at least using it after taking advantage of the CB promo ($50 free, why not).",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iam7egv",
                    "author": "sagaciousmarketeer",
                    "score": -1,
                    "created_utc": 1653963504.0,
                    "response": "Freeway.fi",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}