{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxsdc5",
            "title": "Pantos is still a ERC20 Token right now!",
            "url": "https://www.reddit.com/r/ethereum/comments/uxsdc5/pantos_is_still_a_erc20_token_right_now/",
            "author": "x_file-",
            "created_utc": 1653516245.0,
            "score": 0,
            "num_comments": 2,
            "subreddit": "ethereum",
            "selftext": "Searching for Interoperability Projects.....\nI came across this project called Pantos. Its backed by Bitpanda, a EU based Broker. I think its still pretty early. I would love to hear some opinion on this project!\n\n\n‐---‐---------------------\nThe technology\n\nPantos is based on ground-breaking research in the fields of oracles, relays, smart contracts and blockchain efficiency.\n\n\n\n\"The vision of Pantos is to establish the first true Multi-Blockchain Token System. Acting as a layer zero network built on top of all major blockchains.\n\nThe Pantos team at Bitpanda partnered with researchers from renowned technical universities, TU Hamburg (Germany) and TU Wien (Austria) to co-develop the innovative Pantos technology. As a scientific project, we are proud to be pioneers in this field and being able to shape the future of asset tokenisation.\"\n\n\n\n---------‐------------------\n\nhttps://pantos.io/en/technology",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uxsm7o",
            "title": "Will Layer 2s talk with one another?",
            "url": "https://www.reddit.com/r/ethereum/comments/uxsm7o/will_layer_2s_talk_with_one_another/",
            "author": "hardcoregamer84",
            "created_utc": 1653516933.0,
            "score": 13,
            "num_comments": 21,
            "subreddit": "ethereum",
            "selftext": "Hi Everyone, I’m just curious if ETH layer 2s can or will be able to talk to one another?  Or will we have to connect to different L2s depending on the dapp we want to interact with?\n\nFor example, if a friend of mine starts using a loopring wallet and I use an argent wallet, will I ever be able to send ETH to his wallet?  Or were L2s never designed to interact that way.\n\nThanks,",
            "stickied": false,
            "comments": [
                {
                    "id": "ia07se6",
                    "author": "imothypsy",
                    "score": 10,
                    "created_utc": 1653524808.0,
                    "response": "Yes, Immutable X is working on this",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zsozp",
                    "author": "LamboshiNakaghini",
                    "score": 10,
                    "created_utc": 1653517736.0,
                    "response": "Yes. They already do. I sent some eth from optimism to arbitrum a few days ago using hop protocol.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zrwap",
                    "author": "mooremo",
                    "score": 5,
                    "created_utc": 1653517380.0,
                    "response": "Somebody would have to build a bridge or you'd have to move between them on L1.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia0k6gy",
                            "author": "dmiddy",
                            "score": 2,
                            "created_utc": 1653530554.0,
                            "response": "Hop Protocol bridges L2 to L2!  \nNot sure the mechanism, but it's there",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia0kark",
                                    "author": "mooremo",
                                    "score": 3,
                                    "created_utc": 1653530610.0,
                                    "response": "Yea, it's a bridge.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9zxf0m",
                            "author": "hardcoregamer84",
                            "score": 1,
                            "created_utc": 1653519906.0,
                            "response": "Perfect, that’s what I suspected,  it wanted to get clarification.  Appreciate it!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia07myd",
                                    "author": "hellenkellerzombie",
                                    "score": 19,
                                    "created_utc": 1653524738.0,
                                    "response": "Woah woah woah. This is not accurate. Zk rollups can built trustless bridges between each other that will allow you to execute smart contracts across rollups seemlessly. Immutable X just announced plans to launch unique zk rollups for individual games that will all be able to communicate with an NFT exchange on a different roll up. The use cases are endless and this type of thing is already in development.\n\nEdit: source - https://immutablex.medium.com/immutable-starknet-cross-rollup-nft-liquidity-b32df88cda02",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia0a63b",
                                            "author": "hardcoregamer84",
                                            "score": 6,
                                            "created_utc": 1653525931.0,
                                            "response": "Fantastic!  I knew it must be in development.  That you for this article.  It didn’t make sense that they wouldn’t be able to talk to one another.  Nice to see its being worked on.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ia0kbi7",
                                            "author": "lorenzomofo",
                                            "score": 2,
                                            "created_utc": 1653530620.0,
                                            "response": "Will these bridges operate automatically and invisibly to the users or do users need to call them up manually with each transaction or change the way they interact currently with the chain?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia0w7fs",
                                                    "author": "hellenkellerzombie",
                                                    "score": 2,
                                                    "created_utc": 1653536522.0,
                                                    "response": "It will depend on the product and how developed it is, but eventually the norm will be that the trustless bridges are invisible to the user and they don’t even know they are using them. An example of this is likely to happen in the GameStop wallet. You may be able to store your tokens on the Loopring protocol, but buy NFTs from a marketplace built by immutable x on stark ex with the tokens on the loopring protocol. The NFT will show up in your GameStop wallet, but you never have to bridge the token or the NFT. The wallet will have smart contracts built in to do that for you. It may not be that way at launch, but that’s the type of functionality we will see with these dapps on various zk protocols.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia16kmg",
                                                            "author": "Exoclyps",
                                                            "score": 2,
                                                            "created_utc": 1653543237.0,
                                                            "response": "This was always what I assumed would happen. All those things happening inside the wallet. \n\nFor a simple layout, I doubt you'd even see any L2, just ETH. L1? L2? That'll just end up being the inner workings of the wallet, behind the scenes stuff.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia0bewb",
                                            "author": "Geauxfly",
                                            "score": 3,
                                            "created_utc": 1653526514.0,
                                            "response": "Up Up Up you go.  Everyone needs to know !",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia0b9mj",
                    "author": "MoreCowbellMofo",
                    "score": 2,
                    "created_utc": 1653526447.0,
                    "response": "Yes there are a bunch of bridges between layer 2s already",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1a57g",
                    "author": "yeetsfeetsdeletes",
                    "score": 1,
                    "created_utc": 1653545958.0,
                    "response": "Yup. Multiple ways, chainlink being one of them with CCIP. Note that this is different than a bridge and more of cross smart contracts data and token bridges too",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1sume",
                    "author": "uwdjah",
                    "score": 1,
                    "created_utc": 1653561928.0,
                    "response": "L2s will eventually be fully transparently bridged, and so will the L3s that will eventually get built on top of those. Thats how you scale to infinity and support worldwide mass adoption.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2jwaa",
                    "author": "Sorry_Attitude_",
                    "score": 1,
                    "created_utc": 1653576128.0,
                    "response": "There are a lot of bridges, Ethereum is there to keep everything in a standard and in sync not necessarily unite them. But because Ethereum is there bridges are able to be built between them much easier and cheaper\n\nThat's why a lot of projects build on Ethereum first like Angelblock then go into an L2, easier to get the standard then jump over than to straight up build on L2 then figure out Ethereum \n\nIt is also why a lot of other chains like Algorand are building L2's that bridge Ethereum so it all becomes a sidechain basically\n\nSaw  a trend, and that is that everything will connect through Ethereum\n\nNot sure how much that will do for the price of Eth but it will do a lot for it's life span",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}