{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uv7dtw",
            "title": "Can someone know who I am/what I do from having my coinbase ETH address?",
            "url": "/r/CryptoCurrency/comments/uv7blp/can_someone_know_who_i_amwhat_i_do_from_having_my/",
            "author": "ThunderTM",
            "created_utc": 1653211382.0,
            "score": 7,
            "num_comments": 15,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9jsyd0",
                    "author": "Sorry_Attitude_",
                    "score": 6,
                    "created_utc": 1653216337.0,
                    "response": "Yes, the CEX knows everything you do because that's how it works.\n\nAnd the authorities know it also because the CEX transmits them further\n\nAnd on a private wallet, they can find you out but probably will have a hard time figuring out who you really are",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9k0da2",
                            "author": "ThunderTM",
                            "score": 1,
                            "created_utc": 1653221912.0,
                            "response": "I mean when for example I give you one of my BTC addresses on coinbase. How much can you find out about me.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9kepu7",
                                    "author": "211216819",
                                    "score": 3,
                                    "created_utc": 1653229707.0,
                                    "response": "Not much other than the amounts you move with that address. You can create multiple addresses on Coinbase to have a little bit of privacy though.\n\n(CEX and authorities know as Sorry\\_Attitude\\_ said)",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9sifws",
                                    "author": "Sorry_Attitude_",
                                    "score": 1,
                                    "created_utc": 1653388742.0,
                                    "response": "All transfers are visible and amounts, which means smart contracts too, for example if i use UniSwap or Kaddex, i can see you interacted with them if I know which one is which\n\nI can backtrack through the history of the coin since it was created, and in time search for wallets and piece it together like puzzle, so kinda everything is visible if there is enough patience and probably processing power lol",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9sj138",
                                            "author": "ThunderTM",
                                            "score": 1,
                                            "created_utc": 1653389206.0,
                                            "response": "But I don't understand how that is working with coinbase.  \n\n\nIf I do 100 deposits spread over 1 year with 100 different deposit addresses every time, shouldn't my coins be stored on multiple wallets (or one one big coinbase wallet) and the amount shown in my account is just these numbers (my total deposits) combined?  \n\n\nOr is there actually only one single wallet linked to my coinbase account and if someone has that address he knows my holdings?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9sq0ba",
                                                    "author": "Sorry_Attitude_",
                                                    "score": 2,
                                                    "created_utc": 1653393936.0,
                                                    "response": "theres a single wallet linked to your account but they have proprietary tech and hide it.\n\nCoinbase themselves record everything that comes in and goes out of that wallet and basically overall just see everything happening that is theirs\n\nI don't know the details exactly because they hide it under their own copyright trademark etc \n\nUnlike dexes like AlgoFi UniSwap Kaddex or AAVE for borrowing where your personal wallet works directly on the chain and all that stuff\n\nI'd guess you transfer tokens to that wallet but they have their own accountability chain over it so wallets dont actually move anything they just are there while coinbase works everything else for free on their platform.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9uvp7y",
                                                            "author": "ThunderTM",
                                                            "score": 1,
                                                            "created_utc": 1653427942.0,
                                                            "response": "Thank you !",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9kgewx",
                    "author": "goodbonobo",
                    "score": 3,
                    "created_utc": 1653230493.0,
                    "response": "Only Coinbase knows who you are by your address (of course).  Coinbase actually generates a new ETH address for you on each transaction (and you can request more).  You can reuse any of your old addresses (they are all yours forever).  The other advantage is nobody can use your addresses to see your balance.  \n\nHowever as they say “Not your keys not your crypto” so technically Coinbase has your money. If you moved to your wallet it’s harder to hide IMHO (not anonymity) but assets because someone can just look at your address and see how much you have and try to track what you do even though they might not know who you are.  \n\nPros and cons for each (exchange/custodial wallet vs non-custodial wallet) with regard to privacy.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}