{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us95p2",
            "title": "Cloudflare to run Ethereum node experiment to help ‘build a better internet’",
            "url": "https://www.reddit.com/r/ethereum/comments/us95p2/cloudflare_to_run_ethereum_node_experiment_to/",
            "author": "TechynoWorld",
            "created_utc": 1652867130.0,
            "score": 28,
            "num_comments": 6,
            "subreddit": "ethereum",
            "selftext": "Cloudflare is going to participate in the research and development of the core infrastructure that helps keep Ethereum secure, fast, as well as energy-efficient for everyone,” the firm stated.\n\nAhead of Ethereum’s highly anticipated switch to proof-of-stake (PoS), cybersecurity firm Cloudflare is set to launch and fully stake Ethereum validator nodes over the next few months.\n\nIt aims to study energy efficiency, consistency management and network speed of the PoS network as part of its commitment to environmental sustainability and to help “build a better internet.”\n\nCloudflare was founded in 2010 and provides web security services such as distributed denial-of-service (DDoS) mitigation to protect clients from DDoS attacks.\n\nCloudflare said it was experimenting with the “next generation of Web3 networks that are embracing proof of stake,” with Ethereum being the first in line for the company.\n\nAt this stage, it appears the Merge and transition to a PoS consensus mechanism is slated to go live by Q3 or early Q4, barring any further delays, with Cloudflare noting that this will lead to “significant energy efficiency improvements” for the network.\n\nAccording to a Monday blog post, the firm will launch and fully stake Ethereum validator nodes — 32 Ether (ETH) required per node...\n\nRead full Article [https://techyno.com/cloudflare-to-run-ethereum-node-experiment-to-help-build-a-better-internet/](https://techyno.com/cloudflare-to-run-ethereum-node-experiment-to-help-build-a-better-internet/)",
            "stickied": false,
            "comments": [
                {
                    "id": "i931bae",
                    "author": "Either-Advantage",
                    "score": 1,
                    "created_utc": 1652887818.0,
                    "response": "I don't know about the whole \"better internet\" shtick but I think CloudFlare generally provides very good services. I'd much rather use them over something like Google or AWS. With that being said I'm pretty sure they're going to be on a L2 such as Polygon Hermez and not Ethereum itself.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92e8si",
                    "author": "n8dahwgg",
                    "score": -1,
                    "created_utc": 1652877335.0,
                    "response": "I guess when enough nodes are on aws service providers hop in? /shrug",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92xqcn",
                    "author": "LEO_TROLLSTOY",
                    "score": 0,
                    "created_utc": 1652886349.0,
                    "response": "Better internet, sure…",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "us99ka",
            "title": "Layer 2 (zkSync) Swaps and Fiat On-Ramp are Now Live on Numio",
            "url": "https://www.reddit.com/r/ethereum/comments/us99ka/layer_2_zksync_swaps_and_fiat_onramp_are_now_live/",
            "author": "milvus",
            "created_utc": 1652867614.0,
            "score": 38,
            "num_comments": 20,
            "subreddit": "ethereum",
            "selftext": "Hello /r/ethereum,\n\nOur timing for this release couldn’t be much worse but bears haven’t stopped us building before and they won’t stop us now.\n\n[Numio](https://www.numio.one/) is a non-custodial, Layer 2 Ethereum, mobile app available on Android and iOS. First released in 2020, we were the first app to be built on zkSync.\n\n## What's new?\n\n**Layer 2 Swaps** \\- we’ve added Layer 2 Swaps with our [ZigZag](https://info.zigzag.exchange/) integration which means you can swap tokens quickly and cheaply on the zkSync network.\n\nThe cost for a swap is currently under $0.50 - the cheapest I have swapped for is £0.07.\n\nWe’ve added the following pairs for now but will be adding loads more (>75) very soon.\n\n* ETH/USDC\n* ETH/USDT\n* USDC/USDT\n\n**Layer 2 fiat on-ramp** \\- you can now purchase crypto directly on zkSync. This feature is supported by our [MoonPay](https://www.moonpay.com/) integration and saves you a lot on gas fees.\n\n**NFTs** \\-You can view and interact with your NFT collection in the app.\n\n## A Note on Privacy and Fees on Numio\n\nNumio is non-custodial - you generate your own private keys within the app and can download your private keys at any time.\n\nYou can stay pseudonymous - you don’t need to give an email, phone number, or complete KYC to use Numio - all you need is a username.\n\nDownloading and signing up for Numio is free. Whether you are using Layer 1 or Layer 2, we won’t charge you to make an account or create a wallet.\n\n## Feedback\n\nAs always we appreciate all the feedback we get, so please let us know if you have any comments, requests, or criticisms - we’re always working to improve.\n\nThanks",
            "stickied": false,
            "comments": [
                {
                    "id": "i92bxfn",
                    "author": "AESTHTK",
                    "score": 10,
                    "created_utc": 1652876045.0,
                    "response": "Awesome!\n\nWill take a look.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i926nwe",
                    "author": "Dry-Hurry-7598",
                    "score": 4,
                    "created_utc": 1652872752.0,
                    "response": "You say it’s cheaper because there’s hardly any gas fees, but you’re using moonpay which has too many fees 😂",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92brrx",
                            "author": "milvus",
                            "score": 7,
                            "created_utc": 1652875955.0,
                            "response": "It's on our roadmap to add additional on-ramps.\n\nIs there a particular one that you would like to see?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92dkz7",
                                    "author": "paddylov",
                                    "score": 6,
                                    "created_utc": 1652876972.0,
                                    "response": "Banxa",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i939pk3",
                                    "author": "hughvr",
                                    "score": 3,
                                    "created_utc": 1652891251.0,
                                    "response": "Anyone that I can use in Mexico. So far only centralized exchanges let me on-ramp. Will give yours a shot.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96gdgg",
                                            "author": "milvus",
                                            "score": 1,
                                            "created_utc": 1652948300.0,
                                            "response": "Let me know how it goes. We want to be as wide reaching as we can so will look out for Mexico friendly integrations.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9tabzd",
                                    "author": "stupidcupid112",
                                    "score": 2,
                                    "created_utc": 1653403964.0,
                                    "response": "ramp.network\n\nAnd also something that would have INR (Indian Rupee) support for Fiat on Ramp.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9x1yft",
                                            "author": "milvus",
                                            "score": 1,
                                            "created_utc": 1653473699.0,
                                            "response": "Hello, Ramp is also on our roadmap\n\nWe will definitely be looking to add support for INR",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92oq1s",
                    "author": "xNUCLEARxBLASTx",
                    "score": 2,
                    "created_utc": 1652882466.0,
                    "response": "Can I use an hardware wallet with your app? Are fiat on-ramps available for non-US citizens?\n\nGood job on the app btw :)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92wa1r",
                            "author": "milvus",
                            "score": 4,
                            "created_utc": 1652885748.0,
                            "response": "There is currently no hardware support but we will be making some hardware wallet enhancements in the future.\n\nre the fiat on-ramp, it will work anywhere that MoonPay is supported. I am in the UK and have no problems and I know that colleagues in Europe haven't had any issues either.\n\nThanks",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}