{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuvsuh",
            "title": "Becoming an Eth2.0 Validator Node",
            "url": "https://www.reddit.com/r/ethereum/comments/uuvsuh/becoming_an_eth20_validator_node/",
            "author": "NOWNodes",
            "created_utc": 1653166469.0,
            "score": 0,
            "num_comments": 6,
            "subreddit": "ethereum",
            "selftext": "**Ethereum 2.0 is an upgrade on the Ethereum blockchain. This upgrade aims to make the existing Ethereum blockchain more scalable, secure, and sustainable. In 2022 the upgrade will reach its completion with the merging of the mainnet with the beacon chain. Once this merging or ‘docking’ is done, the entire Ethereum network will be available for staking.**   \n**With the end of energy-intensive mining, the Eth 2.0 upgrade will require validators rather than miners.**  \n**The overall scheme to become a validator requires the minimum deposit of 32 ETH into the Ethereum Foundation’s official deposit contract. Once eligible, the validators will download the updated Eth2.0 software and will run it. While running the software, the system will select validators randomly to propose and attest to blocks on the chain. Those who propose and attest blocks correctly would receive ETH as a reward in proportion to their stake.**\n\n**Yet, the process to become an Eth 2.0 validator node is not so simple and straightforward. One needs to follow certain guidelines to become one. It includes guidelines or recommendations relating to hardware, guidelines on how to choose and install one’s clients, how to set up an Eth1 node, and how to use the Eth2 launchpad.**  \n[**Learn more about**](https://nownodes.io/blog/how-to-become-an-eth2-0-validator-node/)**:**  \n**1) Recommended Hardware Requirements to run a Validator Node**  \n**2) Choosing and Installing the Client**  \n**3) Installing an ETH1 Node**  \n**4) Running the Validator Node on Eth 2.0**\n\nhttps://preview.redd.it/55l72c257w091.png?width=1076&format=png&auto=webp&s=827f5ca86cfd6235a0a89d157200a6fe87556695",
            "stickied": false,
            "comments": [
                {
                    "id": "i9llj9f",
                    "author": "Yoldark",
                    "score": 1,
                    "created_utc": 1653248479.0,
                    "response": "Eth 2.0 isn't call like that anymore. This is the merge and it is called the consensus layer. Eth 2.0 is a confusing terminology that is isn't used anymore.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hvzu9",
                    "author": "mrdougan",
                    "score": -6,
                    "created_utc": 1653170238.0,
                    "response": "lol 32 ETH to be a valindator in ETH2.0 - maybe once MOASS has happened but until then im on ramen",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}