{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqayhg",
            "title": "How to sell ethereum without proof of address?",
            "url": "https://www.reddit.com/r/ethereum/comments/uqayhg/how_to_sell_ethereum_without_proof_of_address/",
            "author": "Sakswa",
            "created_utc": 1652635716.0,
            "score": 3,
            "num_comments": 5,
            "subreddit": "ethereum",
            "selftext": "I have some eth, but I can't find a website to sell it on. I used to use coinbase, but it looks like they don't accept norwegian cards anymore. I moved out of Norway a while back, and don't have access to any documents from the last 3 months proving my address there. I also don't have these documents where I'm staying right now.\n\nIs there a website I could sell on? I've tried zipmex and coinbase as well, but no dice.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uq8vt3",
            "title": "zkEVM - ELI5?",
            "url": "https://www.reddit.com/r/ethereum/comments/uq8vt3/zkevm_eli5/",
            "author": "celticwarrior72",
            "created_utc": 1652629774.0,
            "score": 3,
            "num_comments": 4,
            "subreddit": "ethereum",
            "selftext": "I have been following the developments in the L2 rollup space and using Arbitrum and Optimism.  I'm very interested in the zk rollup tech and could use a concise explanation as to why zkEVM is such an important development and how it works (in layman's terms).  Anyone care to write a short ELI5 on the topic?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8pjjjj",
                    "author": "babossa77",
                    "score": 6,
                    "created_utc": 1652630805.0,
                    "response": "The main idea behind zkEVM is to use zk proofs to proof that any EVM compatible smart contract call has been executed. \n\nThis means that you must be able to generate zkProofs for any possible EVM opcode (opcodes are basically the low level programming commands that the ethereum virtual machine executes when you call a smart contract).\n\nIf you are able to achieve that, you can do all of the execution and computation of smart contracts off chain (on layer 2) and only post the proofs that this execution happened on layer 1, which is way cheaper than doing everything on layer 1.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}