{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuge8k",
            "title": "Which \"private blockchain\" would you use? (evm-comp only?)",
            "url": "https://www.reddit.com/r/ethereum/comments/uuge8k/which_private_blockchain_would_you_use_evmcomp/",
            "author": "michael98118",
            "created_utc": 1653110473.0,
            "score": 3,
            "num_comments": 13,
            "subreddit": "ethereum",
            "selftext": "I've been hired by a company to \"add crypto\" to their current (successful) product, but they want to have it on a \"private blockchain\" \n\nThe team's initial thought was to fork geth (POW), though I see there being a high cost to maintain/run this.\n\nI was hoping that there was a good POS substitution available.\n\nI'd prefer an EVM protocol, though I could possibly be talked into a diff lang.\n\nWhat does Reddit think?\n\n_**What would Reddit do?**_",
            "stickied": false,
            "comments": [
                {
                    "id": "i9f5xfh",
                    "author": "Perleflamme",
                    "score": 4,
                    "created_utc": 1653112210.0,
                    "response": "If it's private and permissioned, there's no reason a PoW-based chain costs a lot, since you completely control mining difficulty. A permissioned chain can be essentially seen as PoA, even if based on PoW.\n\nThough you get nothing from decentralized blockchain resilience and such anymore.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fbpmv",
                    "author": "AESTHTK",
                    "score": 3,
                    "created_utc": 1653117018.0,
                    "response": "First of all...\n\nDo you mean private as in infrastructure hosting (ie. POA nodes) or private as in permissioned (ie. non public) or private as in data and transaction privacy (ie. off-chain and zk circuits)?\n\nDepending on your answer, I would look at Hyperledger Besu, Kaleido Firefly and Polygon Nightfall.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9f6m38",
                    "author": "dips1994",
                    "score": 2,
                    "created_utc": 1653112758.0,
                    "response": "If you don’t mind me asking what are the company trying to achieve with the private blockchain?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fb4qq",
                    "author": "Kristkind",
                    "score": 2,
                    "created_utc": 1653116526.0,
                    "response": "The reasonable option is offered by\n\nhttps://consensys.net/enterprise-ethereum/best-blockchain-for-business/busting-the-myth-of-private-blockchains/\n\nIf you don't plan to plug your private chain into the public one, you might as well use an SQL database.\n\nUnless it's about the marketing gimmick, then use whatever chain you like to toy around.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fs8xl",
                            "author": "bocceballbarry",
                            "score": 1,
                            "created_utc": 1653131887.0,
                            "response": "Databases aren’t immutable so if that was the only property you needed for your application, that’s one reason you could justify a private blockchain",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9f3yj6",
                    "author": "ChemicalSalamander52",
                    "score": -1,
                    "created_utc": 1653110737.0,
                    "response": "I think avalanche network allows for pretty easy creation of private blockchains, and their smart contracts use solidity. Not sure about cost tho.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9f5gnp",
                            "author": "michael98118",
                            "score": 1,
                            "created_utc": 1653111851.0,
                            "response": "Thank you so much! \n\nI've found: https://docs.avax.network/subnets/",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9fdsy5",
                    "author": "olanod",
                    "score": 1,
                    "created_utc": 1653118869.0,
                    "response": "With the Substrate framework is very straightforward to create your own chain, the default template comes with PoA out of the box and it's simple to add modules(pallets) that add new functionality like an EVM implementation. Moonbeam is an example of a fully Ethereum compatible chain created with Substrate, although a public one connected to the Polkadot ecosystem.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fqso1",
                            "author": "tsurutatdk",
                            "score": 1,
                            "created_utc": 1653130736.0,
                            "response": "If you are familiar with Otto blockchain, you might get interested about it. It's socially responsible PoS blockchain based on substrate that facilitates smart contracts within a community-controlled ecosystem. They're prioritizing security. This is a product from Plugnet.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9fef8u",
                    "author": "Sal_T_Nuts",
                    "score": 1,
                    "created_utc": 1653119428.0,
                    "response": "Aztec L2, it’s Ethereum and completely private with EVM.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}