{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqz563",
            "title": "Vitalik Buterin speaks out on the direction of rebuilding Terra (LUNA) and stablecoin UST.",
            "url": "https://www.reddit.com/r/ethereum/comments/uqz563/vitalik_buterin_speaks_out_on_the_direction_of/",
            "author": "CWCOfficial",
            "created_utc": 1652716558.0,
            "score": 3,
            "num_comments": 1,
            "subreddit": "ethereum",
            "selftext": "Ethereum co-founder Vitalik Buterin thinks Terra’s reconstruction efforts should focus on retail investors holding fewer USTs rather than “**whales**.”\n\n[Vitalik Buterin speaks out on the direction of rebuilding Terra \\(LUNA\\) and stablecoin UST.](https://preview.redd.it/eggu9pwa1vz81.jpg?width=740&format=pjpg&auto=webp&s=6f05abde80179f07147332a15e9b3727d5b2d6e5)\n\nVitalik Buterin speaks out on the direction of rebuilding Terra (LUNA) and stablecoin UST.\n\nSpecifically, on May 14, Anthony Sassano – the writer of the popular [The Daily Gwei](https://thedailygwei.substack.com/) newsletter series in the Ethereum community, tweeted:\n\n\"*Stop experimenting with ponzi, algorithmic stablecoins, yield farming and other unsustainable crap.Instead, experiment with funding ‘****public goods****’, governance/DAO models, decentralized identity/reputation, sustainable finance, and privacy-promoting tools. That is the right direction.”*\n\nRead more: [https://cryptowallcity.com/vitalik-buterin-speaks-out-rebuilding-luna-ust/](https://cryptowallcity.com/vitalik-buterin-speaks-out-rebuilding-luna-ust/)",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uqyxv3",
            "title": "Norges Bank CBDC Sandbox Project",
            "url": "https://www.reddit.com/r/ethereum/comments/uqyxv3/norges_bank_cbdc_sandbox_project/",
            "author": "Janmilly",
            "created_utc": 1652715989.0,
            "score": 19,
            "num_comments": 14,
            "subreddit": "ethereum",
            "selftext": " Nahmii AS to announce that we have been chosen to work  with Norges Bank (the central bank of Norway) on their upcoming  experimental CBDC sandbox project. This prestigious award confirms  Nahmii AS’s position as a global leader in the blockchain space and  represents another milestone for the Bergen-based company. \n\n Following a competitive tender process, Nahmii AS will now build a  sandbox environment for Norges Bank as part of their CBDC experimental  testing strategy. Norges Bank will use this platform as part of a wider  investigation into CBDCs. \n\n[https://blog.nahmii.io/norges-bank-cbdc-sandbox-project-6cc834c56f10](https://blog.nahmii.io/norges-bank-cbdc-sandbox-project-6cc834c56f10)\n\n&#x200B;\n\n&#x200B;\n\n[https://blog.nahmii.io/norges-bank-cbdc-sandbox-project-6cc834c56f10](https://blog.nahmii.io/norges-bank-cbdc-sandbox-project-6cc834c56f10)",
            "stickied": false,
            "comments": [
                {
                    "id": "i8v1q1b",
                    "author": "Iohet",
                    "score": 1,
                    "created_utc": 1652731760.0,
                    "response": "The crypto community as been somewhat resistant to CBDCs, but the past two weeks shows why it's a worthwhile venture for better stability/reliability",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vdlpn",
                            "author": "Perleflamme",
                            "score": 1,
                            "created_utc": 1652736665.0,
                            "response": "No, the past two weeks have shown one failed project. It won't be the last one. \n\nAnd don't expect states not to fail. They reputedly fail often their projects. And they don't care about small people when it's come the question of who to cover for their losses. Look at History if you're not convinced.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vekr1",
                                    "author": "Bigbadbuck",
                                    "score": 1,
                                    "created_utc": 1652737086.0,
                                    "response": "And crypto has cared anymore ? LFG used their reserves to bail out big holders and left everyone else holding the bag",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8vg81j",
                                            "author": "Perleflamme",
                                            "score": 1,
                                            "created_utc": 1652737798.0,
                                            "response": "So, you mean there's really no difference when letting the state do it. In such case, I'll side with trustlessness and skip any state project. \n\nIf you want a state project, you already have a prime example that is ready to use: traditional banks. There's no need to ask for it yet again.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8ver5h",
                                    "author": "Iohet",
                                    "score": 1,
                                    "created_utc": 1652737163.0,
                                    "response": "Tether also lost its peg temporarily over the weekend.  The more these things happen, the more runs are going to happen.  \n\nI don't expect states not to fail at projects, but I do expect a conceptual Federal Reserve backed digital dollar stablecoin to be treated like any other reserve note.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8vhgpy",
                                            "author": "Perleflamme",
                                            "score": 1,
                                            "created_utc": 1652738342.0,
                                            "response": "People also know Tether is undercollateralized. It's the thing with collateralization: you can't cheat without risks. And with continuous risks, you've inevitably losing, because you're playing until you lose.\n\nThat's why fully collateralized projects are the only ones that are resistant: you can always redeem the collateral anyway. \n\nThe good news is they already exist, so you really don't need a state to provide that service to you and necessarily add censorship on top of it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8viwhp",
                                                    "author": "Iohet",
                                                    "score": 1,
                                                    "created_utc": 1652738977.0,
                                                    "response": "There's no guarantee that the collateral is real, that the collateral is available to you if the organization files for bankruptcy, or any guarantee if your holdings are stolen.  Conceptually, federally backed deposit insurance would be possible with a federally backed stablecoin, which protects you from all these things that exist because the private market fucked up at one time or another.\n\nWe don't need to relitigate or ignore the past.  We need to understand the lessons the past has taught us",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8vlgi4",
                                                            "author": "Perleflamme",
                                                            "score": 1,
                                                            "created_utc": 1652740124.0,
                                                            "response": "Technically, if you're looking for a solution in insurances like you're saying, then you can use one that already handles crypto. No need for a state either for that.\n\n>We need to understand the lessons the past has taught us\n\nIt seems to me you're not learning the lesson History's repeatedly showing: don't trust the state or you'll get fooled doing so.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8vly4k",
                                                                    "author": "Iohet",
                                                                    "score": 1,
                                                                    "created_utc": 1652740348.0,
                                                                    "response": ">      It seems to me you're not learning the lesson History's repeatedly showing: don't trust the state or you'll get fooled doing so.\n\nAnd you're implying that trusting self-regulation somehow provides better reliability, when that is clearly not the case",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8vnadx",
                                                                            "author": "Perleflamme",
                                                                            "score": 1,
                                                                            "created_utc": 1652740963.0,
                                                                            "response": ">trusting self-regulation\n\nThis is dubious. You don't need to trust self-regulation, because self-regulation isn't enforced onto people. It's proposed. You retain self-sovereignty. So, you don't need to trust it. Rather, you choose it only if you think it works. The dependency is reversed: you're the one in control of the decision and therefore you're the one responsible for your decisions. The fact some products work and some others don't then becomes an ecosystem that already offers the services you're looking for. All you need after that is a set of tools allowing you to easily judge which services are the ones you're needing. \n\nIt's very different from state enforced regulations: you need to trust these state regulations to be continuously working and you won't have a choice but to suffer from it the instant or doesn't work anymore.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8w1nko",
                                                                                    "author": "Iohet",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652747993.0,
                                                                                    "response": "Sure you do if you are entrusting the worth of something to another party.  In this case, your keys don't mean shit because the underlying value is determined by outside forces.  The reason regulation exists to provide a baseline of protection is because the market has failed enough to unify disparate factions of government together to say enough is enough on a particular issue",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}