{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0it2c",
            "title": "Rocketpool minipool",
            "url": "https://www.reddit.com/r/ethereum/comments/v0it2c/rocketpool_minipool/",
            "author": "ethan_hunt9000",
            "created_utc": 1653853563.0,
            "score": 26,
            "num_comments": 20,
            "subreddit": "ethereum",
            "selftext": "Anybody stake their ETH with a rocketpool mini pool?\n\nJust curious if it is easy or difficult in your opinion and how trustworthy is rocketpool.\n\nAlso do you get APY from staking plus transaction fees? Or is the staking itself from transaction fees?",
            "stickied": false,
            "comments": [
                {
                    "id": "iagq9dl",
                    "author": "ma0za",
                    "score": 15,
                    "created_utc": 1653854743.0,
                    "response": "Yeah i run one\n\n- if you are Willing to put in a bit of work at the Begining to Set it up and get used to Linux command line its really easy. The rocketpool Software stack simplyfies running a validator A LOT compared to solo staking.\n\n\n- In my opinion rocketpool is as trustworthy as it gets apart from straight up solo staking. Smart contracts ran through 4 Audits and using it is trustless and Permissionless\n\n\n- its also more profitable than solo staking as you get additional comission from the liquid stakers supplying you with the other 16 ETH + currently roughly 13% apr on your RPL collateral you have to lock up\n\nI suggest you join the rocketpool sub and discord for more Information and help",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagvnm7",
                            "author": "TovarishFin",
                            "score": 8,
                            "created_utc": 1653857363.0,
                            "response": "I started having a real look at rocketpool a week ago and have been digging through their docs and code. Everything seems pretty solid. I am currently setting up a testnet validator to see what’s what. I would agree with this comment OP.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iahrywu",
                            "author": "user-42",
                            "score": 1,
                            "created_utc": 1653873977.0,
                            "response": "Do you self host? If not, may I ask which hosting provider you went with?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaid1ku",
                                    "author": "ma0za",
                                    "score": 2,
                                    "created_utc": 1653885146.0,
                                    "response": "I run it myself",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iajx46q",
                            "author": "nishinoran",
                            "score": 1,
                            "created_utc": 1653924035.0,
                            "response": "I have to admit though, the last minute error that was shown by Lido? I think in all these staking platforms, that wasn't caught by any of the audits, definitely leaves me still feeling queasy.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iah9v71",
                            "author": "semicryptotard",
                            "score": 0,
                            "created_utc": 1653864463.0,
                            "response": "Just be aware that RPL yields are likely to be cut in half soon due to major whale staking activity.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iahluvm",
                                    "author": "coherentak",
                                    "score": 2,
                                    "created_utc": 1653870791.0,
                                    "response": "It’s still easier to run a node through rocketpool software and yield should get worse but always better than just running a regular eth validator.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iaidexi",
                                    "author": "ma0za",
                                    "score": 1,
                                    "created_utc": 1653885374.0,
                                    "response": "For RPL rewards to be cut in half, whales would need to stake the same amount of collateral that is allready locked up right now which is 5.250.000 RPL. Thats like 30% of the Total supply. If that happens online god knows where the RPL price will Go",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaieqfc",
                                            "author": "semicryptotard",
                                            "score": 1,
                                            "created_utc": 1653886208.0,
                                            "response": "Nah the yield curve isnt linear. That being said, i think we have about 3m RPL lined up for staking so the OTC supply will be wiped out.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaiezww",
                                                    "author": "ma0za",
                                                    "score": 1,
                                                    "created_utc": 1653886381.0,
                                                    "response": "RPL rewards are Distributed Based on your share of the effectively staked supply. Thats linear.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iahz76x",
                    "author": "RevolutionaryMood471",
                    "score": 1,
                    "created_utc": 1653877679.0,
                    "response": "I run one. If you want to learn more, head over to the Rocketpool discord. Incredibly active over there.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajee0s",
                    "author": "SaladAssKing",
                    "score": 1,
                    "created_utc": 1653914505.0,
                    "response": "I use stakewise. I have no knowledge outside of this particular staking platform. So, I am here to read and get info. Thanks OP.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}