{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzrr7c",
            "title": "Need help with Optimism",
            "url": "https://www.reddit.com/r/ethereum/comments/uzrr7c/need_help_with_optimism/",
            "author": "notooth1",
            "created_utc": 1653758051.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "ethereum",
            "selftext": "l2geth cannot connect to data service. Can anyone help?\n\n    INFO [05-28|17:03:41.407] Cannot connect to upstream service       msg=\"Cannot connect to data service: Cannot fetch eth context: Get \\\"http://localhost:7878/eth/context/latest\\\": dial tcp [::1]:7878: connect: connection refused\"\n    INFO [05-28|17:03:51.406] Cannot connect to upstream service       msg=\"Cannot connect to data service: Cannot fetch eth context: Get \\\"http://localhost:7878/eth/context/latest\\\": dial tcp [::1]:7878: connect: connection refused\"\n    INFO [05-28|17:04:01.406] Cannot connect to upstream service       msg=\"Cannot connect to data service: Cannot fetch eth context: Get \\\"http://localhost:7878/eth/context/latest\\\": dial tcp [::1]:7878: connect: connection refused\"\n    INFO [05-28|17:04:11.406] Cannot connect to upstream service       msg=\"Cannot connect to data service: Cannot fetch eth context: Get \\\"http://localhost:7878/eth/context/latest\\\": dial tcp [::1]:7878: connect: connection refused\"\n    INFO [05-28|17:04:21.407] Cannot connect to upstream service       msg=\"Cannot connect to data service: Cannot fetch eth context: Get \\\"http://localhost:7878/eth/context/latest\\\": dial tcp [::1]:7878: connect: connection refused\"\n    INFO [05-28|17:04:31.407] Cannot connect to upstream service       msg=\"Cannot connect to data service: Cannot fetch eth context: Get \\\"http://localhost:7878/eth/context/latest\\\": dial tcp [::1]:7878: connect: connection refused\"",
            "stickied": false,
            "comments": [
                {
                    "id": "iaeebsi",
                    "author": "banaanigasuki",
                    "score": 1,
                    "created_utc": 1653805231.0,
                    "response": "r/ethdev",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uzrlfu",
            "title": "I wonder how sites verify stolen nfts?",
            "url": "https://www.reddit.com/r/ethereum/comments/uzrlfu/i_wonder_how_sites_verify_stolen_nfts/",
            "author": "kid_cl1que",
            "created_utc": 1653757597.0,
            "score": 0,
            "num_comments": 15,
            "subreddit": "ethereum",
            "selftext": "I had a situation where I bought an NFT and after a while the site told me it was stolen, but I bought from the same site. ✅🐹\n\n\nI can imagine such a case:\n\nI bought a NFT and sold it on one of a bunch of sites, and then some time passes and the nft goes up in value and it makes me angry (hi fomo) and I claim the NFT was stolen from me and the site blocks that nft, upsets the new owner and explains that dear friend, the nft is stolen and we will refund you the money you spent to buy it and that's it, and then the NFT comes into my hands and I sell it to great success. Easy money.",
            "stickied": false,
            "comments": [
                {
                    "id": "iac7apa",
                    "author": "rundown03",
                    "score": 1,
                    "created_utc": 1653761861.0,
                    "response": "You clearly don't seem to understand how any of this works.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac7q3l",
                            "author": "kid_cl1que",
                            "score": -1,
                            "created_utc": 1653762063.0,
                            "response": "Well that's why I have a question, how does this system work ?) I know about the service chainalisys and etc",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaf5slm",
                    "author": "ledav3",
                    "score": 1,
                    "created_utc": 1653828071.0,
                    "response": "Did you buy on a legit known site? Feels like you are getting scammed..",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaf6a10",
                            "author": "kid_cl1que",
                            "score": 1,
                            "created_utc": 1653828368.0,
                            "response": "Bought on OpensSea, I went to see FLOR well there was a notice suspicious activity and contacted customer service and I just got upset\n\nSupport apologizes and offers to reimburse me for my purchase, but the NFT price is already higher.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iag2gux",
                    "author": "--soldier76--",
                    "score": 1,
                    "created_utc": 1653843707.0,
                    "response": "They track how many times it’s been screenshitted",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag2yt8",
                    "author": "ROARGRRRR",
                    "score": 1,
                    "created_utc": 1653843932.0,
                    "response": "This is a good question in my opinion. A couple things:\n\n1) You own the NFT. Or to be more specific you own the likely ERC-721 token on the ethereum blockchain.  So opensea can’t force you to give it back to them at a lower price than you think it’s worth.  In this case if you want to simply keep the nft or sell it at the higher price you are free to do so.  Opensea is simply extending a curtesy because some people may be upset that bought a stolen nft.  \n\n2) In a more general sense it is an interesting question when buying an nft to know it’s history and sort of chain of custody.  Some people may feel it is important that it was never stolen.  Others may not care so much since it’s your responsibility to custody your own property.  It will be interesting to see how this develops as the nft space matures.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagmx7z",
                            "author": "kid_cl1que",
                            "score": 1,
                            "created_utc": 1653853174.0,
                            "response": "I'm just wondering how opensea proves the theft. If there is a simple loop, then you can compromise all of your losing trades as stolen. Thus framing future holders 🦊🥕",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iagn3xy",
                            "author": "kid_cl1que",
                            "score": 1,
                            "created_utc": 1653853261.0,
                            "response": "I know for chainalisys services and I think they added the DeFi market check and nft",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iadwo8h",
                    "author": "LordBaikalOli",
                    "score": -1,
                    "created_utc": 1653793143.0,
                    "response": "If only you would known that buying an URL link doesnt give you intellectual property rights of an image...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaemajy",
                            "author": "kid_cl1que",
                            "score": 1,
                            "created_utc": 1653812107.0,
                            "response": "I got into a situation where I bought an NFT on the site and then the site reported that the NFT was stolen and we would refund the funds at the time of purchase. The only point is FLOR went up and NFT had a lot of buy/sell deals, so I, as a new holder, got hit.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iagjmkt",
                                    "author": "LordBaikalOli",
                                    "score": 1,
                                    "created_utc": 1653851634.0,
                                    "response": "Its a scam, you can make money on scams yes, but theres a lot more chance youll be part of the 99% that lose mlmey on it haha",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iagjzda",
                                            "author": "kid_cl1que",
                                            "score": 1,
                                            "created_utc": 1653851799.0,
                                            "response": "I'm just now in a situation where I'm losing nft and lost profits(((",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uzrnuy",
            "title": "DeFi is either truly immutable or permissionless, or it is only \"automated finance\".",
            "url": "https://www.reddit.com/r/ethereum/comments/uzrnuy/defi_is_either_truly_immutable_or_permissionless/",
            "author": "samdane7777",
            "created_utc": 1653757792.0,
            "score": 24,
            "num_comments": 11,
            "subreddit": "ethereum",
            "selftext": "The TLDR is that behind the scenes the US and EU want global mandatory travel rule, which means KYC, compliance, on every DeFi smart contract, every software wallet, and eventually trezor and nano. This is their starting point, because they basically run the world and want a \"suprastate\" more or less.\n\nThey're just going to legally intimidate, enforce, coerce, extradite, prosecute etc developers until they bleed us dry and fully intimidate any venture capital. VC can't do anything, all major liquidity providers will always be extremely legally exposed.\n\nWe need to look at a few facts here:\n\n1) Web 3 helps people in failed states more than developed nations. If a government is particularly terrible and undemocratic, Web 3 being fully immutable and fully anonymous is an absolute necessity.\n\n2) Canada proved that allegedly democratic states will fascistically confiscate funds and politically persecute you for speech and assembly. \n\n3) america has done this in the past, to countless people, notably the Internment of Japanese citizens. america has reneged on countless treaties.\n\n4) Most developing nations are in fact colonially designed \"Post-Colonial administrative States\" that are designed to largely enrich international companies at the expense of civil liberties for the developing world. \n\n5) \"activist\" regularly collude with and weaponize the Privitization of Multinational capital institutions to advocate censorship and confiscation of funds, deplatforming of rights to a living, \"activist\" regularly collude with executive branches of states simultaneously to do extrajudicial, unelected confiscatory and censorial behavior against their political enemies\n\n5b) this sets the precedent to do the same behavior to other outgroups in developing nations, it serves as a playbook for what undemocratic countries can do, and furthers the extreme fascistic behavior of Web2 companies, who also operate overseas in developing nations. It's also already happened in numerous egregious instances I won't get into.\n\n6) Banks and Web2 were used extensively from 2001-to late 2017 and current to further the war on terror, the continued prejudice exists to this day with Persians being blackballed from most of the entire crypto industry, even blackballed from Github.\n\n7) China's entire political system is utterly anti-thetical to crypto, the CCP largely has no use for blockchain technology. The type of human control they want is much easier with SQL databases.\n\n7b) China locked people in their apartments for 60 days, so yes you basically belong to the state there, good luck with speech or finance. \n\n8) People in extremely poor developing nations have absolutely no documentation or their documentation is extremely limited, banking is non existent. If they are given permissioned back doored narc ware automated crypto-finance, their own government will use it to prejudice them deeply, and that's not even getting into what we already do to say Iran as I already mentioned.\n\n9) Web 1 is not state resistant. Self hosting is not state or sovereign resistant. Tor is not enough. Web 1 is not \"neutral territory\",  in that individual websites can easily be targeted, you do not have a \"platform network commons of neutrality\" to give some sort of \"lost in the crowd effect\" to protect you from political persecution. \n\n9b) Though the absolute blockchainifcation of everything is stupid, and excess tokens are stupid, Web 1 basically has no state resistance to corrupt or ideological factions of the state, or states, without some finality, fidelity, and encryption via Zkrollups and layer 3 features and or Lightning, or IBC, etc. offchain engineering without onchain guarantees makes web 1 deeply vulnerable and deeply unscalable. This is why Web2 beat Web 1's network effect so severely, scale and adoption based on peer to peer usage.  \n\n10) Currency Boards, Central Banks, and Lebanon as example. Need I say more.\n\n11) and this is important, Daos that we have, have made, or have tried to make are by definition much more democratic and transparent than Western Governments. Whatever international consensus you think is needed to public infrastructure, taxation, charity, children, the elderly, whatever concern you have about oversight of \"criminals\", public networks like ethereum, and public protocols like aave are infinitely more democratic than the US government, SEC, or countless evil web 2 companies like Reddit.",
            "stickied": false,
            "comments": [
                {
                    "id": "iad4v11",
                    "author": "Sw33tN0th1ng",
                    "score": 18,
                    "created_utc": 1653777891.0,
                    "response": "Take a break. Go for more walks. This reads like you've been boxed in your own head way too long.\n\n\"They\" are just ordinary humans following ordinary human behavior. There is no man behind the curtain. There is no great and powerful Oz with detailed plans for the whole world.\n\n\"They\" are just selfish and short sighted people pursuing personal short term goals. There is no enemy with a plot, just mediocre selfish individuals each doing their own tiny part to make the world suck.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iae6tks",
                            "author": "Perleflamme",
                            "score": 1,
                            "created_utc": 1653799620.0,
                            "response": "To be fair, nothing in OP's rant actually needs to be based on the fact there's some kind of long term goal to control people or whatever. Even with the realization it's resulting from short term goals of short sighted people, it's still the same, valid rant: being short sighted, at least some of these people will still try and fight against decentralization because of the short term loss they feel from it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iadq3xg",
                    "author": "Perleflamme",
                    "score": 2,
                    "created_utc": 1653789364.0,
                    "response": ">They're just going to legally intimidate, enforce, coerce, extradite, prosecute etc developers until they bleed us dry and fully intimidate any venture capital. VC can't do anything, all major liquidity providers will always be extremely legally exposed.\n\nYou can't bleed what's anonymous. They can't find Satoshi, which means it's possible for anyone else to do the same. And even if they actually find that person/group, everyone will think they've just pretended they've found Satoshi to show they can reach anyone, nothing else. As long as the same signature used to encrypt the message stored in the first block isn't used again, no one can claim who Satoshi is. And if Satoshi is smart enough, Satoshi's burnt that private key, so that no one can prove who Satoshi really is.\n\nIt's exactly the same with liquidity providers. There are people with huge amounts of crypto, from the very beginning. And no one knows who they are. At any point in time, they can be part of any decentralized organization needing liquidity providers. \n\nAs such, all they can legally intimidate, enforce, coerce, extradite and prosecute  is whatever's not decentralized. \n\nAnd that's exactly how uncoerceable coordination works. \n\nFor instance, China tried to ban crypto mining activities. All it could do is ban big mining farms, shutting what previously was more than 50% of mining activities. Within a year, it's now back to the same activity level, but with hidden mining activities. All China enforced is making sure PoW remains decentralized, which is frankly very useful. I wouldn't have expected such consequences, even more so this soon. \n\nDAOs aren't really democratic. They give more power to the people, sure, because it's about self-sovereignty, but self-sovereignty is fortunately antithetical to democratic principles, notably the fact that majorities have all powers over others within a democracy. That concept of majorities having all power is dangerous anyway, as it's pretty vulnerable to manipulation.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagetzu",
                            "author": "French_Francis",
                            "score": 1,
                            "created_utc": 1653849393.0,
                            "response": "Absolutely agree but imo what we need is to try to imitate Satoshi, maybe investing into decentralized projects like bch could help us avoid big brother a whole lot. It is not a definitive solution but I think it's a first step towards some kind of solution.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iagkwfc",
                                    "author": "Perleflamme",
                                    "score": 1,
                                    "created_utc": 1653852226.0,
                                    "response": "What do you want more from BCH? It's already there and working. It's not as if the goal of BCH wasn't already fulfilled. \n\nMaybe you're willing to reduce its cost and throughput even more? Why not. Have some kind of PoS-based BCH, perhaps? Or implementing some kind of master coin on top of BCH like what Vitalik wanted to do with BTC back in the days, so that you can increase BCH scalability through other layers?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iadpagj",
                    "author": "Ok-Nefariousness1340",
                    "score": 1,
                    "created_utc": 1653788899.0,
                    "response": "Seems mostly true. No point in sitting around feeling anxious about it though. \n\n1. What specific steps are they likely to take to implement these restrictions? What will the process look like?\n\n2. What can we do to prevent this, or at the least make it more difficult for them?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iags7h2",
                    "author": "Mallardshead",
                    "score": 1,
                    "created_utc": 1653855678.0,
                    "response": "It's a vaporware scam:\n\n[https://twitter.com/tenderscore/status/1530790900749676544?s=20&t=ZpTySbLAflu5CRHGzkpJOg](https://twitter.com/tenderscore/status/1530790900749676544?s=20&t=ZpTySbLAflu5CRHGzkpJOg)",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uzrlsx",
            "title": "Noob-friendly Web3 platforms Beginners can try out! — Coinsources",
            "url": "https://coinsources.io/ethereum/",
            "author": "Freakstyle5",
            "created_utc": 1653757627.0,
            "score": 1,
            "num_comments": 4,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}