{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqxqb2",
            "title": "Tracking Ethereum Developer Hours and/or Code Changes",
            "url": "https://www.reddit.com/r/ethereum/comments/uqxqb2/tracking_ethereum_developer_hours_andor_code/",
            "author": "JT_1976",
            "created_utc": 1652712700.0,
            "score": 1,
            "num_comments": 6,
            "subreddit": "ethereum",
            "selftext": "Is there a way to track how much time Ethereum developers are actually spending on The Merge? Is there a way to track the material progress this \"team\" is making on a daily basis or do they get around to writing code when they \"feel\" like it?\n\nI've been in the software development industry since 2000. Far more complex systems and applications have been developed in a fraction of the time it is taking Ethereum developers to do whatever it is they are supposed to be doing.\n\nWhere is the accountability? If this  was a VC backed start-up in the normal capital markets, this bullshit would not be allowed to happen.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8u1630",
                    "author": "jpea",
                    "score": 4,
                    "created_utc": 1652717073.0,
                    "response": "How have you been in the software world for 22 years being this much of an asshole?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u1la5",
                            "author": "JT_1976",
                            "score": 2,
                            "created_utc": 1652717244.0,
                            "response": "It takes 22 years of being in the software world to become this much of an asshole.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8u5awm",
                                    "author": "jpea",
                                    "score": 1,
                                    "created_utc": 1652718744.0,
                                    "response": "Touché.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8u6quh",
                                            "author": "JT_1976",
                                            "score": 1,
                                            "created_utc": 1652719311.0,
                                            "response": "And for the internet record, I'm really not this much of an asshole, at least not in the offline world.\n\nSomething about being online makes being an asshole very easy. It is why after 22 years of being in and around this stuff, I desire less and less and just want to be outside. I suspect others will follow over time, which is why I short Meta and Snap.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8vc6gm",
                    "author": "Perleflamme",
                    "score": 1,
                    "created_utc": 1652736057.0,
                    "response": "Most devs fail to realize coding an ecosystem in a trustless environment isn't relying only on development skills. It first and foremost relies on game theory principles. \n\nCreating the detailed specs themselves is extremely difficult, because you have to ensure it works without knowing who interacts with your system. And you have to implement self-regulated mechanisms that allow for the different users to have aligned incentives, notably in terms of profitability. At all times, being malevolent must be unprofitable. \n\nAnd all that without any bug, of course. Let's just say that it's quite rare to see actually good devs, ones who value the activity of testing and who know that coding architecture has nothing to do with an \"architect\" telling you which lib to use, devs who know how to follow the SOLID principles.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqxluf",
            "title": "CBDC: Who is building the platform for the US government backed stablecoin?",
            "url": "https://www.reddit.com/r/ethereum/comments/uqxluf/cbdc_who_is_building_the_platform_for_the_us/",
            "author": "Sparrow7Trades",
            "created_utc": 1652712340.0,
            "score": 1,
            "num_comments": 11,
            "subreddit": "ethereum",
            "selftext": "I am confident that huge gains are in store for whatever company has a contract with the federal government to build out its government-backed stablecoin network. But I can't figure out what company that is. Visa? Anchorage? Stellar? Square? Help me people.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8txvnb",
                    "author": "patrioterection",
                    "score": 4,
                    "created_utc": 1652715737.0,
                    "response": "Its Circle/USDC. I thought everyone already knew this.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ub4nr",
                            "author": "Sparrow7Trades",
                            "score": 2,
                            "created_utc": 1652721042.0,
                            "response": "From what I read, Circle has positioned itself to be the choice, but I don't see where that choice has been made. Seems Visa has done the same. What makes you so sure it's Circle?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8uy03v",
                                    "author": "patrioterection",
                                    "score": 1,
                                    "created_utc": 1652730240.0,
                                    "response": "They have Blackrock backing them. $7 trillion in assets under their control. That's almost 15% of all the wealth in the world.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8uallw",
                    "author": "No-Courage-1202",
                    "score": 2,
                    "created_utc": 1652720828.0,
                    "response": "Probably one of the big banks",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vc8m0",
                    "author": "MoistConcert420",
                    "score": 2,
                    "created_utc": 1652736083.0,
                    "response": "Probably the U.S. treasury. With the U.S. track record. They'll probably make some new government body to run/oversee it. I highly doubt it will be contracted out. \n\nFrom the small study they did (treasury/university) all the stats looked like direct stats from ETH network, such as theoretical limits. Wouldn't be surprised if they just running a geth clone. \n\nEither way going to be some big players such as the Treasury. Why print money when you can just modify a line of code? Hahahaha. \n\nWould a backed U.S. government stablecoin even logically make sense if they can unlimited print the backing? Of course it does... do what China and India did... release coin, than ban everything else. Easy profits.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vd2yd",
                            "author": "Sparrow7Trades",
                            "score": 1,
                            "created_utc": 1652736442.0,
                            "response": "Okay these are wise thoughts, however I read that the Treasury felt under the gun to get this done this year in order to compete with China. If that's true, they can't do it in-house. The government is WAY too slow to get it done in months. Hence my belief it not only will be contracted out, I bet it already has.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vfgp7",
                                    "author": "MoistConcert420",
                                    "score": 1,
                                    "created_utc": 1652737467.0,
                                    "response": "Follow the FED minutes.... almost everytime they discuss research and years out before a possibility of a CBDC backed by the U.S. \n\nNot sure where you see the rush stuff at. If it's not coming from Powell, I wouldn't be buying into what people are selling. Not like the FED is just going to sit on it than just release something magically one day when they are claiming years out if they do one at all. \n\nI'm more concerned about how China and India banned other crypto once they dropped their own CBDC and how the U.S. will almost follow identical suit. A CBDC by the U.S. could be the deathnail to crypto. \n\nWasn't that long ago the dollar was under attack and they stole everyone's physical gold. Would have to be pretty delusional their endgoal is to incorporate. When they just steal the tech for themselves and ban everyone from using anything else.\n\n*** on a side note ***\nWhen I say ban... I mean FIAT on ramps/off ramps. Erich can easily be done with an executive order  What coin is going to have value if you can't get FIAT?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8vfpof",
                                            "author": "Sparrow7Trades",
                                            "score": 1,
                                            "created_utc": 1652737575.0,
                                            "response": "I agree. Must get on defi. Thanks for your thoughts.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8trjfj",
                    "author": "PapaChonson",
                    "score": 1,
                    "created_utc": 1652713110.0,
                    "response": "Stellar has been my guess. Now we wait and see…",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}