{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ryk3it",
            "title": "\"My first impressions of web3\"",
            "url": "https://moxie.org/2022/01/07/web3-first-impressions.html",
            "author": "jenya_",
            "created_utc": 1641595152.0,
            "score": 650,
            "num_comments": 257,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "hrrz15r",
                    "author": "vbuterin",
                    "score": 424,
                    "created_utc": 1641649993.0,
                    "response": "The word \"server\" imo is not very useful in the blockchain context; it combines together a bundle of concepts that are best treated separately. Particularly, think of the following ways that a user could connect to the blockchain:\n\n1. Use a Binance account.\n2. Run a piece of code that asks the Infura API endpoint what the blockchain state is, trust the answer. However, keys are still kept locally; the code signs transactions locally and sends them to the Infura API endpoint to be re-broadcasted.\n3. Same as (2), but the code also runs a [light client](https://github.com/ethereum/consensus-specs/blob/dev/specs/altair/sync-protocol.md) to verify the signatures on the block headers and uses Merkle proofs to verify individual account and storage data.\n4. Same as (3), but the code talks to N different API endpoints run by N different companies, so only 1 of them need to be providing honest answers for the connection to be reliable.\n5. Same as (4), but instead of pre-specifying N API endpoints the code connects directly to a p2p network\n6. Same as (5), but the code also does data availability sampling and accepts fraud proofs, so it can detect and refuse to accept blocks that are invalid.\n7. Run a fully verifying node.\n8. Run a fully verifying node that also participates in mining/staking.\n\nCurrently, only (1), (2), (7) and (8) are feasible, and (7) and (8) are too expensive for most users. Indeed, the whole reason why blockchains are the future of decentralization and self-hosting is not is that running a server that stays online 24/7 is even harder than (8) [if your staking node is only online 95% of the time, you're fine; if your _website_ is only online 95% of the time, that presents a serious annoyance for your users!].\n\nMoxie's critiques in the second half of the post strike me as having a correct criticism of the _current state_ of the ecosystem (where (1), (2), (7) and (8) are the only things that we have working code for), but they are missing where the blockchain ecosystem is going. There's already teams [working](https://github.com/ethereum/consensus-specs/pull/2786) on [implementing](https://github.com/uink45/Beacon-Chain-Light-Client-Prototype) (3), (4), (5), and active research on [making](https://github.com/ethereum/consensus-specs/pull/2792/) (6) [happen](https://notes.ethereum.org/@vbuterin/verkle_tree_eip). These efforts, contrary to Moxie's claim that there's little _cryptography_ involved in crypto (correct about much of what's happening today!), are heavily based on some of the most cutting-edge and advanced cryptography out there: [Verkle trees](https://vitalik.ca/general/2021/06/18/verkle.html), [ZK-SNARKs of the EVM](https://ethresear.ch/t/a-zk-evm-specification/11549), [BLS signature aggregation](https://ethresear.ch/t/pragmatic-signature-aggregation-with-bls/2105) and so on. \n\nAs for my theory about \"why this hasn't happened yet\", I would say a lot of it comes down to limited technical resources and funding. It's easier to build things the lazy centralized way, and it takes serious effort to \"do it right\". The Ethereum ecosystem did not have that much resources up until ~4 years ago.  Of course, ~4 years ago, the ecosystem did start to have a lot of resources, but new projects are slow to ramp up, and the centralized workarounds have had years of head start. One thing that makes the ramp up even slower is the chain of dependencies: in order to have light clients, we need to have a light client friendly chain, which is a deep change to the protocol, and so the only realistic opportunity to implement it is the switch to PoS, and we're only now at the point where we have the PoS, and full integration with the merge is coming soon. Fortunately, the dependencies are being attacked and resolved one-by-one, and there has already been a lot of progress! Once the general-purpose hard legwork is done by a few dedicated teams, building trustless applications will become much more feasible for all dev teams, that would just need to plug in the libraries.\n\nSo I think the properly authenticated decentralized blockchain world is coming, and is much closer to being here than many people think. Of course, it's always possible that all this tech will get built and many people will not care. But I'm more optimistic. Users generally accept defaults given by developers, and many developers really do genuinely care about decentralization and trustlessness (and growing legal issues with running centralized points of trust will push them to care more). Decentralized options that users reject today (eg. running a full node) really are quite difficult today, so it's understandable that users are sticking to the more centralized options that at least they can easily use. None of the proposals outlined here are anywhere remotely as difficult, and even running a full node itself will get easier and cheaper over time as ideas like statelessness and history expiry come into play. So I see no technical reason why the future needs to look like the status quo today.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hrs6men",
                            "author": "OneSmallStepForLambo",
                            "score": 47,
                            "created_utc": 1641653744.0,
                            "response": ">People don’t want to run their own servers, and never will. The premise for web1 was that everyone on the internet would be both a publisher and consumer of content as well as a publisher and consumer of infrastructure.\n\nI just setup a test node on the Kintsugi network, the process is out of reach for a non technical person. However, so is setting up a Linux box as a home router, firewall, DNS and DHCP server. But every grandmother out there is running this right now buy purchasing a low cost appliance that makes the UX seamless. \n\nI'd like to think this would be the case with Web3 as we build more and more abstraction layers. I don't see why that couldn't happen.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hru3o87",
                                    "author": "pedrodevoto",
                                    "score": 10,
                                    "created_utc": 1641681606.0,
                                    "response": "Do you see the difference though? “Running your server” refers to the fact of knowing what you are doing. Having an ISP’s tech guy plug a router in your home is not “running your own server”. For most people it’s just a black ugly necessary magic box that generates Internet. Once the state of the art gets into something more convenient, like when devices can be connected directly to satellite Internet connection, people will get rid of those inconvenient unnecessary pieces of ugly furniture.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hrxczpu",
                                            "author": "OneSmallStepForLambo",
                                            "score": 4,
                                            "created_utc": 1641743775.0,
                                            "response": ">when devices can be connected directly to satellite Internet connection, people will get rid of those inconvenient unnecessary pieces of ugly furniture.\n\nDo you mean low orbit satellites (e.g. Starlink), or cell providers via 5G? IMO I don't think fibre to the home is going anywhere for the next 20+ years. It will always provide the lowest latency, highest throughput to the home. 10Gbe in enterprises are a thing now, and they will be coming to homes in the next 5-10 years. \n\nImagine Ethereum's block chain size 3 times larger than it is now, over 10Gb. It would sync the chain in [~40 minutes](https://www.wolframalpha.com/input/?i=3TB+over+10+gigabit+per+second) using low cost commodity hardware - compute and storage prices will continue to drop like they're now.  I digress from the point however that \"running your own server\" won't be the focal point, the technical hurdles we're jumping through now are not intended to be the expectation for the average end user in \"web3\".",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hs90uba",
                                                    "author": "saurosaur",
                                                    "score": 2,
                                                    "created_utc": 1641930949.0,
                                                    "response": "> It will always provide the lowest latency, highest throughput to the home.\n\nI agree fully that Starlink is not a competitor to fiber, but in the very niche case that you want low latency over very long distances (e.g. other continents) Starlink will potentially provide the lowest latency because the speed of light is faster in vacuum (space) than in a fiber optic cable.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hs9nnez",
                                                            "author": "Fat-boyy",
                                                            "score": 1,
                                                            "created_utc": 1641939327.0,
                                                            "response": "Ye iirc Africa and countries without wide spread networks is the biggest target for Starlink. Will get them more integrated with the rest of society.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hrth3q6",
                                    "author": "aurous9",
                                    "score": 4,
                                    "created_utc": 1641672470.0,
                                    "response": "Seconded. I agree that most people won't set up a node. However, as you said we already see easy to implement solutions. Rocketpool and other Staking-as-a-Service or Nodes-as-a-Service solutions (StrongBlock) make it seamless for people to earn rewards while supporting the underlying Web3 infrastructure.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hrxkekz",
                                            "author": "therealestx",
                                            "score": 1,
                                            "created_utc": 1641746605.0,
                                            "response": "Aren't you introducing a lot more centralization that way?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hs88cm8",
                                                    "author": "semicryptotard",
                                                    "score": 2,
                                                    "created_utc": 1641920573.0,
                                                    "response": "Rocketpool is a decentralized staking service. Anyone can permissionlessly become a node operator by setting up Rocketpool's smart node stack on a linux box (they have easy to follow instructions and a very helpful discord community).\n\nNode operators contribute half of the 32 ETH required for a validator while \"stakers\" who swap their ETH for RP's derivative token rETH contribute the other half. Stakers can stake as little as 0.1 ETH, expanding the market for staking and ensuring more users can participate. By swapping ETH for rETH, they also retain liquidity and can use rETH in defi (integrations with various defi protocols are ongoing).\n\nFor their services, Node operators receive both ETH rewards on their 16 ETH, plus a commission on rewards from the stakers' 16 ETH (5-20% based on staking demand). They also receive RP's native token, RPL, which is used by Node Operators to collateralizes (insure) their nodes against slashing. Current APR on RPL is over 25%. Don't need to get into that piece in detail, but the point is that this service greatly incentivizes decentralization of the node operator layer with a superior economic model.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hrulzw3",
                                    "author": "garbbagebear",
                                    "score": 2,
                                    "created_utc": 1641689200.0,
                                    "response": "I also don't see why someone cannot start a service business that helps customers with their setups, like telecom company's do today.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hrs83n5",
                            "author": "-xander",
                            "score": 14,
                            "created_utc": 1641654419.0,
                            "response": "Thank you for the candid write-up. This is more of a philosophical question than a technical one, but the original article spoke a lot about speed to market wrt protocol vs platform. Do you think builders and users will tolerate waiting for protocol improvements when the expectations of modern development increasingly tends towards rapid updates and iteration? What are the mechanisms for bringing these users back to protocol-level solutions? In some ways, I think Solana is more platform than protocol and that accounts for its success.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hru653b",
                                    "author": "pepepeoepepepeoeoe",
                                    "score": 3,
                                    "created_utc": 1641682620.0,
                                    "response": "I really don’t even consider solana a competitor to ethereum. I’ve been ‘in’ crypto since before ethereum existed and I’d never even consider using sol for centralization reasons. It’s only a competitor if you consider ethereums purpose to be a casino and finance ‘app’, which is not at all how I see it. But for people who see it like that sure go use solana it’s gonna be better for now (until the centralization catches up to you). \n\nIf you care about decentralization the only real competitor is Bitcoin, but smart contracts are way more interesting to me personally.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hrw9eei",
                                            "author": "redsilverbullet",
                                            "score": 6,
                                            "created_utc": 1641720828.0,
                                            "response": "How is bitcoin decentralized? isn’t 50% of hashrate controlled by like 4 pools?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hrxkykr",
                                            "author": "therealestx",
                                            "score": 3,
                                            "created_utc": 1641746820.0,
                                            "response": "The point the article was making was that the majority of people don't care about decentralization. Making money is the priority on Solana or ETH.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hrt4qz0",
                                    "author": "cantuccihq",
                                    "score": 7,
                                    "created_utc": 1641667614.0,
                                    "response": "I don't think users are waiting, are they? I mean, look at the explosion of NFT communities, Defi apps, DAOs, etc. I think adoption is limited by UX, transaction costs, and complexity of the programming model, more than by degree-of-decentralization.\n\nThe evolution u/vbuterin talks about is an exciting infrastructure roadmap to reduce centralization, but how much will that really affect user-facing applications?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hsph8un",
                                            "author": "acjohnson55",
                                            "score": 2,
                                            "created_utc": 1642209785.0,
                                            "response": "My thoughts exactly. I think those advances will matter on the backend of markets, but not necessarily impact what products and services consumers will adopt.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hrtxqg6",
                            "author": "mstksg",
                            "score": 5,
                            "created_utc": 1641679194.0,
                            "response": "why would platforms like OpenSea ever be incentivized to implement or give up power to these missing middles?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hslk180",
                                    "author": "educatemybrain",
                                    "score": 2,
                                    "created_utc": 1642142717.0,
                                    "response": "The same reason every company does - competition. There are already alternate platforms like looksrare eating their lunch, and if OpenSea doesn't keep up they'll end up being another MySpace.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hs4c3a0",
                                    "author": "lllama",
                                    "score": 1,
                                    "created_utc": 1641851065.0,
                                    "response": "Or rather, what incentivized them to implement this so poorly to start with?\n\nAdding a hash is not exactly rocket science. It's so simple I just assumed they were doing it already.\n\nIt feel deliberate to me.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hs3vdzf",
                            "author": "pbrody",
                            "score": 5,
                            "created_utc": 1641844911.0,
                            "response": "Very much agree with Vitalik and Moxie generally.  I particularly agree with Vitalik's point, it's too easy to use centralized infrastructure now.  I wrote about this last week:\n\n[https://www.coindesk.com/layer2/2022/01/03/web-30-is-too-complicated/](https://www.coindesk.com/layer2/2022/01/03/web-30-is-too-complicated/)\n\nWe must put more blockchain in our blockchain stacks, not just rely upon APIs to build solutions that are \"decentralized\" but depend on centralized infrastructure.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hsek183",
                                    "author": "DConny1",
                                    "score": 1,
                                    "created_utc": 1642023740.0,
                                    "response": "As someone who doesn't come from a software engineering background, but has been in and around crypto for 5 years, I really enjoyed your article, Paul.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hrul08r",
                            "author": "hello_yahweh",
                            "score": 18,
                            "created_utc": 1641688781.0,
                            "response": "This is laughable.\n\nHow many billions of dollars do you need to authenticate HTTP requests? Anonimize them? Do some basic peering? Use even the lightest wallet? It's not a rocket science.\n\nHow many millions of dollars you needed to pull off Ethereum? \n\nThe truly depressing part is that moxie's critique is even not very deep.  It would take literally five minutes for every security researcher to come up with this. The problem is that the ecosystem is actively silencing any voices of concern, so no one even dared to write it. Deep thinking is not the name of the game here. \n\nAs a result, every dollar in the ecosystem makes things worse by attacting even worse grinders, and scaring away developers worth their salt. No investment will improve crypto. Additionally, negative network effects (ie: it makes more sense to start something than to work on an existing project) guarantee no maturity whatsoever, a neverending cycle of copycats approaching the minimum viable fraud, like NFT winning over DeFI.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ht1df7g",
                                    "author": "mrJP889",
                                    "score": 3,
                                    "created_utc": 1642427751.0,
                                    "response": "the majority of people here in the crypto space care less about truth, let alone decentralization,  all they need is another casino, another well-made ponzi, people need a way to gamble their money with and love get rich quick stories",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hs2xsal",
                                    "author": "pachirulis",
                                    "score": 1,
                                    "created_utc": 1641832720.0,
                                    "response": "Yes sir, totally right, here is the only article that supports you and the people that criticize the crypto bros gold rush. Really worth reading.   \n https://www.usenix.org/publications/loginonline/web3-fraud",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hrt6oul",
                            "author": "ChronicElectronic",
                            "score": 9,
                            "created_utc": 1641668368.0,
                            "response": "> Of course, ~4 years ago, the ecosystem did start to have a lot of resources, but new projects are slow to ramp up, and the centralized workarounds have had years of head start.\n\nIsn't this one of Moxie's core points? The centralized approaches will always have a head start because decentralized solutions will always be slow to develop and adapt.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hrw900u",
                                    "author": "bejonesin",
                                    "score": 1,
                                    "created_utc": 1641720523.0,
                                    "response": "Agreed but looking at the evolution of FOSS, this will likely result in a more rigid stratification between technologically literate (TL) and normal users (NU). TL will fortify and thrive; NU might dabble here and there when properly incentivized (i.e. Libre vs MS Office, GIMP vs Photoshop) but, to echo much of the sentiment here, NU will benefit most when infrastructure is completely behind the scenes and hosting the apps/tools they use without their knowledge.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hrs1y2p",
                            "author": "grassclip",
                            "score": 3,
                            "created_utc": 1641651494.0,
                            "response": "For points {3, 4, 5, 6}, where you say those are currently unfeasible ways for a user to connect to the ecosystem, do you have preference on which one lacking in participants but would be the most beneficial everyone if more people or groups invested in it?\n\nSimilarly, is there something in points {1, 2, 7, 8}, that is currently doable, that would bring the most help to the ecosystem? Perhaps easing the ability to not need to use Infura?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hsjrbc3",
                            "author": "DeviateFish_",
                            "score": 2,
                            "created_utc": 1642113048.0,
                            "response": "> As for my theory about \"why this hasn't happened yet\", I would say a lot of it comes down to limited technical resources and funding.\n\nI'm sorry, but what the fuck?\n\nThere's *so* much money in this space, and you're trying to say there's \"not enough funding\"? Hell, so many people (yourself included) have made literally millions (billions?) from Ethereum, and you're complaining about the lack of funding?  You could fund all of this yourself, and have been able to for _years_.\n\nOh, right, because 99% of that \"funding\" just goes towards making more money from that money.  You know, \"investing\".  The problem, of course, is that you've built an entire ecosystem on top of the profit-maximization incentive.\n\nAs the old saying goes:  \"Show me the incentives, and I'll show you the outcomes.\"  Perhaps including \"currency\" in \"cryptocurrency\" was the original mistake, the one that explains why there's so little \"technical resources and funding\" despite the literal _deluge_ of money in the space?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hskgk17",
                                    "author": "vbuterin",
                                    "score": 15,
                                    "created_utc": 1642123356.0,
                                    "response": "Did you even read the post?\n\n> The Ethereum ecosystem did not have that much resources up until ~4 years ago. Of course, ~4 years ago, the ecosystem did start to have a lot of resources, but new projects are slow to ramp up, and the centralized workarounds have had years of head start. One thing that makes the ramp up even slower is the chain of dependencies: in order to have light clients, we need to have a light client friendly chain, which is a deep change to the protocol, and so the only realistic opportunity to implement it is the switch to PoS, and we're only now at the point where we have the PoS, and full integration with the merge is coming soon.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hsz5khy",
                                            "author": "imponing",
                                            "score": 12,
                                            "created_utc": 1642380934.0,
                                            "response": "Gotta say, I have an immense amount of respect for you coming out onto Reddit to call out bad actors and defend your project and others building on top of it against fools like this guy, especially when it makes almost no difference to you other than being the right thing to do",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hsnbcr1",
                                            "author": "DeviateFish_",
                                            "score": 2,
                                            "created_utc": 1642178539.0,
                                            "response": "Did you even read mine? You've had ample funding and resources since the crowdsale. The entire ecosystem has had orders of magnitude more than what the EF pulled in the crowdsale since barely a year in.\n\nThere's always been tons of money sloshing in this space. The problem isn't the \"order of operations\" (which has also drastically changed since the earliest plans, so it's a bit revisionist to imply it's been stable since the start, much less the last four years), it's that the vast majority of that money has no interest except to multiply. This goes all the way back to the DAO, and _includes your own money_.\n\nThe profit motive has applied to you, too, and it's silly to claim otherwise.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hsndhf4",
                                                    "author": "vbuterin",
                                                    "score": 19,
                                                    "created_utc": 1642179357.0,
                                                    "response": "> The entire ecosystem has had orders of magnitude more than what the EF pulled in the crowdsale since barely a year in.\n\nThis is the whole problem! The EF was months away from bankruptcy in late 2015, and only truly became financially stable in 2017. The \"ecosystem\", on the other hand, started prospering very quickly - and specifically, the parts of the ecosystem which were for-profit companies, and did not have any incentives to build ecosystem-wide public goods that were actually decentralized.\n\nThat was the whole imbalance!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hspo43t",
                                                            "author": "DeviateFish_",
                                                            "score": 3,
                                                            "created_utc": 1642212924.0,
                                                            "response": "Which goes back to my original point:\n\n> The problem, of course, is that you've built an entire ecosystem on top of the profit-maximization incentive.\n\nYou cannot succeed in this environment, because of the profit incentives baked into the very game theory this whole ecosystem is built upon. Those incentives are so strong that they will pervert any other incentive structure you even try to build, and they simply do not care about your other goals.\n\nThere's a particular irony, though, in the EF being so close to bankruptcy while Consensys was literally swimming in cash, given the relationship between the two.\n\n> That is the whole imbalance!\n\nFTFY",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hrs7hfj",
                            "author": "ilikebeanss",
                            "score": -2,
                            "created_utc": 1641654143.0,
                            "response": "> Moxie's critiques in the second half of the post strike me as having a correct criticism of the current state of the ecosystem (where (1), (2), (7) and (8) are the only things that we have working code for), but they are missing where the blockchain ecosystem is going.\n\nFor that being the current state of the ecosystem, a lot is being promised without something substantial to back it up. I think that's the problem, the community is burning through whatever benefit of the doubt the world is giving it by making huge promises for \"one day.\"",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hrtaa93",
                            "author": "theOasisdotcom",
                            "score": 1,
                            "created_utc": 1641669771.0,
                            "response": "By this logic however, won’t centralized services have an even further head start of $$$ and time at any random point in the future? Why is the “missing middle” a temporary state of affairs?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hrvfihw",
                            "author": "lightwad",
                            "score": 1,
                            "created_utc": 1641702161.0,
                            "response": "I am not familiar with how web3 apps interface with Ethereum, but is there any work being done to ensure users can pick which option 1-8 they want to use, rather than being stuck with whatever the app developer chooses?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hrw9lrf",
                                    "author": "redsilverbullet",
                                    "score": 1,
                                    "created_utc": 1641720984.0,
                                    "response": "You can set a custom node to connect to in MetaMask but thats about it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hrxuor7",
                            "author": "cryptoChewy",
                            "score": 1,
                            "created_utc": 1641750456.0,
                            "response": "Is ETH 2.0 going to be declared a security?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hu8ajij",
                                    "author": "humbleElitist_",
                                    "score": 1,
                                    "created_utc": 1643158065.0,
                                    "response": "not a separate token. Asking \"Is ether going to be declared a security\" is a question you could ask. \"Is eth 2.0 going to be declared a security\" seems to not make sense?  \n\nUnless you mean \"is ether going to be declared a security as a result of switching to PoS\" ?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hs387hz",
                            "author": "robertDouglass",
                            "score": 1,
                            "created_utc": 1641836505.0,
                            "response": "My response https://laconic.community/t/in-response-to-moxie-org-my-first-impressions-of-web3/121/2",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hst9y4v",
                            "author": "thedecoyaccount",
                            "score": 1,
                            "created_utc": 1642280165.0,
                            "response": "advice to DEVs out there: when you build 2, 3 ,4, 5,6,7, 8 , PLEASE make an easy to use GUI, don't hide behind complex code and be gatekeeper from the masses, do good for the world make an easy user friendly GUI for everything, and allow advanced nerd coders to play with a terminal if they need.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ht5sr0d",
                            "author": "NicoJuicy",
                            "score": 1,
                            "created_utc": 1642501206.0,
                            "response": "You're totally missing the ball here.\n\nEndusers indeed don't care about blockchain, but currently a minority cares about it because of personal greed, creating a wrong impression about general interest for involved persons ( eg. you).\n\nSo in general, the conclusion should be: end-users don't care about blockchain.\n\nAdditionally, you are building tools for developers and technical people! Not end-users. How can you miss that?\n\nDevelopers/PM's and PO's care about the tech involved and there is almost no objective reason to prefer blockchain above the centralized solutions.\n\nI see no reason why it would be anything more than the status quo today.\n\nI also don't see a technical reason why it should be anything more. Technical debt will ruin Ethereum in the long run. Slow to adopt changes and by that slow to innovate. The more you build an eco-system, the more you will be blocked.\n\nThis fundamental reason won't change.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hvc7oip",
                                    "author": "granularclouds",
                                    "score": 2,
                                    "created_utc": 1643841064.0,
                                    "response": "I would I could read a cogent case against exactly what you lay out here.\n\nThe closer I look into blockchain, the more compelling and indeed even sort of impressive and reliable I find 'legacy' systems. The more experience I've had with building in/for 'web3' the more it feels like literally just web2 but with some copy and pasted solidity and a chrome extension in place of stripe/shopify. And that's without confronting the MLM nature that defines the social contagion phenomenon that is positively rife, more than almost any legal arena I can think of, with paid and unpaid shills, scammers, empty headed or otherwise uninformed influencers and FOMO-pilled, bag-chasing (soon to be bag holding) rubes and unfortunates. \n\nMoreover - and credit to Buterin for responding to Moxie's post - but it is a space so crazily allergic to criticism, attaining cultish proportions see nowhere this side of religion and politics.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hwamnw3",
                                            "author": "NicoJuicy",
                                            "score": 1,
                                            "created_utc": 1644449834.0,
                                            "response": "> the more compelling and indeed even sort of impressive and reliable I find 'legacy' systems\n\nTbh, i never found blockchain compelling since 2018 ( i got out end of 2017 because I  believe i saw the issues. I was a fan of Ethereum and Bitcoin before).",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hthndqu",
                            "author": "-JamesBond",
                            "score": 1,
                            "created_utc": 1642702915.0,
                            "response": "7 and 8 are too \"expensive\" for users until your next toaster has enough storage and compute to act a node. Compute and storage are growing much faster than the blockchains themselves.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hvm88vm",
                            "author": "Haldane-FRS",
                            "score": 1,
                            "created_utc": 1644010759.0,
                            "response": "https://youtu.be/Jbuoszz3w0g",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hrsqk9p",
                            "author": "tombuben",
                            "score": -7,
                            "created_utc": 1641662087.0,
                            "response": "> As for my theory about \"why this hasn't happened yet\", I would say a lot of it comes down to limited technical resources and funding\n\nI'm sorry, but the money and resources is not an issue for someone who invested in eth early on (for example, by being one of the first people who mined any of the tokens). This is a weak excuse about the current state of the ecosystem.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hrsa34q",
                            "author": "ugosemh",
                            "score": -6,
                            "created_utc": 1641655301.0,
                            "response": "$POKT already does that. 300mm + relays/day and growing by the day.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ht5raok",
                            "author": "NicoJuicy",
                            "score": 0,
                            "created_utc": 1642500006.0,
                            "response": "What i read: \"it's harder to setup with Blockchain\". Calling the efficient way lazy is really stupid.\n\nBlockchain will never succeed even solely because of it's major drawbacks.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hrpxeyt",
                    "author": "Crypto_Economist42",
                    "score": 166,
                    "created_utc": 1641605393.0,
                    "response": "Moxie is spot on in his write up here.\n\nMetamask pings etherscan API for every transaction history.  Etherscan keeps your IP. All your addresses are connected with each other and doxxed.\n\nHorrible for privacy. If you use Metamask you have none.\n\nInfura is basically a central point of failure for all eth dapps. We need light client research to advance by an order of magnitude.\n\nThese are legitimate shortcomings of Ethereum ecosystem and need to be fixed.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hrq42t5",
                            "author": "Ohlav",
                            "score": 49,
                            "created_utc": 1641608300.0,
                            "response": "Privacy in transparent chains is like blocking the sun with a sifter.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hrq7psq",
                                    "author": "nvncble",
                                    "score": 5,
                                    "created_utc": 1641609908.0,
                                    "response": "feels oxymoronic honestly. The commentary in the link was kinda referring to the quandary of  recentralization by methods used to make Web3 more adoptable and the pace of development (adoptable or otherwise). There are problems Web3 doesnt intend to fix and other problems that are inherant to the nature of most markets.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hrrqq6f",
                                            "author": "Ohlav",
                                            "score": 1,
                                            "created_utc": 1641645036.0,
                                            "response": "Yeah, like central banks trying to maintain control with CBDCs.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hrqtlar",
                                    "author": "i_have_chosen_a_name",
                                    "score": 1,
                                    "created_utc": 1641620765.0,
                                    "response": "Come on man. It's possible to give end users some control over it. \n\nThe dynamics are quite nice, the bigger your footprint on the network is the harder it is to have privacy and the easier it is to be transparent by default. But the smaller you are as a fish the easier it is to have privacy and the harder it is to have transparency. But if you want to you can be transparent, it's up to you.\n\nAt least that's how it works with Bitcoin Cash and cash fusion which is build in to many SPV wallets now. \n\nIf you combine Bitcoin Cash with monero using atomic swaps the end user can have pretty descent control over how private or how transparent they want to be.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hrrrf9h",
                                            "author": "Ohlav",
                                            "score": 2,
                                            "created_utc": 1641645499.0,
                                            "response": "Sorry mate, but the actual end user that uses Facebook and WhatsApp, Tiktok and Instagram won't do any of those. And they don't need to, they'll just use what is easier.\n\nPrivacy is something you may get in Web2, with DNSCrypt, VPNs, TOR, etc. But it isn't fully functional. JS won't work and most sites will break. I don't want that on Web3.\n\nFor Web3, I want the end of predatory tactics like fingerprinting. Transparent chains can provide that, but only if you are tech savvy.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hrqv2nj",
                                            "author": "dnick",
                                            "score": 2,
                                            "created_utc": 1641621639.0,
                                            "response": "How accessible would you say this ideal brain would be to the average person at this point.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hrqvjt6",
                                                    "author": "i_have_chosen_a_name",
                                                    "score": 3,
                                                    "created_utc": 1641621924.0,
                                                    "response": "Try it. Cashfusion is build in  to https://electroncash.org/ and https://play.google.com/store/apps/details?id=xyz.pokkst.pokket\n\nand also coming to the Bitcoin.com wallet (which also supports Ethereum) \n\nAtomic swaps between Monero and BCH can be made using the software at https://atomicdex.io/\n\n\nIs any of this straight forward to the average person? \n\nNo, but we are close to having UX where people just make the choice between opaqueness and transparency. And the Bitcoin.com wallet is being used right now by my mom and dad so it's definitely going in the right direction in terms of UX (but still much worse then something like handcash was at one point) \n\nWe will get there eventually as long as the community remains funded enough.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hrr6pan",
                                                            "author": "dnick",
                                                            "score": 1,
                                                            "created_utc": 1641629613.0,
                                                            "response": "I do agree that we'll get there. I'm still wondering if we missed the boat on an option that embraces the trustless promise of crypto, as I have no intention of using anything from the bitcoin.com domain for historical reasons, and it seems ease of use currently is going in the complete opposite direction, but I do think once we hit on some compromises we'll at least be able to take advantage of the remaining benefits of crypto.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hrr8ao9",
                                                                    "author": "i_have_chosen_a_name",
                                                                    "score": 2,
                                                                    "created_utc": 1641630831.0,
                                                                    "response": "> as I have no intention of using anything from the bitcoin.com domain for historical reasons\n\nYou have been bamboozled there my friend. I got into the Bitcoin community in 2011, and everybody that loves Bitcoin either quit Bitcoin in disgust after the hostile take over by Visa/Mastercard or is still working on Bitcoin Cash.\n\nhttps://wallet.bitcoin.com gives users full control, hardly any Bitcoin Core maxi wallet does that. The trend among Core maxi's is to push people to custodial wallets like wallet of Satoshi or strike. \\\n\nAnd now with support for smartBCH the Bitcoin.com wallet is going to allow users to seamlessly and decentralised swap between stablecoins and BCH, instantly under 1 BCH for about 5 cents per swap. Or even enter in to hedge position using https://anyhedge.com/\n\nThe user experience with Bitcoin Cash is the best it's ever been, but still much room for improvement.\n\nTry it out for yourself. This is how everybody in Bitcoin before 2015 wanted Bitcoin to work. \n\n/u/chaintip",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hrr8dfa",
                                                                            "author": "chaintip",
                                                                            "score": 3,
                                                                            "created_utc": 1641630888.0,
                                                                            "response": "***\nu/dnick has [claimed](https://www.blockchain.com/bch/tx/478c0c90d4cdea929b08ea5e9fe9071d9c28947b89a6b4ea956fd366209db154) the `0.05130441 BCH` | `~19.38 USD` sent by u/i_have_chosen_a_name\nvia [chaintip](http://www.chaintip.org).\n***",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "hrxqy90",
                                                                            "author": "dnick",
                                                                            "score": 2,
                                                                            "created_utc": 1641749077.0,
                                                                            "response": "I do like the intent, and I don't mean to say the bitcoin wallet isn't good/great/whatever, I'm referring to trust.  The promise of bitcoin was that it operates without having to trust a central party, and wallets in general are either completely negating that or at least teaching people to lean in that direction.  That in itself may not be entirely avoidable, but in the absence of a viable way to avoid putting some initial trust in an unknown party, I do tend to avoid recommending parties that I feel an active reason to distrust.   \n\n&#x200B;\n\nYou can call it 'bamboozled', but you're likely not going to be able to convince me that in the early stages of the BCH fork that the people running [bitcoin.com](https://bitcoin.com) weren't actively using the misdirection and confusion to trick people into supporting their coin at the expense of what they were actually trying to do.  Sure there was a large component of trying to help people and being convinced that they were on the right side of things so their intentions were good (not entirely, but willing to give them a large benefit of the doubt in any case).  But good intentions don't negate tactics, and if they were willing to manipulate people for a good cause, they can manipulate them for a dishonorable cause later if their priorities change.  For that reason I don't consider them significantly different from the BTC team, and they have to be treated as untrustworthly sources just like any other.  \n\n&#x200B;\n\nTo be fair, all of crypto has that same issue, even if it hasn't been shown in the same way in all other coins.  Satoshi solved three legs of the platform, but centralization of development isn't a solved problem even if people are comfortable with the current balance in one coin or another.  The simple fact that external platforms like .com or twitter or /reddit has so much influence shows the crypto is in a very unstable state just yet...and once a wallet or two start becoming super dominant, we'll have ownership of that domain/souce to be concerned about too.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hrxux4i",
                                                                                    "author": "i_have_chosen_a_name",
                                                                                    "score": 2,
                                                                                    "created_utc": 1641750542.0,
                                                                                    "response": ">I do like the intent, and I don't mean to say the bitcoin wallet isn't good/great/whatever, I'm referring to trust. The promise of bitcoin was that it operates without having to trust a central party\n\nThe Bitcoin.com wallet is an Simple Payment Verification wallet. [An essential part of Satoshi his plans to scale Bitcoin to the masses.](https://satoshi.nakamotoinstitute.org/emails/cryptography/2/)\n\n>It is possible to verify payments without running a full network node. A user only needs to keep\na copy of the block headers of the longest proof-of-work chain, which he can get by querying\nnetwork nodes until he's convinced he has the longest chain, and obtain the Merkle branch\nlinking the transaction to the block it's timestamped in. He can't check the transaction for\nhimself, but by linking it to a place in the chain, he can see that a network node has accepted it,\nand blocks added after it further confirm the network has accepted it.\nAs such, the verification is reliable as long as honest nodes control the network, but is more\nvulnerable if the network is overpowered by an attacker. While network nodes can verify\ntransactions for themselves, the simplified method can be fooled by an attacker's fabricated\ntransactions for as long as the attacker can continue to overpower the network. One strategy to\nprotect against this would be to accept alerts from network nodes when they detect an invalid\nblock, prompting the user's software to download the full block and alerted transactions to\nconfirm the inconsistency. Businesses that receive frequent payments will probably still want to\nrun their own nodes for more independent security and quicker verification.\n\n\n >That in itself may not be entirely avoidable, but in the absence of a viable way to avoid putting some initial trust in an unknown party, I do tend to avoid recommending parties that I feel an active reason to distrust.\n\nYou don't need to trust any party when using the Bitcoin.com wallet. You should read up on how SPV works. You can verify your own transactions so nobody can bamzooble you.  When I use the Bitcoin.com wallet I don't have to trust anything or anybody. \n\nBitcoin Core also has SPV wallet like Elektrum. They work exactly the same except for instant payment which have been removed by Replace By Fee which Bitcoin Cash never adopted in to it's code. \n\n\nAnd of course on Bitcoin Core there is no guarantee your tx gets in to the next block because lots of times the mempool is full and you need to win a fee auction. \n\n\n>You can call it 'bamboozled', but you're likely not going to be able to convince me that in the early stages of the BCH fork that the people running bitcoin.com weren't actively using the misdirection and confusion to trick people into supporting their coin at the expense of what they were actually trying to do. Sure there was a large component of trying to help people and being convinced that they were on the right side of things so their intentions were good (not entirely, but willing to give them a large benefit of the doubt in any case). But good intentions don't negate tactics, and if they were willing to manipulate people for a good cause, they can manipulate them for a dishonorable cause later if their priorities change. For that reason I don't consider them significantly different from the BTC team, and they have to be treated as untrustworthly sources just like any other.\n\nThe Bitcoin Core team [actively DDOSSED](https://np.reddit.com/r/btc/comments/4835fp/blockstreamgmaxwell_will_have_you_believe_there/) any competing nodes of the network. In some cases their  DDOS nuked entire rural providers. \n\nThey also banned any discussion about it from bitcointalk.org and /r/bitcoin and any IRC servers, and the Bitcoin dev mailing lists.\n\nAll that Roger Ver did was call BTC Bitcoin Core and BCH Bitcoin Cash when selling both coins on Bitcoin.com \n\n \n\n>To be fair, all of crypto has that same issue, even if it hasn't been shown in the same way in all other coins. Satoshi solved three legs of the platform, but centralization of development isn't a solved problem even if people are comfortable with the current balance in one coin or another. The simple fact that external platforms like .com or twitter or /reddit has so much influence shows the crypto is in a very unstable state just yet...and once a wallet or two start becoming super dominant, we'll have ownership of that domain/souce to be concerned about too.\n\nActually Bitcoin Cash has 6 full nodes team that work independently from each other and are independently funded.  \n\n\nhttps://bitcoincashnode.org/en/\n\nhttps://bchd.cash/\n\nhttps://www.bitcoinunlimited.info/\n\nhttps://bitcoinverde.org/\n\nhttps://kth.cash/\n\nhttps://gitlab.com/FloweeTheHub/thehub\n\n\n>and once a wallet or two start becoming super dominant\n\nSo these 6 independ full node teames, well all these nodes also work as wallet. \n\nNext to that there are more then 70 different wallet for Bitcoin Cash, from client side java wallets to SPV wallets for android and IOS, etc etc etc etc. \n\n\nMost of these wallets are compatible with each other which means you can export your seed from one wallet and import in to the other and then have access to your funds.\n\nThis is very decentralised. The majority of these wallets are open source so you can look a the code or make changes to it and then compile your own wallet.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hs6rlmf",
                                                                                            "author": "dnick",
                                                                                            "score": 2,
                                                                                            "created_utc": 1641893440.0,
                                                                                            "response": "Good response, but I would take exception to three, maybe 4 points.\n\nBTC doing shady stuff doesn’t have anything to do with another team doing shady stuff.\n\nRoger Ver and bitcoin.com *didn’t* just call BTC Bitcoin Core and BCH Bitcoin Cash…they linked to ‘Bitcoin’ and ‘Bitcoin Core’, at a time where Bitcoin was being called out by national media for X price, and visitors go to the site and see Bitcoin (with no qualifier) available far less…now I could recognize that switch up, but you’re not going to convince me that they weren’t taking advantage of that little omission to drive adoption or overtly trick people.  If they had added qualifiers to both, even the fact that they listed BCH first and more obviously could have been overlooked or justified, but calling it Bitcoin and in a less prominent button also offering something called Bitcoin Core cannot.  True, they did eventually change to promote qualifiers to both, but not after already showing themselves to be willing to stoop before correcting course.\n\nThird, 6 teams now doesn’t mean 6 or 10 or 2 teams in the future.  Just because it happens to be okay now doesn’t mean there are any safeguards in the future…just look at how close ABC came to knocking the feet out from under us, or SV with its fork.  BCH is every bit as *susceptible* to centralization, just like BTC looked good and decentralized in the early days.\n\nLastly, trust in a wallet is different than trust in open source…being on a platform it seems almost trivial to throw in a proprietary ‘tweak’ or two in the final product even if you’re source code is open, there’s always something you can’t include in the platform hash, even if it’s only credential related or whatever…being the creator of a mobile wallet will always give you an avenue to take advantage of some people, even if it’s just the lazy ones, even if it risks trashing your reputation, we’re still stuck trusting those safeguards, instead of just the underlying tech.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "hrrjntu",
                                                            "author": "Commercial-Bass-3668",
                                                            "score": 1,
                                                            "created_utc": 1641639829.0,
                                                            "response": "Cashfusion new app is so op",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "hrxt9zp",
                                                            "author": "dnick",
                                                            "score": 1,
                                                            "created_utc": 1641749942.0,
                                                            "response": "As others have mentioned, I do think most of these options are outside of the scope of most people understanding them 'currently', but how we choose to engage and request features will drive the future tremendously.  Obviously still in early days for this, but I think the most important piece we can try pushing for is transparency and open-source in development and maybe even more importantly in making the backend stuff commoditized to a certain degree so we're not leaning on/trusting any specific group for anything other than pretty buttons or UI preferences.  It's great for the community when one group figures out a great way to do something, even better when it's added to the community.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hrxvudq",
                                                                    "author": "i_have_chosen_a_name",
                                                                    "score": 1,
                                                                    "created_utc": 1641750883.0,
                                                                    "response": "The Bitcoin.com wallet is currently being used by my dad and my mother. I showed them how to work with it and they are using it now. They can scan a qr code and slide to make a payment or they can show their qr code to people with the app that want to pay them or copy the address in to a dapp from where they are withdrawing.\n\nThe Bitcoin.com wallet will have cashfusion build in and enable by default (opt out) \n\nThat means that even my mom and dad, the wallet will be mixing coins in the background using Cashfusion which increases the fungibility and severely enhanced privacy. \n\nIt's save to say that already BCH has much better and affordable privacy then BTC. Of course none of it comes close to Monero. But it does offer the end user protection where BTC wallets offer absolutely nothing and wallets like Samurai are extremely expensive and coinjoin offers magnitude worse privacy compared to cash fusion.  Coinjoins are already being brute forced by analysis companies but with cash fusion this is unfeasible.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hs6q3tz",
                                                                            "author": "dnick",
                                                                            "score": 1,
                                                                            "created_utc": 1641892231.0,
                                                                            "response": "That’s great the usability is getting there, or there already.  It doesn’t really address any of the centralization concerns, but it’s fair to say that there are a lot of usability functions that are far more accessible with BCH than with BTC.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hs78jhd",
                                                                                    "author": "i_have_chosen_a_name",
                                                                                    "score": 1,
                                                                                    "created_utc": 1641905651.0,
                                                                                    "response": "Btc, bch and eth all have enough core network decentralization, but there is no single piece of infra for bch that could go down and would prevent end users from accessing the network. Infura however … imaging them getting a visit from the CIA.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hsa211i",
                                                                                            "author": "dnick",
                                                                                            "score": 1,
                                                                                            "created_utc": 1641945068.0,
                                                                                            "response": "Yeah, hardware-wise decentralization will make or break coins, and these three seem reasonably set there.  Development-wise, none of them are out of the woods as far as suffering the same centralization as core.  It doesn’t matter if they’re good ‘for now’, they’re all subject to the same contraction of fear where someone stands out as the de facto protector, and suddenly no one else can get their foot in the door to compete…from there it’s a short walk to Blockstream.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "hrxxff3",
                                                            "author": "dnick",
                                                            "score": 1,
                                                            "created_utc": 1641751467.0,
                                                            "response": "When you say Cashfusion is 'built in' to electron cash, do you mean it uses it by default, or it's an option somewhere?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hrxypyw",
                                                                    "author": "i_have_chosen_a_name",
                                                                    "score": 1,
                                                                    "created_utc": 1641751940.0,
                                                                    "response": "https://i.imgur.com/kC1pLPA.png",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hs6q6b5",
                                                                            "author": "dnick",
                                                                            "score": 1,
                                                                            "created_utc": 1641892290.0,
                                                                            "response": "Gotcha, I also noticed it in tools or somewhere based on a survey they sent out.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hrrrjec",
                                                    "author": "Ohlav",
                                                    "score": 2,
                                                    "created_utc": 1641645576.0,
                                                    "response": "If you notice his reply, it's not accessible. It's like L2 in Ethereum: tech savvy people get it, regular folks just bolt.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hrre2b0",
                                            "author": "belitemara",
                                            "score": 0,
                                            "created_utc": 1641635363.0,
                                            "response": "Combining with Monero or Railgun has been one of the best privacy plays for me. Same also applies to being on Good VPN apps like SpiderVPN, Express and NordVPN. They limit the rate at which users data details get leaked out thereby protecting end-users details as well.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hrqkrc2",
                            "author": "Mr_Growhair",
                            "score": 5,
                            "created_utc": 1641616022.0,
                            "response": "Do you think pocket network might be a solution to at least the infura/alchemy problem?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hru4ulc",
                            "author": "mmcnl",
                            "score": 2,
                            "created_utc": 1641682089.0,
                            "response": "The problems described are inherent to the concept of blockchains apps and cannot be fixed from a fundamental perspective, basically rendering blockchain technologies at scale useless. All that blockchain technologies do is provide an alternative of storing data (decentralized vs centralized). Is that exciting to you? Then by all means go ahead. But 99.9% of all the rage is driven by the gold rush, as moxie explains very well.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hrs68fk",
                            "author": "MillerNPR",
                            "score": -5,
                            "created_utc": 1641653562.0,
                            "response": "These won’t get fixed.\n\nVitalik will just post on Twitter in a few years and go “huh, guess that was a bad idea, ahh man that sucks, it didn’t work as well as I thought”\n\nAnd then return to his hoardes of wealth and riches",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hrqaydo",
                            "author": "Fun-Card8813",
                            "score": 1,
                            "created_utc": 1641611359.0,
                            "response": "What do you suggest we need for ultimate privacy? Private wallet,chains? \n\nThanks.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hrrc6ts",
                            "author": "cryptening",
                            "score": -4,
                            "created_utc": 1641633863.0,
                            "response": "They aren't shortcomings for the people in charge. Maybe this is what was planned from the start by consensys, JPM, The EF and exchanges like coinbase? Even if it wasn't planned it is hard to see any other outcome for ethereum. \n\nThis moxi quote is damning: I think it will have the tendency to serve the interests of the people sitting in that room every day rather than what we may consider our broader goals.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hrqpmgu",
                    "author": "BlotchyBaboon",
                    "score": 23,
                    "created_utc": 1641618566.0,
                    "response": "I feel like crypto in general feels a bit like the Internet did in 1995: lots of progress being made, lots of cool stuff happening and you could kind of see a direction just beginning to form.  In 1995 you could tell that it was probably going to be possible to a lot of ecommerce.  Online forums had trolls, so you could see that would be an issue, etc.  \n\n**However**, web3 - wow.. that seems vague.  I don't think we're at the point where we can really define what that really means or how it'll work.  If it'll work.  If it'll be thing.  Is there really going to be a rollup that contains everyone's tweets and resistant to censorship?  Who's going to pay even $.01 for that transaction to take place?\n\nI sort of feel like blockchain is going to move forward and we're going to solve all those capacity and throughput issues and then we're just going to get stuck there.  Everything else going to be just as centralized as it is now.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hrt0uon",
                            "author": "cryptolipto",
                            "score": 7,
                            "created_utc": 1641666081.0,
                            "response": "I think you can look at DeFi as an example of what crypto brings to the table. I can take out a loan in seconds with no bank or middle man. I just need collateral. This simply wasn’t possible 5 years ago and crypto makes it possible. \n\nYeah it all runs on Infura and that’s concerning but to me as an end user I’m experiencing much more freedom with my money",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hrty9ib",
                                    "author": "Hyper1on",
                                    "score": 2,
                                    "created_utc": 1641679410.0,
                                    "response": "What is the benefit of this vs peer to peer lending platforms, which have existed for more than a decade?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hru8poa",
                                            "author": "cryptolipto",
                                            "score": 1,
                                            "created_utc": 1641683689.0,
                                            "response": "Give me an example. But without knowing the competition I would say: \n\n1) you can borrow and lend with out a credit check. In fact, credit doesn’t matter at all. This will allow people who don’t have a credit history or poor credit to borrow if they need it. \n\n2) there is no centralized service providing the loan, or managing it. It’s all done through pools of liquidity and run by computer code. It’s trustless. \n\n3) I can’t speak about P2P rates but often the rates to borrow money in DeFi are very good. In fact, some are so good that with incentives, you *get paid* to borrow money. I haven’t seen that before DeFi. \n\n4) it allows people to earn interest passively by lending it out to the pool. Again, often the rates for lending are quite good, but sometimes not as high as something like staking or liquidity providing. \n\n5) it’s possible to do things like take out a loan that is automatically paid back over time. Protocols like alchemix do this. I have used it and it works.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hrt1qvh",
                                    "author": "canihelpyoubreakthat",
                                    "score": -2,
                                    "created_utc": 1641666433.0,
                                    "response": "Explain. What collateral can you provide? Who in their right mind would give an anonymous loan? There needs to be some authority involved that can guarantee the collateral...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hrt2jc7",
                                            "author": "cryptolipto",
                                            "score": 5,
                                            "created_utc": 1641666749.0,
                                            "response": "Read up on Aave. They are a protocol that allows for trustless lending and borrowing of assets. Go to the dapp and check it out. \n\nActually plenty of people would lend out money. Aave has one of the highest TVLs in all of crypto. You can lend ETH, Aave, LINK, SNX, and plenty more. They’re multichain as well",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hrt6s15",
                                                    "author": "canihelpyoubreakthat",
                                                    "score": 2,
                                                    "created_utc": 1641668403.0,
                                                    "response": "So what I'm gathering is that in order to borrow you must first put down collateral equal to or greater than the value of the loan... what? Rubbish.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hrtd5to",
                                                            "author": "cryptolipto",
                                                            "score": 6,
                                                            "created_utc": 1641670903.0,
                                                            "response": "Haha that’s pretty much how rich people use their money just so you know. Anyways I thought I was entering into a good discussion on crypto based on the topic. Apparently not.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hrte1ee",
                                                                    "author": "canihelpyoubreakthat",
                                                                    "score": 0,
                                                                    "created_utc": 1641671251.0,
                                                                    "response": "No it's not, at least not the details that matter. I don't have to put $11,000 down up front to take a $10,000 loan. What would be the point?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hrtggvm",
                                                                            "author": "noweezernoworld",
                                                                            "score": 6,
                                                                            "created_utc": 1641672219.0,
                                                                            "response": "People take loans against home equity all the time. It’s extremely common. This is no different.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hrtibjy",
                                                                                    "author": "canihelpyoubreakthat",
                                                                                    "score": 1,
                                                                                    "created_utc": 1641672956.0,
                                                                                    "response": "A home is not a liquid asset, and the only reason you can take a loan against a home is because a central authority exists to enforce it.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hrtlb8i",
                                                                                            "author": "noweezernoworld",
                                                                                            "score": 3,
                                                                                            "created_utc": 1641674155.0,
                                                                                            "response": "Some people don’t want to sell their crypto because they believe it will be worth more in the future. So it’s quite sensible for those folks to collateralize a few ETH to get $10k right now.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "hrtes4o",
                                                                            "author": "cryptolipto",
                                                                            "score": 2,
                                                                            "created_utc": 1641671543.0,
                                                                            "response": "I’m not going to try to convince you. Do your own research or stay out if you don’t feel like it",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ht0h4n6",
                            "author": "Siref",
                            "score": 1,
                            "created_utc": 1642404556.0,
                            "response": "While I agree, I think , we're seeing it in the wrong perspective. \n\nWhenever a new piece of technology comes out, it's usually inferior to its main incumbent in many ways. It ends up serving a niche that can oversee it's limitations while it matures and becomes something biggee. \n\nIn the context of blockchains, DeFi may have its niche case (e.g. cross border money transfers are a real deal, but there's more than that. We should be focusing on what this technology enables us to do that wasn't possible in the past, and that's the tricky part that will take some time.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hrqy1fr",
                    "author": "emmmaaaaaaaaa",
                    "score": 23,
                    "created_utc": 1641623481.0,
                    "response": "It’s nice to read genuine, thought out criticisms. A really fresh breath of air compared to twitter’s usual go to’s.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hrqy908",
                    "author": "tirtha_s",
                    "score": 8,
                    "created_utc": 1641623618.0,
                    "response": "Moxie is not anti-web3 or cryptocurrency if someone's coming to that conclusion after reading this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hrqc1m5",
                    "author": "big_black_doge",
                    "score": 52,
                    "created_utc": 1641611854.0,
                    "response": "TLDR: The current eth ecosystem is actually centralized, and nobody seems to care.\n\nEdit: The upvotes on this comment prove that, indeed, nobody gives a shit about decentralized applications.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hrqyiek",
                            "author": "The-Slow-Traveller",
                            "score": 19,
                            "created_utc": 1641623788.0,
                            "response": "Saying it is centralized is wrong because it implies that one authority could shut it down. Only this specific problem with data in these node APIs is centralized but can be fixed. I believe The Graph and Chainlink are designed to decentralize access to all kinds of APIs and information.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hrr3tzm",
                                    "author": "Bad_Camel",
                                    "score": 6,
                                    "created_utc": 1641627479.0,
                                    "response": "It's not wrong. One call to AWS/Infura is what is needed.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hrs4knm",
                                            "author": "The-Slow-Traveller",
                                            "score": 4,
                                            "created_utc": 1641652773.0,
                                            "response": "One call is what is needed… to do what? Reveal identifying information? I am agreeing but my point is that this is an easy problem to fix. This is the same with Opensea and probably the uniswap site also. They are all gathering information like any other centralized company so if you need privacy you need to take extra measures like VPNs and different kinds of wallets and dexes.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hrtgds9",
                                                    "author": "lonelycatcarrot",
                                                    "score": -3,
                                                    "created_utc": 1641672185.0,
                                                    "response": "To turn ETH off dummy. It’s a massive attack surface. One call from the pentagon and it’s lights out ETH. Trying doing that to Bitcoin.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hrulb61",
                                                            "author": "The-Slow-Traveller",
                                                            "score": 5,
                                                            "created_utc": 1641688909.0,
                                                            "response": "You are calling me dumb and saying things like “turn ETH off”. What exactly does that mean? How would the pentagon shut off ETH?\n\n“Trying do that to bitcoin” lol",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hrvd0yx",
                                                                    "author": "big_black_doge",
                                                                    "score": 0,
                                                                    "created_utc": 1641700989.0,
                                                                    "response": "The SEC and IRS are looking very closely at ETH. If they want to, they can tell all or some service providers to eth contracts to shut down. That is a very real possibility, especially when they are concerned about money laundering, tax evasion, and securities. Then Ethereum would pretty much be useless until an actual decentralized infrastructure was made, which is a long way off.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hryw236",
                                                                            "author": "lechuga2010",
                                                                            "score": 1,
                                                                            "created_utc": 1641763692.0,
                                                                            "response": "Yes, dude... Anyone on the planet can fire up a full Ethereum node on minimal home hardware within ~18 hours, but it would be sooo easy to shut down... 🙄",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hrzdlgf",
                                                                                    "author": "big_black_doge",
                                                                                    "score": 1,
                                                                                    "created_utc": 1641770022.0,
                                                                                    "response": "What can you do with just an ethereum node and no server? Send eth around? Ok, that's what bitcoin is.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hs04tos",
                                                                                            "author": "lechuga2010",
                                                                                            "score": 1,
                                                                                            "created_utc": 1641780582.0,
                                                                                            "response": "What on earth? Can you be more clueless? You think contracts are stored on servers?",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hryum3f",
                                            "author": "lechuga2010",
                                            "score": 1,
                                            "created_utc": 1641763160.0,
                                            "response": "What? Have you ever looked at the top networks running bitcoin nodes?  All I see is hosting providers and a bizarrely large Tor % that is vast majority hosting (probably because you can run one node on the same machine/ip and use multiple Onion addresses)... Your statement is as ridiculous as claiming one call to Hetzner Online and bitcoin is shut down. The difference between home hosted BTC/Ethereum nodes is so marginal it's not even worth talking about.\n\nhttps://pbs.twimg.com/media/FEQ8qKEVEAUNlYh?format=jpg&name=900x900",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hrt2by7",
                            "author": "TopWoodpecker7267",
                            "score": 6,
                            "created_utc": 1641666669.0,
                            "response": "> and nobody seems to care.\n\nI care. I also won't let \"perfect\" become the enemy of \"good\".",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hrqmo6p",
                            "author": "Pezotecom",
                            "score": 1,
                            "created_utc": 1641617011.0,
                            "response": "bitcoin folks have been saying it for years.    \n\nnot that it's that is such a bad thing, but people don't understand the trade-offs.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hrs2lqd",
                                    "author": "big_black_doge",
                                    "score": 1,
                                    "created_utc": 1641651821.0,
                                    "response": "Well, considering that the whole point of this eth ecosystem is to decentralize apps, it defeats the whole purpose. It gives credit to the people who call crypto a speculative bubble.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hrqyvsd",
                            "author": "aknalid",
                            "score": 1,
                            "created_utc": 1641624032.0,
                            "response": "BUt wEb3 BrO",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hrqwifd",
                            "author": "tirtha_s",
                            "score": 1,
                            "created_utc": 1641622515.0,
                            "response": "Is this why they integrated crypto payments in Signal App ?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hrs2miv",
                                    "author": "big_black_doge",
                                    "score": 1,
                                    "created_utc": 1641651831.0,
                                    "response": "What does this have to do with eth or web3?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hrsm0ze",
                                            "author": "tirtha_s",
                                            "score": 1,
                                            "created_utc": 1641660306.0,
                                            "response": "Implementing cryptocurrency transactions is a part of web3. So he's doing that in his company, it implies that he does understand specific use cases that are the prime value pillars of web3.\n\nIt does come with its challenges, but that's what engineering is for. We continuously work on existing problems. To bring improved versions of the result, there's no stopping.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hryorfb",
                                                    "author": "lumberjack233",
                                                    "score": 1,
                                                    "created_utc": 1641761088.0,
                                                    "response": "He's not using eth tho",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hs0v819",
                                                            "author": "tirtha_s",
                                                            "score": 1,
                                                            "created_utc": 1641791630.0,
                                                            "response": "Web3 isn't just Ethereum. Whatever solution suits their crypto payment needs :)",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hs0zvmp",
                                                                    "author": "lumberjack233",
                                                                    "score": 1,
                                                                    "created_utc": 1641793803.0,
                                                                    "response": "I think he just doesn't have that rosy view of web 3 and only use it for specific purposes. Too many VCs are promising the world and pumping their bags, there needs to be rational voice that says hey settle down, this thing is useful but it is not going to take us to utopia",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hrsyd1m",
                    "author": "cryptolipto",
                    "score": 3,
                    "created_utc": 1641665115.0,
                    "response": "Finally a good criticism of crypto. It’s true we do rely on Alchemy and Infura too much",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hrsrbcb",
                    "author": "OneSmallStepForLambo",
                    "score": 7,
                    "created_utc": 1641662378.0,
                    "response": "Man, this is such a thoughtful, well written, but pessimistic article given the state we're at in the span of 12 years. _A LOT HAS HAPPENED_. I'm either in some confirmation bias/Kool-Aid loop or my perception of time and expectations are different than others. \n\n>A protocol moves much more slowly than a platform. After 30+ years, email is still unencrypted; meanwhile WhatsApp went from unencrypted to full e2ee in a year. \n\nTCP/IP wasn't the best protocol, but it had the magical \"It works\" + adoption. When it wasn't good enough, it simply changed. Sure, there was debate's and concerns, but what average person remembers that? Now we have enough addresses to accommodate growth with IPv6. These **protocols move slow because they work**, and people are busy doing things on top of it. **Demand for change, creates change**\n\nMost email _communication_ is encrypted. The demand (or value) for encrypted email messages are not high enough for it to be adopted. There's better systems to accomplish the goal (e.g. \"Why are you putting _that_ in email?\"). Email is still needed - just for different use cases than it was 30+ years ago. For organizations or individuals that need to encrypt email - they simply encrypt them using easy to use features that are already built. \n\nThe examples of centralized API's, OpenSea, MetaMask are all valid points, I personally just view these as transitional phases, or onboardings. You can be critical of how they're transitioning, but that's what it is - a transition. Ethereum impresses me because it continues to evolve while not only maintaining the network effect but growing it's adoption. The more adoption, the less agile you become. But change is still obviously happening. \n\nIf there is a demand for a decentralized web3, it will happen so long as the demand persists. Ask an average person how they feel about these private social media companies, and the power they wield. I think the answer now would be different than only 5-6 years ago. The real question in my opinion: is Web2 good enough? Or, Is there a demand for Web3? \n\nPersonally, I think so.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hrtvkzc",
                            "author": "kipdingo",
                            "score": 3,
                            "created_utc": 1641678323.0,
                            "response": ">The examples of centralized API's, OpenSea, MetaMask are all valid points, I personally just view these as transitional phases, or onboardings. You can be critical of how they're transitioning, but that's what it is - a transition. \n\nI agree, these are probably transitory, but I took Moxie's article to say:\n\n* most people aren't aware that there are centralization points in web3 (there are), and\n* anyone who *does* know of such things, they don't seem to mind (given absence of discussion about this topic)\n\nfor now at least, I don't see any pressure to push toward truly decentralizing things (like Infura's APIs) because everyone is sort of fine with it. for change to occur, we'd need to first get to a place where people want change, then take more time for that change to occur.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hrtww5p",
                                    "author": "OneSmallStepForLambo",
                                    "score": 2,
                                    "created_utc": 1641678853.0,
                                    "response": "Fair points. We can speculate or wait an see. I'd like to think the user community simply consumes best available options. You can compare it to obtaining crypto\n\n- CPU mining  / playing around sending/receiving for fun\n- Going to the pharmacy to use the red phone / money gram\n- Using Mt Gox\n- Using other exchanges\n- Using Defi / stable tokens",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hrtyh8k",
                                            "author": "kipdingo",
                                            "score": 3,
                                            "created_utc": 1641679497.0,
                                            "response": "that's a good way to phrase it: the community will use the best available options.\n\nwhich would suggest: there exists an opportunity today for someone to build an Infura-like replacement which *isn't* centralized by one company, then spread the word to the broader crypto community – hey use this new thing, it removes a centralized point-of-failure that you've accepted until now.\n\nI think we're in agreement that if such a thing existed, it would get used; and I think further we're saying: that *is* where things will end up. the question is: how will we get there?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hrqmhx6",
                    "author": "danlthemanl",
                    "score": 24,
                    "created_utc": 1641616922.0,
                    "response": "Moxie blew the whistle on Ethereum and nobody cares. Web3 not decentralized in the slightest, especially with all the VC money flowing in.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hrr0gqs",
                            "author": "minisculepenis",
                            "score": 36,
                            "created_utc": 1641625097.0,
                            "response": "It depends on how you use it, doesn’t it? You can run your own node and no one can stop you. You can run your own Uniswap front end and no one can stop you. You can call contracts directly using RPC calls can no one can stop you.\n\nDo I care that I sometimes used centralised services? Not really.\n\nDo I care that I always have an option to use a fully decentralised client at all times permisssionlessly? Fuck. Yes.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hrsfxil",
                                    "author": "TheDeliman",
                                    "score": 4,
                                    "created_utc": 1641657813.0,
                                    "response": "You’re cherry picking examples. Most projects aren’t open source or distributed in a way you can run the frontend yourself like uniswap. Most don’t even have the actual RPC calls or contract APIs documented anywhere.\n\nNot to mention that there is zero chance the unsophisticated average user is ever going to take the time to do any of that while chasing a few dollars on the NFT bubble du jour. \n\nIt’s absolutely a problem that the ecosystem people actually use is looking more different from the actually decentralized power-user ecosystem by the day",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hs3ohld",
                                    "author": "habitofwalking",
                                    "score": 1,
                                    "created_utc": 1641842385.0,
                                    "response": "Is that different from running your own server?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hrtshbx",
                            "author": "kipdingo",
                            "score": 1,
                            "created_utc": 1641677064.0,
                            "response": "not just Ethereum that isn't decentralized, but various other blockchains and related systems too – owned by individual companies. I found out recently that Binance's blockchain has 21 validators on it, and the group is capped and also hand-picked by Binance. a 51% attack would be very much in the realm of possibility (not saying they will, or that they're motivated to do such a thing; but it's possible).\n\nthe whole \"decentralized\" story seems:\n\n1. like vaporware, and\n2. something that most (90% or more?) users do not care about\n\nbeyond banking / financial problems (like moving my own money around when and how I want, without the hassle of what current banking rules force me to do), why else would an average person care about decentralizing anything? unless it's faster, or cheaper, or both, I'm convinced they won't care about it at all. which leaves me scratching my head about the rush to try decentralizing things. what am I missing?\n\nEDIT: I guess people aren't liking the \"vaporware\" comment! whether it's that or something else, I'd be interested in any replies. ;) to elaborate on \"seems like vaporware\": as with actual vaporware (where there isn't a real product to show anyone), web3 *seems* to share some of the same characteristics (including arguments about what web3 even *is*, with few concrete examples in existence).",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hs1ff3e",
                                    "author": "GrumpyMcGillicuddy",
                                    "score": 2,
                                    "created_utc": 1641803459.0,
                                    "response": "I think this is the key question. People may be dimly irritated that 4 or 5 companies control most of web2, but unless they can *do* something different on web3 why would they migrate?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hrqmsg0",
                    "author": "Lone_Reckoner",
                    "score": 5,
                    "created_utc": 1641617072.0,
                    "response": "Thanks for sharing, sort of reminds me of [this article](https://www.stephendiehl.com/blog/web3-bullshit.html) that Stephen Diehl wrote, though perhaps Diehl's is a little more blunt...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hrr0js6",
                            "author": "minisculepenis",
                            "score": 7,
                            "created_utc": 1641625157.0,
                            "response": "Blunt. And wrong.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hrr1br7",
                                    "author": "minisculepenis",
                                    "score": 9,
                                    "created_utc": 1641625691.0,
                                    "response": "I’m going to get rightfully called out for not providing any nuance.\n\nHeres Diehls stance: “The blockchain offers nothing new or worthwhile to the universe of technology.”\n\nUntil I can send someone uncensorable trustless money to another part without a centralised middle party then he can go and fuck himself. For all he tries to call out charlatans he’s awfully good at staging false arguments to promote his personal brand. Hypocrite.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hs9uvsi",
                                            "author": "09937726654122",
                                            "score": 1,
                                            "created_utc": 1641942114.0,
                                            "response": "Meh",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hrtuc7z",
                            "author": "kipdingo",
                            "score": 7,
                            "created_utc": 1641677823.0,
                            "response": "thanks for posting that article, hadn't seen it. Stephen Diehl is clearly frustrated, and perhaps that might turn some readers off, but he raises some of the same questions I've been trying to wrap my head around, and I think thus far it is a bit confusing that there aren't clearer answers yet from the broader web3 advocates.\n\nto be clear, I currently take no sides – either for or against web3 – but I can't even make sense to myself what web3 – this future, decentralized world – does for people (and I mean \"people in general\", not for crypto enthusiasts who are in crypto-related reddit subs).\n\nalso, the use cases around payments make sense, those are pretty clear. but web3 usefulness beyond payments..?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hrx81e2",
                                    "author": "poofyhairguy",
                                    "score": 2,
                                    "created_utc": 1641741802.0,
                                    "response": "The boom of NFTs shows another huge use case. \n\nNFTs allow people to own a piece of the digital world in a way that could never happen before. Prior to crypto NFTs at best you could own digital items within an ecosystem- think of emotes in Fortnite or knives in CSGO as examples. You had to be in that ecosystem to enjoy that digital asset and you had no way to use that asset outside of that ecosystem.\n\nMeanwhile my favorite NFT is my twitter profile picture. Anyone can lookup my address and verify it’s mine. Because it’s an NFT project that gives me full rights (not all do but that is evolution) I can also use that NFT in the fanfiction stories I write about my NFTs and publish those stories- heck monetize those stories- without worrying about being sued because I can prove ownership of that digital asset on the blockchain.\n\nAs future generations spend more and more time online, more of their limited human experience is spent in a digital space (hence the metaverse concept). Future generations won’t care about having fancy cars or clothes to show their status to peers because the actual peers they care to impress aren’t in their physical community or neighborhoods but instead in online communities with like minded people. \n\nWith NFTs someone who is terminally online can buy something like a Cryptopunk and put it as their Twitter pic and show off to their online Twitter friends (aka who they spend most of their time with) their status and taste. This is impossible to do with ecosystem specific digital items as often those ecosystems evolve or change (think of how there is a new FIFA game every year) without the input of the users in the community.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hrz7e26",
                                            "author": "kipdingo",
                                            "score": 3,
                                            "created_utc": 1641767734.0,
                                            "response": ">As future generations spend more and more time online, more of their limited human experience is spent in a digital space (hence the metaverse concept). Future generations won’t care about having fancy cars or clothes to show their status to peers because the actual peers they care to impress aren’t in their physical community or neighborhoods but instead in online communities with like minded people.\n\nI think this is a pretty compelling point – easy to see that priorities for someone in their teens or 20's doesn't care about the kinds of things that used to matter for that age group a few decades (or more), namely cars. It wasn't that long ago that cars were \\_the gateway\\_ to social interactions, freedom, employment, identity. It used to be the case (in the US at least, say like 1980's or earlier) that the day someone turned 16, there was an urgency to take the driving test so they could start driving. Today, that doesn't matter nearly as much. Plenty of people are late teen years or even into their 20's and don't need a car. Why bother? They can do most, maybe all, of those things without a car - social, freedom, employment, identity.\n\nSo, I agree with NFT value for some aspects of digital/online property ownership, like an online community where I can buy something and display it to everyone else.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hrxfub8",
                                            "author": "architravesty",
                                            "score": 1,
                                            "created_utc": 1641744873.0,
                                            "response": "Literally the only element of anything you described that required a blockchain or even anything vaguely crypto-adjacent was getting suckers to throw large quantities of money in.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hrrquln",
                    "author": "GuessWhat_InTheButt",
                    "score": 6,
                    "created_utc": 1641645118.0,
                    "response": ">As it happens, companies have emerged that sell API access to an ethereum node they run as a service, along with providing analytics, enhanced APIs they’ve built on top of the default ethereum APIs, and access to historical transactions. Which sounds… familiar. At this point, there are basically two companies. Almost all dApps use either [Infura](https://infura.io/) or [Alchemy](https://www.alchemy.com/) in order to interact with the blockchain. In fact, even when you connect a wallet like MetaMask to a dApp, and the dApp interacts with the blockchain via your wallet, MetaMask is just making calls to Infura!\n>\n>These client APIs are not using anything to verify blockchain state or the authenticity of responses. The results aren’t even signed. An app like Autonomous Art says “hey what’s the output of this view function on this smart contract,” Alchemy or Infura responds with a JSON blob that says “this is the output,” and the app renders it.\n>\n>This was surprising to me. So much work, energy, and time has gone into creating a trustless distributed consensus mechanism, but virtually all clients that wish to access it do so by simply trusting the outputs from these two companies without any further verification. It also doesn’t seem like the best privacy situation. Imagine if every time you interacted with a website in Chrome, your request first went to Google before being routed to the destination and back. That’s the situation with ethereum today. All write traffic is obviously already public on the blockchain, but these companies also have visibility into almost all read requests from almost all users in almost all dApps.\n\nOof, the state of Ethereum is even worse than I thought.\n\n>What I found most interesting, though, is that after OpenSea removed my NFT, it also no longer appeared in any crypto wallet on my device. This is web3, though, how is that possible?\n>\n>[...]\n>\n>Again, like with my dApp, these responses are not authenticated in some way. They’re not even signed so that you could later prove they were lying. It reuses the same connections, TLS session tickets, etc for all the accounts in your wallet, so if you’re managing multiple accounts in your wallet to maintain some identity separation, these companies know they’re linked.\n\nWhat a shit show.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hrt1xol",
                            "author": "OneSmallStepForLambo",
                            "score": -1,
                            "created_utc": 1641666511.0,
                            "response": "IMHO you have a high criterion for what a \"shit show\" is. In the absence of something better (or what these projects are striving towards), how would things be better without them?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hs2d7ys",
                                    "author": "GrumpyMcGillicuddy",
                                    "score": 0,
                                    "created_utc": 1641824677.0,
                                    "response": "Read the post. He describes how opensea would actually be a lot better if they removed the blockchain bits.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hs2fn0p",
                                            "author": "OneSmallStepForLambo",
                                            "score": 1,
                                            "created_utc": 1641825704.0,
                                            "response": "Fair enough on open sea, however they state clearly in their documentation how they avoid gas fees -  if you actually mint your NFT, it's on the blockchain. \n\nMy question to you was in regards to Infura and Alchemy. I think it's plausible that users are using simply what's available. And current state isn't indicative of future state. \n\nI would lean more on the side that this is concern trolling rather than a shit show.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hrr7qbf",
                    "author": "breitan",
                    "score": 4,
                    "created_utc": 1641630392.0,
                    "response": "Very interesting read and thanks for sharing. As the foundational layer is there i am pretty sure the problems described will be solved within the next decade. There are way too many smart people working on these matters.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hrttwcw",
                    "author": "nice-guy-melon",
                    "score": 2,
                    "created_utc": 1641677642.0,
                    "response": "This proves that \"decentralisation\" is a facade that most people believe and reality might be the same as people perceive.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hrqukkn",
                    "author": "rtheiss",
                    "score": 4,
                    "created_utc": 1641621342.0,
                    "response": "Monero has entered the chat",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hru6i8c",
                            "author": "16withScars",
                            "score": 1,
                            "created_utc": 1641682772.0,
                            "response": "You can use https://zk.money today.\n\n https://link.medium.com/BGng6SK5Emb",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hrqkisg",
                    "author": "grutanga",
                    "score": 4,
                    "created_utc": 1641615900.0,
                    "response": "Very good read. First step is having nodes for whatever you’re holding. Second I guess would be to host your own server.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hrryr0f",
                            "author": "athei-nerd",
                            "score": 2,
                            "created_utc": 1641649846.0,
                            "response": "I think you missed one of his central points. Nobody wants to do that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hrsaa6h",
                                    "author": "grutanga",
                                    "score": 1,
                                    "created_utc": 1641655386.0,
                                    "response": "Can’t tell if this is sarcasm or not lol",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hrtuy4m",
                                            "author": "kipdingo",
                                            "score": 1,
                                            "created_utc": 1641678066.0,
                                            "response": "I think that comment is not trying to be sarchastic – Moxie said a few times how running servers is a pain, individuals don't want to do it, even companies don't want to do it. nobody wants to do it. so yes, there are some benefits to running a node for any crypto you're holding, but then: you're running a server for each.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hrty02t",
                                                    "author": "grutanga",
                                                    "score": 1,
                                                    "created_utc": 1641679303.0,
                                                    "response": "Yes. Hosting our own servers in addition to our own modes would solve the problem painted in the article. So, second step after getting a node running is to set up a server. I didn’t intend to say that it was easy but rather that it’s worthwhile.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hrqoz69",
                            "author": "FunCryptographer4761",
                            "score": 2,
                            "created_utc": 1641618222.0,
                            "response": "Layer 2s and roll ups scale with privacy possibility. It is possible to have private transactions now. It is just really expensive and a hassle.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hrtupwt",
                                    "author": "kipdingo",
                                    "score": 2,
                                    "created_utc": 1641677975.0,
                                    "response": "solving privacy broadly (cheaply, and easily) feels like perhaps one of the largest barriers to widespread crypto adoption. if A wants to send $20 to B, with PayPal for example, they just send it without worrying that person B can see anything else about person A (like how much money they have, what else they've spent money on, where their deposits come from, etc).",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hru2w0a",
                                            "author": "FunCryptographer4761",
                                            "score": 1,
                                            "created_utc": 1641681283.0,
                                            "response": "No shit",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hrq7sby",
                    "author": "nvncble",
                    "score": 3,
                    "created_utc": 1641609940.0,
                    "response": "lol everything is a fractal. theres no escape",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hrrg39n",
                    "author": "JohnMaddn",
                    "score": 3,
                    "created_utc": 1641636986.0,
                    "response": "Stop using Metamask. It's *NOT* web 3.0 - it's just a poorly written web-app with zero privacy and piss poor security.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hrriq6w",
                            "author": "nookieroob",
                            "score": 3,
                            "created_utc": 1641639090.0,
                            "response": "Best alternatives?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hrriygc",
                            "author": "iphonegoogle",
                            "score": 2,
                            "created_utc": 1641639272.0,
                            "response": "What alternative do you suggest?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hrumwcm",
                            "author": "edmundedgar",
                            "score": 1,
                            "created_utc": 1641689579.0,
                            "response": "Also it's no longer free software, it has a proprietary license to stop people from forking it to make it better or work around their management if they try to screw their users.\n\nBrave is better, it doesn't fix all the privacy problems but it's definitely an improvement, and it's free software.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hrtm8fx",
                    "author": "iamtheprimeminister",
                    "score": 3,
                    "created_utc": 1641674531.0,
                    "response": "Glad to see some sensible considerations around Web3. I honestly don’t see a need for Web3. It’s way above my understanding however but a decentralised web browsing experience is something that can already be achieved with TOR. \n\nBlockchains are too clunky for web architecture imo. \n\nThey do however have their place in finance, property rights and information that should be immutable - I just don’t see a need for running web apps on a blockchain.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hrpbrpp",
                    "author": "coinfeeds-bot",
                    "score": -19,
                    "created_utc": 1641596402.0,
                    "response": "tldr; Despite considering himself a cryptographer, I have not found myself particularly drawn to “crypto.” I don’t share the same generational excitement for moving all aspects of life into an instrumented economy. I’m much more likely to click on Pepperidge Farm Remembers flavored memes about how ‘crypto’ used to mean “Cryptography” than I am the latest NFT drop.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hrqbzop",
                            "author": "big_black_doge",
                            "score": 13,
                            "created_utc": 1641611830.0,
                            "response": "This tldr is literally the first 3 sentences. Bad bot.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hrwiv2d",
                    "author": "saddit42",
                    "score": 1,
                    "created_utc": 1641728168.0,
                    "response": "Great article. Nice to see some more experienced voices in this space. You're right.\n NFTs not including the hash of the image file is totally stupid.\nBut with regards to infura/alchemy.. I think what you're missing is that light client friendlyness and light clients that run on your phone/browser is something that is actively worked on.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hrxu6hf",
                            "author": "JanssonsFrestelse",
                            "score": 1,
                            "created_utc": 1641750269.0,
                            "response": "Even a hash of the image would need some sort of \"signature in the bits\" that could be verified, otherwise changing one pixel in an undistinguishable way would generate a different hash. I'm sure there are possible solutions to this, but I'm really surprised that an NFT is/can be literally just a URL. That's just about the least \"non fungible\" thing I can think of.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hrz8fbm",
                                    "author": "saddit42",
                                    "score": 1,
                                    "created_utc": 1641768115.0,
                                    "response": "I'm not really able to make sense of your \"signature in the bits\" part. You exactly want that changing even one pixel would result in a different hash.. that's the point of a hash.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hrzfwo2",
                                            "author": "JanssonsFrestelse",
                                            "score": 1,
                                            "created_utc": 1641770885.0,
                                            "response": "That's my point as well. If I owned an NFT for the pixel-modified forgery, how would you know which one is \"the original\"? But I don't know much about trading NFTs, can you tell who minted it (i.e. the original artist)? I guess that could also solve the issue.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hrzvky5",
                                                    "author": "saddit42",
                                                    "score": 1,
                                                    "created_utc": 1641776846.0,
                                                    "response": "The hash of the image should be stored in the smart contract in an immutable way. So the nft contract is mapped to one specific image.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hs1ip01",
                                                            "author": "JanssonsFrestelse",
                                                            "score": 1,
                                                            "created_utc": 1641805909.0,
                                                            "response": "There needs to be some source of truth though where we can determine that a specific hash value is the one mapped from the original image. Otherwise you could just have two indistinguishable images and their hashes, which by themselves doesn't tell us anything useful. But I suppose the artist could publish/advertise the hash of the original in the same way we advertise our public keys, post checksums for binaries etc.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hs1s0u2",
                                                                    "author": "saddit42",
                                                                    "score": 1,
                                                                    "created_utc": 1641812934.0,
                                                                    "response": "Sorry I think you got something wrong there. I'm not sure yet what exactly.\n\n1. Publish a jpg. Thousands of people can see it and store it on their computers\n2. Hash that jpg. \n3. Create an nft that stores the hash of the jpg.\n\nWhy would you need some additional source of truth now. The nft is now clearly mapped to the jpg. Everyone can take the original jpg, hash it and see that indeed the nft holds that hash. Also everyone can see what the first existing nft was that held this hash. Noone is able to take that hash, create another nft and put it into an earlier block than the first one. Everyone would see what nft existed first if both store the same hash.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hs26cgx",
                                                                            "author": "JanssonsFrestelse",
                                                                            "score": 1,
                                                                            "created_utc": 1641821501.0,
                                                                            "response": "My point is that there is no way to distinguish the original jpeg from one that has a single slightly modified pixel, you would need to know that what you downloaded and hashed was actually the original. But yes you are right that comparing the times the NFTs were created should also solve this, given that you can find a trusted source (or better yet, several independent sources) of the original from which you could compute the hash to compare against.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hs2kzy5",
                                                                                    "author": "saddit42",
                                                                                    "score": 1,
                                                                                    "created_utc": 1641827886.0,
                                                                                    "response": "Yes. You always know what was there first. If you change one pixel and create a second nft then the blockchain is your source of truth proving that there's a very very similar jpg (just different in 1 pixel) that already existed before.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hs3z0j9",
                                                                                            "author": "JanssonsFrestelse",
                                                                                            "score": 1,
                                                                                            "created_utc": 1641846244.0,
                                                                                            "response": "Still though, even a slight modification of an image's metadata or some compression, anything really, will change an image's hash. Your hash is only as good at proving you \"own\" some image as whichever centralised authority you've decided to trust is at storing and providing that image in the same state as it was when the hash was computed. Which begs the question why you need the blockchain in the first place, you might as well just have a ledger of the ownerships stored by the same centralised authority trusted to host the image. \n\nA signed message by the image author's private key included in the NFT which uniquely identifies it would at least also create some sort of connection to the author, like how you can imagine a perfect replica of Mona Lisa is not the same as the original since it still doesn't have Leonardo da Vinci's brushstrokes (not a perfect metaphor, I know).\n\nBut of course, as the article pointed out, many (most?) NFTs don't even have a hash! You \"own\" some string of characters that has the format of a URL, which you can only hope will return a response containing your image. Someone on hackernews called it \"storing a bookmark in the most convoluted and expensive way possible\". It all just seems like a such a joke.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ht2d98b",
                    "author": "theworlddidwut",
                    "score": 1,
                    "created_utc": 1642442637.0,
                    "response": "Maybe Jack will build something to make running a server / node more accessible? :) \n\n&#x200B;\n\nhttps://www.theverge.com/2022/1/14/22883500/jack-dorsey-block-bitcoin-mining-system-open-source-mainstream",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hrqhno5",
                    "author": "OnceUponABroke",
                    "score": -1,
                    "created_utc": 1641614464.0,
                    "response": "so some says that this year is METAVERSE season",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urv6z6",
            "title": "Ethereum Co-founder Vitalik Buterin Pens His Heart Out in a Series of Twitter Thread",
            "url": "https://thenewscrypto.com/ethereum-co-founder-vitalik-buterin-pens-his-heart-out-in-a-series-of-twitter-thread/",
            "author": "Loud_Dingo7261",
            "created_utc": 1652818312.0,
            "score": 413,
            "num_comments": 110,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8zrcyn",
                    "author": "iamaneditor",
                    "score": 353,
                    "created_utc": 1652820706.0,
                    "response": "Here's the summary of the Tweets:\n\nThread: some still open contradictions in my thoughts and my values, that I have been thinking about but still don't feel like I've fully resolved.\r  \n\r  \nContradiction between my desire to see Ethereum become a more Bitcoin-like system emphasizing long-term stability and stability, including culturally, and my realization that getting there requires quite a lot of active coordinated short-term change.\r  \n\r  \nContradiction between my preference for reducing reliance on individuals and trying to build fixed systems that can stand the test of time and my appreciation of \"live players\" and their role in helping the world move forward.\r  \n\r  \nContradiction between my desire to see Ethereum become an L1 that can survive truly extreme circumstances and my realization that many key apps on Ethereum already rely on far more fragile security assumptions than anything we consider acceptable in Ethereum protocol design.\r  \n\r  \nContradiction between my love for things like decentralization and democracy, and my realization that in practice I agree with intellectual elites more than \"the people\" on many (though definitely far from all) specific policy issues.\r  \n\r  \nContradiction between my desire to see more countries adopting radical policy experiments (eg. crypto countries!) and my realization that the governments most likely to go all the way on such things are more likely to be centralized and not friendly to diversity internally.\r  \n\r  \nContradiction between my desire to see more diversity in interesting \\*cultures\\* and my realization that maintaining a culture that's distinct from the mainstream seems to often require \\*some\\* kind of insanity or artificial barrier or similar thing that I ideologically dislike.\r  \n\r  \nContradiction between my dislike of many modern financial blockchain \"applications\" ($3M monkeys etc), and my grudging appreciation for the fact that that stuff is a big part of what keeps the crypto economy running and pays for all my favorite cool DAO/governance experiments.\r  \n\r  \nContradiction between my desire for crypto to grow beyond finance and my realization that finance (incl payments+SoV) is still by far the most successful category of crypto apps, \\*especially\\* among third-world residents, human rights activists and vulnerable people generally.\r  \n\r  \nContradiction between my desire to maximally simplify the L1 and my desire to maximally simplify the whole ecosystem (as a simple L1 often \"exports\" its complexity to higher layers of the stack that users have to adopt anyway)\r  \n\r  \nContradiction between my desire to be a positive-sum mediator figure that can be everyone's friend and my desire to stand strongly with good against evil those times when true evil is what we face.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i904je5",
                            "author": "breeezyyyy",
                            "score": 68,
                            "created_utc": 1652826448.0,
                            "response": "God the comments are probably the most cringe I've ever seen on a Twitter thread\n\n99% missed the point and whooshed over their heads",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9064cy",
                                    "author": "KingzLegacy",
                                    "score": 20,
                                    "created_utc": 1652827172.0,
                                    "response": "A lot of BTC bots and shills.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i91g4w3",
                                            "author": "fplfreakaaro",
                                            "score": -3,
                                            "created_utc": 1652850588.0,
                                            "response": "Who’s paying for Bitcoin bots? There are no VC’s involvement in Bitcoin unlike Etherium and other similar shitcoins",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i90si7l",
                                    "author": "walk_thru_my_fart",
                                    "score": 15,
                                    "created_utc": 1652837795.0,
                                    "response": "Elon plz clean the place up, i gotta read twitter from reddit",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i910b52",
                                            "author": "rezilient",
                                            "score": 15,
                                            "created_utc": 1652841509.0,
                                            "response": "Not sure why you’re getting downvoted, you’re absolutely correct. Twitter is a dumpster fire of bots. I can’t bother sifting through comments because its a minefield of pitchforks, fanbois and robots.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i90u8pm",
                                    "author": "NTXL",
                                    "score": 6,
                                    "created_utc": 1652838603.0,
                                    "response": "And then their’s CH. really smart and insightful guy but God he can be a fucking ass",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8zs5dh",
                            "author": "possiblynotanexpert",
                            "score": 29,
                            "created_utc": 1652821034.0,
                            "response": "Thanks!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zvyas",
                                    "author": "iamaneditor",
                                    "score": 11,
                                    "created_utc": 1652822641.0,
                                    "response": "You're welcome!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i902grz",
                            "author": "Perleflamme",
                            "score": 41,
                            "created_utc": 1652825500.0,
                            "response": "It's pretty nice to see these contradictions. Solving contradiction is how people grow up. \n\nBesides, they're particularly on point. \n\nI understand there are a few ideals, in there, that are conflicting with the reality that some forms of governance aren't actually as ideal in practice as they're supposed to be in theory. To me, for instance, most forms of collectivism should be avoided any time it's possible, so that helping each others becomes an actual virtue being cultivated rather than forced action being avoided. \n\nI think some of these contradictions can't be solved in themselves in a trustless ecosystem, as it's expected to see cheapest forms of any service to become predominant noise in a trustless ecosystem (it's cheap to create speculative assets, as much as creating misinformation) and that only shows a need for tools to filter out the noise from the signal, up to the point where noise learns how to cheaply become signal. \n\nBut other contradictions could be solved by having several competing decentralized chains, notably a few different versions of Ethereum.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i90m0uk",
                            "author": "Norva",
                            "score": 15,
                            "created_utc": 1652834744.0,
                            "response": "“Contradiction between my love for things like decentralization and democracy, and my realization that in practice I agree with intellectual elites more than \"the people\" on many (though definitely far from all) specific policy issues.”\n\nSame",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91annz",
                                    "author": "greencycles",
                                    "score": 2,
                                    "created_utc": 1652847057.0,
                                    "response": "I'd like for him to list a few specific examples of this. Can you list a few specific examples of your own? Mostly interested in what y'all come up with regarding \"the people's position\" on any given policy issue.\n\nSince when and why are \"intellectual elites\" not included as part of \"the people?\"",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i91c1xu",
                                            "author": "IntangibleThings",
                                            "score": 6,
                                            "created_utc": 1652847902.0,
                                            "response": "For me, most people who voice opinions are often uneducated on the topics they speak about. They lack an understanding of how the world works, lack critical thought and analysis, and equate their knowledge to limited content served to them in their entertainment-driven bubbles.  \n\n\nThe internet was great for democratizing everybody's ability to speak, but it also meant that there was far more noise to contend with. Experts soon had to go toe-to-toe with somebody who happened to have massive followings for various unrelated things.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i90hoy5",
                            "author": "Darius510",
                            "score": 1,
                            "created_utc": 1652832707.0,
                            "response": "That first one isn’t even a contradiction because getting there doesn’t require active coordinated short-term change, it requires leaving it alone and letting it harden with time.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90iuui",
                                    "author": "AESTHTK",
                                    "score": 10,
                                    "created_utc": 1652833262.0,
                                    "response": "The point being it’s not quite ready to be left alone yet - was my interpretation.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90j85b",
                                            "author": "Darius510",
                                            "score": 1,
                                            "created_utc": 1652833430.0,
                                            "response": "The kind of mentality that has had constant change for 7 years doesn’t lead to the mentality where they ever leave it alone. This “just one more change” excuse will always exist.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i90jddh",
                                                    "author": "AESTHTK",
                                                    "score": 9,
                                                    "created_utc": 1652833498.0,
                                                    "response": "Yep. That’s the contradiction. 🙃",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i90pnhj",
                                                            "author": "Darius510",
                                                            "score": -5,
                                                            "created_utc": 1652836458.0,
                                                            "response": "No, it's not. It's just self deception. It would be a contradiction if it was actually true that short term change was \\*required.\\* It's not required. They could have stopped the hard forks a long time ago and built on a solid foundation like BTC did. But they never stopped tinkering, and they never will.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i90t45r",
                                                                    "author": "Perleflamme",
                                                                    "score": 4,
                                                                    "created_utc": 1652838084.0,
                                                                    "response": ">like BTC did\n\nSure works like a charm. /s\n\nI think we have a very different definition of what a solid foundation is.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i90ta1t",
                                                                            "author": "Darius510",
                                                                            "score": -2,
                                                                            "created_utc": 1652838160.0,
                                                                            "response": "The results speak for themselves",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i90tikl",
                                                                                    "author": "Perleflamme",
                                                                                    "score": 6,
                                                                                    "created_utc": 1652838268.0,
                                                                                    "response": "Indeed they do. At least we agree on this.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i904ynu",
                    "author": "0ToTheLeft",
                    "score": 50,
                    "created_utc": 1652826641.0,
                    "response": "Now compare these tweets vs Do Kwon. \n\nWhen you invest, you invest in people, even when we are talking about techology, you invest in the people building it. This is a guy i would invest on.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90t055",
                            "author": "I_SUCK__AMA",
                            "score": 1,
                            "created_utc": 1652838032.0,
                            "response": "Very true, it's about the team much more than the company",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i91bznw",
                            "author": "DiamondDallasHands",
                            "score": 1,
                            "created_utc": 1652847862.0,
                            "response": "That’s partially what gives me confidence in Ethereum as well as Algorand. Both Vitalik and Silvio seem like they have good heads on their shoulders.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zocf8",
                    "author": "patniemeyer",
                    "score": 198,
                    "created_utc": 1652819451.0,
                    "response": "Historically speaking it's not uncommon for someone to be brilliant at a young age, but to also be so forward-thinking, consensus-building, and eminently reasonable is rare.  He is the best steward this project could have right now.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zthqb",
                            "author": "torvaman",
                            "score": 19,
                            "created_utc": 1652821595.0,
                            "response": "Totally agree. He has such a long range view on every item. I’ve always felt the best leaders think in time ranges of many many years and sometimes beyond their own lives. Vitalik’s vision is something to witness, and I particularly enjoy how down to earth he is. He laps me twice over in intelligence, but I feel like I could sit down with him and have a meaningful dialogue or just goof around. \n\nSomething that I felt after reading that though, is that I get the sense that vitalik’s very much focused on leaving Ethereum. I don’t think any of us would be surprised that one day he will, but this thread struck me like he was saying without saying that ethereum is me and I am ethereum and it needs to not be that way. I’m doubtful it happens anytime soon, but in the medium term I’m suspect he will step away from ETH and let it grow without him. \n\nI think we can all agree having a project with a face attached to it is a risk. It’s great that ethereums is vitalik’s, but a risk nonetheless and a truly decentralized product is faceless. Anyone else get that sense?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i914f88",
                            "author": "life762",
                            "score": 4,
                            "created_utc": 1652843581.0,
                            "response": "Sometimes comments on this sub are indistinguishable from a cult follower describing her beloved leader. Spooky.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i901weo",
                            "author": "Vaylx",
                            "score": 5,
                            "created_utc": 1652825243.0,
                            "response": "🥂",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i902cok",
                            "author": "NewPenBrah",
                            "score": -23,
                            "created_utc": 1652825448.0,
                            "response": "Maybe, but would have been a better steward if he didn't feel the need to be a star. Could have been such an awesome move for him to stay anonymous like Satoshi, people always wondering if it was him or not. Some people just love the limelight. No denying he's hella clever though.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i905e0f",
                                    "author": "patniemeyer",
                                    "score": 23,
                                    "created_utc": 1652826834.0,
                                    "response": "I sense zero ego in Vitalik.  I think he would be very happy to just step back and become a regular user of Ethereum if it were ready.   But without some kind of honest leadership I think the project would be quickly overrun by crypto bro's and finance psychopaths or stagnate with infighting.  He's walking a fine line amongst the libertarians, the technologists, and the world builders who all want different things.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9060c9",
                                            "author": "NewPenBrah",
                                            "score": -7,
                                            "created_utc": 1652827121.0,
                                            "response": "Do you sense more ego in Satoshi or in Vitalik? If you can claim a greater or equal ego in someone who you don't know if is a man, woman, ai, group or anything else then I suppose we are using vastly different definitions for ego. I'm surprised this is even a discussion, but i guess the V worship is pretty high around here.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i907chg",
                                                    "author": "Oxidative",
                                                    "score": 14,
                                                    "created_utc": 1652827740.0,
                                                    "response": "\"Do you sense more ego in Vitalik, a public figure, or [person we haven't heard from in 10+ years]?\"\n\nYou're right it shouldn't be a discussion, it's a non-starter.\n\nDo you sense more ego in Jerry or this bottle of ketchup I have here? I'm forced to say Jerry but it's kinda meaningless, yeah?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i91i45h",
                                                            "author": "NewPenBrah",
                                                            "score": 1,
                                                            "created_utc": 1652852008.0,
                                                            "response": "İt is definetly possible to compare the egos of two people who were active at different times. I cant even how someone could imagine you couldn't. The reason it is obvious that V has a bigger ego is that when given the choice one person chose to be indifiable and have his name plastered all over his work and the other chose not to. That is how we can decide who has a bigger ego. İ mean, i get it, Vitalik(like almost everyone) wanted attention and praise for his hard work. That's fine, but let's not pretend like it is something other than it is just because the guy came up with some good ideas, jeesh.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9070y1",
                                                    "author": "patniemeyer",
                                                    "score": 3,
                                                    "created_utc": 1652827591.0,
                                                    "response": "I have always thought of Satoshi's anonymity as part of the bootstrapping that was necessary to get people to accept the idea of a blockchain.  It's a lot easier to answer the question of \"why does this block get to start with half the money in the universe\" if it's something like an \"immaculate conception\" with no person around to benefit from it.  Being created by an anonymous / pseudonymous persona who disappeared is about as close as you'll get to that.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i91huxy",
                                                            "author": "NewPenBrah",
                                                            "score": 1,
                                                            "created_utc": 1652851819.0,
                                                            "response": "Wow, i knew people were coming like they knew Satoshi has a lot of coin, this is the first time I've heard people think it was half. Last i heard it was something like 1/100th maybe and i always assumed that was exaggerating.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i90tcq2",
                                                    "author": "Perleflamme",
                                                    "score": 2,
                                                    "created_utc": 1652838195.0,
                                                    "response": "There's a big difference between being worshipped and having ego.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zq6sh",
                    "author": "00_nothing",
                    "score": 43,
                    "created_utc": 1652820222.0,
                    "response": "I really hate the standards in crypto journalism.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90faoa",
                            "author": "Old_Cranberry1433",
                            "score": 5,
                            "created_utc": 1652831538.0,
                            "response": "I believe you mean in Journalism it’s self",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8zu7u6",
                            "author": "Perleflamme",
                            "score": 11,
                            "created_utc": 1652821908.0,
                            "response": "The standards in most of journalism, actually... \n\nMaybe crypto could solve that. It would be interesting to have some DAOs supporting responsible journalism with detailed journalistic interpretation matched with detailed data sources.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90duun",
                    "author": "Ok-Nefariousness1340",
                    "score": 16,
                    "created_utc": 1652830840.0,
                    "response": ">Contradiction between my desire to see more diversity in interesting *cultures* and my realization that maintaining a culture that's distinct from the mainstream seems to often require *some* kind of insanity or artificial barrier or similar thing that I ideologically dislike.\n\nReally feeling this one",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91826m",
                            "author": "Gotigers811",
                            "score": 3,
                            "created_utc": 1652845548.0,
                            "response": "Japan is a good example of this. They have a very interesting, distinct culture thats maintained by heavy restrictions on immigration.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i911exz",
                            "author": "SilentRhetoric",
                            "score": 2,
                            "created_utc": 1652842051.0,
                            "response": "I didn’t really understand that one, actually.  What is that supposed to mean?  Lots of cultures developed due to natural barriers (e.g. geographical isolation of the Indian subcontinent) or are maintained outside the mainstream because people like them.  What am I missing about his point?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91569o",
                                    "author": "Ok-Nefariousness1340",
                                    "score": 5,
                                    "created_utc": 1652843970.0,
                                    "response": "I guess I'm thinking more in the context of groups on the internet. Most talk and think in a very mainstream way, and the ones that *don't*, have some kind of quality that is extremely offputting.\n\nHow could you maintain a culture outside the mainstream when mainstream people like it? Like as in, want to participate? They will participate, not fully understand, and it will be diluted away until it's just an aspect of the mainstream culture. The way to keep it separate is for outsiders to want to stay away.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i90kcph",
                    "author": "jconn93",
                    "score": 14,
                    "created_utc": 1652833956.0,
                    "response": "Why not just link the tweets instead of this shite article?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90oycs",
                            "author": "ca7ac",
                            "score": 1,
                            "created_utc": 1652836122.0,
                            "response": "You can just view the tweets through a link on the article",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90p6hj",
                                    "author": "jconn93",
                                    "score": 8,
                                    "created_utc": 1652836231.0,
                                    "response": "Article itself doesn't add anything. My critique here is that the article itself is useless content to this sub vs just posting the primary source.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90w5q6",
                                            "author": "ToneTaLectric",
                                            "score": 0,
                                            "created_utc": 1652839520.0,
                                            "response": "It was shite to me. I’m new to this space, and I’m not up on all the personalities driving crypto. I understand Bitcoin, but I don’t understand Ethereum. I thought this was a good read. I appreciate people who understand internal contradictions and who see contradictions as something worth navigating and  but not simply discarding. Had OP posted a link to a tweet, I wouldn’t have read it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i90fc7f",
                    "author": "DI0nysOO2",
                    "score": 4,
                    "created_utc": 1652831559.0,
                    "response": "The amount of times I read penis was way too much",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90n8nn",
                    "author": "shart_leakage",
                    "score": 3,
                    "created_utc": 1652835321.0,
                    "response": "I really like Vitalik. He’s a thinker and an honest person. \n\nPosting this from my shitter, well after I pooped, so you know it’s real.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ztm7d",
                    "author": "Kira__________",
                    "score": 21,
                    "created_utc": 1652821649.0,
                    "response": "Vitalik has a unique mind.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90rekz",
                    "author": "Rampager",
                    "score": 3,
                    "created_utc": 1652837282.0,
                    "response": "I sincerely hope for Vitalik's sake he never reads replies to his own twitter threads. It makes the contradiction about intellectual elites hit far harder (not that I am one, but easy to see from the replies who isn't :P). Fascinating stuff as always from the VB.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zndlp",
                    "author": "Cleafonreddit",
                    "score": 10,
                    "created_utc": 1652819046.0,
                    "response": " \" Hoskinson urged that the Ethereum co-founder move over to Cardano, stating “it’s not too late to come to Cardano.” \"\n\nHes always seeking attention, someone does something and hes the child that goes \" yea but look at me\".",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90p23q",
                            "author": "ca7ac",
                            "score": -6,
                            "created_utc": 1652836172.0,
                            "response": "Relax it was 1 reply.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i902h90",
                    "author": "suuperfli",
                    "score": 12,
                    "created_utc": 1652825505.0,
                    "response": "so basically he says that sound money is the biggest and most important use case (especially for human rights), and he wishes ETH was more like Bitcoin (maximizing long term stability).",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90gss4",
                            "author": "Darius510",
                            "score": 3,
                            "created_utc": 1652832273.0,
                            "response": "Which is ironic considering it’s moving in exactly the opposite direction",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90tbca",
                                    "author": "I_SUCK__AMA",
                                    "score": 8,
                                    "created_utc": 1652838177.0,
                                    "response": "Bitcoin has a lot of issues, ethereum strikes the best balance between \"bitcoin-like\" rigidity and smart contract expressivity.  But ultimately we'll need a few diffrent platforms at different places on that spectrum.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i91dsr7",
                                    "author": "niktak11",
                                    "score": 1,
                                    "created_utc": 1652849010.0,
                                    "response": "Thank god",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i90o720",
                                    "author": "anonymous7865412",
                                    "score": -1,
                                    "created_utc": 1652835768.0,
                                    "response": "⬆️",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i900aqw",
                    "author": "jlevy1126",
                    "score": 2,
                    "created_utc": 1652824532.0,
                    "response": "Love it, an invitation from an old friend seen as a jab. Journalism in crypto is despicable.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91g6we",
                    "author": "444_headache",
                    "score": 2,
                    "created_utc": 1652850628.0,
                    "response": "I understand his contradictions but my take away is that the merge is not going as hoped.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90x8zr",
                    "author": "Professional-Cod-927",
                    "score": 4,
                    "created_utc": 1652840038.0,
                    "response": "Honestly these are arguments that I've brought up time and again and something that we do have to seriously consider.\n\nBut the moment I mention the uses of crypto by these less than Democratic countries where isolation of power is rampant, I get downvoted. Sometimes it's not FUD and it's people who genuinely consider the pros and cons of crypto.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90aq2a",
                    "author": "Valence00",
                    "score": 3,
                    "created_utc": 1652829339.0,
                    "response": "Charles told Vitalik to join him on Cardano. I wonder how Eth or Ada would've been like if the two of them stayed as a team.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9185hc",
                            "author": "Gotigers811",
                            "score": 4,
                            "created_utc": 1652845599.0,
                            "response": "From what I have heard, Charles was a serial liar and very unpleasant to work with in Ethereum. It would not have gone well.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i91g5gq",
                            "author": "omgzpplz",
                            "score": 2,
                            "created_utc": 1652850600.0,
                            "response": "I would be very surprised if Cardano amounted to anything. Charles is an absolute nut job and serial liar with an over-inflated ego. I'm not going to bet on that horse.\n\nAnd even if you are optimistic about ADA, like someone else mentioned, they'd never get along.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i90r8mo",
                            "author": "endlessinquiry",
                            "score": 1,
                            "created_utc": 1652837204.0,
                            "response": "They are kind of like yin/yang.\n\nI think one has strength where the other has weakness, and visa-versa.  \n\nIf you could get a moderator between the two, I think together they could accomplish more together than they have apart.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i919udz",
                                    "author": "W944",
                                    "score": 2,
                                    "created_utc": 1652846574.0,
                                    "response": "Fu - Sion - Ah!\n\nCardaneth",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i90qbxj",
                    "author": "manginahunter1970",
                    "score": 1,
                    "created_utc": 1652836780.0,
                    "response": "It's been said (please calm down maxis) that if Buterin and Hoskinson can melt Ethereum and Cardano that it would become unstoppable. \n\n\nI know they have within the past few months buried the hatchet yet their maxi fanbois prefer to fan the old flames. \n\n\nCan you even actually imagine it?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i919d7z",
                            "author": "edmundedgar",
                            "score": 2,
                            "created_utc": 1652846297.0,
                            "response": "It's been said by who? The dude worked with a bunch of early Ethereum people, they found that he was a pain in the arse and kicked him out.\n\nIt's not maxi to say that, it's just what happened.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i919jre",
                                    "author": "manginahunter1970",
                                    "score": 2,
                                    "created_utc": 1652846406.0,
                                    "response": "They've both moved on from that.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i90zyzs",
                    "author": "GhabageMan",
                    "score": 1,
                    "created_utc": 1652841343.0,
                    "response": "Soooooo when Eth 2.0",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90c4bm",
                    "author": "mrmadbull2021",
                    "score": -3,
                    "created_utc": 1652830000.0,
                    "response": "Did he say when merge",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zvcgn",
                    "author": "G33ONER",
                    "score": -11,
                    "created_utc": 1652822388.0,
                    "response": "He should get ripped",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zwuzy",
                            "author": "teenagemutaintninja",
                            "score": 3,
                            "created_utc": 1652823030.0,
                            "response": "Elaborate",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zxw9f",
                                    "author": "moeljills",
                                    "score": 13,
                                    "created_utc": 1652823477.0,
                                    "response": "Jacked, like shredded",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i900tfs",
                                            "author": "WalletDeskShoe",
                                            "score": 5,
                                            "created_utc": 1652824762.0,
                                            "response": "I think means ripped like a bong lol",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i90m3rr",
                                                    "author": "DREAMEATER__",
                                                    "score": 2,
                                                    "created_utc": 1652834781.0,
                                                    "response": "I read it as jacked too, and I'm the biggest stoner I know lol.\n\nIn OP's defense, everyone should get ripped. In both senses of the word lol.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i90p8ne",
                    "author": "ca7ac",
                    "score": 1,
                    "created_utc": 1652836260.0,
                    "response": "Oh gotcha. Ya fuck them hoes",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90pwsy",
                    "author": "cousin_brian",
                    "score": 1,
                    "created_utc": 1652836582.0,
                    "response": "I will buy eth at 420",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90uf2j",
                    "author": "N_GHTMVRE",
                    "score": 1,
                    "created_utc": 1652838686.0,
                    "response": "Some good points, especially [this one](https://youtu.be/QFgcqB8-AxE)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91cml4",
                    "author": "12ealdeal",
                    "score": 1,
                    "created_utc": 1652848263.0,
                    "response": "Anyone in here reading this a bit concerned for ETH?\n\nThe series of tweets almost reads a bit defeatist and yielding to BTC.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91hi3r",
                            "author": "edmundedgar",
                            "score": 1,
                            "created_utc": 1652851558.0,
                            "response": "What specifically seems defeatist? Are you talking about this?\n\n> Contradiction between my desire to see Ethereum become a more Bitcoin-like system emphasizing long-term stability and stability, including culturally, and my realization that getting there requires quite a lot of active coordinated short-term change.\n\nThe context for this is that Bitcoin ossified and said \"OK, let's do most of the innovating on Layer 2 from now on\", well before it was well enough built out to be a useful system to build Layer 2s on. In theory Ethereum has sort-of got there, at least once we have data sharding, so Ethereum should be able to do Bitcoin-style ossification fairly soon without the downside being as serious as it is for bitcoin - if that's what people choose.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i918ura",
                    "author": "dpux",
                    "score": -1,
                    "created_utc": 1652845995.0,
                    "response": "I know I will be downvoted for asking this in the Ethereum community but which of his concerns are not already resolved or being addressed by Cardano? Which of his concerns have not been highlighted and thoroughly discussed by Charles Hoskinson in the last few years?\n\nIf Vitalik (and crypto community) were serious about decentralization, governance and actually solving the problems that Vitalik raised, they would keep their ego aside and work with Cardano, or atleast stop spreading misinformation. But I am 100% sure that won't happen because writing about \"desires\" and \"contradictions\" is enough to keep public engaged - it's a trick politicians have been using for centuries.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91a0uj",
                            "author": "edmundedgar",
                            "score": 2,
                            "created_utc": 1652846680.0,
                            "response": "Seriously, you people are ridiculous. Any time somebody posts something about a problem in Ethereum you show up and vaguely claim Cardano fixes it, any time somebody posts about something good in Ethereum you claim Cardano already does it. There's never any detail about what's better, and on inspection it always turns out to be bullshit.\n\nYou don't impress anyone with all this brainless tub-thumping, you just make your project looks like a hustle. Other projects that people are actually building on don't feel the need to do this [*], they just get on with building it.\n\n[*] OK, just occasionally we get something similar from Algorand people, but never like Solana or Avalanche or whatever.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91b6na",
                                    "author": "dpux",
                                    "score": 1,
                                    "created_utc": 1652847373.0,
                                    "response": "I am raising these questions because people like Vitalik get media publicity for acting like saints when in reality they support the very same VCs and Governments they claim to fight against. The worse part if that they demonize people who are actually trying to solve tough engineering problems like decentralization and governance.\n\nIf you really have any doubts on why Cardano isn't already solving the concerns Vitalik raised, please post your question here, I promise to answer them with facts. But when you write Cardano looks like a \"hustle\", I am pretty sure you don't have any questions, just false assumptions that you don't want corrected because it hurts you financially.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i91eq9n",
                                            "author": "edmundedgar",
                                            "score": 1,
                                            "created_utc": 1652849633.0,
                                            "response": "What's \"solving the concerns\"? It's a whole list of complicated trade-offs and contradictions, there isn't one thing that \"solves\" them. There's nothing to rebut.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i91f29o",
                                                    "author": "dpux",
                                                    "score": 1,
                                                    "created_utc": 1652849857.0,
                                                    "response": "Got it, noone is solving any problem. Lets make money writing philosophies.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i91fo0t",
                                                            "author": "edmundedgar",
                                                            "score": 1,
                                                            "created_utc": 1652850265.0,
                                                            "response": "I didn't say noone is solving any problems, I said *you're not posting any solutions to any problems*. You're just vaguely saying Cardano solves them and challenging people to prove it doesn't, which is ludicrous because it's an entire thread of incredibly diverse things.\n\nBTW, I also didn't say Cardano is a hustle. I said *people like you make it look like a hustle*.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i91gyak",
                                                                    "author": "dpux",
                                                                    "score": 1,
                                                                    "created_utc": 1652851170.0,
                                                                    "response": "\\>>I said you're not posting any solutions to any problems.\n\nAnd I offered you to ask me which concern do you want an answer for - to which you replied there is no concern/problem and nothing \"solves\" them.\n\n\\>>  I said people like you make it look like a hustle.\n\nPeople like me who question Vitalik's hypocrisy between talk and action? I brought Cardano in the discussion as a solution if you or someone else really want to solve the problem.\n\nMy offer still stands - pick one item from Vitalik's thread that you find incredibly difficult to solve and let me reply how Cardano solves that problem in an open and democratic way.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zup7o",
                    "author": "coinfeeds-bot",
                    "score": 0,
                    "created_utc": 1652822113.0,
                    "response": "tldr; Ethereum co-founder Vitalik Buterin tweeted that there are \"some still open contradictions in my thoughts and my values.\" He also stressed his ambition to see Ethereum become a Layer 1 blockchain that can endure harsh conditions. Cardano inventor Charles Hoskinson responded by urging him to move over to Cardano, stating “it’s not too late to\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}