{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "knjhzm",
            "title": "Anatomy of a sim swap attack: Fast response time, hackers had only 1 hour with my phone",
            "url": "https://www.reddit.com/r/ethereum/comments/knjhzm/anatomy_of_a_sim_swap_attack_fast_response_time/",
            "author": "dreftylefty",
            "created_utc": 1609391299.0,
            "score": 48,
            "num_comments": 38,
            "subreddit": "ethereum",
            "selftext": "Anatomy of a Sim Swap attack of an Iphone X.\n\nNOTE: my info was leaked in ledger hack.\n\nUnbeknownst to me, at 5:30pm today someone walked into a Tmobile store, claiming my identity and swapped my sim.  At 5:45pm I noticed my texts  were not sending.  I had no phone calling ability.  Other house mobile phones worked. Wifi internet on my phone worked.  I see an alert on my chase account of a credit inquiry at Macy's Department store minutes later.  At that point I knew it was a sim card swap attack.  I called Tmobile.   Recording says, \"1 hour wait.\"  I leave my wifes number for them to call back.  I race over to the Tmobile store 5 minutes away and plead my case. \"Stop the phone access.\"  They research and see that the swap happened at a store but can't say which one.  They call into Tmobile to figure out next steps.  While we are waiting, I get the call back from Tmobile corporate.  They agree it is a fraud case and they switch the sim back to my phone, I regain access within 1 hour or so since the swap occurred.  I agreed to switch phone numbers being that I was hacked once already, I will likely continue to be a target due to the ledger hack. By this time I am checking all my crypto accounts and gmail.\n\nI had AUTHENTICATOR 2FA: on everything except for binance, cash app(luckily tied to a DIFFERENT phone number), breez.\n\nNo evidence of entry to my gmail account.  No evidence of entry to binance or other accounts.\n\nSo far only fraud is Macy's Department store credit.\n\nTmobile says they will follow up and have fully logged this as a fraud/identity theft. I called Chase credit monitoring and have a case open on the Macy's credit inquiry.\n\nI will update if hackers were able to access anything else of my accounts/crypto in that 1 hour time span.\n\nTHANK YOU all previous people who have told your story about these attacks.  Hopefully my quick recognition and intervention saved me some $$.  Nevertheless there was very little crypto they had access to because almost all big accounts have authenticator 2FA (no sms 2fa).\n\nIF YOUR PHONE STOPS WORKING, but wifi works etc.  First response should be to confirm it is a sim swap attack.\n\nQuestion: Is my iphone metamask ethereum account threatened still somehow?  I see no unrecognized transactions.  Was it threatened at all during the sim swap?",
            "stickied": false,
            "comments": [
                {
                    "id": "ghlgupu",
                    "author": "DooDooDaddy",
                    "score": 27,
                    "created_utc": 1609411618.0,
                    "response": "Someone needs to bring a class action against T-Mobile. This shit is not ok, they need to do a proper verification before making these kinds of changes to people’s accounts.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ghm9z0p",
                            "author": "audigex",
                            "score": 7,
                            "created_utc": 1609432786.0,
                            "response": "Yeah, ID should be required to do a sim swap, at the very minimum",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ghmm5q3",
                                    "author": "troutsoup",
                                    "score": 1,
                                    "created_utc": 1609439023.0,
                                    "response": "i got a sim for my daughter and was asked for ID. i’m sure a lot of it comes down to who you get in the store though",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ghmmjo4",
                                            "author": "audigex",
                                            "score": 8,
                                            "created_utc": 1609439223.0,
                                            "response": "I think the point for me is that the carrier should either see ID of the person on the account, or be liable for any and all losses arising from the fraud.\n\nImagine how quickly they’d take steps to resolve it if that happened? The inconsistencies of which employee deals with it would vanish overnight",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ghm3dhp",
                            "author": "dreftylefty",
                            "score": 3,
                            "created_utc": 1609429227.0,
                            "response": "For real, the employees are easily corruptible.  They need cameras in the store so people get caught and held responsible.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ghnlq25",
                            "author": "cryptolicious501",
                            "score": 1,
                            "created_utc": 1609458638.0,
                            "response": " \n\nThe sim swap attack can be protected against, at least for me at ATT, where ATT will ask for pass word before they change your sim... I had to ask for this type of protection a couple of years ago when I heard about the sim swap attack. It did not come standard...\n\nT-Mobile should offer this type of protection for its customers, ffs.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ghnt1gm",
                                    "author": "Hodlmegently",
                                    "score": 1,
                                    "created_utc": 1609462894.0,
                                    "response": "Exactly... something as simple as this can prevent financial ruin. Why don't all carriers have this option.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ghtp0kl",
                                    "author": "VariousJackfruit",
                                    "score": 1,
                                    "created_utc": 1609593747.0,
                                    "response": "T-mobile does offer that protection too.. Just people seem able to bypass it due to shitty employees.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ghlcpjz",
                    "author": "Majsvaffla",
                    "score": 9,
                    "created_utc": 1609407205.0,
                    "response": "Hackers didn’t have your physical phone, right? They only had control of your phone number. Unless you were using your phone number as 2FA, were there ever any risk of them stealing anything?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ghlhg57",
                            "author": "twigman7",
                            "score": 5,
                            "created_utc": 1609412261.0,
                            "response": "That’s right . \n\nRemoving your phone number completely from your primary email (eg gmail) and using an authenticator (Google has one) is the number 1 thing to do to avoid sim swap. Your primary email is your absolute god-head.\n\nOtherwise the hackers “forget password” everything and switch out your passwords , plus they have access to x1000 more info about you.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ghm34eh",
                                    "author": "dreftylefty",
                                    "score": 1,
                                    "created_utc": 1609429088.0,
                                    "response": "Somehow in 1 hour they weren’t able to change my email password. I didn’t have Authenticator set up for my email.  Either they were too slow to  o make the change or i had some other setting for recovery?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ghmxhui",
                                            "author": "LiterallyTrolling",
                                            "score": 1,
                                            "created_utc": 1609445004.0,
                                            "response": "Were you using texts as 2FA on your email?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ghn0q6j",
                                                    "author": "dreftylefty",
                                                    "score": 3,
                                                    "created_utc": 1609446749.0,
                                                    "response": "I have an alternate recovery EMAIL.  And a security question. \nuse your phone to sign in: off\n2step verification: off\n\nThese settings probably saved me",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ghnlgjw",
                                                            "author": "twigman7",
                                                            "score": 2,
                                                            "created_utc": 1609458491.0,
                                                            "response": "This was your saving grace. Well done.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hhpw0p7",
                                            "author": "FunCandy8149",
                                            "score": 1,
                                            "created_utc": 1634973702.0,
                                            "response": "They were too busy at macys",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ghmcmhh",
                    "author": "daxtaslapp",
                    "score": 3,
                    "created_utc": 1609434151.0,
                    "response": "Wow reading your post i felt the rush of urgency",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ghmtlax",
                            "author": "dreftylefty",
                            "score": 1,
                            "created_utc": 1609442919.0,
                            "response": "I wrote it right after I swapped back and got a new phone line, was still pretty amped up",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ghlb7ui",
                    "author": "koneru9999",
                    "score": 3,
                    "created_utc": 1609405627.0,
                    "response": "Does TMobile stores issue a new SIM card with out a valid identity card ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ghlef5r",
                            "author": "Eduel80",
                            "score": 9,
                            "created_utc": 1609409029.0,
                            "response": "Some will with a few Franklins shoved in their face.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ghm3vke",
                            "author": "dreftylefty",
                            "score": 2,
                            "created_utc": 1609429503.0,
                            "response": "It is a fireable offense for an employee to do this unless the hacker had a fake ID. I will find this out in 24 hours probably.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ght0eu8",
                                    "author": "youriqis20pointslow",
                                    "score": 2,
                                    "created_utc": 1609569232.0,
                                    "response": "Fireable offense? I would press charges",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ghlue7d",
                    "author": "hblask",
                    "score": 2,
                    "created_utc": 1609423769.0,
                    "response": "Most (all?) providers give you a way to require ID and/or codes in order to swap your phone. If anyone has not set that up on their phone, do it now.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ghm3qsx",
                            "author": "dreftylefty",
                            "score": 2,
                            "created_utc": 1609429431.0,
                            "response": "Tmobile requires an ID for ALL in store changes.  The store fucked up, the employee was probably paid off. Its a fireable offense!\n\nI didn’t set a sim passcode.  I should have and need to study that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gq2x01l",
                    "author": "Orejita2018",
                    "score": 1,
                    "created_utc": 1615105864.0,
                    "response": "T-Mobile made a copy of my boyfriends license, swapped his SIM card and told him he needs to get his lap top and accept new PIN number.  He didn’t know better.  Within an hour they had stolen over 12k from his account and made copies of his license and they will hitting banks in New Jersey, Ohio and Florida all within and hour.  Big big arrestees made due to BF having the time line details perfect for the FBI and they all were let out on bail and right back at it.  Going after his frozen accounts, posing has him and know everything about his family and life so much so the bank tellers unfreeze and the they take more money.  The police never confiscated the fake license machine. One photo copy of his license is now out and in the hands of various thieves who have their face but my boyfriends actual license and when the bank calls to confirm they actually get the call and pretend to be him.  The made a copy of his SIM card.  ￼",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gq3qa3c",
                            "author": "dreftylefty",
                            "score": 1,
                            "created_utc": 1615130558.0,
                            "response": "i'm sorry that is a really fucked up situation.  I hope he has frozen his credit through all three credit score companies.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ghlaa5d",
                    "author": "prismalabsx",
                    "score": -27,
                    "created_utc": 1609404654.0,
                    "response": "Relax bro smokin too much of the pcp I see",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ghm21ay",
                            "author": "FartClownPenis",
                            "score": 2,
                            "created_utc": 1609428481.0,
                            "response": "Who even smokes pcp anymore",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "bqgeur",
            "title": "[Question] Can I include public visible text comments in Eth transactions?",
            "url": "https://www.reddit.com/r/ethereum/comments/bqgeur/question_can_i_include_public_visible_text/",
            "author": "T0TALWANNABE",
            "created_utc": 1558269116.0,
            "score": 8,
            "num_comments": 5,
            "subreddit": "ethereum",
            "selftext": "Hello all! \n\nI am looking to do finincial exchange via eth network and I need to identify each deal by adding a relevant comment under transaction. It's not about smart contracts: there're no need for complicated execution, I just need to add a property comment for manually done TX that will be visiable to whole network. \n\nHow to do it with ETH network or with other blockchains?   \nP.S. I know that WAVES allow this feature, but I am more devoted to eth :3   \nThanks in advance!",
            "stickied": false,
            "comments": [
                {
                    "id": "eo5qd1m",
                    "author": "409h",
                    "score": 2,
                    "created_utc": 1558301670.0,
                    "response": "Yes, you can input text in the `data` field of the transaction. For MyCrypto, here's [a graphic](https://i.imgur.com/nOYJZyW.png). You can see that [the transaction](https://etherscan.io/tx/0x884034d95cd72e6fe3c55a59b673e91aa72f86eff33428054106ef77c4d84035) has the text in the data field on Etherscan (use Etherscan to \"View Input As\" > \"UTF-8\" for human readable)\n\nMore on the data field: https://medium.com/mycrypto/why-do-we-need-transaction-data-39c922930e92",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "eo4datt",
                    "author": "Sulack",
                    "score": 0,
                    "created_utc": 1558275174.0,
                    "response": "It's not too hard. Message me and I can help",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}