{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uq7ill",
            "title": "Seeking advice & informative resources to convince my father, a professional stock trader, to invest in ETH",
            "url": "/r/ethtrader/comments/uq7crn/seeking_advice_informative_resources_to_convince/",
            "author": "yvesclover",
            "created_utc": 1652625691.0,
            "score": 3,
            "num_comments": 3,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8pcgel",
                    "author": "AESTHTK",
                    "score": 3,
                    "created_utc": 1652627653.0,
                    "response": "Listen to the most recent Bankless episode with Hal Press:\n\nhttp://podcast.banklesshq.com/betting-the-fund-on-the-merge-hal-press-north-rock-digital\n\nNot only does he make an extremely compelling argument for Ethereum as an investment, he uses traditional stock valuation concepts to argue the case - it’s extremely relevant to your exact situation.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqckp6",
            "title": "Layer 2 in 2022: Are You Ready for Rollups, Bridges, New Apps, Life With Ethereum 2.0, and Layer 3?",
            "url": "https://www.reddit.com/r/ethereum/comments/uqckp6/layer_2_in_2022_are_you_ready_for_rollups_bridges/",
            "author": "Theodora765",
            "created_utc": 1652640309.0,
            "score": 72,
            "num_comments": 12,
            "subreddit": "ethereum",
            "selftext": "We all recall this is a pivotal year for Ethereum layer 2 (L2) solutions so what happens over the coming months will be critical in making decentralized finance (DeFi) work better, faster, and more reliably for a far greater number of users.  \n\nLast year saw L2 solutions roll out with great promise, increasing the number of decentralized apps across verticals such as exchanges, marketplaces, wallets, bridges, and more. Yet the growing user base and total value locked on Ethereum L2 were eclipsed by alternative layer 1 blockchains emerging to fill the market gaps that persisted such as Ethereum’s scalability issues.\n\n   With multiple apps deployed across chains, we are now seeing increasing fragmentation that adds complexity for end-users and detracts from the ultimate goal of making DeFi accessible for all. We have seen chains like smartchain develop cheap, fast and highly efficient solutions which helps launching of projects like Cake, Minosis, Xvs etc even more accesible.  Ethereum creator Vitalik Buterin has claimed that (L2s or) “rollups are in the short and medium-term, and possibly in the long term, the only trustless scaling solution for Ethereum”. \n\n We have seen this start to play out, with the total value locked (TVL) in layer 2 protocols such as StarkNet, Arbitrum, and Boba Network growing from USD 50 million to a high of USD 7 billion.  I look forward to what follows, do you think the L2 will be a total success?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8qbubh",
                    "author": "1moreOz",
                    "score": 21,
                    "created_utc": 1652643183.0,
                    "response": "A post about L2 not mentioning loopring or matic, interesting",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qg3pe",
                            "author": "frank__costello",
                            "score": 5,
                            "created_utc": 1652645070.0,
                            "response": "Don't worry, the shills will take care of it in the comments",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8qbo97",
                    "author": "frank__costello",
                    "score": 5,
                    "created_utc": 1652643108.0,
                    "response": "These posts are weird",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qh7m9",
                            "author": "notdsylexic",
                            "score": 3,
                            "created_utc": 1652645559.0,
                            "response": "It’s written like a blog post… not a discussion post.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}