{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v1121i",
            "title": "What is retroactive public goods funding and how exactly does it work?",
            "url": "https://www.reddit.com/r/ethereum/comments/v1121i/what_is_retroactive_public_goods_funding_and_how/",
            "author": "Corgisarehilarious",
            "created_utc": 1653919811.0,
            "score": 7,
            "num_comments": 4,
            "subreddit": "ethereum",
            "selftext": "I'm writing a report and trying to get my head around the concept. Can someone please explain it to me simply and/or provide some links for reading material :) . Thanks!",
            "stickied": false,
            "comments": [
                {
                    "id": "ial7y54",
                    "author": "Perleflamme",
                    "score": 2,
                    "created_utc": 1653945437.0,
                    "response": "You may want to look at Gitcoin. It's the keyword you're most probably looking for.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialiy2p",
                    "author": "fav53",
                    "score": 2,
                    "created_utc": 1653950916.0,
                    "response": "If you want something to exist then you incentivize it. Retroactive rewards means instead of telling people to do X and they get money you instead give money to people who already did whatever it is you think should be rewarded.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v117og",
            "title": "ETH staker/miner vs BTC miner poll",
            "url": "https://www.reddit.com/r/ethereum/comments/v117og/eth_stakerminer_vs_btc_miner_poll/",
            "author": "gharvhel",
            "created_utc": 1653920260.0,
            "score": 1,
            "num_comments": 2,
            "subreddit": "ethereum",
            "selftext": "*I tried posting this or* r/CryptoCurrency *and it got removed.* r/Bitcoin *is a bubble that doesn't let you post about anything else.*  \n\n\nIn my circle, I know many Eth stakers, but no Btc miners. Making a poll to gauge the experience of other people.\n\n[View Poll](https://www.reddit.com/poll/v117og)",
            "stickied": false,
            "comments": [
                {
                    "id": "iamki1w",
                    "author": "j_greca",
                    "score": 1,
                    "created_utc": 1653971053.0,
                    "response": "Decent poll. I don't personally know anyone mining btc. Seems very commercial now. Wish it wasn't so challenging to get decent asic miners.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v1158d",
            "title": "Solidity courses",
            "url": "https://www.reddit.com/r/ethereum/comments/v1158d/solidity_courses/",
            "author": "oriok92",
            "created_utc": 1653920064.0,
            "score": 3,
            "num_comments": 4,
            "subreddit": "ethereum",
            "selftext": " \n\nHello!\n\nI'm looking for an updated Solidity course that can teach me enough to get a junior solidity dev level. My objective is to find some well paid job as a begginer developer in the Defi ecosystem.\n\nRight now I have thought about two courses: Consensys (The Blockchain Developer Program On-Demand, 295$) and the recently published course from Freecodecamp (30hour complete course).\n\nAlso I have thought about learning from Alchemy and Ethereum.org.\n\nJust to introduce a little bit my background, used to work in banking consulting, I got algorithmic trading experience with python (Using Binance API) also had build few codes to buy tokens and getting data from blockchains, AVAX, BSC and FTM mainnly. And for the lasts months I was a full time Degen, so got experience with DEFI, Metamask, tx, NFT, shitcoins, etc.\n\nCan you guys tell me if I'm a little bit misguided with this courses and what would you recommend me to start with?\n\nThank you!",
            "stickied": false,
            "comments": [
                {
                    "id": "iakgdla",
                    "author": "ThenOwl9",
                    "score": 1,
                    "created_utc": 1653932575.0,
                    "response": "Have you looked at the gamified courses?  Think Loom has one.  Not sure of quality.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakof8v",
                    "author": "Web3Dude",
                    "score": 1,
                    "created_utc": 1653936211.0,
                    "response": "If you are looking to learn solidity and get a job the best option is metana.io - they will teach solidity comprehensively, help you build your dapp portfolio, and also make sure you land a job in web3 development as well.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}