{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqbugk",
            "title": "If The SEC retaliates for UST Terra/Luna",
            "url": "https://www.reddit.com/r/ethereum/comments/uqbugk/if_the_sec_retaliates_for_ust_terraluna/",
            "author": "samdane7777",
            "created_utc": 1652638230.0,
            "score": 0,
            "num_comments": 14,
            "subreddit": "ethereum",
            "selftext": "We have the leverage because if they try to put kyc on native wallets or felonize, extradite, or intimidate developers for coding, or blackball smart contracts, give \"defi licenses\" to CME chicago good ole boys, we will dedollarize & pull everything out of the US. US gets nothing.\n\nLook at what Tom Duffy and  the CME are doing to our industry, this decrepit guy is admitting to the US ag hearing what he & his crony did the last 4 year to us. If they try to give licenses to DeFi w/ gate keeping, Dedollarize everything, let them know.\n\nYou know how easy it is to just write a front end that shows the usd dollar amount of a completely different stable coin pegged to god knows what. Dedollarization.\n\nJust build collateralized stable coins tied to a basket of 50 different currencies and 20 or 30 treasuries, plus 20 or 30 commodities, if these nation state want to do reflexivity attacks on the collateral, they'll have to short every major currency in every major country in the world. Invent our own peg. Over collateralize it to peg it to a past snap shot of itself at a given index of valued assets. It can be done.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8qi1ax",
                    "author": "HEX_helper",
                    "score": 2,
                    "created_utc": 1652645926.0,
                    "response": "I wouldn’t mind competing stable coins\n\nUnfortunately the dollar is dominating all other fiat currencies right now",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8q3rt8",
                    "author": "caploves1019",
                    "score": 0,
                    "created_utc": 1652639586.0,
                    "response": "Why flee the collapsing USD for a digital version pegged to it? Gtfo stables in general, stick to future proof currency that deflates over time. Screw stables full stop.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qcs44",
                            "author": "samdane7777",
                            "score": 3,
                            "created_utc": 1652643602.0,
                            "response": "No one who has money on the line, or most advanced finance and fund management is going to just expose themselves to bitcoin and it's serious lack of stability, or any other deflationary asset. The concept of not having credit expansion or inflation in some degree, and some stability in asset price, is complete btc maxi peter pan stuff. I'm literally not talking about pegging it to the US dollar either, I'm talking about pegging it to the aggregate value of about 500 assets in decimal form, specially picked to reduce volatility, and to make impossible for the US gov to engage in reflexivity attacks without crashing the rest of the global economy.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qjgcy",
                                    "author": "caploves1019",
                                    "score": 1,
                                    "created_utc": 1652646551.0,
                                    "response": "What you're referring to is Time Wonderland wrapped memories and magic internet money crap. Which has also completely failed.\n\nAlso see for reference Papa Dao and hector Dao. Two other failed stable asset basket stacked ponzinomics trash.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8rtlro",
                                            "author": "Dry-Hurry-7598",
                                            "score": 0,
                                            "created_utc": 1652667887.0,
                                            "response": "Time wonderland was not a stablecoin wtf you saying ???? And mim is still around are you high you can google this shit because mim is backed by collateral",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8rypjl",
                                                    "author": "caploves1019",
                                                    "score": 1,
                                                    "created_utc": 1652670495.0,
                                                    "response": "You just said a basket of assets that isn't a stable USD.... You're referring to time wonderland.\n\nTime wonderland had many assets, including mim, as the backing to stabilize it to the value of the assets backing it.\n\nMim is stable from usdc, usdt, busd, and other interest bearing stables staked within it. It's literally a house of cards backing each other in circular recursive illogical ponzinomics. Pieces are collapsing while others have remained slightly insulated; SO FAR.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8s0fqp",
                                                            "author": "Dry-Hurry-7598",
                                                            "score": 1,
                                                            "created_utc": 1652671446.0,
                                                            "response": "Read your second paragraph to stabilise it to the basket of goods, but that doesn’t mean it was a stablecoin, it had no liquidation feature like mim has, so it was allowed to follow the market which was the start of the bear market and eth btc avax all tanked so Yh that’s why it also started to fall.\n\nAnd yes it was very bad for mim to be backing time and time for be backing mim I don’t disagree but the other assets that mim is using are fine and you don’t give a logical explanation why the other assets such as Usdc and Busd are bad collateral ?Usdc, Busd, usdt, yearn eth etc are all controlled and ran by other separate entities you do realise that ? So how could it just be stacking in circles situation/ recursive they aren’t related and correlated assets ?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8r7hzo",
                            "author": "I-make-ada-spaghetti",
                            "score": 2,
                            "created_utc": 1652657439.0,
                            "response": "What you are proposing requires merchants to price things in the actual currency the buyer wants to pay in.\n\nNo one wants to be walking around every day doing conversions in their head like they are on holidays in a foreign country.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8rd3vq",
                                    "author": "caploves1019",
                                    "score": 1,
                                    "created_utc": 1652660234.0,
                                    "response": "That wasn't necessary on the gold standard. Everyone knew how hard they had to work, putting their time and energy into doing a task, to earn gold. They knew based on that reference how much time their gold was worth and priced their goods and services in that much gold.\n\nOff the gold standard, we trust central government to tell us what our time is worth converted in USD. In countries other than US, the reference is in the local currency and plenty of countries already do the conversion in their heads when tourists visit....\n\nYour logic is flawed.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8rmppb",
                            "author": "Dry-Hurry-7598",
                            "score": 1,
                            "created_utc": 1652664729.0,
                            "response": "Well decentralised overcollaterlised stablecoins make more sense because yes they are pegged to $1 but it could easily be switched to peg the yen instead you just need to measure all the assets that’s are collateralised in yen or any currency even in terms of Btc",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8qcgr2",
                    "author": "samdane7777",
                    "score": 1,
                    "created_utc": 1652643458.0,
                    "response": "Unfortunately I believe normalizing stablecoin pegs to the US dollar was just a mistake and a giant lever of power for the gov to enforce kyc & gatekeeping for banking cartels on everything & one, to utterly destroy censorship resistance in the crypto ecosystem.  \nThis means a stateless currency pegged to \"things\" (in small .0001 decimal place value) is going to have to be anonymously made, collateralized, run by anonymous devs, or built in a failsafe way. The US gov only understands fraud, force, & violence & coercion.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qhgje",
                            "author": "Technical_Low_3233",
                            "score": 2,
                            "created_utc": 1652645669.0,
                            "response": "What about tether usdt? No U.S. oversight, audit.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8q0v2k",
                    "author": "samdane7777",
                    "score": -1,
                    "created_utc": 1652638295.0,
                    "response": "Enough is enough.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qwav7",
                    "author": "Boxman212",
                    "score": 1,
                    "created_utc": 1652652130.0,
                    "response": "You know what ALWAYS stays pegged to the dollar and is already digital?  Yep.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}