{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uu72kj",
            "title": "How are Lido, Coinbase and large managed staking providers keeping their validator nodes and private keys secure? Looking for tips on keeping my validator node safe",
            "url": "https://www.reddit.com/r/ethereum/comments/uu72kj/how_are_lido_coinbase_and_large_managed_staking/",
            "author": "LinusThiccTips",
            "created_utc": 1653078874.0,
            "score": 3,
            "num_comments": 4,
            "subreddit": "ethereum",
            "selftext": "I’m running my own validator node at home for now but I want to move it to a dedicated server for reliability.\n\nConsidered hosting it on a VM, but even with disk encryption, the provider could dump RAM and read my passphrase.\n\nSo now I’m looking into a dedicated bare-metal server. An attacker being able to dump RAM is still possible but considerably harder, that’s good enough for me.\n\nThat got me thinking, how are all the big time managed staking like Coinbase, Lido, RocketPool keeping their fleet of validator servers secure? \n\nThey’re very likely running VMs on cloud providers. I know it’s very unlikely that AWS or Google Cloud will pull a RAM dump on them, but credentials can still get compromised as we’ve seen it happen so many times before. I want to follow the best practices to be at least as secure as them.\n\nMy plan to secure my validator node:\n\n- Bare-metal server\n- My own VPN, always on with killswitch enabled (might use ZeroTier or Tailscale for this)\n- Firewall only accepting incoming connections from the VPN subnet\n- Only SSH incoming connection allowed, with port-knocking to expose-hide the custom port, only my SSH key allowed to login\n- Run geth and validator software out of an encrypted partition\n\nThis sounds good to me, but is there anything else I should do?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9dww7m",
                    "author": "mooremo",
                    "score": 1,
                    "created_utc": 1653086755.0,
                    "response": "The passphrase and validator key that you put on the validator aren't good for anything except validating, they can't be used to withdraw funds.\n\nKeep the seed phrase that you used to generate the keys safe offline, that's what you need to withdraw. \n\nDon't overcomplicate your setup. That's how you take unnecessary downtime.\n\nDon't try to have it automatically fail over to a second ready to go machine, that's how you get slashed.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}