{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "p78pe9",
            "title": "The Mod that recently tried to call Ethereum a centralized pile of garbage Ponzi Scheme banned me from r/Bitcoin a few months ago for calling out his pitiful attempts to compare the energy consumption of the worlds banking system to Bitcoin.",
            "url": "https://www.reddit.com/gallery/p78pe9",
            "author": "theguywhoisright",
            "created_utc": 1629351136.0,
            "score": 234,
            "num_comments": 59,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "h9iswqy",
                    "author": "MDWSmusicpls",
                    "score": 8,
                    "created_utc": 1629373812.0,
                    "response": "Why do Botcoiners still claim Ethereum is a shitcoin?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h9lpqwh",
                            "author": "Frosty_Pea",
                            "score": 4,
                            "created_utc": 1629419615.0,
                            "response": "Their scared that ETH will over take its thrown one day.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "h9iyop9",
                            "author": "Symbaaaa",
                            "score": 8,
                            "created_utc": 1629377137.0,
                            "response": "Because they feel as though they missed out on them so shill BTC as the king so they feel less bad about their investment decisions",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "h9j595r",
                            "author": "Trrwwa",
                            "score": -1,
                            "created_utc": 1629380388.0,
                            "response": "Because if Vitalik, Charlie lee, etc. all worked on bitcoin rather than an alt the whole space would be wildly different for the better.  Vitalik split off because he grew impatient with btc development, not because what he wanted to do couldn't be done on btc, it just couldn't be done as easily. Imagine a world where alts didn't exist... where would we be?\n\nThat idealism seeds the discontent.  Then combine that with the fact that 99% of alts are,  without a doubt,  pure scams... \n\nI own alts, and i understand there was no way humans would all work on btc. We have too much ego and greed to be so intensely and loyally collaborative.  But i wish vitalik and all the good devs of actual good alts focused their abilities on btc, 1st layer, 2nd layer, etc. We are still not sure this whole thing is going to work and be accepted.  It would have been nice if we lasted a bit longer as one team before fracturing..",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "h9jru6c",
                                    "author": "szchz",
                                    "score": 6,
                                    "created_utc": 1629389895.0,
                                    "response": "Two ways to vote... one is to voice, the other is to walk. He did both.\n\nI'm for one glad that there are options in a space that is so young, the idea of all staying tied to one way of doing things seems silly when theres a lot of possibilities to explore. \n\nIf you eco-system is successful people will come, and thats whats happened with Ethereum.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "h9kc8d9",
                                            "author": "Trrwwa",
                                            "score": 1,
                                            "created_utc": 1629398342.0,
                                            "response": "But there would still be options... what smart contract peg, what defi, what wallet,  what side chain,  what lightning style network,  etc. The blockchain is just the consensus backbone.  There really isn't a need for an option there.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "h9kfa36",
                                                    "author": "szchz",
                                                    "score": 1,
                                                    "created_utc": 1629399612.0,
                                                    "response": "\n\nSure people may want different trade offs at the level of consensus also.Proof of stake shares some similarities with proof of work but they have different trade offs. People have spoken at length about these differences so I won't rehash them but that's one example where",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "h9kgobi",
                                                            "author": "Trrwwa",
                                                            "score": -2,
                                                            "created_utc": 1629400194.0,
                                                            "response": "Ya, i don't think theres a real need for pos, but that's just me.  Still, you can literally have Pos sidechain on btc. If you want to be like \"i hate btc so much,  it's such an ecological disaster that i want no part of it and need pos\"  fine. You are wrong,  but fine, another consensus chain would be necessary. \n\nLook.  Empty your biases. Btc, the world,  etc would be better off if everyone in crypto worked on the same chain. The argument against that is weak.  Now,  dont get me wrong,  i have published articles about alt coins being beneficial to the ecosystem etc, and some are; they innovate, they push the space forward,  they provide a safety in case btc is coopted (maybe),  etc. But i still wish deep down that people were good enough for them to not exist.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "h9mrjwh",
                                                                    "author": "szchz",
                                                                    "score": 1,
                                                                    "created_utc": 1629440592.0,
                                                                    "response": "I'll leave you with this from the horses mouth:\n\n[https://www.reddit.com/r/ethereum/comments/p7kmto/vitalik\\_buterin\\_says\\_hes\\_skeptical\\_of\\_jack/](https://www.reddit.com/r/ethereum/comments/p7kmto/vitalik_buterin_says_hes_skeptical_of_jack/)\n\n\"this is the whole reason ethereum started as an independent system in the first place, there are technical limits to your ability to graft new functionality onto a system thats not powerful enough to support that functionality\"\n\nIt sounds like the trade off wasn't worth it. I hope in the long-term our experience of the crypto world becomes seamless and experientially feels as if it's one chain but for now we have to vote with our wallets, and developers with their time and energy.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "h9n8a2o",
                                                                            "author": "Trrwwa",
                                                                            "score": 1,
                                                                            "created_utc": 1629454834.0,
                                                                            "response": "The technical limits he refers to,  to my knowledge based on his previous work, are in regards to the trust model... he thinks defi on bitcoin will be less decentralized than defi on eth. The flip side of that argument is,  btc base layer is more decentralized than eth, primarily due to the existing complexity of eth which gives it native smart contract functionality but also bloats the main chain reducing node count, increasing initial sync etc. Some people argue that functionally those things don't matter, eth is decentralized despite being built on low full node count.. that's mostly accurate.  That same argument applies to defi on btc. The trust model may be weaker, but functionally it will prove to not matter. Is there a functional difference between the federated model and what eth base layer is today? Not really... and thats ok. Eth still works. Rootstock probably will too",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "h9i1z2e",
                    "author": "DeathThroesBass",
                    "score": 55,
                    "created_utc": 1629352186.0,
                    "response": "Maxi fuck boi hates facts",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h9i830t",
                            "author": "Hanzburger",
                            "score": 10,
                            "created_utc": 1629356972.0,
                            "response": "Maxi fuck bois *HATE* facts...click here to find out why!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "h9j9fmv",
                    "author": "Brief-Music-5825",
                    "score": 6,
                    "created_utc": 1629382268.0,
                    "response": "The Maxi Fu…k also banned me 🤡 just for saying that there was future for both BTC and ETH. Maxis are the talibán of crypto. Radical assholes",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h9iv52w",
                    "author": "Old_World9768",
                    "score": 15,
                    "created_utc": 1629375163.0,
                    "response": "I consume much less electricity than NYC subway.\n\nIf you do a lot of things, you expend a lot of energy. If you do almost nothing, you won't expend almost no energy.\n\nObvious",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h9iphgd",
                    "author": "lordytoo",
                    "score": 12,
                    "created_utc": 1629371539.0,
                    "response": "he banned me today from that sub! hurray",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h9i3tx3",
                    "author": "Wunschkonzert",
                    "score": 35,
                    "created_utc": 1629353574.0,
                    "response": "The Banking System is used by 6 billion people. How many people use Bitcoin again? Stop making false camparisons.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h9i5i83",
                            "author": "Perleflamme",
                            "score": 9,
                            "created_utc": 1629354880.0,
                            "response": "Well, to be fair, the quantity of energy used by Bitcoin is for security, not for the number of transactions. \n\nThe simplest solution to increase the number of transactions would be to increase the block size or reduce the time target. It wouldn't increase difficulty or electricity consumption. But it would decrease decentralization.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "h9mlhxr",
                                    "author": "dopef123",
                                    "score": 1,
                                    "created_utc": 1629436220.0,
                                    "response": "Security on the Blockchain is based on the energy it would take to attack it. If mining is poorly distributed then it doesn't really matter how big the network is.\n\nAnother issue is that energy consumption will scale with price. Bitcoin can suck up pretty much infinite energy.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "h9icb0b",
                                    "author": "dsmlegend",
                                    "score": -8,
                                    "created_utc": 1629360574.0,
                                    "response": "I don't think it's for security. I think it's just an accidental product of economic incentives. Bitcoin block rewards 6.25 BTC. This justifies and bankrolls a dollar-equivalent in electricity expenditure (a pretty hefty electricity bill considering 144 blocks per day). Miners are in competition so they will maximise their efforts and squeeze the profit margin as far as possible until cost approaches reward.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "h9ie0lp",
                                            "author": "Perleflamme",
                                            "score": 13,
                                            "created_utc": 1629362065.0,
                                            "response": "It is for security: there is a target difficulty depending on the current hash rate of miners. If the target difficulty was lowered, miners would spend less in electricity because it wouldn't be as profitable anymore. You have the good premise, it's just that you didn't bring it to the end of the reasoning. \n\nMiners mine to ensure that one person bringing 51% of the hash rate is way too expensive. That's why the Bitcoin network doesn't want to lower the target difficulty. In a sense, the network locked itself into a mechanism of high security and high expenditures. And this will worsen as BTC's price will increase.\n\nThe weird part is that BTC's security is way higher than it was in its beginning. At some point, I would have believed the network would have wondered how much is too much. But I guess now they're simply too afraid of change itself. They have to much and don't want to lose it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "h9igf3r",
                                                    "author": "dsmlegend",
                                                    "score": -3,
                                                    "created_utc": 1629364202.0,
                                                    "response": "No, I believe the target difficulty is set to preserve blockchain consensus and avoid reorgs by targeting 10 minute block time. What do you think the quantity of energy used would be if the block reward were zero? I see what you are saying - that the protocol creates an energy-constraint to limit block production, but this is not the root cause for the energy consumption. You have to ask about the incentive that drives it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "h9ika20",
                                                            "author": "Perleflamme",
                                                            "score": 6,
                                                            "created_utc": 1629367520.0,
                                                            "response": "Well, the incentive is part of the system, technically. So, yes, you could say it's because of the incentive. It's a matter of considering what can be changed by the system. Incentives themselves can't be changed (unless if you consider changing the nature of the incentive, but that would mean replacing PoW and I'm pretty sure the Bitcoin network isn't ready for that). And I agree that reorg also is part of the threats, but uncle management isn't something new or impossible. It can't be a reason in itself. \n\nIf the block reward were 0, mining would entirely depend on fees and would need high enough and stable enough fees to justify mining. In practice, that's what awaits BTC long term.\n\nI see what you mean: mining would then be done by less people with less mining rigs, which would reduce global consumption. You're right, I think. \n\nThat said, the system requires enough electricity to be consumed to guarantee no one can attack it with 51% of the hashrates. Whatever they do, they'll have to find a way to keep costs high. What PoS does with scarcity of owned resources, PoW does with scarcity of consumed resources and needs enough of such resources consumed to be secured and have value.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "h9ioqr7",
                                            "author": "n8dahwgg",
                                            "score": 3,
                                            "created_utc": 1629371007.0,
                                            "response": "No it's for security lol",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "h9lxnea",
                                                    "author": "dsmlegend",
                                                    "score": 0,
                                                    "created_utc": 1629423316.0,
                                                    "response": "Oh my, r/ethereum bois are sour. So many downvotes and I'm not even wrong. Back to r/monero I go for sanity. \n\nYou better hope it's not for security because the next halving is going to seriously cut down on the electricity subsidy.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "h9m2zg9",
                                                            "author": "n8dahwgg",
                                                            "score": 1,
                                                            "created_utc": 1629425882.0,
                                                            "response": "Your description was textbook. Somehow you came to the wrong conclusion. That's fine though. This will play out.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "h9ilc8l",
                            "author": "intergalatiic",
                            "score": 2,
                            "created_utc": 1629368395.0,
                            "response": "Found the shitcoiner s/",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "h9i7adf",
                            "author": "theguywhoisright",
                            "score": 5,
                            "created_utc": 1629356320.0,
                            "response": "Yep, exactly why I called him out, and then ban, lol",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "h9jaex9",
                            "author": "robsumtimes",
                            "score": 1,
                            "created_utc": 1629382694.0,
                            "response": "Exactly, how many bc are there now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "h9ii9mj",
                    "author": "AdNo9347",
                    "score": 3,
                    "created_utc": 1629365830.0,
                    "response": "Username checks out...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h9i30rt",
                    "author": "N7DJN8939SWK3",
                    "score": 2,
                    "created_utc": 1629352963.0,
                    "response": "We could cut back on both mining, and shit in the banking system. Oh and the NYT should stop printing the Sunday paper",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h9j4vuj",
                    "author": "Seebeedeee",
                    "score": 2,
                    "created_utc": 1629380213.0,
                    "response": "Bitcoin mining has buildings and people too",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h9jnkvy",
                    "author": "politicsareshit",
                    "score": 2,
                    "created_utc": 1629388174.0,
                    "response": "They can coexist....BTC,eth,ada,link,etc. They'll keep pushing eachother to be better and innovate (as a free market should)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h9k790l",
                    "author": "Randolph-",
                    "score": 2,
                    "created_utc": 1629396242.0,
                    "response": "Oof. Truly sad. I knew he was talking crap. Trying really hard to make it sound legit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h9kijca",
                    "author": "SurpriseUnhappy2706",
                    "score": 2,
                    "created_utc": 1629400961.0,
                    "response": "The sorry pos just permanently banned me today from r/ Bitcoin for calling him out on the same type post. All I said was that he was shilling for Bitcoin with his negative eth posts to keep eth from dragging his bag down. Fuck him.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h9kleir",
                    "author": "blindato1",
                    "score": 2,
                    "created_utc": 1629402134.0,
                    "response": "Bitcoin sub is a pile of garbage. Most specific subs for coins are.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h9j69tb",
                    "author": "dmiddy",
                    "score": 4,
                    "created_utc": 1629380857.0,
                    "response": "OP: Goes into coin specific subreddit seemingly with the goal of talking shit about the coin.  \n\nOP: \\*gets banned\\*  \n\nOP: surprised pikachu",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h9jjr3j",
                            "author": "theguywhoisright",
                            "score": 4,
                            "created_utc": 1629386620.0,
                            "response": "Not what happened. Calling out misinformation isn’t talking shit. I own Bitcoin, but comparing uncorrelated things for clout just makes the industry weaker.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "h9i8tx7",
                    "author": "FluffyGlass",
                    "score": -14,
                    "created_utc": 1629357591.0,
                    "response": "Bitcoin energy consumption should be compared to the energy consumed by fiat system, not banking per se. And yes, Butherium is centralized garbage.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h9iyr1b",
                            "author": "Symbaaaa",
                            "score": 3,
                            "created_utc": 1629377170.0,
                            "response": "Please tell me how you reached the conclusion that ETH is centralized.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "h9jaobj",
                    "author": "robsumtimes",
                    "score": 1,
                    "created_utc": 1629382804.0,
                    "response": "Not to get of the subject bu I just heard on the news that Dorsey will now start mining bc. I'm sure that will be on the up n up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h9l1lpd",
                    "author": "Get_dat_bread69",
                    "score": 1,
                    "created_utc": 1629408707.0,
                    "response": "Bashco is the worst",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h9l9k49",
                    "author": "peterjoel",
                    "score": 1,
                    "created_utc": 1629412110.0,
                    "response": "Do you have links to the posts in question, so we can judge for ourselves?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h9ljct8",
                            "author": "theguywhoisright",
                            "score": 1,
                            "created_utc": 1629416614.0,
                            "response": "The article about Bitcoin vs world banking? It’s a shit article that tries to correlate energy usage NOW with Bitcoin to the banking system NOW. The world banking system operates with more than 3 billion users, Bitcoin is a TINY fraction of that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "h9lrxbo",
                                    "author": "peterjoel",
                                    "score": 1,
                                    "created_utc": 1629420630.0,
                                    "response": "I mean the posts on r/bitcoin that got you banned.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "h9lwmqi",
                                            "author": "theguywhoisright",
                                            "score": 1,
                                            "created_utc": 1629422828.0,
                                            "response": "It’s in the post I just made, there’s 3 pictures",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "h9lxsxp",
                                                    "author": "peterjoel",
                                                    "score": 2,
                                                    "created_utc": 1629423391.0,
                                                    "response": "Oh right. They didn't load the first time, until I reloaded. I see them now.\n\nThis kinf of stuff has been going on in r/bitcoin for years. You haven't lost anything by being banned. The sad part is that newcomers to crypto will go there as their first port of call and get fed misinformation, not knowing any better.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "h9meepx",
                                                            "author": "theguywhoisright",
                                                            "score": 1,
                                                            "created_utc": 1629431893.0,
                                                            "response": "So true.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "h9mtxql",
                    "author": "DeviateFish_",
                    "score": 1,
                    "created_utc": 1629442487.0,
                    "response": "I dunno, kinda looks like you deserved that ban.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h9ncwld",
                            "author": "theguywhoisright",
                            "score": 0,
                            "created_utc": 1629458267.0,
                            "response": "For saying he looked stupid, for making stupid posts? Would an ETH mod ban me for the same? Comparing energy consumption to the worlds banking system RIGHT NOW is just foolish.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "h9ombun",
                                    "author": "DeviateFish_",
                                    "score": 1,
                                    "created_utc": 1629478969.0,
                                    "response": "Yes, actually, they would.\n\n> **No inappropriate behavior**. This includes, but is not limited to: **personal attacks**, threats of violence, gossip, slurs of any kind, posting people's private information.\n\nIt's right there in the first rule.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "h9qlxze",
                                            "author": "theguywhoisright",
                                            "score": 0,
                                            "created_utc": 1629510185.0,
                                            "response": "An attack is calling someone something did stupid? Get off it",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "h9rj807",
                                                    "author": "DeviateFish_",
                                                    "score": 1,
                                                    "created_utc": 1629530476.0,
                                                    "response": "You did just a *tiny* bit more than call something someone did stupid :P",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "h9icgf9",
                    "author": "dsmlegend",
                    "score": -8,
                    "created_utc": 1629360703.0,
                    "response": "Bitcoin's energy consumption is a totally unnecessary function of the token distribution model and market price.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "55m04x",
            "title": "Let's run on-chain decentralized exchanges the way we run prediction markets",
            "url": "https://www.reddit.com/r/ethereum/comments/55m04x/lets_run_onchain_decentralized_exchanges_the_way/",
            "author": "vbuterin",
            "created_utc": 1475467445.0,
            "score": 194,
            "num_comments": 24,
            "subreddit": "ethereum",
            "selftext": "Alongside some of the other [recent paradigms](http://block.auction/) for decentralized exchanges that we have seen emerge, I thought that I would offer a third alternative. This borrows some ideas from [Nick Johnson's proposal here](https://www.reddit.com/r/ethereum/comments/54l32y/euler_the_simplest_exchange_and_currency/), albeit with many simplifications, and is also very similar to how prediction markets like those in gnosis and augur operate already. \n\nThe main challenge that I see with the MKR market, etherdelta and other markets right now is the high spreads, often 10% or even higher. A large part of this is that market making is very expensive, as creating an order and removing an order both take gas fees, even if the orders are never \"finalized\". State channel-based solutions could theoretically resolve this, but are far from being implemented. My proposed solution is to use the style of \"on-chain automated market maker\" used in prediction markets in a decentralized exchange context.\n\nThe mechanism would look something like this. The market contains an internal state, `PRICE`, which is the current market price. It would also have two parameters, `FEE`, and `DEPTH`. If a user wants to buy `ORDER_AMOUNT` coins, they would raise the price to `PRICE + ORDER_AMOUNT / DEPTH`, and pay `ORDER_AMOUNT * (PRICE + ORDER_AMOUNT / DEPTH / 2) * (1 + FEE)`. Essentially, this constitutes buying an infinitesimal number of coins at every price point between the old price and the new price.\n\nNote that this is not risk-free to set up: it requires an initial deposit of both coins and ETH, and if the price jumps around too quickly it could get exploited. One way to reduce the risk is to put orders into a queue for X blocks and while an order is in the queue other users could \"snap up\" the order, offering to pay a more favorable rate than the original offeror; however, this has complexities of its own and could be left to a later version.\n\nUsers have the ability to \"invest\" in the market. Investing and divesting are proportional: for example, if the market currently contains 2000 ETH and 400 tokens, then an investor would need to provide 2000 * p ETH and 400 * p tokens, which would increase `DEPTH` by a factor of 1 + p and give the investor a `1 / (1 + p)` \"share of the market\". When the investor wants to divest, they are entitled to take out a `1 / (1 + p)` share of whatever ETH and tokens are in the market out at that time (perhaps with a few-hour delay to prevent divesting itself from being subject to front-running during crashes). The theory is that in most cases, the fees collected will be larger than any losses from front-running attacks against the market maker, and the specific mathematical structure of the market maker ensures that risk of loss, while present, is strictly bounded, and in any case investors are the party that will bear the risk.\n\nOne concern of the above scheme as given is that the market would have to have a \"maximum price\" after which it runs out of tokens to sell. One solution is that at some point (eg. when `PRICE` is more than half the maximum price) instead of increasing `DEPTH`, the market simply keeps the depth the same and holds the tokens so as to increase the maximum price that the market can sell at. The market may even choose to _decrease_ depth automatically. One stronger solution is to make depth itself proportional to `1 / PRICE`, and change the formulas accordingly, but this leads to the opposite problem if the price goes too low; hence, some kind of dynamic balancing is going to be necessary in any case.\n\nThe advantage of this scheme from an efficiency perspective is that it offers very low spreads, but at the same time only requires a blockchain transaction for actual trades, not placing or cancelling orders. The design is also relatively simple to understand and implement.\n\n**Edit**: for those looking at this thread in the future, I thought I would add a simplification suggested by Martin Koppelmann. The mechanism would be a smart contract that holds A tokens of type T1, and B tokens of type T2, and maintains the invariant that A * B = k for some constant k (in the version where people can invest, k can change, but only during investment/withdrawal transactions, NOT trades). Anyone can buy or sell by selecting a new point on the xy=k curve, and supplying the missing A tokens and in exchange receiving the extra B tokens (or vice versa). The \"marginal price\" is simply the implicit derivative of the curve xy=k, or y/x.",
            "stickied": false,
            "comments": [
                {
                    "id": "hqvt8ji",
                    "author": "dragondude4",
                    "score": 13,
                    "created_utc": 1641089746.0,
                    "response": "This post led to the creation of a $169B industry. Legendary.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hqw7em9",
                            "author": "sanesame",
                            "score": 5,
                            "created_utc": 1641096297.0,
                            "response": "Insanity.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqww37x",
                                    "author": "Tjaaark",
                                    "score": 3,
                                    "created_utc": 1641111228.0,
                                    "response": "pretty sane",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i4ngsnr",
                            "author": "Kno010",
                            "score": 2,
                            "created_utc": 1649903570.0,
                            "response": "I’m amazed this historical post has gotten so little attention. Basically no comments.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i6ihmwy",
                                    "author": "magnushansson",
                                    "score": 2,
                                    "created_utc": 1651137891.0,
                                    "response": "Yes I agree, I found it referenced from [this](https://ethresear.ch/t/improving-front-running-resistance-of-x-y-k-market-makers/1281) post.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i6mg60i",
                                    "author": "NachoCheeseburger",
                                    "score": 2,
                                    "created_utc": 1651203212.0,
                                    "response": "Here from /r/ethfinance and commenting for history. Love you all",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hx6u0vz",
                            "author": "hidup_sihat",
                            "score": 1,
                            "created_utc": 1645028723.0,
                            "response": "Which industry is that? Sorry for my new question",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hx9c6qx",
                                    "author": "dragondude4",
                                    "score": 2,
                                    "created_utc": 1645065600.0,
                                    "response": "DeFi",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "d8bw7iw",
                    "author": "Dunning_Krugerrands",
                    "score": 26,
                    "created_utc": 1475483106.0,
                    "response": "Designing an automated market maker that can't be exploited is probably fairly hard and also wouldn't add that much liquidity in terms of depth/slippage rather than time. How about just decentralised [Gemini style](https://gemini.com/marketplace/) daily two sided auctions rather than continuous trading. ",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "d8c9b7z",
                            "author": "MrNebbiolo",
                            "score": 2,
                            "created_utc": 1475511212.0,
                            "response": "I also think this concept deserves more attention. The auction could even be hourly. ",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ddqaxxi",
                    "author": "Eyul",
                    "score": 5,
                    "created_utc": 1487079914.0,
                    "response": "We've been working on a solution for these challenges in the last few months and released the whitepaper yesterday. We named it \"Bancor Protocol\". I believe it addresses most if not all the issued raised here as well as offer additional utility.\n\nThe solution is based on user-created \"Bancor-enabled tokens\" (BETs) which hold other standard ethereum tokens (reserves), with a user-defined \"Constant Reserve Ratio\" (CRR) for each of the held reserves in a specific BET. BETs autonomously issue themselves in exchange for reserve tokens, and transfer reserve tokens to holders destroying BETs. The price is calculated continuously according to the CRR and the reserve balance, so the market-cap of a token with a 10% CRR in ETH would be its [ETH balance] / [ETH CRR]. \n\nA token with multiple reserves calculates its own market-cap, in each of its reserves. When the calculated market-caps are not equal in value (i.e. do not match the external market-prices) an incentive to arbitrage and realigned them is created. \n\nBETs holding multiple reserves totaling 100% CRR would function as decentralized ETF, while BETs with less than 100% CRR function as new currencies, creating new credit gradually as they grow, and are intrinsically liquid.\n\nWe would be happy to get any feedback and comments on the first draft of the whitepaper. \n\n[Bancor Protocol Whitepaper](https://goo.gl/1WNx2l)\n\nhttps://www.bancor.network",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "d8bs5f2",
                    "author": "Hhbhf",
                    "score": 9,
                    "created_utc": 1475471286.0,
                    "response": "I think automated market makers are great and yes - they should be used for tokens beyond tokens on prediction markets. However- everybody should be aware of the limitations. They are good for price discvovery but for actual trading too capital inefficient. So such a market place would in my opinion mainly be a price feed oracle - but that is a good start!\n\nRead more here: https://forum.gnosis.pm/t/market-maker-order-book/19/6",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "d8bs9hz",
                            "author": "vbuterin",
                            "score": 12,
                            "created_utc": 1475471547.0,
                            "response": "I think a hybrid scheme could work well. There are also other forms of participation that we can introduce; for example I can imagine offering the ability to invest in only the buy side of a market maker (so a whale looking to buy $1m could just invest in a really huge buy-side depth that others could sell into), or to make an order at `PRICE + X`, where `X` is set by the orderor and constant and `PRICE` is market state and moves around.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "d8bwzpb",
                    "author": "spacedv",
                    "score": 6,
                    "created_utc": 1475486100.0,
                    "response": "One problem with this is that traders and speculators who want to be only (or mostly) on either the buy side or sell side at the current price level are better off using a traditional style exchange. It's also a bit weird that after someone does a market buy order, a new investor will put in less of the token that was sold and more of the token that it was bought with. Getting close to running out of tokens on either side is a big risk like this.\n\nTo fix these issues, I think it would be good to have separate depth for both buy side and sell side, and ability to invest to either side separately or to both in whatever proportions. When someone does a market order to buy `x` percent of the tokens `A` in the system for token `B`, the depth on the sell side would decrease by `x` percent and increase similarly on the buy side. Also anyone who had a share `Ps` of the sell side and 0 of the buy side before that market order would continue having the same share of the sell side (with now less depth), and now have share `Ps*y/(1+y)` of the buy side (with increased depth), where `y` is the percent of increase of tokens `B` in the system. Any fees should be added to the sell side depth.\n\nDoing it this way should make it more interesting for traders and speculators to participate if they lean even slightly to either the bullish or bearish side. Another benefit is increasing incentive to invest on the sell side and decreasing incentive to withdraw your investment from it when the price increases, and vice versa for the buy side. This would help with keeping the sides balanced.\n\nI have to admit I was lazy and didn't do the math on whether that actually works without exploit possibilities, but if it does, it would make sense to do it like this right? It could more closely mimic normal exchanges I think. Maybe some of you folks with ultra high IQ here can instantly see that this doesn't work lol...\n\nEDIT: in the first paragraph, `Ps*y/(1+y)` instead of `y/(1+y)`.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "d8cupk2",
                    "author": "olliey",
                    "score": 4,
                    "created_utc": 1475539190.0,
                    "response": "I don't understand why there is no functioning decentralised exchange on ethereum. The Counterparty one is really cool. And lots of things have been popping up because of it. ",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "delzcbq",
                            "author": "frenchhoudini",
                            "score": 1,
                            "created_utc": 1488872265.0,
                            "response": "[EtherDelta](https://etherdelta.github.io) is a functioning decentralized exchange on Ethereum with 600+ users.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "d8btgux",
                    "author": "jrkirby",
                    "score": 3,
                    "created_utc": 1475474429.0,
                    "response": "Don't make divesting delayed, make it a drawn out process. Instead of giving people their share of the market say, 6 hours, after they request it, give then the average of what their share is worth over the course of those 6 hours.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "d8bzk1c",
                    "author": "polayo",
                    "score": 1,
                    "created_utc": 1475495013.0,
                    "response": "I believe a good approach would be to escrow the funds in a smart contract upon order execution in a  centralized exchange, so the funds are not at risk. ",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}