{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v07xlp",
            "title": "could anyone have created an NFT of Jack dorseys first tweet?",
            "url": "https://www.reddit.com/r/ethereum/comments/v07xlp/could_anyone_have_created_an_nft_of_jack_dorseys/",
            "author": "horsey-the-blue",
            "created_utc": 1653818093.0,
            "score": 33,
            "num_comments": 53,
            "subreddit": "ethereum",
            "selftext": "Jack Dorsey created an NFT of his first tweet and sold it for $2.9m (it's worthless now). My question is, since an NFT is just a url, couldn't anyone have minted this NFT or does it have to be the owner?\n\nIs it possible for another NFT to be created using the same url using the same or different blockchain. If this is the case, and you can literally create the same NFT, why would it be worth anything?",
            "stickied": false,
            "comments": [
                {
                    "id": "iafkygo",
                    "author": "t-han72",
                    "score": 24,
                    "created_utc": 1653835876.0,
                    "response": "Anyone COULD have done it yes. Since Jack did it, it got a ton of attention and he made it into a charity event. If we did it, it would just be two (probably) nobodys uploading data to the blockchain. Anyone else can recreate that but anyone else can’t recreate Jack’s mint",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagwv5t",
                            "author": "Disastrous-Big8848",
                            "score": 2,
                            "created_utc": 1653857957.0,
                            "response": "Speak those facts",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaey8o1",
                    "author": "PrawnTyas",
                    "score": 70,
                    "created_utc": 1653822751.0,
                    "response": "Something a lot of people miss about the whole NFT tweet thing is that it was for charity. Jack donated the money from the sale. Nobody actually thinks buying a tweet is a valid reason for NFT’s to exist.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaf9hjm",
                            "author": "Fizzifish",
                            "score": 27,
                            "created_utc": 1653830171.0,
                            "response": "Tell that to the person who bought the tweet and spectacularly failed to sell it at higher price. And acted like he didn’t want to sell after that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iafcodx",
                                    "author": "PrawnTyas",
                                    "score": 0,
                                    "created_utc": 1653831842.0,
                                    "response": "No need, he already knew when he bought it. \n\nhttps://twitter.com/jack/status/1369326373035245581?s=21&t=hNQSgmbn6UplXI79hPmZ_Q",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iahk6yp",
                            "author": "Gimme_tacos79",
                            "score": 3,
                            "created_utc": 1653869904.0,
                            "response": "That's not the point of the question asked. If I took a snap of his first tweet, could I have sold it as the first tweet?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iagezzt",
                    "author": "CrimbusIsOver",
                    "score": 3,
                    "created_utc": 1653849474.0,
                    "response": "Half of these comments are a literal South Park episode.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafy0l0",
                    "author": "iLuvRachetPussy",
                    "score": 3,
                    "created_utc": 1653841703.0,
                    "response": "You can make an NFT of anything you want. Good luck getting someone to buy it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagkbwb",
                    "author": "osogordo",
                    "score": 3,
                    "created_utc": 1653851960.0,
                    "response": "It's more about who minted it instead of what was minted that makes it interesting/desirable.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagm2ac",
                    "author": "falldownreddithole",
                    "score": 3,
                    "created_utc": 1653852774.0,
                    "response": "The answer is \"yes\". Anyone could have turned it into an NFT. Anyone can turn any digital content into an NFT.\n\nThe follow-up question you must be asking yourself then is: \"Then what is the value of the NFT if anyone can create it?\"\n\nAnd you're not wrong to ask.\n\nThe answer is as simple as it is complex: Authorship and chain of ownership. An NFT emitted by Jack Dorsey himself (or an organisation he would lend credence to) is worth something for the mere fact that it has a social connection at is basis - the endorsement / identity of the emittent.\n\nWhy this fact makes a massive difference is lost on many people. Why this fact should not be worth an infinite amount is lost on the rest. The truth lies somewhere in between.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaet95q",
                    "author": "Perleflamme",
                    "score": 13,
                    "created_utc": 1653818423.0,
                    "response": "It's worth just as much as anyone else is ready to pay for. That said, the value is different simply by being created by someone else. Or being created at another point in time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaeusq5",
                            "author": "ColdFusion3456",
                            "score": 6,
                            "created_utc": 1653819789.0,
                            "response": "I don’t know. I think the market is becoming diluted. Just like the ERC-20 token bubble in 2017. Everybody and their fucking grandma making tokens and now it’s just NFTs. Many will sell high initially for hype but I can guarantee many will plummet in value if not become worthless",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaevyrn",
                                    "author": "Perleflamme",
                                    "score": 6,
                                    "created_utc": 1653820840.0,
                                    "response": "I agree, for sure, many will plummet, mostly because of the lack of a service. But some do deliver a service, notably the access to a community.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iagepb4",
                                    "author": "CrimbusIsOver",
                                    "score": 1,
                                    "created_utc": 1653849332.0,
                                    "response": "They're literally worthless to begin with.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iaetn9t",
                            "author": "horsey-the-blue",
                            "score": 2,
                            "created_utc": 1653818768.0,
                            "response": "So it's only worth something if the real owner also vouches for it?\n\nWhy even need a blockchain if you need something tangible like the owners approval outside of the blockchain for it to have value.\n\nJack Dorsey might as well write an IOU on a piece of paper.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaf3esg",
                                    "author": "eastsideski",
                                    "score": 13,
                                    "created_utc": 1653826545.0,
                                    "response": "> Jack Dorsey might as well write an IOU on a piece of paper.\n\nWe already have this, it's called an autograph\n\nA book autographed by the author is worth more than the normal book, and a tweet nft minted by the author is worth more than one minted by a random person",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iaeuvgc",
                                    "author": "Perleflamme",
                                    "score": 6,
                                    "created_utc": 1653819857.0,
                                    "response": ">So it's only worth something if the real owner also vouches for it? \n\nThat's not what I said. Maybe it's worth something *to you* only if the \"real owner\" also vouches for it. It doesn't say anything about what it's worth to anyone else. \n\nThe value being different doesn't equal being worthless. \n\n>Jack Dorsey might as well write an IOU on a piece of paper. \n\nAn IOU is easy to forge.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iagn0zn",
                                            "author": "morose_turtle",
                                            "score": 1,
                                            "created_utc": 1653853223.0,
                                            "response": "About as easy as a NFT😅",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iagqgxq",
                                                    "author": "Perleflamme",
                                                    "score": 2,
                                                    "created_utc": 1653854842.0,
                                                    "response": "Hum, no, an NFT can't be forged, just like any other token. It's its own proof. Try to forge an ETH or any ERC. You'll see it's very easy for anyone to check the contract is the one it's supposed to be. All you need is checking the contract address. \n\nYou can forge gold and you can forge banknotes: both require special expertise and sometimes even equipment to detect forgery. \n\nYou can't forge a token: anyone can check two strings are identical.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iafy5fq",
                    "author": "cip43r",
                    "score": 4,
                    "created_utc": 1653841764.0,
                    "response": "NFTs are connected to the URI and the creator address. No other NFT will jave the URI and Jack's address as the creator. Thus, it is not the original. It's like you selling my car to someone, but you aren't the owner. You can run away with the money, and the person can come and ask for my car. But I can just tell them, it wasn't yours to sell.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagh8b1",
                            "author": "sos755",
                            "score": 2,
                            "created_utc": 1653850513.0,
                            "response": "\"original\" is a poor choice of words because it is ambiguous.\n\n* Every NFT is \"original\" by definition.\n* Even an \"original\" digital asset is typically just a copy of the \"original\" de to the nature of information, computers, and the internet.\n* Suppose someone else made an NFT with Jack's tweet before Jack. Wouldn't theirs be the \"original\"?\n\nYour ownership example is flawed. If I (or Jack) sells you an NFT, you are the owner of the NFT. You are not necessarily the owner of the asset associated with the NFT. If I sell you an NFT using Jack's tweet, you are still the owner of the NFT regardless of who owns the tweet.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iagp60c",
                                    "author": "pipsforthepoor",
                                    "score": 1,
                                    "created_utc": 1653854231.0,
                                    "response": "Ok well you missed the point I guess.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iagp3ql",
                            "author": "pipsforthepoor",
                            "score": 0,
                            "created_utc": 1653854201.0,
                            "response": "You’re the only one who is bringing up the tea point of nfts. It’s not an image, it’s not a url, it’s not the metadata. It’s the provenance of the thing. It’s an original, created by jacks team.\n\nAnyone could make a bored ape, but it’s not a REAL bored ape authenticated by the blockchain. Tbh this is one of the best ideas in blockchain, nfts.\n\nProvable originality. Kind of groundbreaking.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafdava",
                    "author": "Ncookiez",
                    "score": 6,
                    "created_utc": 1653832161.0,
                    "response": "Obligatory \"an NFT is not just a URL\", the URL is one piece of any NFTs metadata.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafzsua",
                    "author": "masssy",
                    "score": 3,
                    "created_utc": 1653842504.0,
                    "response": "Yes anyone could make it just like anyone could print Mona Lisa off their $100 laserjet. Doesn't make the copy worth billions though.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagfdt3",
                            "author": "W944",
                            "score": 4,
                            "created_utc": 1653849650.0,
                            "response": "That’s the problem, how do you prove an NFT is the original? You can’t. Not without some external centralized source outside the blockchain itself that gives you the answer (think opensea)\n\nRead this for more: https://blog.blockmagnates.com/the-stolen-ape-yacht-club-and-web3s-unspoken-fatal-flaw-213baf902c1b",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iagmdsk",
                                    "author": "falldownreddithole",
                                    "score": 2,
                                    "created_utc": 1653852923.0,
                                    "response": ">That’s the problem, how do you prove an NFT is the original? You can’t. Not without some external centralized source outside the blockchain itself that gives you the answer (think opensea)\n\nYou can always check yourself by following the chain of ownership. Which is saved immutably on the blockchain.\n\nThe central source only does it for you, making it much more convenient to check it. But if you distrust the central source you can check yourself at any time.\n\nThat's a massive difference.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iah4g5z",
                                    "author": "Ruzhyo04",
                                    "score": 1,
                                    "created_utc": 1653861699.0,
                                    "response": "Token address and data lives on chain, not on Opensea servers lol",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iagkdek",
                    "author": "renec112",
                    "score": 2,
                    "created_utc": 1653851979.0,
                    "response": "Yes they could. I could probably also write an autograph pretty close to Jack Dorsey's with all.e practice.. But it would be worthless since everyone knew I made the autograph",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagn72l",
                    "author": "PIGA_Strategies",
                    "score": 2,
                    "created_utc": 1653853298.0,
                    "response": "My hypothesis is that yes, anyone could have minted an NFT of a publicly available tweet. However, the “collectibles” market (which this would fall into) would likely want an authentic tweet (I.e. the tweet is minted by the account owner). Non authentic NFT-tweets would affect pricing and marketability of the NFT. Ensuring authentication would require some form of KYC layered into the minter’s wallet to prove it is associated with the Twitter account owner. There’s likely a market opportunity to build something that connects the KYC details for people to layer-1s so L1s can connect to something functioning as an “identity oracle” such that they can confirm identity of wallet owners without actually knowing or possessing any personally identifying information (e.g. a zero knowledge proof)\n\nThen there is the issue of IP rights and whether minting another person’s tweets violates copyright. And who owns a tweet’s IP? Twitter or the account owner?\n\nYou are correct about being able to mint any nft on another layer-1. Blockchains are just databases. You can add an entry to the “ledger” on any layer-1 representing a tweet NFT. Who knows how to mitigate that issue but I agree that it makes the idea of NFTs less “scarce” than you’d like to assume.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagtlx0",
                    "author": "ZirJohn",
                    "score": 2,
                    "created_utc": 1653856365.0,
                    "response": "Yes. That is why it is worthless.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagurzq",
                    "author": "Maleficent-Art7366",
                    "score": 2,
                    "created_utc": 1653856935.0,
                    "response": "Add one pixel to it and create a new nft.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaet2p1",
                    "author": "Careless-Childhood66",
                    "score": 2,
                    "created_utc": 1653818261.0,
                    "response": "It's interesting for collectors",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaeumpo",
                            "author": "ColdFusion3456",
                            "score": -7,
                            "created_utc": 1653819638.0,
                            "response": "If the fees weren’t so high I would screenshot it, mint it and give it to you. You’ll be so interesting. Forever unique.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaezgpw",
                                    "author": "SuperCryptoBr0",
                                    "score": 9,
                                    "created_utc": 1653823718.0,
                                    "response": "You can paint a Picasso too but nobody will buy your tweet nor painted Picasso.  Both of the originals will sell though…the value is still subjective  as seen by Jacks NFT tweets massive drop in price from its last sale",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaflp0a",
                    "author": "Boxman212",
                    "score": 1,
                    "created_utc": 1653836211.0,
                    "response": "Yes you can make one right now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafx8yt",
                    "author": "Sevenisalie",
                    "score": 0,
                    "created_utc": 1653841366.0,
                    "response": "I don’t know what’s so hard for you goons to understand about where value is created. \n\nThat nft was sold for charity. Purchased by someone that WANTED TO SPEND THAT MUCH ON CHARITY. That’s where the value was created. \n\nAll value is created by liquidity.  Liquidity is created when a buyer submits an offer to a seller. That buyer is in control of the value they think their offer is worth. The buyer. Not you. Not your mother,  brother, or father. The buyer. \n\nLet’s put this into real world terms. You have no use for a delivery of 20 heads of hog from the chicago cattle auction. You wouldn’t offer $38k for that contract because hogs ain’t worth shit to you. You’re not a hog farmer. \n\nSame concept here. Value is created by the buyer. The buyer decides what it’s worth, not anyone else. You can kick and scream that “omg that nft isn’t worth 2.5M”\n\nBut guess what? It is\n\nBecause a buyer matched up his liquidity to a seller at that price",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafzl8a",
                            "author": "stef171",
                            "score": 4,
                            "created_utc": 1653842410.0,
                            "response": "That was not OPs question..",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iagk0mo",
                    "author": "ahungrylilsandwhich",
                    "score": 1,
                    "created_utc": 1653851814.0,
                    "response": "Yeah anyone could have minted it but it would show your wallet minted it in the contract and people would know it was a fake.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iah51si",
                    "author": "Ruzhyo04",
                    "score": 1,
                    "created_utc": 1653862003.0,
                    "response": "> (it’s worthless now)\n\nBased on what, the fact that the didn’t get a bid to meet reserve during an auction? By that logic if I bid $1 for the Eiffel Tower, it’s only worth $1.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iah75z0",
                    "author": "bosshax",
                    "score": 1,
                    "created_utc": 1653863074.0,
                    "response": "No? It’s all about authenticity.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahc8ms",
                    "author": "hatetheproject",
                    "score": 1,
                    "created_utc": 1653865699.0,
                    "response": "The whole reason the NFT exists is to show “ownership”. No one gives a shit about your URL of jack dorseys first tweet unless you bought it from jack dorsey. i",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahgtje",
                    "author": "towhead",
                    "score": 1,
                    "created_utc": 1653868108.0,
                    "response": "Everyone could and can.  That tweet could have a billion NFTs.  Having one made by Dorsey would theoretically make it more valuable, unless Dorsey decided to just make more.\n\nThis is a silly use of NFTs, probably done for charity since people actually think these might have value someday and why not take advantage of that?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahjrxk",
                    "author": "littlebrushwooddog",
                    "score": 1,
                    "created_utc": 1653869682.0,
                    "response": "NFT is ownership.. not to be confused with the art itself.. an NFT is the underlying right of license, sale & distribution per terms agreed upon with copyright holder.. in some cases the one issuing NFT & the copyright holder are the same party. Pretty insane to see the functions of copyright, licensing, sale & distribution all in one simple little smart contract automatically governing the copyright and its uses.. this is part of the reason I think NFTs are going to flip content monetization on its head.. imagine a music copyright.. now anytime anyone wants to access the copyright it goes across network, knocks on the metaphorical door of the smart contract governing that work and then tells it its different prices for different desired uses.. say in a film, or commercial or maybe just some bar that wants to have that song in heavy rotation.. immediately the copyright is more valuable because it has full visibility into any and all streams/downloads/videos that HAD TO access the smart contract tracks which govern the work.. not to mention complete control of all terms of the contract such as price per play, price per film play, price to drag it into your YouTube or TikTok video real quick.. owners and those who hold smart contracts to distribute the work will almost instantaneously become more valuable than they currently are because funds for their work(s) are being managed with an all seeing eye (the network) and with terms and actual operations carried out by the smart contract from all over the world, IN REAL TIME, and all who want to use said work have to come knock on THE SAME DOOR🚪🤯Let’s talk about immensely increasing the value of content creators and artists of all kinds, everywhere🤙🏼 (also peep why everyone in music industry copyright.. i.e. ASCAP, BMI, SESAC, MLC as well as content streaming leaders like Spotify & TikTok are all millions of dollars invested in blockchain companies and projects at the moment)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag0ry8",
                    "author": "Sorry_Attitude_",
                    "score": 0,
                    "created_utc": 1653842945.0,
                    "response": "I guess anyone could have done it, i mean heck you can go on Angelblock and just take a picture and mint an Nft with their stuff\n\nBut at the same time the jack Dorsey minted one is special because it was by him, he made it and he sold it for charity\n\nlike Angelblock using the nfts as part of their fundraising platform, you can just mint your own but you don't get the benefits\n\nNFts are starting to be something more than pictures finally anyway so thats nice",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagkurc",
                    "author": "Remarkable-Memory-86",
                    "score": 0,
                    "created_utc": 1653852204.0,
                    "response": "Point of NFT is that you could make blockchain proof of ownership over something IRL. Technology was used to make cats in kitty side ETH at first, then for ape side of ETH. I wonder what would be next?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}