{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uytbl6",
            "title": "Vitalik Buterin: How to create algostablecoins that don’t turn into ponzis and don’t collapse",
            "url": "https://medium.com/@unclefibonacci/vitalik-buterin-how-to-create-algostablecoins-that-dont-turn-into-ponzis-and-don-t-collapse-14f8c86906e2",
            "author": "btcxlab",
            "created_utc": 1653638832.0,
            "score": 828,
            "num_comments": 98,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia6g98w",
                    "author": "ideadude",
                    "score": 37,
                    "created_utc": 1653649110.0,
                    "response": "Direct link to Vitalik's blog post: https://vitalik.ca/general/2022/05/25/stable.html",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6asmx",
                    "author": "coinfeeds-bot",
                    "score": 100,
                    "created_utc": 1653644702.0,
                    "response": "tldr; Ethereum co-founder Vitalik Buterin shared two thought experiments on how to evaluate the stability of an algorithmic stablecoin. He suggested that a stablecoin project’s market activity “drops to near zero,” users should be able to extract the fair value of their liquidity from the asset. He also suggested that the project should implement a negative interest rate when it tracks a “basket of assets” that grows at 20%.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaaa3f5",
                            "author": "Minethatcoin",
                            "score": 1,
                            "created_utc": 1653718261.0,
                            "response": "#1 sounds like the current fiat system\n\n#2 Do Kwon is a little sh** \n\n#3 vital ik doesnt need to have an answer to everything \n\n#4",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia6wilr",
                    "author": "ApocryphalVegan",
                    "score": 10,
                    "created_utc": 1653658486.0,
                    "response": "Welp, we might as well pump another algo stable to $30bn market cap and see what happens",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6vvsq",
                    "author": "llort_lemmort",
                    "score": 17,
                    "created_utc": 1653658183.0,
                    "response": "Can someone explain to me how a stablecoin like RAI would handle the following situation?\n\nLet's say there is much higher demand for owning RAI than for borrowing RAI, which is to say people want to buy RAI instead of borrowing RAI against ETH collateral. In this case the price of RAI would go up. If I understand correctly, the protocol would then work against that by making interest rates negative and therefore incentivizing the borrowing of RAI. People would then likely borrow RAI, do nothing with it and collect the negative interest rates, possibly sell them and therefore stabilize the price.\n\nAs long as rates are positive all RAI in existence are borrowed into existence. The protocol can then decrease the supply by increasing the rates and incentivizing people to return their borrowed RAI. But if rates go negative for long enough, RAI are created that are not borrowed.\n\nIf we assume that people would just hold the borrowed RAI in case of negative interest rates, then the rates have to be significantly negative for a significant amount of time in order to create enough coins that are actually sold to balance the price. This means that with enough demand for RAI, over time the majority of the circulating supply would not be borrowed RAI anymore.\n\nWhat happens if now the demand for RAI goes down and interest rates turn positive? The people that held borrowed RAI only to generate more RAI return their RAI to the protocol but now all the additional RAI that was created through negative interest rates is still circulating. It might even be that all borrowed RAI is returned to the protocol but there is still a lot of remaining RAI in circulation and the protocol has no mechanism anymore to make these coins more valuable.\n\nI guess in this scenario RAI would just lose its peg and become unusable as a stablecoin. Any thoughts on this?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7ll9i",
                            "author": "Sylentwolf8",
                            "score": 10,
                            "created_utc": 1653669111.0,
                            "response": "I think this question all lies on the surplus treasury mechanism. Normally there is a constant positive interest rate paying into the surplus treasury. During times like you're describing, the treasury is essentially losing money in order to pay out the negative interest. During stable operation the natural state is the surplus treasury is gaining money, and it also gains even more money during increased interest periods.\n\nI don't obviously have exact math, but I believe this would allow it to maintain stability, assuming the surplus treasury can outlast negative interest periods. (Which it really should be able to.)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7xqw3",
                                    "author": "llort_lemmort",
                                    "score": 5,
                                    "created_utc": 1653674162.0,
                                    "response": "That's actually a good point I didn't consider. So during positive interest rates the amount of debt can surpass the circulating supply such that all the borrowed RAI could never be fully returned.\n\nThis metric should also be easy to measure and monitor.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia8avef",
                    "author": "MKT17",
                    "score": 5,
                    "created_utc": 1653679937.0,
                    "response": "Soooooooo Djed then",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia66vvh",
                    "author": "LTuvok",
                    "score": 70,
                    "created_utc": 1653641154.0,
                    "response": "Take a look at that whitepaper, Vitalik. \n\n[Djed - thats how you do it](https://www.google.com/url?q=https://eprint.iacr.org/2021/1069.pdf&sa=U&ved=2ahUKEwj83rDApP_3AhUfQ_EDHcH0C2oQFnoECAwQAg&usg=AOvVaw3roSN89s8VYlZ07NNPJcXG)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6dc87",
                            "author": "PinkPuppyBall",
                            "score": 32,
                            "created_utc": 1653646871.0,
                            "response": "Or you know, look at rai which he talks about. It's been live for years.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6p5xd",
                                    "author": "KlopKlop10293",
                                    "score": 24,
                                    "created_utc": 1653654757.0,
                                    "response": "Rai is over-collateralised just like dai, dai uses multiple assets, rai Eth and isn’t pegged directly to usd, I’d rather stick to dai",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia7amnx",
                                            "author": "StefanMerquelle",
                                            "score": 9,
                                            "created_utc": 1653664642.0,
                                            "response": "Personally I think long term is to not have a peg to USD at all, à la RAI but the market prefers peg for now",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia7e7hy",
                                                    "author": "luquoo",
                                                    "score": 6,
                                                    "created_utc": 1653666102.0,
                                                    "response": "I never heard about rai till now.  Are there vendors accepting it anywhere?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia7o4pe",
                                                            "author": "StefanMerquelle",
                                                            "score": 1,
                                                            "created_utc": 1653670151.0,
                                                            "response": "What? No lol",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia8d7wl",
                                                                    "author": "luquoo",
                                                                    "score": 1,
                                                                    "created_utc": 1653680995.0,
                                                                    "response": "Lol, I guess that makes sense.  Seems like the one of the uses for this would be as a middle coin to use as collateral for something like DAI.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia8m487",
                                                                            "author": "StefanMerquelle",
                                                                            "score": 2,
                                                                            "created_utc": 1653685077.0,
                                                                            "response": ":) it's just very niche right now. I'm not even aware of many vendors accepting stablecoins in general except through Coinbase, FTX, etc who do it behind the scenes",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "ia90c36",
                                                    "author": "wanglubaimu",
                                                    "score": 2,
                                                    "created_utc": 1653691955.0,
                                                    "response": "If you want to safely track the USD you want to hold at least some USD, the more the better from a safety perspective. The inherent aim of a USD stablecoin is to have the same value as the USD. \n\nMaker had/has? plans for a coin tracking a basket of currencies and or other assets. However there are apparently legal issues with this, it's obviously a threat to national currencies even more than the current implementation.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia778j1",
                            "author": "civilian_discourse",
                            "score": 25,
                            "created_utc": 1653663228.0,
                            "response": "The idea of a loosely secured stablecoin ever working is fundamentally flawed. It cannot be done without becoming a ponzi. It's either \"wrapped\" (USDC, GUSD, WBTC) or collateralized (RAI, DAI, LUSD). Anything else is you effectively extending a line of credit. That's not a stablecoin, that's just buying up someone else's unsecured debt that's been dressed up to look like a stablecoin.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia81715",
                            "author": "LiveClimbRepeat",
                            "score": 3,
                            "created_utc": 1653675663.0,
                            "response": "but this still could go to zero.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8imce",
                                    "author": "llort_lemmort",
                                    "score": 0,
                                    "created_utc": 1653683448.0,
                                    "response": "Only if the base currency that is used as collateral also goes to zero.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia8j12o",
                                            "author": "LiveClimbRepeat",
                                            "score": 0,
                                            "created_utc": 1653683636.0,
                                            "response": "if ether goes to $200, it's gone a lot of the way there already",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia8kjyl",
                                                    "author": "llort_lemmort",
                                                    "score": 1,
                                                    "created_utc": 1653684341.0,
                                                    "response": "That's still different from going to zero. Djed is also overcollateralized so depending on the overcollateralization ratio it could for example deal with Ether going down 75% without losing the peg. There's also a big chance of Ether recovering after a crash which means that Djed would also recover.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia6a4db",
                            "author": "Bru_Boy8",
                            "score": 13,
                            "created_utc": 1653644100.0,
                            "response": "💯 he’s explaining what they are doing. Djed will eventually be available on ETH too",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia71om7",
                                    "author": "DATY4944",
                                    "score": 10,
                                    "created_utc": 1653660858.0,
                                    "response": "SigUSD has been running on ergo for a year",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia7wq6p",
                                            "author": "SgtPepe",
                                            "score": 7,
                                            "created_utc": 1653673726.0,
                                            "response": "And has handled crashes like a champ. Over-collateralization is the only way. Ergo is doing it right.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ia82mhp",
                                            "author": "Puppy_Coated_In_Beer",
                                            "score": 4,
                                            "created_utc": 1653676287.0,
                                            "response": "People are seriously sleeping on Ergo.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia7zjx8",
                            "author": "kiefferbp",
                            "score": 4,
                            "created_utc": 1653674943.0,
                            "response": "Nope. Shen is basically an even riskier Luna.\n\nTypical Cardano fanboys.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia9q34e",
                                    "author": "KlopKlop10293",
                                    "score": 1,
                                    "created_utc": 1653705433.0,
                                    "response": "Yeah they just made it more complicated, there is just no way to conserve value out of minting new token that need to be sold, with 3-10 tokens doesn’t change the fact mcap can’t be cheated",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia6p0dy",
                            "author": "KlopKlop10293",
                            "score": 3,
                            "created_utc": 1653654672.0,
                            "response": "Doesn’t work. If Shen mcap collapse there won’t be anyway to buyback Ada and would literally turn into an ust2.0.\n\nThey just made terra-ust but instead of doing luna <->ust, they made if: Shen <-Ada->ust\n\nI’m amazed they wrote so many pages on something that is clearly doomed",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8id0w",
                                    "author": "llort_lemmort",
                                    "score": 0,
                                    "created_utc": 1653683330.0,
                                    "response": "You clearly don't understand Djed. They don't need to buyback Ada because both Djed and Shen are sold for Ada which is then locked up and used as a reserve.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia9pp45",
                                            "author": "KlopKlop10293",
                                            "score": 1,
                                            "created_utc": 1653705229.0,
                                            "response": "lol ok so what do you when the Ada reserve isn’t enough to cover the value in usd?\n\nlet me guess mint more Shen? Nice sounds like luna again…",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaafwqu",
                                                    "author": "llort_lemmort",
                                                    "score": 2,
                                                    "created_utc": 1653723208.0,
                                                    "response": "When the reserve isn't enough to cover Djed will depeg to avoid a death spiral. No new tokens will be minted in that case.\n\nThe perfect algorithmic stablecoin does not exist. There are always tradeoffs. Djed might lose its peg under certain market conditions but can therefore avoid a death spiral.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia68aaa",
                    "author": "lorenzomofo",
                    "score": 3,
                    "created_utc": 1653642424.0,
                    "response": "Excellent.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7y7yy",
                    "author": "MushinZero",
                    "score": 3,
                    "created_utc": 1653674365.0,
                    "response": "Let me say it again\n\n\\*inhales\\*\n\nYOU CANNOT STAY PEGGED TO ANOTHER ASSET WITHOUT BEING ABLE TO TRADE 1-1 WITH THAT ASSET (OR EQUIVALENT VALUE) AT ANY TIME.\n\nAnything else is printing free money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8859g",
                    "author": "Yoloballsdeep",
                    "score": 4,
                    "created_utc": 1653678720.0,
                    "response": "Can he now please pontificate to how to unfuck Ethereum. My profile is being sodomized",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7zrrj",
                    "author": "Snoo-99563",
                    "score": 2,
                    "created_utc": 1653675038.0,
                    "response": "For stablecoins to remain stable we gotta remove the speculation part but then we wouldn’t have had coins like luna",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6wfyh",
                    "author": "Trevonhaywood",
                    "score": 4,
                    "created_utc": 1653658453.0,
                    "response": "TL; DR Positive Affirmations. Duh",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia68l0d",
                    "author": "paul_tu",
                    "score": 2,
                    "created_utc": 1653642697.0,
                    "response": "Then better do it now",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6hvd8",
                    "author": "shirram",
                    "score": 1,
                    "created_utc": 1653650246.0,
                    "response": "can someone plz explain how borrowing RAI makes you go long on eth? (1% change in price of eth makes your position change by 2%)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6mgws",
                            "author": "Dwaas_Bjaas",
                            "score": 7,
                            "created_utc": 1653653200.0,
                            "response": "RAI is backed by locking Ethereum. So if you deposit ETH you mint RAI. That’s why you go long",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia78ard",
                                    "author": "shirram",
                                    "score": 2,
                                    "created_utc": 1653663671.0,
                                    "response": "Thanks. But how does that magnify your gains compared to just holding ETH?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia8xpw0",
                                            "author": "LogrisTheBard",
                                            "score": 3,
                                            "created_utc": 1653690664.0,
                                            "response": "Minting doesn't in and of itself. If you use the RAI to buy more ETH then it certainly does. No different than DAI.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ia7jjc4",
                                            "author": "Sylentwolf8",
                                            "score": 2,
                                            "created_utc": 1653668281.0,
                                            "response": "You can use that RAI to buy more ETH. So in reality you can have 1.66x your original amount of ETH... but with risk of liquidation if it goes down of course.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia7zr59",
                                    "author": "opticoin",
                                    "score": 1,
                                    "created_utc": 1653675030.0,
                                    "response": "Isn't that how DAI works as well? Whats new then?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia6pco7",
                            "author": "veryicy",
                            "score": 2,
                            "created_utc": 1653654861.0,
                            "response": "Should be more like borrowing RAI with your eth maintains your eth long. To go leveraged long you'll have to trade the new RAI for more eth.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia6rzwl",
                            "author": "themanndalore",
                            "score": -1,
                            "created_utc": 1653656275.0,
                            "response": "RAI is basically a short ETH/USD.  If you have 1 ETH backing 1000 RAI and the price of ETH goes up 2x, you still only have 1000 RAI.  But you can always only withdraw 3.14$ worth of ETH per RAI...so you're short ETH/USD.  Now if you borrow a short position, agree to pay back in some period, this makes you in effect long the underlying ETH",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia73ytx",
                                    "author": "civilian_discourse",
                                    "score": 6,
                                    "created_utc": 1653661848.0,
                                    "response": "This is wrong. When you deposit ether and borrow RAI, you only ever have to pay back what you borrowed +/- interest to withdraw your ether. It's not an exchange, it's a collateralized loan.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia8kyuw",
                    "author": "GoXplore",
                    "score": 1,
                    "created_utc": 1653684534.0,
                    "response": "Fugayzi fugaazi",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia82ysc",
                    "author": "rahulrdb18",
                    "score": 0,
                    "created_utc": 1653676436.0,
                    "response": "Everything is ponzi in some form or shape except bitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8c95f",
                            "author": "IsrOkeX",
                            "score": 6,
                            "created_utc": 1653680560.0,
                            "response": "Except the magical Bitcoin",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia6ax2i",
                    "author": "chedebarna",
                    "score": -25,
                    "created_utc": 1653644813.0,
                    "response": "So his solution is a stablecoin that's not pegged to fiat. So, NOT a stablecoin.\n\nIf his great idea is to create a crypto that's pegged to another crypto, well, we already have BTC.\n\n1 BTC = 1 BTC. Doesn't get more stable than that.\n\nIf you're betting on the value of an underlying reserve crypto such as ETH or BTC just buy ETH or BTC. The whole concept of going through a third party stablecoin pegged to them is absurd.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6csx0",
                            "author": "LegitimateCopy7",
                            "score": 15,
                            "created_utc": 1653646427.0,
                            "response": "1 LUNA = 1 LUNA\n\nstable af 😂",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7l9we",
                                    "author": "Inthewirelain",
                                    "score": 3,
                                    "created_utc": 1653668980.0,
                                    "response": "Technically untrue now top lol luna2.0 has rebased the currency",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia6cv4u",
                            "author": "piquant-nuggets",
                            "score": 3,
                            "created_utc": 1653646478.0,
                            "response": "Why is this getting downvoted?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6grhg",
                                    "author": "Perleflamme",
                                    "score": 14,
                                    "created_utc": 1653649464.0,
                                    "response": "Because a stablecoin doesn't need to be pegged to any fiat to be stable. A stablecoin is supposed to be stable in value over time, not necessarily to copy the value of a fiat. A perfect stablecoin would for instance perfectly reflect the monetary inflation of each fiat. \n\nWe can't achieve a perfect stablecoin, of course, but we can get close to the feature through indexes based on several different products and stability through self-regulated mechanisms.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia6itca",
                                            "author": "chedebarna",
                                            "score": -1,
                                            "created_utc": 1653650894.0,
                                            "response": "\"Stable in value\" meaning what? That doesn't mean anything.\n\nStablecoins BY DEFINITION are stable in PRICE, which is denominated in whatever coin it is pegged to, be it fiat, a basket of currencies, commodities or whatever (which are denominated in fiat...), or another crypto like ETH or BTC.\n\nIn this last case, you don't need a stablecoin for anything at all. Just buy the underlying crypto, because 1 BTC or 1 ETH will always be 1 BTC or 1 ETH.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia6yxbw",
                                                    "author": "Perleflamme",
                                                    "score": 1,
                                                    "created_utc": 1653659611.0,
                                                    "response": ">\"Stable in value\" meaning what? That doesn't mean anything.\n\nI already explained, actually. Value is what people are ready to pay in any other assets to buy this product. People want an asset that keeps its value so that they can save the value they produced for others for later. And really, that role is not provided by fiat, which has proven to be too inflationary to allow people to keep value for what they've offered to others. \n\nIf you really want to, get robbed all you want, but you're not the one who will prevent others from accessing assets that keep their financial security safe. \n\n>Stablecoins BY DEFINITION are stable in PRICE\n\nHum, no, clearly not. That wouldn't be possible anyway to be stable in price against everything, because every other asset has its own prices fluctuating against any other asset. Being pegged to a fiat only means you're completely sure your stablecoin won't be very stable, as you're completely sure it will lose value over time. \n\nCommodities aren't denominated in fiat either, that doesn't make any sense: commodities have values that you can buy with several other assets, being locally sold preferentially in a fiat or another doesn't change anything to its value. Do you think electricity can only be bought in USD? Or even in fiat? There even already are crypto about decentralized electricity markets, for instance, right into Brooklyn. And it's not pegged to USD at all. \n\n>In this last case, you don't need a stablecoin for anything at all. Just buy the underlying crypto, because 1 BTC or 1 ETH will always be 1 BTC or 1 ETH.\n\nIt's not about being pegged to BTC or ETH. Read again, really.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia6ie1t",
                                    "author": "chedebarna",
                                    "score": -7,
                                    "created_utc": 1653650604.0,
                                    "response": "Because I'm questioning God Almighty, and the Cult can't have any of that.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia6q5bv",
                                            "author": "jlevy1126",
                                            "score": 7,
                                            "created_utc": 1653655300.0,
                                            "response": "No it's because you think you know what you're talking about but you're wrong.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia6dfge",
                            "author": "Deif",
                            "score": 1,
                            "created_utc": 1653646945.0,
                            "response": "Been using RAI for a year. History shows it's stable even through market volatility. That can't be said for most \"stablecoins\".",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6j14l",
                                    "author": "chedebarna",
                                    "score": 1,
                                    "created_utc": 1653651041.0,
                                    "response": "Is it more stable than ETH?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia6jljx",
                                            "author": "Deif",
                                            "score": 2,
                                            "created_utc": 1653651413.0,
                                            "response": "Obviously.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia6lrum",
                                                    "author": "chedebarna",
                                                    "score": -4,
                                                    "created_utc": 1653652787.0,
                                                    "response": "You didn't get it, did you.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia6ctz4",
                            "author": "shim__",
                            "score": 1,
                            "created_utc": 1653646451.0,
                            "response": "If your goal is to design an solid algorithm, it doesn't matter what price feed you're using",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia6i824",
                            "author": "hulkklogan",
                            "score": 1,
                            "created_utc": 1653650488.0,
                            "response": "Go look at RAI.  It is only backed by ETH, and yet stable even in Fiat value... But it isn't pegged to any fiat.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6mv3w",
                                    "author": "cosmogli",
                                    "score": 0,
                                    "created_utc": 1653653436.0,
                                    "response": "Ummm....how is it pegged to ETH and still stable in fiat value when ETH itself isn't stable in fiat value?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia74l6r",
                                            "author": "hulkklogan",
                                            "score": 4,
                                            "created_utc": 1653662113.0,
                                            "response": "It isn't pegged to ETH, its ***backed by*** ETH, which means it is collateralized by ETH.\n\nIt is algorithmic stable coin, so it does fancy math things to add/remove supply of RAI and ETH to keep its price stable.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia79vas",
                                                    "author": "cosmogli",
                                                    "score": 1,
                                                    "created_utc": 1653664328.0,
                                                    "response": "That makes sense. Where is the collateralized ETH kept and traded though? And what is it traded for?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia7o9xl",
                                                            "author": "hulkklogan",
                                                            "score": 1,
                                                            "created_utc": 1653670211.0,
                                                            "response": "It is complicated, big brain shit.  I won't pretend to understand it.\n\nHere is a primer:\nhttps://medium.com/reflexer-labs/stability-without-pegs-8c6a1cbc7fbd",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia7yc6z",
                    "author": "Warm-Top-4816",
                    "score": 1,
                    "created_utc": 1653674416.0,
                    "response": "Pretty insightful read. The reputation projects like UST has given stablecoins in recent times is quite damaging. I myself was seeking safer investments only to be cast away. Switched to p2e like shiryo, it's been a nice change of scenery",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8a8a2",
                    "author": "xiwefe2",
                    "score": 1,
                    "created_utc": 1653679646.0,
                    "response": "They should do a show on how to never allow people like do kwon to enter the crypto buisiness ever again. I sure hope in the future, all new projects will launch with AngelBlock to a path without greddy and incapable VC's like this gent, got a few of their NFTs ,ppl at VeeCon were sure hyped about them,half sold out allready..Oh and i hope that ETH does it good this time with the upgrade, thumbs up",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8her3",
                    "author": "hok98",
                    "score": 1,
                    "created_utc": 1653682895.0,
                    "response": "Can we make a token that is pegged to value?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8v0ht",
                    "author": "iamjide91",
                    "score": 1,
                    "created_utc": 1653689337.0,
                    "response": "I love his ideas. But please, Mr Buterin, don't venture into that at all. Let's just focus on turning down eth fees for now. Thanks.\n\nSigned: concerned hodler.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8y84b",
                    "author": "thisisluk4s",
                    "score": 1,
                    "created_utc": 1653690914.0,
                    "response": "ypu dont <3",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9fkx3",
                    "author": "xSilentxHawkx",
                    "score": 1,
                    "created_utc": 1653699873.0,
                    "response": "The money God always wins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9tofi",
                    "author": "d_howe2",
                    "score": 1,
                    "created_utc": 1653707339.0,
                    "response": "> If, in the extreme case, all demand for holding RAI disappears simultaneously except for one holder, the redemption rate would skyrocket until eventually every lender's safe gets liquidated. The single remaining holder would be able to buy the safe in the liquidation auction, use their RAI to immediately clear its debt, and withdraw the ETH. This gives them the opportunity to get a fair price for their RAI, paid for out of the ETH in the safe.\n\n> Another extreme case worth examining is where RAI becomes the primary appliation on Ethereum. In this case, a reduction in expected future demand for RAI would crater the price of ETH. In the extreme case, a cascade of liquidations is possible, leading to a messy collapse of the system. But RAI is far more robust against this possibility than a Terra-style system.\n\n**TLDR**: Step 1. Assume ETH is stable. Step 2. Voilà! \n\nLol such a genius this guy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6o6p2",
                    "author": "Ghostlucho29",
                    "score": -12,
                    "created_utc": 1653654205.0,
                    "response": "Dude looks sick",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6lubw",
                    "author": "errorspng",
                    "score": -19,
                    "created_utc": 1653652828.0,
                    "response": "rat",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia72oc3",
                    "author": "Mallardshead",
                    "score": -14,
                    "created_utc": 1653661291.0,
                    "response": "This guy is clueless. Should've disappeared long ago.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6me1r",
                    "author": "DrFunkensteinberg",
                    "score": 0,
                    "created_utc": 1653653152.0,
                    "response": "It’s like no one ever talks about trialgotonicstablecoins though",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8gbmh",
                    "author": "DI0nysOO2",
                    "score": 0,
                    "created_utc": 1653682401.0,
                    "response": "Is he ill or something? I remember him looking much healthier",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaaon6c",
                            "author": "misterflerfy",
                            "score": 1,
                            "created_utc": 1653731240.0,
                            "response": "He pissed off Putin recently; hope he’s ok.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}