{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqvrd7",
            "title": "Do you find Xangle useful for their crypto ratings and analysis?",
            "url": "https://www.reddit.com/r/ethereum/comments/uqvrd7/do_you_find_xangle_useful_for_their_crypto/",
            "author": "serban1313",
            "created_utc": 1652707029.0,
            "score": 3,
            "num_comments": 1,
            "subreddit": "ethereum",
            "selftext": "Hi! I have discovered a lot of sites that offer crypto ratings for different projects, with analysis and a full report with their findings. [Xangle](https://xangle.io/en/) for example, is a South Korean business focused on a disclosure platform for crypto projects. The exchanges in that part of the world, need a third-party rating report to list their tokens because the Korean commercial banks require it. [Here](https://finance.yahoo.com/news/xangle-credibility-ratings-used-korean-121000301.html) is an article I found. My question is, ... do you find helpful their crypto reports?\n\nOther platforms/websites that offer analysis are TokenInsight and Baserank. If you have other platforms that do crypto projects analysis, let me know.\n\n[View Poll](https://www.reddit.com/poll/uqvrd7)",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uqvtpi",
            "title": "StarkNet Roundup #16",
            "url": "https://swagtimus.substack.com/p/starknet-roundup-16?s=w",
            "author": "starknet_intern",
            "created_utc": 1652707217.0,
            "score": 6,
            "num_comments": 6,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8tei1k",
                    "author": "starknet_intern",
                    "score": 3,
                    "created_utc": 1652707227.0,
                    "response": "Highlights:\n\n- OpenZeppelin contracts wizard now available as API - makes it super easy to spin up ERC-20 and ERC-721 contracts.\n\n- New StarkNet projects: Giza, Arcticium, Starcombo - check the roundup to see what they're all about!\n\n- full node json rpc providers by http://cartridge.gg - give the StarkNet block explorer \"Voyager\" a breather and get up to 25x faster avg response times + access to event filters.\n\n- StarkNet TVL & volume featured on L2Beat - you heard that right! Since last week, the cap on the bridge has been raised several times and StarkNet is now slowly climbing up the TVL rankings on L2Beat!\n\n- Dune dashboard for StarkGate bridge - A handy dashboard for tracking StarkGate bridge stats.\n\n- StarkNet Community Call 13 - Cairo v0.8.2 & Dev education were the discussion topics.\n\n- Space strategy game Influence announced their test-to-earn program, and teased their L1 <> L2 bridge.\n\n- and lots more as usual!\n\nMake sure to check out the full post linked above. Thanks for reading, and I'll see you guys again next week!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tfpfm",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1652707817.0,
                    "response": "tldr; StarkNet Alpha v0.8.2 is now LIVE on testnet. OpenZeppelin Contracts Wizard is now available as an API for CairoLang. Web3 Infrastructure Company ChainstackHQ announces support for StarkNet, allowing smooth Node syncronization, battle-tested infra for mainnet and multi-hosting options.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}