{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvs0bt",
            "title": "does ethereum support multiple concensus methods?",
            "url": "https://www.reddit.com/r/ethereum/comments/uvs0bt/does_ethereum_support_multiple_concensus_methods/",
            "author": "cc672012",
            "created_utc": 1653279508.0,
            "score": 7,
            "num_comments": 15,
            "subreddit": "ethereum",
            "selftext": "Hi, I'm starting on reading about Blockhains and their applications.\n\nTwo papers I've read claimed that they used a private/permissioned blockchain that uses a proof of authority concensus mechanism. However, they also mention that they're using Ethereum smart contracts and as far as I know, Ethereum is a proof-of-work public blockchain.\n\nMy questions are:\n1) How is this possible? Did they fork Ethereum and modified the source?\n2) If Ethereum somehow supports this, is this possible with all blockchains that support Smart contracts, say Cardano?\n\nPapers I've read:\nGürsoy, G., Brannon, C.M. & Gerstein, M. Using Ethereum blockchain to store and query pharmacogenomics data via smart contracts. BMC Med Genomics 13, 74 (2020). https://doi.org/10.1186/s12920-020-00732-x\n\nAicha Fatrah, Said El Kafhali, Abdelkrim Haqiq, and Khaled Salah. 2019. Proof of Concept Blockchain-based Voting System. In Proceedings of the 4th International Conference on Big Data and Internet of Things (BDIoT'19). Association for Computing Machinery, New York, NY, USA, Article 31, 1–5. https://doi.org/10.1145/3372938.3372969",
            "stickied": false,
            "comments": [
                {
                    "id": "i9np3yf",
                    "author": "edmundedgar",
                    "score": 3,
                    "created_utc": 1653290080.0,
                    "response": "The Ethereum software implementations like Geth generally support multiple types of consensus mechanisms. So it's the software built to run Ethereum, and it runs the Ethereum Virtual Machine and contracts written for Ethereum, but it's not the Ethereum network.\n\nGenerally you shouldn't need to modify the source code to do this since several consensus mechanisms are supported by default, but they might have done that if they wanted a feature that it didn't have.\n\nCardano doesn't support the Ethereum Virtual Machine, so Cardano software wouldn't help you with this specific case. You could do something similar where you took the Cardano software and used it to make a different network (I'm not sure how much you could do by configuring it and how much you'd need to change the source code) but if the goal is to run smart contracts then I can't think why you'd use that platform, there are lots of better smart contract platforms aside from the EVM.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nuq78",
                    "author": "thomas_m_k",
                    "score": 2,
                    "created_utc": 1653295266.0,
                    "response": "In addition to what the other comment said, there were multiple Proof of Authority test nets for Ethereum. Currently the Goerli test net runs with PoA.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nyvfk",
                    "author": "AESTHTK",
                    "score": 2,
                    "created_utc": 1653299125.0,
                    "response": "That would probably be Hyperledger Besu or Quorum or similar, which allows you to set multiple consensus methods when deploying Ethereum as a private network. \n\nIf it’s a permissioned system there’s no need for Byzantine fault tolerance, so POA is much faster.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvugnu",
            "title": "Why is it gas less / free to read the block chain like ethscan? or other way?",
            "url": "https://www.reddit.com/r/ethereum/comments/uvugnu/why_is_it_gas_less_free_to_read_the_block_chain/",
            "author": "personplaygames",
            "created_utc": 1653289558.0,
            "score": 4,
            "num_comments": 20,
            "subreddit": "ethereum",
            "selftext": "Why is it free to read data? I understand writing data to the blockchain is not free because space is consumed and logic is computed or something.\n\nIs it free because its just it?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9nrgzx",
                    "author": "Perleflamme",
                    "score": 20,
                    "created_utc": 1653292191.0,
                    "response": "What's scarce is writing, because there's only so much space in any block and only so many blocks per minute (notably ~15M gas per block for 30M gas max, with a block every ~13s). That's the blockspace, a pretty scarce resource. \n\nReading is just you reading the chain. You're already paying for your electricity and computer to read the chain. You can do that as much as you want without impacting anyone else. \n\nBut when you write, you need to ask for the consensus to add your content onto the chain and to be stored by everyone having a node. It means someone else may not be able to store their own content because you've out priced them. As I've already said, it's scarce space, so you need to prove to the network your content is worth being stored, by paying for it. \n\nOtherwise, that scarce resource that blockspace is could be spammed by malevolent actors for free. Gas costing something is a security measure, even though being cheap is a possibility brought by L2s.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nrjsg",
                    "author": "never_safe_for_life",
                    "score": 8,
                    "created_utc": 1653292264.0,
                    "response": "Reads only have to happen on one machine. Writes have to be duplicated across all ~50,000. \n\nRemember that bitcoin works by letting anyone and everyone download a full copy of the data. So if you’ve got a PC lying around you can download a copy. From that point your reads are happening only on your hardware.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ozjfj",
                    "author": "Kike328",
                    "score": 2,
                    "created_utc": 1653320031.0,
                    "response": "most people here is not exactly right, reads also cost gas when those reads are in some transaction.\n\nWhat costs gas, is to have something included into the blockchain (a read, a write, even empty transactions which cost 21.000 gas and they don’t do anything).\n\nWhen you’re reading externally the blockchain, you’re just reading the state of the chain without including anything on it.\n\nBasically using the EVM/transacting is what has a cost",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9p3yty",
                    "author": "lorenzomofo",
                    "score": 2,
                    "created_utc": 1653321898.0,
                    "response": "It’s free because the spec says it’s free. So it’s basically subsidized by people writing to the blockchain.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nq019",
                    "author": "Neophyte-",
                    "score": 4,
                    "created_utc": 1653290846.0,
                    "response": "> Is it free because its just it?\n\nyeah exactly anyone can be a node you cann participate in writing by being a miner but you must agree to the consensus rules, that is unless you are trying to attack the blockchain.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}