{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uy7x01",
            "title": "Do you think we'll be able to implement blockchain learning?",
            "url": "https://www.reddit.com/r/ethereum/comments/uy7x01/do_you_think_well_be_able_to_implement_blockchain/",
            "author": "willsureck",
            "created_utc": 1653572537.0,
            "score": 160,
            "num_comments": 36,
            "subreddit": "ethereum",
            "selftext": " Since we already have virtual real estate, fashion, arts, and play to earn and their markets are constantly expanding, do you think learn-to-earn will be a huge thing too? I have found this [article](https://elearningindustry.com/impact-of-blockchain-technology-on-the-elearning-industry) about the impact of blockchain on Elearning If you think about it, it will be a win-win situation and it will also be helpful for those who don’t have the motivation to learn. Not just by learning about coins like Coinbase where you can start learning by watching videos and answering quiz questions that run for a certain period of time, Binance where a new user who signed up within 3 days can earn popular coins, Coinmarketcap partners with a variety of new cryptocurrencies and protocols trying to get their name out there, but like Kirin metaverse where they will have games that offer programs that reinforce education and reward learning with crypto assets, and I’m not sure if you will earn something from Bloktopia but it will act as a gateway for users to learn about blockchain and how it's helping power the metaverse.   \nDo you think we will have more learn-to-earn programs in the future?",
            "stickied": false,
            "comments": [
                {
                    "id": "ia2ujn5",
                    "author": "sckuzzle",
                    "score": 31,
                    "created_utc": 1653580448.0,
                    "response": "If \"blockchain learning\" is just giving rewards to people for watching videos and answering quizzes, then don't kid yourself: this is horrible.  It'll just be another method of stealth marketing to people under the guise of \"learning\".  Only the projects that are borderline scams will need to actually pay people to learn about it, and thus that is all you will get.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5mqcy",
                            "author": "lorenzomofo",
                            "score": 2,
                            "created_utc": 1653625636.0,
                            "response": "Reminds me of ads masquerading as edutainment.\n\nToday I learned that the great taste of Subways foot long is because of the 5 different herbs and spices.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia2dvva",
                    "author": "Wrong_Net_749",
                    "score": 5,
                    "created_utc": 1653573594.0,
                    "response": "Yes, it would be beneficial, but I doubt it would be implemented across multiple metaverses. But let us wait and see what the future has in store for us.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2zcql",
                            "author": "Overall_Essay_3138",
                            "score": 1,
                            "created_utc": 1653582345.0,
                            "response": "I can’t see it to be beneficial at all. I think it will be just a waste of time.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia3bz3l",
                                    "author": "Wrong_Net_749",
                                    "score": 1,
                                    "created_utc": 1653587323.0,
                                    "response": " It will benefit both the coin and the project, as well as the user. It will benefit the coin because it will draw more attention to it, similar to what cmc is doing; it will benefit the project because you are using their platform, and I'm sure there will be a cut for them once you earn crypto assets by answering quizzes, watching videos, and so on.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia2tkz8",
                    "author": "Either-Advantage",
                    "score": 3,
                    "created_utc": 1653580070.0,
                    "response": "I feel like this is already something a lot of projects are jumping on. The web3 space is still early as hell and there's plenty of room for growth. Polygon Academy is an example of something that could work like this. Incredible learning opportunity, you can't earn yet but maybe they'll add it in the future? Overall this seems way more useful than play to earn.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3kgyy",
                    "author": "bocceballbarry",
                    "score": 3,
                    "created_utc": 1653590784.0,
                    "response": "I’m building a decentralized university and I can tell you with certainty after talking to many employers that the current options for learning are not working.\n\nIf you’ll remember my post on what an actual path to becoming a full stack web3 SWE looks like, it’s about 2 years of intensive college course level work. This isn’t something you can learn over night.\n\nWhat we’re seeing is that people are listening to crap advice posted on r/ethdev. Taking a trivial udemy JS course, doing crypto zombies, and thinking that’s it they’re ready to be a developer. They then go bomb interviews and can’t answer basic questions about fundamental CS and programming concepts that every CS student sophomore in the country could answer. They get discouraged and enter this weird area where they think they’re beyond the basics but because they never learned them properly they start struggling to progress but are unwilling to go back to square one and start with a course for absolute beginners. Employers are then reinforced in their belief that a CS degree is a necessary filter. It’s a shit show\n\nTLDR; we need more serious options but less bloated and costly than 4 year degrees",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia3ztd5",
                            "author": "Web3Dude",
                            "score": 1,
                            "created_utc": 1653597172.0,
                            "response": "What is the name of your decentralized  university?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5mw6l",
                                    "author": "lorenzomofo",
                                    "score": 0,
                                    "created_utc": 1653625735.0,
                                    "response": "SkillShare, MasterClass, CuriosityStream, Nebula",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia314bl",
                    "author": "BattyPolling",
                    "score": 1,
                    "created_utc": 1653583034.0,
                    "response": " Binance would be great if it will be available for users who are not new too…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia33wbr",
                    "author": "espresso_chain",
                    "score": 1,
                    "created_utc": 1653584115.0,
                    "response": "doubt it. unless there's KYC to ensure you aren't gaming the system... but even then I don't see the point. online earning is very easy to game. I basically googled my way through my degree when we switched to Zoom classes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5mz7d",
                            "author": "lorenzomofo",
                            "score": 1,
                            "created_utc": 1653625788.0,
                            "response": "Maybe that's the use case for Soul Bound Tokens.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5ysyq",
                                    "author": "espresso_chain",
                                    "score": 1,
                                    "created_utc": 1653634081.0,
                                    "response": "soulbound kyc probably",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia3a51f",
                    "author": "goodwidth_29",
                    "score": 1,
                    "created_utc": 1653586586.0,
                    "response": " I wonder what kind of games will kirin include? I hope there will be something useful like Duolingo lololool.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia3na4o",
                            "author": "DisfiguredGusto",
                            "score": 2,
                            "created_utc": 1653591938.0,
                            "response": " I hate that bird.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia3bpc7",
                    "author": "ExultantDossier",
                    "score": 1,
                    "created_utc": 1653587214.0,
                    "response": " Blockchain development services can provide much more to the eLearning industry than just digital certificates and cryptocurrencies for rewards.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4di6d",
                    "author": "Longjumping-Basket62",
                    "score": 1,
                    "created_utc": 1653603135.0,
                    "response": "Rather than 'Earn to learn', that seems to be 'get paid for watching ads'. Although I think education on Web3 has a lot of potential, paying in crypto to receive independent and quality courses that can compete with traditional universities. That'll be big some day soon.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4pf10",
                    "author": "-spooky_ghost",
                    "score": 1,
                    "created_utc": 1653608749.0,
                    "response": "\"be helpful for those who don't have the motivation to learn\" is where I opt out of the idea.\n\nIf you don't have the motivation to learn I don't want to employ you. That implies your lazy and your only doing it to make quick easy money. \n\nI.e your only \"learning\" because your being paid too. Not because you have a passion or interest for what your doing.\n\nImmutable,easily verifiable certifications on a blockchain, yes. \n\nPaying people that have no interest in furthering their education or exploring their curiosity, 100% no.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5n56g",
                            "author": "lorenzomofo",
                            "score": 1,
                            "created_utc": 1653625889.0,
                            "response": ">I.e your only \"learning\" because your being paid too. Not because you have a passion or interest for what your doing.\n\nMost people get degrees because of that. Learn to earn to pay rent.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5syqk",
                                    "author": "-spooky_ghost",
                                    "score": 1,
                                    "created_utc": 1653629733.0,
                                    "response": "Of course, but you don't go spend 7 years getting the grades you need to go to university then 3 years and getting into debt and getting a degree in something you don't care about. \n\nSome people get paid to go to university through scholarship but only if your best in your field, which takes motivation, dedication and often sacrifice\n\nThat's a whole lot different than paying unmotivated people that have no interest in learning who are only doing a course because your paying them.. Life isn't and shouldn't be an easy ride",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia55e76",
                    "author": "CIN432",
                    "score": 1,
                    "created_utc": 1653616557.0,
                    "response": "I can imagine employers paying for notifications  of those who qualify knowledge in Any field and that value being passed on to those who learn and prove their abilities. Win-win.... get paid to learn and have your credentials sent to potential employers. I'd love to be notified as soon as a potential employee becomes available. I'm already prying in on college campuses to find people in this epic staff shortage. As I'm writing this, I'm thinking about putting together a program myself as a recruiting funnel.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia71knb",
                    "author": "Successful-Driver722",
                    "score": 1,
                    "created_utc": 1653660808.0,
                    "response": "I believe that it is inevitable that this way of learning becomes the norm.    \n\nIf you are a business owner, you want people working for you who actually want to be working in the industry and not there out of necessity.  \n\nThe college/university way of learning, is dying and was always exceptionally elitist anyway.  \nSo many talented individuals have been left at the wayside because they were unable to pay, or commit to a 3/4/5 year course. \n \nNone of us know what is around the corner and going the university route is one hell of a gamble. Doctors, nurses, accountants etc. are all careers that will  be automated at some point in the not too distant future, I believe.  \n\n  \nBlockchain, DeFi et al. are exploding and there are not enough suitable courses out there to provide enough graduates to fill the jobs that are actually available. Therefore, employers are going to have to get their staff from somewhere and educating them yourself seems like the most sensible way to do it.  \nYes, people require currency to be able to better educate themselves, but gone are the days of waitering/waitressing your way through college.  \nThis pandemic has changed the way people prioritise their lives and working yourself to an early grave is sensibly being removed from that thought process. \n\nDecentralisation is the way!\nPower to the people!  \nDo Your Own Research(Learn)!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}