{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ura484",
            "title": "Cloudflare is experimenting with running POS nodes.",
            "url": "https://blog.cloudflare.com/next-gen-web3-network/",
            "author": "Gotigers811",
            "created_utc": 1652747123.0,
            "score": 353,
            "num_comments": 50,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8wagjx",
                    "author": "j1mmie",
                    "score": 110,
                    "created_utc": 1652752404.0,
                    "response": "I love how Cloudflare has a team of people genuinely interested in crypto. And they are working on the field even though there’s no immediate profitability from it. Just cool for a company",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wga1p",
                            "author": "Jjabrahams567",
                            "score": 56,
                            "created_utc": 1652755350.0,
                            "response": "As a software dev that uses their services fairly often I can say I like to use them over alternatives at google or AWS. It is a shame their stock price doesn’t reflect that quality.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xmnfp",
                                    "author": "breeezyyyy",
                                    "score": 14,
                                    "created_utc": 1652787072.0,
                                    "response": "that just means you have time to stack cheap shares",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8y8kml",
                                            "author": "sixwax",
                                            "score": 7,
                                            "created_utc": 1652798255.0,
                                            "response": "If you start thinking in terms of share price instead of some pie-in-the-sky speculative rocket ship, the math —and what sort of valuation looks reasonable— changes dramatically.\n\nA more sober look at Ethereum would be a comparison to AWS compute cost/value instead of as a SOV… but then you have to factor in the projected role/value of L2/side chains/etc due to interoperability…\n\nYknow, think like an actual investor instead of a crazed sports fan…",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9056p8",
                                                    "author": "Jjabrahams567",
                                                    "score": 2,
                                                    "created_utc": 1652826744.0,
                                                    "response": "It is pretty complicated to compare ETH to AWS. Your AWS subscription doesn’t double as financial instrument. It is also not decentralized. Solana is more comparable to AWS. I’m getting bearish on Solana after trying to use it for development. Ethereum’s biggest advantage in my opinion is ease of entry for developers. Solidity contracts are easier to use than AWS lambda functions and comparable to cloudflare workers in terms of programming at least for me.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8yn126",
                                    "author": "santypk4",
                                    "score": 1,
                                    "created_utc": 1652804278.0,
                                    "response": "Value investing",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8zg4vy",
                            "author": "bluesohle",
                            "score": 1,
                            "created_utc": 1652816053.0,
                            "response": "It means a lot friend",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8wccza",
                    "author": "UnamazingHero",
                    "score": 49,
                    "created_utc": 1652753354.0,
                    "response": "I'm a POS node tbh",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xwx7z",
                            "author": "lorenzomofo",
                            "score": 9,
                            "created_utc": 1652792916.0,
                            "response": "Don’t be so hard on yourself. Your work is proof you are valuable.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8x6o30",
                    "author": "edmundedgar",
                    "score": 6,
                    "created_utc": 1652773603.0,
                    "response": "I hope they're better at this than they were at running .eth.link.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wimkz",
                    "author": "VividEdge",
                    "score": 8,
                    "created_utc": 1652756603.0,
                    "response": "Will we be able to let cloud flare run our validators for us? Like an easy deployment hosting service?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8y88ll",
                            "author": "goldcakes",
                            "score": 9,
                            "created_utc": 1652798113.0,
                            "response": "Yes, eventually. Cloudflare is an infrastructure company.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xirmb",
                    "author": "breitan",
                    "score": 3,
                    "created_utc": 1652784337.0,
                    "response": "This is too me very bullish. The more validators the merrier",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x8h0j",
                    "author": "thomas_m_k",
                    "score": 2,
                    "created_utc": 1652775264.0,
                    "response": "> The other major trade off accepted with the security of Proof of Work has been the number of transactions the network can handle per second. For instance, the Ethereum network can currently process about 30 transactions per second. This ultra-low transaction rate was acceptable when the technology was in development, but does not scale to meet the current demand.\n\nThis is a bit confused. PoW might affect the lowest viable *block time* but block time has nothing to do with throughput (transactions per second). You can totally have a high-throughput PoW chain; the problem is just centralization risk.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8y0zzs",
                            "author": "MoneroArbo",
                            "score": 2,
                            "created_utc": 1652794904.0,
                            "response": "It's related to variability --- having blocks e.g. exactly every 15 seconds is somewhat more efficient than having then 15 seconds on *average*, but some are 2 seconds and others are 40 seconds.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8x0msm",
                    "author": "boli99",
                    "score": 1,
                    "created_utc": 1652768437.0,
                    "response": "We've just gone to a load of trouble to decentralise this stuff. Centralising it all again really isnt a great idea.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x77ys",
                            "author": "Tenoke",
                            "score": 13,
                            "created_utc": 1652774107.0,
                            "response": "Just because a company is running some nodes it doesn't mean it's centralized.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8x8c6r",
                                    "author": "GuessWhat_InTheButt",
                                    "score": 12,
                                    "created_utc": 1652775137.0,
                                    "response": "The web was decentralized once. Now it runs almost entirely behind Cloudflare proxies.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8x9e2m",
                                            "author": "dreamin_in_space",
                                            "score": 2,
                                            "created_utc": 1652776120.0,
                                            "response": "And do you think that's good or bad for you?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xa234",
                                                    "author": "GuessWhat_InTheButt",
                                                    "score": 7,
                                                    "created_utc": 1652776746.0,
                                                    "response": "Bad for everybody except Cloudflare.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8yebip",
                                                            "author": "Cryptolution",
                                                            "score": 9,
                                                            "created_utc": 1652800669.0,
                                                            "response": "Apparently you've never worked in the internet/networking industry or ever ran a popular website.\n\nIf you had you would know what valuable a service cloudflare is. These entities exist because they provide value to a market. If they didn't they wouldnt exist.\n\nI had sites get ddos'd long before cloudflare existed. I got kicked out of many hosts because of something that was never my fault. It created labor burdens on me and my staff migrating to new hosts as well as extra financial costs, something that really sucked for non profit community driven projects. \n\nLiterally millions of users would get screwed when this happened.\n\nThis has never happened since cloudflare. I'm super grateful for it.\n\nI get you are a edgelord who pontificates about things you don't understand, but the world is not black and white. There are things called tradeoffs and you clearly don't have the experience to understand them.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8yjsdn",
                                                                    "author": "Theoretical_Action",
                                                                    "score": -12,
                                                                    "created_utc": 1652802926.0,
                                                                    "response": "Bad, uneducated, and egotistical take.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8yjcdr",
                                                    "author": "Theoretical_Action",
                                                    "score": -4,
                                                    "created_utc": 1652802746.0,
                                                    "response": "It's bad for everyone. Cloud flare goes down and people lose access to massive chunks of popular websites all across the internet. How are people not getting this?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i91t7f9",
                                                            "author": "boli99",
                                                            "score": 1,
                                                            "created_utc": 1652861213.0,
                                                            "response": "Various reasons. \n\n1. You have some people running 15-pageviews-a-month sites and they put it behind a cloudflare proxy 'for protection' and because its on the free tier, and because they want to feel 'big'. Pointing out that cloudflare is bad for the internet feels like a personal attack to them and their little website.\n2. The people that are running large hit count sites probably cant remember stuff like [this](https://www.datacenterdynamics.com/en/opinions/inside-the-fastly-outage-a-firm-reminder-on-internet-redundancy/) - or just want to bury their heads in the sand. Yes folks, it may be convenient, but its also bad for the security of the internet.\n2. Elsewhere in this thread you have some folk asking 'wow so does this mean cloudflare can run our nodes/validators for us'? as though its some kind of good thing, completely ignoring the danger of having one private company being a large part of the network (i.e. its now open to regulation by governments since they have a company to attack). Just wait til cloudflare is running 35% of nodes for some chain. Legally force them offline, and then you only need to do a 16% attack on what remains of the network to kill it (instead of a 51% attack)\n3. Given that most of the people on the planet are now regularly carrying tens of gigabytes of spare storage space and a high speed connection **in their pockets** - the best solution for caching and CDNing high traffic sites would be an peer-to-peer open dynamic framework that their phones can be a part of, possibly even taking advantage of blockchain-based ideas allowing trust groups etc. allowing clusters of data to literally spread out or roam around the planet to be close to where they are needed - **thats** the future of CDN and caching, not inflating these massive companies to become single-points-of-failure and then congratulating ourselves for doing so.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i91u9s6",
                                    "author": "boli99",
                                    "score": 1,
                                    "created_utc": 1652862205.0,
                                    "response": "10000 individual people running 10000 nodes would take 10000 legal actions in 10000 places to take all 10000 of them offline\n\n10000 nodes running under cloudflare (or any other company) takes one person to walk into  cloudflare with [the right piece of paper](https://en.wikipedia.org/wiki/Court_order) to have all 10000 of them turned off.\n\nCloudflare becomes a central point of failure.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i91ualg",
                                            "author": "WikiSummarizerBot",
                                            "score": 1,
                                            "created_utc": 1652862226.0,
                                            "response": "**[Court order](https://en.wikipedia.org/wiki/Court_order)** \n \n >A court order is an official proclamation by a judge (or panel of judges) that defines the legal relationships between the parties to a hearing, a trial, an appeal or other court proceedings. Such ruling requires or authorizes the carrying out of certain steps by one or more parties to a case. A court order must be signed by a judge; some jurisdictions may also require it to be notarized. The content and provisions of a court order depend on the type of proceeding, the phase of the proceedings in which they are issued, and the procedural and evidentiary rules that govern the proceedings.\n \n^([ )[^(F.A.Q)](https://www.reddit.com/r/WikiSummarizer/wiki/index#wiki_f.a.q)^( | )[^(Opt Out)](https://reddit.com/message/compose?to=WikiSummarizerBot&message=OptOut&subject=OptOut)^( | )[^(Opt Out Of Subreddit)](https://np.reddit.com/r/ethereum/about/banned)^( | )[^(GitHub)](https://github.com/Sujal-7/WikiSummarizerBot)^( ] Downvote to remove | v1.5)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8x2ild",
                            "author": "harpocryptes",
                            "score": 5,
                            "created_utc": 1652769977.0,
                            "response": "I agree we should always watch out for any entity getting too big of a stake. From this blog post, it seems that they understand the decentralization ethos so far.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8xiquv",
                            "author": "ItsAConspiracy",
                            "score": 2,
                            "created_utc": 1652784320.0,
                            "response": "At least they're not using Lido.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i918p93",
                            "author": "glibbertarian",
                            "score": 2,
                            "created_utc": 1652845907.0,
                            "response": "Another company running nodes makes the network less centralized.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8x3rkz",
                            "author": "2mjolk",
                            "score": 1,
                            "created_utc": 1652771040.0,
                            "response": "It will be an eternal struggle. Even now with the staking pools there is a drift towards monopolisation; all corporations try to maximize profits and eliminate competition.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8xaqqb",
                            "author": "Casino_Insider",
                            "score": -2,
                            "created_utc": 1652777374.0,
                            "response": "Look at the the centralization of the funds themselves, decentralization in crypto is pretty much a buzz word and that's all.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8yvhmr",
                    "author": "Either-Advantage",
                    "score": 1,
                    "created_utc": 1652807680.0,
                    "response": "This is going to be pushing an already really incredible company forward.  I would prefer using CloudFlare over Google any day of the week. Which chain are they going to be running these on? I'm really hoping it's something like Polygon Hermez or something else with ZK but If it's posted on the Ethereum subreddit then it being on any other L2 will put a smile on my face",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w0tj7",
                    "author": "Defiant-Inspector-14",
                    "score": -51,
                    "created_utc": 1652747576.0,
                    "response": "Piece of shit nodes?  Ha ha ha",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yk0i8",
                    "author": "Intelligent_Steak",
                    "score": 1,
                    "created_utc": 1652803022.0,
                    "response": "This is great, the more organizations we have staking and running PoS nodes, the more decentralized and resilient the network becomes.  I'm glad Cloudflare is getting involved",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91tkrg",
                            "author": "boli99",
                            "score": 1,
                            "created_utc": 1652861556.0,
                            "response": ">  the more organizations we have staking and running PoS nodes, the more decentralized\n\nbzzt. completely wrong.\n\nthe more organisations you have running nodes, the easier they are to find and the easier they are to attack (legally or even illegally)\n\ncould you attack 1000 people running 1000 nodes? you could, but it would be awkward, because that's probably 1000 different computers in 1000 different places.\n\nWhat about 1 company running a datacenter with 1000 nodes in? You could deliver the [right piece of paper](https://en.wikipedia.org/wiki/Court_order) to the owner of that building and have the whole lot turned off in a few minutes - LEGALLY.\n\nDoes that make you feel safer? or less safe? (bearing in mind that Defi terrifies most governments)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91tliv",
                                    "author": "WikiSummarizerBot",
                                    "score": 1,
                                    "created_utc": 1652861575.0,
                                    "response": "**[Court order](https://en.wikipedia.org/wiki/Court_order)** \n \n >A court order is an official proclamation by a judge (or panel of judges) that defines the legal relationships between the parties to a hearing, a trial, an appeal or other court proceedings. Such ruling requires or authorizes the carrying out of certain steps by one or more parties to a case. A court order must be signed by a judge; some jurisdictions may also require it to be notarized. The content and provisions of a court order depend on the type of proceeding, the phase of the proceedings in which they are issued, and the procedural and evidentiary rules that govern the proceedings.\n \n^([ )[^(F.A.Q)](https://www.reddit.com/r/WikiSummarizer/wiki/index#wiki_f.a.q)^( | )[^(Opt Out)](https://reddit.com/message/compose?to=WikiSummarizerBot&message=OptOut&subject=OptOut)^( | )[^(Opt Out Of Subreddit)](https://np.reddit.com/r/ethereum/about/banned)^( | )[^(GitHub)](https://github.com/Sujal-7/WikiSummarizerBot)^( ] Downvote to remove | v1.5)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8xftfp",
                    "author": "Hot_Structure8421",
                    "score": -5,
                    "created_utc": 1652781931.0,
                    "response": "What is cloudflare? I'm on so many projects right now (my fav being Shiryo) that cannot keep tract of everything, how is it related to ETH?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xftz0",
                            "author": "wikipedia_answer_bot",
                            "score": 8,
                            "created_utc": 1652781943.0,
                            "response": "**Cloudflare, Inc. is an American content delivery network and DDoS mitigation company, founded in 2010.**\n\nMore details here: <https://en.wikipedia.org/wiki/Cloudflare> \n\n\n\n*This comment was left automatically (by a bot). If I don't get this right, don't get mad at me, I'm still learning!*\n\n[^(opt out)](https://www.reddit.com/r/wikipedia_answer_bot/comments/ozztfy/post_for_opting_out/) ^(|) [^(delete)](https://www.reddit.com/r/wikipedia_answer_bot/comments/q79g2t/delete_feature_added/) ^(|) [^(report/suggest)](https://www.reddit.com/r/wikipedia_answer_bot) ^(|) [^(GitHub)](https://github.com/TheBugYouCantFix/wiki-reddit-bot)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8w4h81",
                    "author": "Tugies",
                    "score": -95,
                    "created_utc": 1652749399.0,
                    "response": "nobody gives a shit tbh. crypto is dead",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wgie0",
                            "author": "Jjabrahams567",
                            "score": 35,
                            "created_utc": 1652755473.0,
                            "response": "This puts a smile on my face because I know we are in deep value territory. ‘Crypto is dead’ is the best buy signal especially when fundamentals haven’t changed.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8wi7fx",
                                    "author": "Tugies",
                                    "score": -41,
                                    "created_utc": 1652756384.0,
                                    "response": "it puts a smile on your face because you are degenerate enough to continue burning money",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8x58nd",
                                            "author": "Dwaas_Bjaas",
                                            "score": 6,
                                            "created_utc": 1652772326.0,
                                            "response": "Your anger fuels my happiness 😊",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8whzsw",
                            "author": "its_spelled_iain",
                            "score": 34,
                            "created_utc": 1652756269.0,
                            "response": "so unsubscribe from r/ethereum",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8wvr3r",
                            "author": "Furlz",
                            "score": 5,
                            "created_utc": 1652764756.0,
                            "response": "RemindME! 6 Months \"lol\"",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8wvtsh",
                                    "author": "RemindMeBot",
                                    "score": 3,
                                    "created_utc": 1652764808.0,
                                    "response": "I will be messaging you in 6 months on [**2022-11-17 05:19:16 UTC**](http://www.wolframalpha.com/input/?i=2022-11-17%2005:19:16%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/ethereum/comments/ura484/cloudflare_is_experimenting_with_running_pos_nodes/i8wvr3r/?context=3)\n\n[**3 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fethereum%2Fcomments%2Fura484%2Fcloudflare_is_experimenting_with_running_pos_nodes%2Fi8wvr3r%2F%5D%0A%0ARemindMe%21%202022-11-17%2005%3A19%3A16%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20ura484)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8yf7ss",
                    "author": "Krkopitions",
                    "score": -3,
                    "created_utc": 1652801041.0,
                    "response": "pos will kill the eth. tnks for this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z0bpk",
                    "author": "FluxSeer",
                    "score": 0,
                    "created_utc": 1652809608.0,
                    "response": "Wow, they have no idea how PoW actually works.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}