{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz8dp0",
            "title": "L2s are a great medicine for scalability but they aren’t the cure",
            "url": "https://www.reddit.com/r/ethereum/comments/uz8dp0/l2s_are_a_great_medicine_for_scalability_but_they/",
            "author": "DeliciousNectarine8",
            "created_utc": 1653687142.0,
            "score": 66,
            "num_comments": 34,
            "subreddit": "ethereum",
            "selftext": "Now I have to clarify that Vitalik’s vision is for L2s to become so incredibly efficient that the difference between medicine and cure doesn’t even matter anymore. He wants L2s to basically become an integral part of Ethereum’s chain.\n\nBut for the meantime, my title stays true to its word. L2s are more of a very effective band aid that constantly need change from time to time.\n\nAnd that’s okay as long as L2s keep up this current pace of development.  \nSome find it toxic, but I think the rivalry between L2s is exactly what’s keeping Ethereum alive right now cause each L2 is trying to 1up the other.  \nPolygon and Loopring are both at each other’s neck and have both come up with some great tech as a result of that. We’ve also saw some aggressive development from Zksync resulting in impressive scalability number which landed them lots of funds from bitdao for ZkDAO’s development.\n\nThis is exactly what Vitalik is dreaming of, L2s grinding so hard that eventually they get so good at what they do that it all becomes seamless and part of the process where people think of L2s as part of Ethereum and basically take them for granted as a normal product not independent from Ethereum anymore.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia8rv21",
                    "author": "Either_Sign651",
                    "score": 38,
                    "created_utc": 1653687817.0,
                    "response": "Polygon, Loopring, Zksync  and Immutable X all working to make Ethereum better for everyone",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaalg2k",
                            "author": "AESTHTK",
                            "score": 5,
                            "created_utc": 1653728288.0,
                            "response": "And many more without tokens: http://l2beat.com",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaa6p9c",
                            "author": "Nonocoiner",
                            "score": 3,
                            "created_utc": 1653715640.0,
                            "response": "You forgot to mention the top 3: Arbitrum, dYdX and Optimism.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaaeup5",
                                    "author": "_JohnWisdom",
                                    "score": -2,
                                    "created_utc": 1653722273.0,
                                    "response": "You didn’t forget to shill",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaal2iq",
                                            "author": "Nonocoiner",
                                            "score": 6,
                                            "created_utc": 1653727936.0,
                                            "response": "Not shilling anything, just found it a bit strange [the largest L2's by TVL](https://l2beat.com) weren't included in this list.\n\nCurrently my personal favorite is zkSync.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iaaucc8",
                                    "author": "lorenzomofo",
                                    "score": 1,
                                    "created_utc": 1653736191.0,
                                    "response": "It’s my first time hearing about dydx. I hope they register dxdy too because I’m sure there will be plenty of typos.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iab4u8f",
                                    "author": "fplislife",
                                    "score": 1,
                                    "created_utc": 1653743111.0,
                                    "response": "dYdX is build on Starkware l2",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabhpve",
                                            "author": "Nonocoiner",
                                            "score": 2,
                                            "created_utc": 1653749817.0,
                                            "response": "Yes, good to mention that. dYdX is just an application that runs on Starkware.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaacp8y",
                    "author": "asosao_2416",
                    "score": 10,
                    "created_utc": 1653720413.0,
                    "response": "Read your post but still don’t see any explanation as to why you think L2s aren’t the cure?\n\nCan you clarify? All I read was L2s competing with each other. Would like to understand your point further.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaalalx",
                            "author": "AESTHTK",
                            "score": 3,
                            "created_utc": 1653728143.0,
                            "response": "It’s a troll post - Ethereum is following a roll-up centric roadmap:\n\nhttps://members.delphidigital.io/reports/the-hitchhikers-guide-to-ethereum/",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaaepzg",
                    "author": "PinkPuppyBall",
                    "score": 5,
                    "created_utc": 1653722155.0,
                    "response": "Title essentially says L2's are not viable long term and then text says the opposite. What's the point of this post, really?\n\nThe text reads like slightly edited crypto news. This looks suspiciously like yet another a karma farming account. Dormant for 2 years and a flood of posts in crypto subreddits the past 2 weeks only.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaalb54",
                            "author": "AESTHTK",
                            "score": 2,
                            "created_utc": 1653728157.0,
                            "response": "It’s a troll post.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia99a8q",
                    "author": "banaanigasuki",
                    "score": 2,
                    "created_utc": 1653696532.0,
                    "response": "[Fractal scaling](https://medium.com/starkware/fractal-scaling-from-l2-to-l3-7fe238ecfb4f) is the cure: congested L2? create an L3 :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9n74f",
                    "author": "sargontheforgotten",
                    "score": 3,
                    "created_utc": 1653703913.0,
                    "response": "Yes, L2’s aren’t fully mature yet and yes, competition is great for innovation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8r4oz",
                    "author": "AdhesivenessDue652",
                    "score": 2,
                    "created_utc": 1653687465.0,
                    "response": "Nice analogy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaalers",
                    "author": "AESTHTK",
                    "score": 1,
                    "created_utc": 1653728255.0,
                    "response": "This post and title is mostly misinformation.\n\nRead this instead:\n\nhttps://members.delphidigital.io/reports/the-hitchhikers-guide-to-ethereum/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabg6rj",
                    "author": "Either-Advantage",
                    "score": 1,
                    "created_utc": 1653749081.0,
                    "response": "I think rivalry is healthy, I love Polygon as it literally makes Ethereum usable for me. Wouldn't be able to afford eth gas fees if my life depended on it. It can get toxic I agree. At the end of the day we are fighting for the same goal. To grow our beloved Eth.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabqufn",
                    "author": "GBaghdo",
                    "score": 1,
                    "created_utc": 1653754091.0,
                    "response": "Polygon is not a layer2. Its a side chain.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabwlxk",
                            "author": "cestbondaeggi",
                            "score": 1,
                            "created_utc": 1653756787.0,
                            "response": "and looping is just an app built on L2 lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaaavur",
                    "author": "VRoid",
                    "score": -3,
                    "created_utc": 1653718894.0,
                    "response": "tldr, So let the Russian kid to fix bugs of Ethereum main net then ASAP.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaaolrk",
                            "author": "Oxmell",
                            "score": 1,
                            "created_utc": 1653731205.0,
                            "response": "It's not that easy...",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia974m6",
                    "author": "MoreCowbellMofo",
                    "score": -10,
                    "created_utc": 1653695409.0,
                    "response": "I don’t think this makes any sense. Both polygon and loopring and L2s in general are down massively. How are they in any way “keeping ethereum alive”… lol where do people come up with this stuff?\n\nWhat’s going on right now is consolidation. There’s been a huge attack against Luna, prior to that the market was down anyway. Weak hands are folding. Illiquid buyers are buying. We won’t be seeing these prices again for a long while after 2022/2023 as the next bitcoin halving takes place in 2024. Ethereum is abt to undergo one of the most significant changes ever which could see it placed in prime position to dominate finance for the next 5-15 years.\n\nEthereum killers have 1/10th the user base at most and will face the exact same problems as ethereum did. Some are even ethereum forks with a few parameter tweaks. They’ve all had problems from what I’ve seen. I don’t see any value in them. They’re offering the same base layer but without the developer ecosystem/developer count/developer uptake. They are not innovating. They’re not leading. They’re doomed from the start. Everyone wants to corner the market but they’re using the technology of yesterday that’s been tried, tested and failed to scale. \n\nWhat’s going on now has nothing to do with L2s. Enjoy it whilst it lasts.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia99a6y",
                            "author": "FaceDeer",
                            "score": 7,
                            "created_utc": 1653696532.0,
                            "response": "In what way are L2s \"down massively\"? According to [L2beat](https://l2beat.com/) they've actually slightly increased their total value locked over the past week.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia9ck1b",
                                    "author": "MoreCowbellMofo",
                                    "score": -4,
                                    "created_utc": 1653698264.0,
                                    "response": "In the way that the whole market is down 60%. Loopring peaked at $3.50.. it’s trading at <0.50.. so down 85%ish. When I checked polygon a while back it’s market cap was double what it is today… that’s a pretty big drop",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia9ft3w",
                                            "author": "FaceDeer",
                                            "score": 6,
                                            "created_utc": 1653699990.0,
                                            "response": "Oh, you're measuring by the value of the L2-specific tokens, rather than by how much usage the L2s are actually getting? I care more about the latter than about the former. Some L2s don't even have native tokens.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia9hdly",
                                                    "author": "MoreCowbellMofo",
                                                    "score": 0,
                                                    "created_utc": 1653700828.0,
                                                    "response": "Some don’t have native tokens yet.. there probably will be a few more given some time. Starkware has a whole bunch of systems and completed $100m round of investment based on an $8bn valuation. There value went up 4x in 1 yr. why? Because of the deal with GameStop. Looprings fair value should be at least $10 really. Why? Because if ethereum is the financial system of the future it’s massively undervalued by as much as 10x minimum I’d say. As such if L2s are the scaling solution, loopring should be 10x to more or less directly correlate. Chances are however it could do far better than that as it corners market share in the crypto gamefi and defi space due to the userbase exploding from ethereum and GameStop simultaneously. We won’t see anything like that level of uptake with Polygon/other L2s for at least 1-2 yrs which is how long it’s currently taken for GameStop to get this far… so ultimately I think loopring will do very well. 10x-100x seems perfectly reasonable to me over the next yr or two.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia9yilf",
                                            "author": "Digitlnoize",
                                            "score": 4,
                                            "created_utc": 1653710052.0,
                                            "response": "Or it’s up almost 100% from its baseline a year ago lol 🤷‍♂️. But it’s not it’s price today that matters.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia9ay0q",
                            "author": "Lippshitz",
                            "score": 0,
                            "created_utc": 1653697408.0,
                            "response": "Ok so you disagree with vitalik?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia9cx85",
                                    "author": "MoreCowbellMofo",
                                    "score": 4,
                                    "created_utc": 1653698460.0,
                                    "response": "Vitalik is not god. He was promoting OMG back in 2018. Today he’s promoting zk proofs as a potential longer term solution to scalbility and a zk evm protocol. Why? Because they’re simpler to build for and simpler to understand. \n\nLoopring is a centralised organisation. Polygon is a centralised organisation. Ex ceo of loopring has now started a decentralised zk solution. I’m sure vitalik is in the loop or will be soon. I mostly follow loopring as I believe it’s a superior chain with greater potential than polygon given its partnership with GameStop and an ex loopring employee working at GameStop to promote it.\n\nIn response to my not agreeing with vitalik… I can’t possibly know what point your referencing here. But in terms of what OP claimed - “L2s are keeping ethereum alive” - they aren’t. It’s a wrong analysis of what’s going on. But it did catch my attention … which is why I’m commenting\n\nI’d also add that OPs account doesn’t inspire much confidence that they know what they’re talking about either. A few posts from 2-3 months ago and then some crypto related ones more recently.. seems like a spam acct to me?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia9ermf",
                                            "author": "Lippshitz",
                                            "score": 0,
                                            "created_utc": 1653699444.0,
                                            "response": "Oh gotcha. Im not well read in crypto like you. I am a LRC and GME fan. Just sorta went with whatever vitalik says.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia9gnn6",
                                                    "author": "MoreCowbellMofo",
                                                    "score": 3,
                                                    "created_utc": 1653700447.0,
                                                    "response": "He’s smart don’t get me wrong. But I think it’s wise to remember he’s just one guy. He has influence for sure but he has a much smaller community (3.9m on Twitter) following him than Elon musk (95m). So when vitalik tweets some impact is seen… when Elon tweets, the ground moves and we see 10% moves.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iablrre",
                    "author": "MillennialBets",
                    "score": 0,
                    "created_utc": 1653751718.0,
                    "response": "Eh, scaling the blockchain with more and more layers in a fractal like system seems like the most likely and complete solution to infinite scalability with different protocols",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}