{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqr8j0",
            "title": "Ethereum Deflationary or Inflationary",
            "url": "https://www.reddit.com/r/ethereum/comments/uqr8j0/ethereum_deflationary_or_inflationary/",
            "author": "Tangang97",
            "created_utc": 1652690413.0,
            "score": 5,
            "num_comments": 2,
            "subreddit": "ethereum",
            "selftext": "I made some research about the inflation rate of Ethereum, but different rates have always been quoted. As far as I understand it, there is a basic 4% inflation rate, which is reduced by how much of the transaction costs are burned. There is also occasionally talk of deflationary rates, but that refers more to the transaction peak of isolated days or?\n\nCan anyone recommend me a source that reflects the inflation rate properly? \n\nIt is also often said that after the merge Ethereum should become deflationary, but I do not understand how that should be the case, since rather less is burned by the higher utilization possibility.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8svcjv",
                    "author": "g_squidman",
                    "score": 3,
                    "created_utc": 1652694826.0,
                    "response": "Yeah, it's complicated and it's scheduled to change probably later this summer after the merge.\n\nThe merge doesn't affect blocksizes. It won't reduce fees, so the burn rate will stay relatively the same. It just reduces issuance by a lot, and people expect the new issuance to come a lot closer to the average burn rate.\n\nIt's not exactly correct to call Ethereum deflationary though. Even if more coins are burned than are printed to miners, this would only reduce the supply temporarily. Issuance should hit a theoretical equilibrium point where the same amount are burned as are minted.\n\nwatchtheburn.com is a site that tracks these numbers in real time. But for after the merge, we only have some predictions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8swaq7",
                    "author": "PinkPuppyBall",
                    "score": 1,
                    "created_utc": 1652695644.0,
                    "response": "There are a few variables at play, you can play around over at https://ultrasound.money/ at the bottom to simulate how it will play out.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}