{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqrbe2",
            "title": "A magical week for coaching god Ancelotti",
            "url": "https://www.nowgoal.com/article/8754",
            "author": "jimmyrok9",
            "created_utc": 1652690791.0,
            "score": 3,
            "num_comments": 0,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uqrgqt",
            "title": "Ethereum’s Vitalik Buterin: Terra Should Prioritize Smallholders in Any Proposed Reimbursement Plan",
            "url": "https://timestabloid.com/ethereums-vitalik-buterin-terra-should-prioritize-smallholders-in-any-proposed-reimbursement-plan/",
            "author": "Solodeji",
            "created_utc": 1652691490.0,
            "score": 407,
            "num_comments": 51,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8t0l7e",
                    "author": "frank__costello",
                    "score": 52,
                    "created_utc": 1652699038.0,
                    "response": "The LFG and Terraform Labs have limited funds. The only options are:\n\n* No reimbursment\n* Reimburse all UST at roughly $0.10\n* Reimburse UST at $1, but capped per account",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tnsm9",
                            "author": "420everytime",
                            "score": 28,
                            "created_utc": 1652711517.0,
                            "response": "The more likely one is take the Bitcoin reserves for itself and spend it on legal fees",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tp8ip",
                                    "author": "lorenzomofo",
                                    "score": 8,
                                    "created_utc": 1652712135.0,
                                    "response": "“We know the users would have wanted it that way as evidenced by their incessant hodling.”",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8u6y8x",
                                    "author": "atict",
                                    "score": 1,
                                    "created_utc": 1652719392.0,
                                    "response": "That's one way to get yourself suicided.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8tprux",
                            "author": "lorenzomofo",
                            "score": 8,
                            "created_utc": 1652712365.0,
                            "response": "4th option: burn the excess assets in a last ditch attempt to push up the value of UST.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8t73iy",
                            "author": "KlopKlop10293",
                            "score": -11,
                            "created_utc": 1652703243.0,
                            "response": "They shouldn’t reimburse anyone, the protocol went as written in the whitepaper, it was badly designed yes but it was transparent\n\nThis would also set a very bad precedent for all other tokens and stablecoins and if company aren’t doing for stock’s prices why should luna do it",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tbwmf",
                                    "author": "Nyucio",
                                    "score": 24,
                                    "created_utc": 1652705901.0,
                                    "response": "So instead they should keep the money and run away with it? \n\nIs that what you are saying? Because no one (sane) is going to use UST anymore.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8tev2n",
                                    "author": "cannedshrimp",
                                    "score": -5,
                                    "created_utc": 1652707402.0,
                                    "response": "When a company goes bankrupt it DOES have to pay back investors. This comment makes no sense.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8tgonc",
                                            "author": "billthepi11",
                                            "score": 18,
                                            "created_utc": 1652708296.0,
                                            "response": "No. It has to pay back debtors. Investors get fucked.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8tt8gq",
                                                    "author": "cannedshrimp",
                                                    "score": 1,
                                                    "created_utc": 1652713814.0,
                                                    "response": "If there are enough assets investors do get paid back. It’s common that they don’t because debtors get paid back first. You can argue the order that people get paid back in, but suggesting that no repayment is an option before repaying investors is a perfect example of why these projects, which are basically unregistered securities are going to be a regulatory disaster for the whole space.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8trbjg",
                                            "author": "Bluered2012",
                                            "score": -1,
                                            "created_utc": 1652713018.0,
                                            "response": "Sorry what?? You actually believe that if a publicly traded company goes bust it has to pay back the shareholders?  \n\nIt could be you live in a country in which this is the law, please let me know so I can invest asap.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8tsq8q",
                                                    "author": "cannedshrimp",
                                                    "score": 3,
                                                    "created_utc": 1652713601.0,
                                                    "response": "This is US specific. Shareholders do get paid back. They are just last in the pecking order to be repaid. Either way, there is a proceeding for repayment. The owner of the company doesn’t get to just walk away with the remaining assets as you are suggesting should be the case. \n\nhttps://work.chron.com/gets-paid-first-company-goes-bankrupt-7496.html\n\nThe fact that I am being this heavily downvoted is embarrassing for this sub",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8u016z",
                                                            "author": "Bluered2012",
                                                            "score": 2,
                                                            "created_utc": 1652716616.0,
                                                            "response": "No it isn’t. First of all, it’s a sub for crypto. \n\nSecond of all, saying that shareholders get paid back, like you did, is a massive oversimplification of what actually happens. And makes no sense in the context of the Luna/USDT conversation. \n\nAnyways. I should be working, not arguing about something that is pointless to debate here. You are right in what you said, it just happens so rarely it’s not worth bringing up. The long list of groups that get paid back before the shareholders, who are last, almost always depletes all of the resources. It’s not like the company walked into bankruptcy with healthy accounts.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8u8xp5",
                            "author": "Mefilius",
                            "score": 1,
                            "created_utc": 1652720173.0,
                            "response": "That third option feels the best honestly. It's the closest to insurance and I think it would put some of the folks calling for high regulation at ease at least a little bit.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ssu0f",
                    "author": "coinfeeds-bot",
                    "score": 22,
                    "created_utc": 1652692530.0,
                    "response": "tldr; Ethereum Co-founder Vitalik Buterin has expressed his support for the Terra project’s proposed reimbursement plan for small UST (LUNA) and TerraUSD (UST) holders. He tweeted, “Strongly support this. Coordinated sympathy and relief for the average UST smallholder who got told something dumb about “20% interest rates on the US dollar” by an influencer, personal responsibility and SFYL for the wealthy.”\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8t07kk",
                    "author": "ivgur",
                    "score": 17,
                    "created_utc": 1652698776.0,
                    "response": "this would totally show the superiority of crypto> any industry as the latter tend to save the whales and leave shrimps die",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8thitj",
                            "author": "Tilligan",
                            "score": 9,
                            "created_utc": 1652708688.0,
                            "response": "This proposal is basically what was done for Madoff's clients.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8u4fqe",
                            "author": "forestballa",
                            "score": 5,
                            "created_utc": 1652718392.0,
                            "response": "You know what would show the superiority of crypto? If this didn’t happen in the first place.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8u532k",
                                    "author": "ivgur",
                                    "score": 2,
                                    "created_utc": 1652718654.0,
                                    "response": "true but gotta work with what we have I guess",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8uen42",
                            "author": "thingscouldbeworse",
                            "score": 1,
                            "created_utc": 1652722444.0,
                            "response": "What? Actual financial instruments have mechanisms in place to prevent this in the first place... and in the case of a bank run your money is insured, not proposed at being reimbursed for 1/10th the value.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8t180m",
                    "author": "Maswasnos",
                    "score": 10,
                    "created_utc": 1652699483.0,
                    "response": "It's the right move for sure. Lots of low-info retail got suckered into UST by \"trusted\" personalities in crypto and the 20% APY in Anchor; if we're going to be bailing anyone out it should be them rather than whales/funds who should know better. \n\nI'm generally against bailouts on principle, but LFG has already decided to do one and this is simply about deciding who gets it and how much they receive. \n\nFWIW, Binance/CZ is also on board with this plan despite being a huge holder of LUNA:\n\nhttps://twitter.com/cz_binance/status/1526129841376043008",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tgp18",
                            "author": "flygoing",
                            "score": 14,
                            "created_utc": 1652708301.0,
                            "response": "\"I'm generally against bailouts on principle\" to be clear, this isn't an external bailout. This is taking money that is designated to support the peg, and distributing it directly instead of using it for further buybacks. Very hard time calling that a bailout",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8trpkl",
                    "author": "jlevy1126",
                    "score": 4,
                    "created_utc": 1652713182.0,
                    "response": "So we want the protections of FDIC but not follow any of the legal structure that banks do? I truly don't understand, to me it seems people want their cake and eat it too type of scenario.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tv1kb",
                            "author": "Tre-Ursus",
                            "score": 1,
                            "created_utc": 1652714568.0,
                            "response": "He's saying to use FDIC protections as precedent. That Luna should honor the peg up to $250,000 per account. If a fund was holding $200,000,000 in an account, that's on them.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tvltc",
                                    "author": "jlevy1126",
                                    "score": 2,
                                    "created_utc": 1652714806.0,
                                    "response": "FDIC only has precedent because of the legal requirements surrounding banks and funds in deposit accounts. No crypto is bound by the same structure of legal protections. It's like giving your buddy 10k to put under his mattress for safe keeping and when he gets robbed expecting him to give you the 10k because of FDIC precedence.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8uaiva",
                                            "author": "ihcn",
                                            "score": 1,
                                            "created_utc": 1652720798.0,
                                            "response": "This is a top-down proposal, my dude. Nobody is \"expecting\" this to happen, the people in charge are volunteering this policy.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8udfws",
                                                    "author": "jlevy1126",
                                                    "score": 1,
                                                    "created_utc": 1652721965.0,
                                                    "response": "You're missing my point, but that's ok. Have a good one.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8t6f71",
                    "author": "mongartus",
                    "score": 2,
                    "created_utc": 1652702828.0,
                    "response": "That stock head shot has had a lot of screen time. But I agree, if they can make the bottom 99.6% whole then that's the best course they could take.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ubrgk",
                    "author": "upscaleHipster",
                    "score": 1,
                    "created_utc": 1652721294.0,
                    "response": "I'm surprised to hear about reimbursement. Even anything is better than nothing as a gesture of goodwill.\n\nMakerDAO didn't reimburse any of their early adopters when vaults got liquidated and $8M worth of ETH got sold for $0.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}