{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "r742ud",
            "title": "Silk Road Founder Ross Ulbricht to Launch NFT Collection on Ethereum",
            "url": "https://decrypt.co/87404/silk-road-founder-ross-ulbricht-launch-nft-collection-ethereum",
            "author": "ledonskim754",
            "created_utc": 1638439108.0,
            "score": 914,
            "num_comments": 358,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "hmxd7m2",
                    "author": "LucidsESO",
                    "score": 23,
                    "created_utc": 1638450093.0,
                    "response": "Ah yes, the Dread Pirate collection.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hmx0e1f",
                    "author": "coinfeeds-bot",
                    "score": 37,
                    "created_utc": 1638441021.0,
                    "response": "tldr; Silk Road founder Ross Ulbricht is auctioning a line of NFTs detailing various points in his life, from childhood to his time in prison. The auction will run from December 2-8 on the SuperRare NFT platform, curated by Entoptic. The collection will include artwork, writings, and original animation by digital artist Levitate.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hmy238m",
                            "author": "pugRescuer",
                            "score": -31,
                            "created_utc": 1638461412.0,
                            "response": "> detailing various points in his life\n\nHe's a criminal, if people seriously buy these I'll lost some confidence in this crypto space.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hmyafau",
                                    "author": "Thorbinator",
                                    "score": 26,
                                    "created_utc": 1638464644.0,
                                    "response": "He's a hero. Fuck the US government. Crypto was created because we needed decentralization, aka removing the power of centralized authorities, chief of which is the US government.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hmz8e0f",
                                            "author": "pugRescuer",
                                            "score": -6,
                                            "created_utc": 1638477715.0,
                                            "response": "Oh boy... a hero is a bit of a stretch but ok.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hn0gf9g",
                                                    "author": "TriggerWarning595",
                                                    "score": 2,
                                                    "created_utc": 1638496084.0,
                                                    "response": "He risked his own freedom to protect the freedom of others.\n\nThat’s a hero. If you don’t appreciate what he did, you’re welcome to cry to big brother about it. \n\nWhile your at it, please leave crypto. We don’t need authoritarians in a decentralized space.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hn0s4ei",
                                                            "author": "pugRescuer",
                                                            "score": 0,
                                                            "created_utc": 1638501216.0,
                                                            "response": "Ross is not a martyr. I don't give a fuck one way or the other about silk road and Ross. He and Silk road aren't crypto so there is no crying to big brother (whoever that is). There is just crypto, Ross in jail and your silk road retired. \n\nI'll stay because I was here well before you were born.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hn0z1zk",
                                                                    "author": "TriggerWarning595",
                                                                    "score": 0,
                                                                    "created_utc": 1638504411.0,
                                                                    "response": "Ross’s operation worked through crypto. And by big brother I mean government. The government you’re happy is imprisoning a dude who ran an online marketplace.\n\nI’m gonna be honest. This fact might be really scary to you but the government actually can’t control a blockchain. I know, right? You should avoid it to prevent crime and get a 0.02% apr savings account instead.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hn21g73",
                                            "author": "AxelTheRabbit",
                                            "score": 1,
                                            "created_utc": 1638531336.0,
                                            "response": "I mean, he tried to kill 2 people",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hn0g09l",
                                    "author": "TriggerWarning595",
                                    "score": 3,
                                    "created_utc": 1638495900.0,
                                    "response": "If you don’t believe in the liberty to sell/buy drugs, please get the fuck out of a decentralized space\n\nCrypto has no place for you. This is a platform where people can do anything they want. \n\nIf you don’t like drug sales, go cry to big brother and open a 0.02% APR savings account.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hn0ge8w",
                                            "author": "pugRescuer",
                                            "score": 1,
                                            "created_utc": 1638496072.0,
                                            "response": "> please get the fuck out of a decentralized space\n\nOh fuck off. Selling and buying drugs has nothing to do with the conversation at hand which is about how Ross broke the fucking law. And it wasn't just selling drugs, it was money laundering, potentially hiring a hitman, all sorts of shit that has NOTHING to do with crypto or buying and selling drugs. Kindly fuck off with your bullshit argument.\n\n> cry to big brother and open a 0.02% APR savings account.\n\nYou must be a teenager still living at home.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hn0zsy0",
                                                    "author": "TriggerWarning595",
                                                    "score": 0,
                                                    "created_utc": 1638504769.0,
                                                    "response": "So first off you want dude charged for a potential crime. Kinda sets off a red flag about you\n\nSecond off, the only reason you’d need to launder is because your sales are unjustly illegal in the first place. Would’ve never been a crime \n\nHonest question. If you prefer licking boots so much, why invest invest in a decentralized technology? This fact might scare you, but daddy Biden/Trump (whichever you prefer) can’t control a public blockchain. \n\nReality is people like me are going to use this to buy drugs. If you wanna cry about it, I’d recommend bonds or an index fund if you’re not feeling savings accounts.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hn12t1d",
                                                            "author": "pugRescuer",
                                                            "score": 1,
                                                            "created_utc": 1638506219.0,
                                                            "response": "> you want dude charged for a potential crime\n\nNo it doesn’t, Ross was guilty af. Come the fuck on. \n\n> the only reason you’d need to launder is because your sales are unjustly illegal in the first place. Would’ve never been a crime\n\nYes, when you profit off of selling merchandise that is illegal, you have to launder it to make it legal. \n\nI don;’t lick boots, don’t judge me or try to infer who and what I am. You can buy drugs all you want, I don’t care but that has zero to do with Ross’ guilt. Period. End of story. No crying here.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hn3nv6y",
                                                                    "author": "TriggerWarning595",
                                                                    "score": 1,
                                                                    "created_utc": 1638558072.0,
                                                                    "response": "“Woah there. Literally any crime is illegal and should he punished to the extent of the law. No, I’m not a bootlicker, why?”\n\nLMAO",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hmy8edk",
                                    "author": "oneAJ",
                                    "score": 7,
                                    "created_utc": 1638463878.0,
                                    "response": "He's a criminal in the US courts. The same courts will define you as a criminal if your skin is black so the term 'criminal' is more a judgment on the justice system than the person sentenced.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hmyfztc",
                                            "author": "Screwshank",
                                            "score": -5,
                                            "created_utc": 1638466769.0,
                                            "response": "Oh come on. The laws are fucked and I agree with the sentiment but the courts don't just send you to jail for being black lol.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hmz8nxh",
                                            "author": "pugRescuer",
                                            "score": -5,
                                            "created_utc": 1638477821.0,
                                            "response": "Don't like it change the law instead of worshiping a defined criminal.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hmze40g",
                                                    "author": "AsusWindowEdge",
                                                    "score": 5,
                                                    "created_utc": 1638479863.0,
                                                    "response": "hahahaha....\n\nHow old are you?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hmzngjd",
                                                            "author": "pugRescuer",
                                                            "score": -6,
                                                            "created_utc": 1638483452.0,
                                                            "response": "Old enough to know your perspective is ignorant at best.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hmztreb",
                                                                    "author": "AsusWindowEdge",
                                                                    "score": 4,
                                                                    "created_utc": 1638486024.0,
                                                                    "response": "The criminals created the \"law\" (rules for thee, not for me).  Good luck trying to change them.  You'll be Epsteined right away!  FFS, how unawake can you be?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hn0gwuo",
                                                                            "author": "TriggerWarning595",
                                                                            "score": 2,
                                                                            "created_utc": 1638496294.0,
                                                                            "response": "Anyone who thinks the law should be followed 100% would almost certainly be a Nazi if they were a German citizen in 1941",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "hn04jsw",
                                                                            "author": "pugRescuer",
                                                                            "score": 0,
                                                                            "created_utc": 1638490731.0,
                                                                            "response": "True or false: Ross Ulbricht committed no crimes.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hn07tp5",
                                                                                    "author": "oneAJ",
                                                                                    "score": 2,
                                                                                    "created_utc": 1638492223.0,
                                                                                    "response": "His crime was allowing people the freedom to choose what they do with their own bodies which in many cases means giving people the opportunity to buy drugs/medicines to improve their lives.\n\n&#x200B;\n\nThe war against drugs was started to allow the US government to attack the black and hippie communities. They didn't like black people because they're racist and they didn't like hippies because they objected to their numerous wars.\n\n&#x200B;\n\nWhos a criminal now you ignorant, uninformed dumb ass?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hn0atzw",
                                                                                            "author": "pugRescuer",
                                                                                            "score": 1,
                                                                                            "created_utc": 1638493590.0,
                                                                                            "response": "It's comical how pedantic this discussion is. I'm an uninformed dumb ass? Come on now. The dude broke the law, not sure how you can argue that. The sentence may be harsh but mother fucking literally broke a handful of laws. 🤦‍♂️",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "hn0gqlt",
                                                                    "author": "TriggerWarning595",
                                                                    "score": 1,
                                                                    "created_utc": 1638496219.0,
                                                                    "response": "Oh shit buddy it looks like we’re hurting your feelings. Have you considered crying to big brother about it?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hn0rq2r",
                                                                            "author": "pugRescuer",
                                                                            "score": 1,
                                                                            "created_utc": 1638501037.0,
                                                                            "response": "Nah, my feelings are fine. Thinking you hurt my feelings speaks to how ignorant you are to all of this.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hn0gn8t",
                                                    "author": "TriggerWarning595",
                                                    "score": 0,
                                                    "created_utc": 1638496180.0,
                                                    "response": "Just to let you know, if you were in Germany on 1941 you could certainly be a Nazi with that attitude",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hn0sklc",
                                                            "author": "pugRescuer",
                                                            "score": 1,
                                                            "created_utc": 1638501421.0,
                                                            "response": "You are pulling the hitler nazi argument... come the fuck on you ignorant asshole. Ross is a criminal by definition of a lot of fucking countries, not just the US.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hn3nxe9",
                                                                    "author": "TriggerWarning595",
                                                                    "score": 1,
                                                                    "created_utc": 1638558097.0,
                                                                    "response": "Anti-Nazis were criminals by definition. What’s your point?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hmy4is4",
                                    "author": "Slapbox",
                                    "score": -2,
                                    "created_utc": 1638462370.0,
                                    "response": "You know bitcoin was probably created by a criminal?\n\nhttps://www.google.com/amp/s/bitcoinexchangeguide.com/paul-solotshi-le-roux/%3famp",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hmz8h2z",
                                            "author": "pugRescuer",
                                            "score": 2,
                                            "created_utc": 1638477748.0,
                                            "response": "Criminals can do things that aren't criminal.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hmzgulo",
                                            "author": "AsusWindowEdge",
                                            "score": 1,
                                            "created_utc": 1638480892.0,
                                            "response": "Paul thought he could snitch and get a free ride.  Feds do NOT like smart people AT ALL, especially if these people can't become captains of industry and give the FEDS a cushy 6-figure job with all the benefits at a multinational company later in life.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hn0sdnp",
                                                    "author": "pugRescuer",
                                                    "score": 0,
                                                    "created_utc": 1638501334.0,
                                                    "response": "Your ignorance is comical.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hn25jek",
                                                            "author": "AsusWindowEdge",
                                                            "score": 1,
                                                            "created_utc": 1638534220.0,
                                                            "response": "Bro, if you are some random person making a little money via a salary or you sell things to your masters (public servants), you go through life pretty much licking their boots and they don't care about you.\n\nNow, if you do your own business earning millions and won't share your loot with these self-appointed delusional parasitical unproductive gang members under the guise of \"gov.\" then you are in for a real treat....as soon as they \"discover\" you.  \n\nBless your heart!\n\nPS.  Quick self-analysis.  Look in the mirror and ask honestly yourself the following questions:  \n\n* Did my writings feel like they hurt you mentally?  \n* Did they elicit anger?  \n* If affirmative, it's called cognitive dissonance.  \n\nI can tell they did, because you started the argumentum ad hominem fallacy.  Look it up:  [https://duluthreader.com/articles/2017/05/31/108643-ad-hominem-attacks-and-the-power-of-ignorance](https://duluthreader.com/articles/2017/05/31/108643-ad-hominem-attacks-and-the-power-of-ignorance)",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hn2h7o0",
                                                                    "author": "pugRescuer",
                                                                    "score": 0,
                                                                    "created_utc": 1638540698.0,
                                                                    "response": "You are trying far too hard for internet points.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hn2levf",
                                                                            "author": "AsusWindowEdge",
                                                                            "score": 1,
                                                                            "created_utc": 1638542621.0,
                                                                            "response": "Dude, I FatFIREd a long time ago.  I don't care if you live or die. I don't care for your kind at all.  Bye",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hn2n8d4",
                                                                                    "author": "pugRescuer",
                                                                                    "score": 0,
                                                                                    "created_utc": 1638543419.0,
                                                                                    "response": "You seem to care quite a bit with how much time you spend spewing bullshit all over the place.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hn2wtm4",
                                                                                            "author": "AsusWindowEdge",
                                                                                            "score": 1,
                                                                                            "created_utc": 1638547403.0,
                                                                                            "response": "I FatFIREd a long time ago!  I got NOTHING else to do with my time except working out (powerlifting & boxing), going to the spa, hiking & boating, and getting on the laptop to see how the \"other world\" lives...... I get such a dopamine spike from seeing suckers get taken by the cabal 😂🤣😂🤣😂🤣",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hmz8u4j",
                                    "author": "Mindless_-_Data",
                                    "score": 1,
                                    "created_utc": 1638477887.0,
                                    "response": "Harriet Tubman was a criminal! If people seriously put her in art I'll lose all confidence in the space.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hmzdxna",
                                    "author": "AsusWindowEdge",
                                    "score": 0,
                                    "created_utc": 1638479795.0,
                                    "response": ">He's a criminal\n\nReally?\n\nWhat do you call these people?\n\n[MORE THAN 70 CHILDREN KILLED IN JUST 10 AIRSTRIKES IN AFGHANISTAN, REPORT FINDS.   The Bureau of Investigative Journalism analyzed 10 strikes by the U.S. military and the U.S.-backed Afghan air force and found 115 civilians were killed.](https://theintercept.com/2020/06/03/children-killed-airstrikes-afghanistan-tbij-report/)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hmxg45k",
                    "author": "Cryptokooi89",
                    "score": 70,
                    "created_utc": 1638451684.0,
                    "response": "He's out of prison?\n\n&#x200B;\n\nEDIT: No, he's not I just read. Two times lifetime + 40 years.... Very sad, he was a pioneer.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hmxne5n",
                            "author": "I_SUCK__AMA",
                            "score": 29,
                            "created_utc": 1638455224.0,
                            "response": "Too bad he didn't do this earlier, trump was selling pardons for $2 million each:  https://duckduckgo.com/?q=trump+sell+pardons+%242+million&t=fpas&ia=web",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hmzmhwe",
                                    "author": "abittooambitious",
                                    "score": 5,
                                    "created_utc": 1638483077.0,
                                    "response": "Ddg, nice.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hmxl7p7",
                            "author": "wanszai",
                            "score": -37,
                            "created_utc": 1638454216.0,
                            "response": "Pioneer?\n\nIs that what we are calling people who tried to have people killed nowadays?\n\nI love the idea of the silkroad, i might have even used it and the various others sites that popped up afterwards but trying to have people killed in real life is wrong.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hmxnu5g",
                                    "author": "theascendedcarrot",
                                    "score": 20,
                                    "created_utc": 1638455423.0,
                                    "response": "They call him a pioneer because of his contributions to silk road. The jury is still out on whether he actually paid for murder. If he did though, that doesn't nullify the fact that he was a pioneer in the digital marketplace space. This is also not to say that his (alleged) malicious actions are justified by any means. Compartmentalization is a good skill to have.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hmz7jlq",
                                            "author": "gkboy777",
                                            "score": 2,
                                            "created_utc": 1638477394.0,
                                            "response": "It seems pretty clear that he tried to have multiple people killed in different situations",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hmzdj4h",
                                                    "author": "AsusWindowEdge",
                                                    "score": -3,
                                                    "created_utc": 1638479642.0,
                                                    "response": ">tried???\n\nWhat do we call those who actually kill people?\n\n[MORE THAN 70 CHILDREN KILLED IN JUST 10 AIRSTRIKES IN AFGHANISTAN, REPORT FINDS. The Bureau of Investigative Journalism analyzed 10 strikes by the U.S. military and the U.S.-backed Afghan air force and found 115 civilians were killed.](https://theintercept.com/2020/06/03/children-killed-airstrikes-afghanistan-tbij-report/)",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hmxo0p9",
                                            "author": "wanszai",
                                            "score": -7,
                                            "created_utc": 1638455504.0,
                                            "response": "If the Jury is still out.... why he in jail?\n\n&#x200B;\n\nTo clarify, ive done quite a bit of research on this as its a super interesting topic, there are even a few documentaries on this very subject and a wealth of reading material.\n\nI understand your talking about the DPR name being passed around, but its been pretty conclusively proven by various methods that that wasn't the case. He didn't give this technology out to use freely, he profited from it and profited significantly. When he was getting blackmailed he tried to put a hit out on someone. Once he did one he started to put out more. \n\nDude thought he was scarface. \n\nYou can romanticize it all you like and i get it, i used to too. But do the research, guy was fucking fruit loop. A talented fruit loop that could have been paid just as well doing legal things but chose to be an online gangsta and got caught. nothing more.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hmxoi43",
                                                    "author": "theascendedcarrot",
                                                    "score": 17,
                                                    "created_utc": 1638455724.0,
                                                    "response": "His charges are money laundering, computer hacking and conspiracy to traffic narcotics. Those are why he is in jail.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hmxp5de",
                                                            "author": "wanszai",
                                                            "score": -7,
                                                            "created_utc": 1638456011.0,
                                                            "response": "And these are not malicious actions?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hmxrb13",
                                                                    "author": "theascendedcarrot",
                                                                    "score": 13,
                                                                    "created_utc": 1638456947.0,
                                                                    "response": "I don't know what you are getting at. I stated in a previous comment that they were not justified. People are capable of bringing both greatness and evil into the world at the same time. I'm not romanticizing anything, just viewing everything objectively. Criminal actions bad, contribution to an open digital market good.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "hmy9eqk",
                                                                    "author": "shepdozejr",
                                                                    "score": 3,
                                                                    "created_utc": 1638464260.0,
                                                                    "response": "And the goalposts move",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hmyah6w",
                                                                            "author": "wanszai",
                                                                            "score": 2,
                                                                            "created_utc": 1638464664.0,
                                                                            "response": "Al capone's sentence for tax evasion was harsh until you consider the other actions he was involved in.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hrt92m5",
                                                                                    "author": "shepdozejr",
                                                                                    "score": 1,
                                                                                    "created_utc": 1641669300.0,
                                                                                    "response": "Unproven in a court of law. You can’t sentence someone based on crimes they haven’t been convicted of.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "hmy8tjf",
                                                                    "author": "elmosworld37",
                                                                    "score": 1,
                                                                    "created_utc": 1638464037.0,
                                                                    "response": "My friend, do you know what non-violent crime is",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hmy8x0s",
                                                                            "author": "wanszai",
                                                                            "score": -3,
                                                                            "created_utc": 1638464073.0,
                                                                            "response": "A crime?\n\nEnron was a non violent crime.\n\nBernie Madoff was a non violent criminal.\n\nShould we start releasing people now or do you want to think this through further?\n\n&#x200B;\n\nAlso, its probably fair to say he crossed that line when trying to pay people to murder other people.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hmy9hhf",
                                                                                    "author": "elmosworld37",
                                                                                    "score": -2,
                                                                                    "created_utc": 1638464289.0,
                                                                                    "response": "Lmao get a load of this narc, he thinks crime always equals bad.\n\nLaw and morality and two separate concepts. Just because we try to codify morality in law doesn’t always mean we succeed. Also, morality is subjective.\n\nYou’ll learn this when you get to college; for now, you should be enjoying 8th grade instead of being on reddit all day.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hmya1ke",
                                                                                            "author": "wanszai",
                                                                                            "score": 1,
                                                                                            "created_utc": 1638464497.0,
                                                                                            "response": "You know how to tell when someone cant come up with a good rebuttal?\n\nThey call you a child.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "hmy9kp8",
                                                                    "author": "iamedreed",
                                                                    "score": 0,
                                                                    "created_utc": 1638464323.0,
                                                                    "response": "not worthy of a life sentence",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hmya8n5",
                                                                            "author": "wanszai",
                                                                            "score": 2,
                                                                            "created_utc": 1638464573.0,
                                                                            "response": "Maybe, maybe not. But a Jury of his peers seemed to think so.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hmyde2v",
                                                                                    "author": "covidparis",
                                                                                    "score": 1,
                                                                                    "created_utc": 1638465772.0,
                                                                                    "response": "People think a lot of things. When you ask them why they have right to decide what substances others put into their bodies they can't even give you a proper answer. These are the sort people that convict someone for growing a natural plant in their own home, then they leave the courthouse and go for an alcoholic drink. Clearly these laws are wrong and immoral. It's the law that's criminal here.\n\nWe all agree that murder is wrong. The murder accusation seems like a total fabrication, there is no evidence for it. A smear to make him look bad. Ulbricht also didn't even sell drugs, his \"crime\" was creating a website that facilitated free decentralized trade.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hmz8ai8",
                                    "author": "Mindless_-_Data",
                                    "score": 2,
                                    "created_utc": 1638477678.0,
                                    "response": "> people who tried to have people killed\n\nThat he was never charged with because there wasn't nearly enough evidence. And then the investigators that accused him of that ended up being crooks that stole a bunch of Silk Road's BTC, so we *really* shouldn't be taking their word for it.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hmxtcfs",
                                    "author": "bro-guy",
                                    "score": 2,
                                    "created_utc": 1638457825.0,
                                    "response": "Totally agree with you. Don't understand the people defending them, they don't have a clue what he actually did",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hmyezcs",
                                            "author": "Tyroneus",
                                            "score": 4,
                                            "created_utc": 1638466379.0,
                                            "response": "Yeah his chat logs are pretty evil. Dude would’ve done anything and everything to stop his empire from crumbling.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hmyfaew",
                                                    "author": "bro-guy",
                                                    "score": 3,
                                                    "created_utc": 1638466497.0,
                                                    "response": "Exactly https://youtu.be/GpMP6Nh3FvU here are all of the chatlogs, excellent video that explains everything. He is a really evil man, totally deserved sentence",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hmxx8ly",
                                            "author": "wanszai",
                                            "score": 1,
                                            "created_utc": 1638459455.0,
                                            "response": "Cause on the surface it looks like cool revolutionary trying to stick it to the man, when in actuality it was nut case profiting from crime and trying to have peoples lives snuffed out in the process.\n\nIts a very interesting case and i dont doubt he was very intelligent and clearly its a very polarising subject.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hmxljww",
                                    "author": "RelaxedOctopus420",
                                    "score": 1,
                                    "created_utc": 1638454375.0,
                                    "response": "Yeah but like … revolution!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hmxnu69",
                                            "author": "wanszai",
                                            "score": 0,
                                            "created_utc": 1638455424.0,
                                            "response": "I know right! Gotta get those baggies of smack out there! Revolutio.....zzzzzzz",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hmxy5dj",
                                    "author": "radragantav",
                                    "score": 1,
                                    "created_utc": 1638459828.0,
                                    "response": "Yes, the war on drugs is idiotic and he created a fantastic way to get past that. In the quest for liberty he was a pioneer.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hmxyseb",
                                            "author": "wanszai",
                                            "score": 1,
                                            "created_utc": 1638460088.0,
                                            "response": "Id love to see you explain this to the parents of a fentanyl victim.\n\nIm with you largely, some drugs are clearly less harmful then others. The law is changing to reflect that though. \n\nYou are not wrong on the war on drugs being highly retarded, historically it has been used to punish minorities.\n\nI say this as an avid pot smoker.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hmy0r4j",
                                                    "author": "radragantav",
                                                    "score": 4,
                                                    "created_utc": 1638460875.0,
                                                    "response": "If legalized but regulated I highly doubt there would be fentanyl-laced anything selling very well.\n\nA marketplace with reviews is a step in the right direction.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hmy2eq2",
                                                            "author": "wanszai",
                                                            "score": 1,
                                                            "created_utc": 1638461541.0,
                                                            "response": "If it was legalised and regulated, you wouldnt have the need for this so called \"pioneer\" to act as a profiteering middle man though. \n\nA market place review can be easily manipulated... check amazon.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hmxmikc",
                                    "author": "irisuniverse",
                                    "score": -4,
                                    "created_utc": 1638454825.0,
                                    "response": "Calling a hit on someone to protect your revolutionary idea that changed the world for the better deserves jail time. It does not deserve life in prison.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hmxnmgm",
                                            "author": "wanszai",
                                            "score": 2,
                                            "created_utc": 1638455328.0,
                                            "response": "Again, ive used the silk road and the many, many others that cloned it afterwards.\n\nWith that in mind, im not against what it is or what it offered.\n\nId hardly say it changed the world for the better though, tThe guy offered a marketplace to sell drugs, including nasty shit like heroin. He didnt come up with a cure for cancer.\n\nHe was protecting his $$$.\n\nIll take the dislikes. I know im not wrong.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hmyn7fw",
                                                    "author": "Namaha",
                                                    "score": 1,
                                                    "created_utc": 1638469540.0,
                                                    "response": "In terms of harm reduction for users of said products, sites like his definitely changed the world for the better",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hmynzp9",
                                                            "author": "wanszai",
                                                            "score": -1,
                                                            "created_utc": 1638469838.0,
                                                            "response": "[https://www.justice.gov/usao-ndoh/pr/texas-couple-sentenced-prison-they-were-most-prolific-dark-net-fentanyl-vendor-world](https://www.justice.gov/usao-ndoh/pr/texas-couple-sentenced-prison-they-were-most-prolific-dark-net-fentanyl-vendor-world)\n\n&#x200B;\n\nThey literally allowed the sale of fentanyl and had a sister site that sold guns. \n\nYeah, they really cared about their end user and not about $$$.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hmyp1sh",
                                                                    "author": "Namaha",
                                                                    "score": 4,
                                                                    "created_utc": 1638470248.0,
                                                                    "response": "Yes and?\n\nThe problem here isn't fentanyl, the problem is cutting other opiates with fentanyl, or otherwise mislabeling it. That's what causes overdoses and deaths, users try to take their typical amount and end up dead since the fentanyl is orders of magnitude stronger than what they were expecting. Street dealers have always been the problem in this regard, not the online vendors who are actively incentivized *not* to cut their shit",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hmyqy11",
                                                                            "author": "wanszai",
                                                                            "score": 4,
                                                                            "created_utc": 1638470976.0,
                                                                            "response": "Thats a fair point and ill admit to not taking that into consideration.  Im not that well versed in opiates, they scare the shit out of me in any form if im honest and perhaps that fear has biased my opinion on the subject.\n\nThanks for taking the time to explain this to me.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hmysap7",
                                                                                    "author": "Namaha",
                                                                                    "score": 3,
                                                                                    "created_utc": 1638471497.0,
                                                                                    "response": "No prob, and thank you for keeping an open mind about it",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hmzd732",
                                    "author": "AsusWindowEdge",
                                    "score": -1,
                                    "created_utc": 1638479517.0,
                                    "response": ">Is that what we are calling people who tried to have people killed nowadays?\n\nAgree!  I thought they were called US government:  [MORE THAN 70 CHILDREN KILLED IN JUST 10 AIRSTRIKES IN AFGHANISTAN, REPORT FINDS. The Bureau of Investigative Journalism analyzed 10 strikes by the U.S. military and the U.S.-backed Afghan air force and found 115 civilians were killed.](https://theintercept.com/2020/06/03/children-killed-airstrikes-afghanistan-tbij-report/)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hmy1gfs",
                    "author": "tjdavenport",
                    "score": 15,
                    "created_utc": 1638461161.0,
                    "response": "I want to post this at the top level too: https://freeross.org/about/\n\n\nLots of info about the case. Please also consider information from Ross and his family before believing something you read on shitty news websites.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hmzhnlb",
                            "author": "AsusWindowEdge",
                            "score": 5,
                            "created_utc": 1638481201.0,
                            "response": "We know!  I've gone head to head against the FEDS.  Got indicted.  Took it to trial. The judge dismissed the one jury who would NOT agree to find me guilty.  Replaced juror #1 with an alternate, and then got the unanimous guilty verdict.  Remanded me to prison and then sentenced me to 70 months for a crime that was NEVER EVER proscribed and still is not.  \n\nWe know!  F\\*ck the feds!  All of them!  May they all get cancer and die a slow and painful death!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hn17gxh",
                                    "author": "Inevitable-Ad-8556",
                                    "score": 2,
                                    "created_utc": 1638508748.0,
                                    "response": "I have been in your shoes. Ftf.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hn24h51",
                                            "author": "AsusWindowEdge",
                                            "score": 1,
                                            "created_utc": 1638533510.0,
                                            "response": "Welcome!  We're tough AF!  Hold your head high!  Was in there with plenty of Colombian \"supposedly tough\" drug lords and these people snitched, lied,  §5K1.1, Rule 35, etc etc.  on everybody.  Some even their own grandmothers, the taxi drivers, and even the maids.\n\nBut in the end, despite of most of these people being \"garbage\" & criminals, the REAL criminals were those in court who lied, cheated, & robbed others of their possessions by calling it \"justice\".  I'll rather spend the rest of my life in prison than to ever be friends with these so-called \"men of law\".  F\\*ck ALL those people.\n\nPS.  The good thing though?  They wear uniforms and are easy to identify & avoid!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hn2amww",
                                                    "author": "Inevitable-Ad-8556",
                                                    "score": 2,
                                                    "created_utc": 1638537328.0,
                                                    "response": "True story.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hmy5zvf",
                    "author": "NomAnor0",
                    "score": 3,
                    "created_utc": 1638462950.0,
                    "response": "I believe that he won't receive any profits from the collection, right?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hmytgk4",
                            "author": "Namaha",
                            "score": 9,
                            "created_utc": 1638471943.0,
                            "response": "I believe Son of Sam laws would prevent him from legally profiting, yes. The article says that he wants proceeds to go towards (among other things) helping kids stay in contact with their incarcerated parents",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hmzcbf0",
                                    "author": "eastsideski",
                                    "score": 2,
                                    "created_utc": 1638479183.0,
                                    "response": "> Son of Sam laws would prevent him from legally profiting\n\nQuick Google search shows that New York is the only state with a similar law that hasn't been ruled unconstitutional yet, and I don't think Ross was tried in New York state court",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hmzhw57",
                                            "author": "AsusWindowEdge",
                                            "score": 3,
                                            "created_utc": 1638481293.0,
                                            "response": "He was!  By an appointee of Schumer.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hmwznem",
                    "author": "saddit42",
                    "score": 98,
                    "created_utc": 1638440394.0,
                    "response": "> The site began as a place to purchase illegal drugs but quickly expanded to include weapons and other contraband items.\n\nThe state of journalism is just sad. Silkroad did **not** sell any weapons. \n\nFrom wikipedia: *\"The site's terms of service prohibited the sale of certain items. When the Silk Road marketplace first began the creator and administrators instituted terms of service that prohibited the sale of anything whose purpose was to \"harm or defraud\".[19][80] This included child pornography, stolen credit cards, assassinations, and weapons of any type; other darknet markets such as Black Market Reloaded gained user notoriety because they were not as restrictive on these items as the Silk Road incarnations were.\"*\nhttps://en.wikipedia.org/wiki/Silk_Road_(marketplace)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hmy0tty",
                            "author": "HeyImGilly",
                            "score": 20,
                            "created_utc": 1638460905.0,
                            "response": "Did you ever browse the site? Because I can guarantee you that they sold weapons and you don’t know what you are talking about.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hmyb98d",
                                    "author": "Screwshank",
                                    "score": -2,
                                    "created_utc": 1638464960.0,
                                    "response": "Can't really guarantee that unless you purchased one. They could've been plants by the feds. It happens all the time on shady sites.\n\nI'm not saying that weapons weren't sold, just that listings for guns don't prove it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hmyggtl",
                                            "author": "HeyImGilly",
                                            "score": 2,
                                            "created_utc": 1638466953.0,
                                            "response": "So what about Black Market Reloaded or The Armoury?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hmyy8hn",
                                                    "author": "megahorse17",
                                                    "score": 1,
                                                    "created_utc": 1638473784.0,
                                                    "response": "BMR had nothing to do with Ross Ulbricht. The armoury was weapons though obviously. Short lived.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hmywjpd",
                                    "author": "megahorse17",
                                    "score": -3,
                                    "created_utc": 1638473133.0,
                                    "response": "Youre crazy. I was on it every day. Didn't happen, apart from the short lived sister site.\nThere is archives of the site online if you want to prove yourself wrong too.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hmy06e1",
                            "author": "tjdavenport",
                            "score": 4,
                            "created_utc": 1638460644.0,
                            "response": "I don’t think Ross should be in prison but I do have to say that I browsed Silk Road while it was online and I definitely saw guns for sale. I’m guessing it took some time for moderators to take those kinds of listings down.\n\n\nEdit: I’m also surprised this hasn’t been linked yet: https://freeross.org/about/\n\nThere’s a lot of info on that site that supports Ross’s case. People are asking for citations so here are some.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hmxp3fq",
                            "author": "Whos_the_NPC",
                            "score": 11,
                            "created_utc": 1638455987.0,
                            "response": "Dude silkroad sold weapons then removed them within the first year.  Chill out\n\nEdit: getting downvoted for being part of the club 😎",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hmydx1a",
                            "author": "Wah_Gwaan_Mi_Yute",
                            "score": 4,
                            "created_utc": 1638465972.0,
                            "response": "Silk Road did have weapons",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hmwzoh0",
                            "author": "WikiSummarizerBot",
                            "score": 3,
                            "created_utc": 1638440419.0,
                            "response": "**[Silk Road (marketplace)](https://en.wikipedia.org/wiki/Silk_Road_\\(marketplace\\))** \n \n >Silk Road was an online black market and the first modern darknet market. As part of the dark web, it was operated as a Tor hidden service, such that online users were able to browse it anonymously and securely without potential traffic monitoring. The website was launched in February 2011; development had begun six months prior. Initially there were a limited number of new seller accounts available; new sellers had to purchase an account in an auction.\n \n^([ )[^(F.A.Q)](https://www.reddit.com/r/WikiSummarizer/wiki/index#wiki_f.a.q)^( | )[^(Opt Out)](https://reddit.com/message/compose?to=WikiSummarizerBot&message=OptOut&subject=OptOut)^( | )[^(Opt Out Of Subreddit)](https://np.reddit.com/r/ethereum/about/banned)^( | )[^(GitHub)](https://github.com/Sujal-7/WikiSummarizerBot)^( ] Downvote to remove | v1.5)",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hmy8pmu",
                            "author": "d_m_916",
                            "score": 2,
                            "created_utc": 1638463995.0,
                            "response": "Ummm. Yes, they did.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hmyq1sl",
                            "author": "MoarSocks",
                            "score": 2,
                            "created_utc": 1638470631.0,
                            "response": "Sorry, but I call BS.\n\nI had huge stakes in BTC back in the day (when it was around $30) and gave them all away the moment I came across yellowcake for sale on the SR. Could have made a fortune but left the scene after seeing this sale. Still glad I did.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hmz2ym8",
                                    "author": "nukedmylastprofile",
                                    "score": 3,
                                    "created_utc": 1638475650.0,
                                    "response": "Had to Google what yellowcake was. Jfc I would have bailed too, that’s a step too far and too risky to be associated with in my book",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hmzb6b1",
                            "author": "Cobmojo",
                            "score": 1,
                            "created_utc": 1638478757.0,
                            "response": "He just wanted people killed.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hmy42xi",
                            "author": "cip43r",
                            "score": 1,
                            "created_utc": 1638462197.0,
                            "response": "Your'e such a bro. Thanks.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hn0n33v",
                            "author": "FightForDemocracyNow",
                            "score": 1,
                            "created_utc": 1638498999.0,
                            "response": "Silk road definitely sold counterfeit money and fraudulent documents.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hmyj5jz",
                    "author": "JrSpewing",
                    "score": 2,
                    "created_utc": 1638467974.0,
                    "response": "The pirate series?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hmyn5l9",
                    "author": "iAmEeRg",
                    "score": 2,
                    "created_utc": 1638469521.0,
                    "response": "From prison?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hmzcome",
                    "author": "iszomer",
                    "score": 2,
                    "created_utc": 1638479319.0,
                    "response": "Is this a honeypot by the feds?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hmxo80s",
                    "author": "DaquanSwett",
                    "score": 11,
                    "created_utc": 1638455596.0,
                    "response": "#FREEROSSULBRICHT",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hmzbiz2",
                            "author": "Cobmojo",
                            "score": -2,
                            "created_utc": 1638478886.0,
                            "response": "No thanks. He tried to kill people. No matter what other great things he did, he deserves to be in jail.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hn1s8ju",
                                    "author": "Ryozuo",
                                    "score": 2,
                                    "created_utc": 1638523734.0,
                                    "response": "This right here. He knowingly tried to have three people killed, under the assumption they were all real people. It was only a matter of time before he got his hands on a real hitman & real target",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hmzq2bs",
                                    "author": "DaquanSwett",
                                    "score": -3,
                                    "created_utc": 1638484495.0,
                                    "response": "Ross Ulbricht was minding his own business, not bothering anyone.  Some idiot threatened to narc him out to the FBI, which would've resulted in him being imprisoned for life (even though he didn't hurt anyone; his \"crimes\" were nonviolent and victimless).  Someone else offered to kill said threat, Ross accepted.\n\nGiven the choice between life in prison, and having someone carry out a hit, the vast majority of rational people would pick the hit to save their lives.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hn05j83",
                                            "author": "2heads1shaft",
                                            "score": 2,
                                            "created_utc": 1638491179.0,
                                            "response": "Regardless of what most people would do, what he did is illegal. What is there to argue?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hn0axxb",
                                                    "author": "DaquanSwett",
                                                    "score": -6,
                                                    "created_utc": 1638493640.0,
                                                    "response": "You sound like a fucking narc\n\nWhat is there to argue? What he did was justified.  He bothered no one, someone tried to put him in jail for life, he defended himself. He didn't act unjustly.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hn1ci6s",
                                                            "author": "t00rshell",
                                                            "score": 4,
                                                            "created_utc": 1638511772.0,
                                                            "response": "He tried to have people killed because his drug market was going to get him in trouble.\n\nHe’s a piece of shit who deserves to die in jail.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hn1zlk3",
                                                                    "author": "DaquanSwett",
                                                                    "score": 0,
                                                                    "created_utc": 1638529902.0,
                                                                    "response": "You sound like the type of douchebag who calls the cops on their neighbors for smoking weed in their backyard.  Fucking loser.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hn2e4jz",
                                                                            "author": "t00rshell",
                                                                            "score": 1,
                                                                            "created_utc": 1638539182.0,
                                                                            "response": "Where I live smoking pot is fully legal, so thanks but try again 😂\n\nAnd the only loser is good old Ross who’s spending his entire life as a girlfriend in prison 😂",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hn2l7je",
                                                                                    "author": "DaquanSwett",
                                                                                    "score": 0,
                                                                                    "created_utc": 1638542532.0,
                                                                                    "response": "\"I mindlessly enforce the laws, even immoral ones!\"\n\nYou're the type of trash who, if you lived in 1940s Germany, would've ratted out your Jewish neighbors for not registering bc it would've been \"breaking the law\"",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hn2mddi",
                                                                                            "author": "t00rshell",
                                                                                            "score": 1,
                                                                                            "created_utc": 1638543044.0,
                                                                                            "response": "From your defense of Ross the attempted murderer it sounds like in 1940's Germany you'd be there executing Jews, after all its you fucking morons that thinks Ross was justified.\n\nDrug laws can be argued, I don't happen to think making heroin and fent easier to get is a good thing.\n\neither way, scum bag here tied to have two people killed, thats way off the drug reservation.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hmzs0jz",
                                            "author": "Cobmojo",
                                            "score": 1,
                                            "created_utc": 1638485299.0,
                                            "response": "Or just stop doing the illegal things.\n\n Definitely killing someone is not the top option.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hn0b356",
                                                    "author": "DaquanSwett",
                                                    "score": -2,
                                                    "created_utc": 1638493706.0,
                                                    "response": "Ok narc",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hn0dooa",
                                                            "author": "Cobmojo",
                                                            "score": 1,
                                                            "created_utc": 1638494868.0,
                                                            "response": "Okay sociopath.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hmzh7zb",
                                    "author": "AsusWindowEdge",
                                    "score": -3,
                                    "created_utc": 1638481033.0,
                                    "response": ">He tried to kill people\n\nHow about those people who ACTUALLY kill people, including children? \n\n[MORE THAN 70 CHILDREN KILLED IN JUST 10 AIRSTRIKES IN AFGHANISTAN, REPORT FINDS.   The Bureau of Investigative Journalism analyzed 10 strikes by the U.S. military and the U.S.-backed Afghan air force and found 115 civilians were killed.](https://theintercept.com/2020/06/03/children-killed-airstrikes-afghanistan-tbij-report/)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hn03ylw",
                                            "author": "subdep",
                                            "score": 4,
                                            "created_utc": 1638490462.0,
                                            "response": "# WHATABOUTISM",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hn0ol7v",
                                                    "author": "AsusWindowEdge",
                                                    "score": -2,
                                                    "created_utc": 1638499652.0,
                                                    "response": ">WHATABOUTISM\n\ndoes NOT exist.  It's a word uneducated people use because they heard a tintinnabulation but have NO idea where the bell is.\n\nThe actual fallacy you are alluding to is:  [Tu Quoque Fallacy!](https://fallacyinlogic.com/tu-quoque-fallacy-definition-and-examples/)\n\nPlease learn about and don't use it.  Learned intellectuals will be guessing whether you have a severe case of Mondegreen, Mountweazel, or Mumpsimus.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hn0rsg7",
                                                            "author": "subdep",
                                                            "score": 2,
                                                            "created_utc": 1638501066.0,
                                                            "response": "Yeah, you’re guilty of it and you know it. Your only defense is to attack the concept in every way you can. \n\nSad, really.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hn26mug",
                                                                    "author": "AsusWindowEdge",
                                                                    "score": 0,
                                                                    "created_utc": 1638534940.0,
                                                                    "response": "You are so sad.  You won't even take a look and research something that can profoundly change your life for the better.  Gain the freedom & liberty everyone deserves.  You have been so indoctrinated.  \n\nRemember, I am NOT the one \n\n* taking taking a huge chunk of your salary and giving it to your sworn enemy\n* taking your freedom and crushing it\n* arresting you on the streets or even in your house and throwing you in a cage\n* stealing your possessions under the ruse of 18 U.S. Code § 981 - Civil forfeiture.\n* telling you to inject into your body whatever I decide is good for you\n* telling you what you can or cannot use based on the \"campaign donations\" of businesses\n* ad infinitum...\n\nI'm just investing some of my time into you to let you know there is a better life...with absolutely NO benefit to me (except the little dopamine I get from doing it).\n\nI don't support robbing anyone, or killing innocent people, or curbing someone's rights....\n\nThat's it.  Yet, to you...I'm the \"bad\" guy.  \n\nWhat else could I say?  Does your approach here makes sense to you?  If it does, go on.  Bless your heart.\n\nHave a nice day.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hn2idhh",
                                                                            "author": "pugRescuer",
                                                                            "score": 1,
                                                                            "created_utc": 1638541249.0,
                                                                            "response": "Take the tin foil hat off. All the things you conflating into this comment are blasphemous. \n\nTaxes pay for things you use, perhaps some goes where it shouldn't or is wasted but taxes in general are a good thing. Don't like it, stop using all those things and see how far you get. Here we go again on the injecting your body front. You must not like all modern medicine. So stop using all those things and do what you think is best for yourself. Surgery, try it yourself, antibiotics, take some natural home remedy. \n\nHave a nice day.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hn2l6zv",
                                                                                    "author": "AsusWindowEdge",
                                                                                    "score": 0,
                                                                                    "created_utc": 1638542525.0,
                                                                                    "response": "Nice to see another order follower:  [https://www.youtube.com/watch?v=EMMEC4BYdos](https://www.youtube.com/watch?v=EMMEC4BYdos)",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hn2nnk2",
                                                                                            "author": "t00rshell",
                                                                                            "score": 0,
                                                                                            "created_utc": 1638543602.0,
                                                                                            "response": "LOL so you're a scum bag freeloader? \n\nWhy not leave and go to one of those 3rd world countries that have no taxes ?\n\nOh i know, because you're a pussy and would rather complain here on the internet.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "hn2jr35",
                                                                            "author": "subdep",
                                                                            "score": 1,
                                                                            "created_utc": 1638541877.0,
                                                                            "response": "Dude, you are fucking weird. Blocked. Good luck with life.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hmzlqc6",
                                            "author": "Cobmojo",
                                            "score": 9,
                                            "created_utc": 1638482770.0,
                                            "response": "Can both be bad?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hmzuy9g",
                                                    "author": "AsusWindowEdge",
                                                    "score": 0,
                                                    "created_utc": 1638486524.0,
                                                    "response": "100%!  Absolutely 100%!  We're getting somewhere.\n\nPS.  Read the court transcripts.  The feds offered to kill the \"people\" who betrayed Ross for him.  It was a ruse.\n\n*If someone offered to \"off\" my agent, prosecutor, & judge right now, and I didn't think I would get caught (they didn't know me, for example)....I'd have their entire family tree wiped out.  Maybe even their neighbors.  Besides, birds of a feather flock together.  Maybe you are a more forgiving guy, but certainly NOT me.  Just saying.... hypothetically, of course* 🤣😂🤣😂",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hn1clw7",
                                                            "author": "t00rshell",
                                                            "score": 2,
                                                            "created_utc": 1638511838.0,
                                                            "response": "You’re a moron. He agreed to have someone killed.\n\nThat’s never ok.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hn23uyp",
                                                                    "author": "AsusWindowEdge",
                                                                    "score": 0,
                                                                    "created_utc": 1638533086.0,
                                                                    "response": "If you tried to rob me or short changed me too on a deal, take a gander into the morgue of what would happen to you :)",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hn2e9z9",
                                                                            "author": "t00rshell",
                                                                            "score": 1,
                                                                            "created_utc": 1638539257.0,
                                                                            "response": "Sure sure internet tough guy. 🤣😂",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hn2kt1l",
                                                                                    "author": "AsusWindowEdge",
                                                                                    "score": 0,
                                                                                    "created_utc": 1638542354.0,
                                                                                    "response": "You allow people to rob you and short change you without consequences?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hn2nvj0",
                                                                                            "author": "t00rshell",
                                                                                            "score": 2,
                                                                                            "created_utc": 1638543696.0,
                                                                                            "response": "Thats what the police are for cupcake, citizens are not permitted to take the law into their own hands.\n\nIf someone robbed me, id call the policy. Short change is easier, just call my bank and have the charge turned around.\n\nSee how no where here led me to attempted murder?",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hmyul2m",
                    "author": "LilliProfits",
                    "score": 7,
                    "created_utc": 1638472376.0,
                    "response": "Ross Ulbricht saved more lives than he harmed. \n\nDrug use can be dangerous and a lot of that danger is in not knowing the product. Ideally nobody would need or want hard drugs but in the world where people do they should have info to do them more safely.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hn05pnt",
                            "author": "2heads1shaft",
                            "score": -5,
                            "created_utc": 1638491262.0,
                            "response": "Ah okay, I guess police can kill 1 person for every 10k they save right?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hn0i08q",
                                    "author": "TriggerWarning595",
                                    "score": 4,
                                    "created_utc": 1638496772.0,
                                    "response": "Umm, his difference here.\n\n1.\tIf I die of an OD, that is *my* fault.\n2.\tIf I die of a cop shooting, that is *the cops* fault.\n\nIf you think I don’t deserve the freedom for #1, please get out of crypto. This is a decentralized, feee space. You have no right to cry to big brother here.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hn1jhnx",
                                            "author": "throwawayo12345",
                                            "score": 3,
                                            "created_utc": 1638516632.0,
                                            "response": "I miss the days when virtually everyone in crypto was an anarchist",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hmxh3fh",
                    "author": "niktrexic",
                    "score": 3,
                    "created_utc": 1638452191.0,
                    "response": "he is not in jail?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hmxmpqz",
                            "author": "irisuniverse",
                            "score": 14,
                            "created_utc": 1638454915.0,
                            "response": "He’s creating the art from jail and probably sending externally to a friend to mint the NFTs. Son of Sam laws would likely prevent him from profiting. Proceeds are going to raise money for families of incarcerated parents.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hmxp3en",
                                    "author": "nanazzie",
                                    "score": 8,
                                    "created_utc": 1638455987.0,
                                    "response": "I really hope these NFTs are symbolic of his story/clues about his experience on the Silk Road, nevertheless, I'm quite happy that this is being minted on Ethereum as it marches forward into a zero-carbon complaint.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hmz3et6",
                    "author": "Wild_Beat_2476",
                    "score": 3,
                    "created_utc": 1638475826.0,
                    "response": "One of the pioneers of Bitcoin and crypto",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hmy5lsw",
                    "author": "hejNnzj",
                    "score": 3,
                    "created_utc": 1638462797.0,
                    "response": "The US is one of many global terrorist states.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hmxspae",
                    "author": "JRhod3sie",
                    "score": 2,
                    "created_utc": 1638457548.0,
                    "response": "I don’t understand…like launching via someone on the outside?? How else could it be",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hmzci9q",
                    "author": "Cobmojo",
                    "score": 3,
                    "created_utc": 1638479253.0,
                    "response": "This guy is no hero of crypto. He's one of the reasons it associated with crime.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hmzssyj",
                            "author": "iOceanLab",
                            "score": 13,
                            "created_utc": 1638485626.0,
                            "response": "He's also one of the reasons crypto was able to grow to what it is today.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hn0hm6g",
                            "author": "TriggerWarning595",
                            "score": 0,
                            "created_utc": 1638496602.0,
                            "response": "Gonna give you a few facts buddy\n\n1.\tCrypto was created in opposition to governments and big banks. If you disagree with non-violent drug sales, you’re both an authoritarian and have no place here. Big brother can’t control this one for you\n2.\tIf you disagree with people making 100% voluntary, non violent sales just because it’s illegal, you probably would’ve been a Nazi if you were a German citizen in 1941. After all, not killing Jews was illegal back then.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hn2n46e",
                                    "author": "t00rshell",
                                    "score": 1,
                                    "created_utc": 1638543367.0,
                                    "response": "I love this, if you dont support fentanyl laced heroin being sold in darknets you're probably a nazi.\n\nLOL and you guys wonder why no one ever takes you seriously.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hn0jc4m",
                                    "author": "Cobmojo",
                                    "score": 0,
                                    "created_utc": 1638497351.0,
                                    "response": "Crypto doesn't belong to an ideology. And your facts are nonsense.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hmxg6i1",
                    "author": "RionFerren",
                    "score": 0,
                    "created_utc": 1638451719.0,
                    "response": "Gas fee too high no thanks",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hmy994i",
                            "author": "Rusyee",
                            "score": 2,
                            "created_utc": 1638464201.0,
                            "response": "Dang I was afraid of this",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hmyvbyg",
                    "author": "OddLibrary4717",
                    "score": 0,
                    "created_utc": 1638472666.0,
                    "response": "Free this man.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hmyl781",
                    "author": "ProvincialPromenade",
                    "score": 1,
                    "created_utc": 1638468770.0,
                    "response": "Kinda sad that he isn’t promoting privacy tech after everything that happened to him. Especially since these NFTs are kinda spicy. \n\nYou can have private NFTs on Secret Network and on Beam.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hmzt4mh",
                    "author": "NevadaLancaster",
                    "score": 1,
                    "created_utc": 1638485760.0,
                    "response": "Free Ross!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hmxxmzt",
                    "author": "silly_mirth",
                    "score": -1,
                    "created_utc": 1638459620.0,
                    "response": "A lot of the stuff in the article doesn't read right. They didn't sell weapons lol.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hmxf5wm",
                    "author": "Thezla",
                    "score": -21,
                    "created_utc": 1638451174.0,
                    "response": "Reminder that Ross Ulbricht tried to execute multiple murders for hire and even paid for them in BTC.\n\nhttps://youtu.be/GpMP6Nh3FvU",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hmz9543",
                            "author": "Mindless_-_Data",
                            "score": 3,
                            "created_utc": 1638478003.0,
                            "response": "Reminder that he was never charged for those crimes because there wasn't enough evidence, and on top of that the investigators accusing him of these crimes ended up being crooks that stole a lot of Silk Road's BTC stash, so we really shouldn't be taking their word for it.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hmxgglm",
                            "author": "earthmoonsun",
                            "score": 11,
                            "created_utc": 1638451866.0,
                            "response": "Allegedly. We don't know for 100% and his trial didn't include these allegations.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hmxiwcl",
                                    "author": "epic_trader",
                                    "score": -7,
                                    "created_utc": 1638453094.0,
                                    "response": "We certainly do know because we have the chat logs and we can confirm he paid the exact amounts as per the transcripts.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hmxkh86",
                                            "author": "TenderloinGroin",
                                            "score": 4,
                                            "created_utc": 1638453867.0,
                                            "response": "Source or you are just the internet",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hmy890y",
                                                    "author": "epic_trader",
                                                    "score": 2,
                                                    "created_utc": 1638463822.0,
                                                    "response": "Watch this: https://www.youtube.com/watch?v=GpMP6Nh3FvU\n\nIt has a link to the transcript as well.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hmzc6oz",
                                    "author": "Cobmojo",
                                    "score": 0,
                                    "created_utc": 1638479134.0,
                                    "response": ">Allegedly.\n\nWe don't know anything 100% for sure. But the prosecution just wanted to nail him on the stuff that was for sure. But there is absolutely evidence he tried to hire people to kill other people.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hmzeg6l",
                                            "author": "earthmoonsun",
                                            "score": 1,
                                            "created_utc": 1638479991.0,
                                            "response": "> We don't know anything 100% for sure. \n\n> But there is absolutely evidence\n\nHmmm...",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hmzf5b8",
                                                    "author": "Cobmojo",
                                                    "score": 1,
                                                    "created_utc": 1638480253.0,
                                                    "response": "How's that confusing?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hmzfmj0",
                                                            "author": "earthmoonsun",
                                                            "score": 2,
                                                            "created_utc": 1638480436.0,
                                                            "response": "that sounds contradictory to me",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hmxsa82",
                            "author": "Typo_Brahe",
                            "score": 1,
                            "created_utc": 1638457368.0,
                            "response": "Sure let's buy into the government narrative. They're known not to lie right!?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hmxk9p7",
                            "author": "Nibbles110",
                            "score": 1,
                            "created_utc": 1638453766.0,
                            "response": "someone didn't do their research",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hmxqlox",
                            "author": "meeyak17",
                            "score": -1,
                            "created_utc": 1638456648.0,
                            "response": "Getting downvoted for spiting facts. He belongs in prison for the rest of his life.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hmz4xh4",
                    "author": "TcherChristian",
                    "score": 0,
                    "created_utc": 1638476412.0,
                    "response": "How long will it be before every felon starts a NFT collection? Shits insane!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hn07xfp",
                    "author": "MaggoLive",
                    "score": 1,
                    "created_utc": 1638492269.0,
                    "response": "There's a new fundraising DAO for the auction!\n\n[https://freerossdao.com](https://freerossdao.com)\n\nCurrently at 633.5 ETH (about $3mil)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hquhpj9",
                    "author": "3h1b",
                    "score": 1,
                    "created_utc": 1641069290.0,
                    "response": "FREE DPR",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hmx14lu",
                    "author": "tipsyXtwo",
                    "score": -14,
                    "created_utc": 1638441649.0,
                    "response": "I figured this guy would have gone all in on $ROPE when he saw the price break 65k",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hmzezi8",
                    "author": "cryptolicious501",
                    "score": 0,
                    "created_utc": 1638480193.0,
                    "response": "It's not going to be lambo tier wealth making.  \n\nIm from the future...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hn1i7b4",
                    "author": "tg_27",
                    "score": 0,
                    "created_utc": 1638515668.0,
                    "response": "Isn’t he still locked up?? Lol",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uv1slb",
            "title": "Vitalik Buterin on Ethereum switch to Proof of Stake",
            "url": "https://youtu.be/mNQkw1cNigU",
            "author": "BlazingHotFireFox",
            "created_utc": 1653186972.0,
            "score": 24,
            "num_comments": 19,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9jqzsl",
                    "author": "eugay",
                    "score": -3,
                    "created_utc": 1653214639.0,
                    "response": "„Some people are saying June/July/August. I don’t know.”\n\nSo he seems to be distancing himself from the responsibility of delivering the merge. Does he not spearhead the efforts anymore?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ld847",
                            "author": "domotheus",
                            "score": 7,
                            "created_utc": 1653244700.0,
                            "response": ">So he seems to be distancing himself from the responsibility of delivering the merge\n\nThat's good, because it's not really up to him at all, and every time he has been overly optimistic in the past and underestimated all the effort needed to switch to PoS, people have thrown that around as a failure of the whole ecosystem, and to this day it still fuels the low-information crowd shouting \"lol they've been saying that since 2018\" in every thread.\n\n> Does he not spearhead the efforts anymore?\n\nNot at all. If you tune in to the all core dev calls every other friday, you'll notice he barely ever speaks anymore. All that's left on the merge is implementation and testing, something he really has no control over. If you wanna pin the efforts on one guy it'd be Tim Beiko, who's job is to coordinate these calls and ensure everything runs smoothly and everyone's clear on what needs to be done.\n\nThese days Vitalik is really just a part of the research team, and at best his influence over governance/development is through being very knowledgeable. Otherwise he works on the theoretical specs for future upgrades, same as any other member of the research team.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9jx9um",
                            "author": "International-Yam548",
                            "score": 5,
                            "created_utc": 1653219744.0,
                            "response": "He just doesn't want to give a time because then we will just be seeing headlines like\"Ethereum proof of stake delayed again\".",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9k1qgs",
                    "author": "SoDi1203",
                    "score": -9,
                    "created_utc": 1653222792.0,
                    "response": "It will never happen",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9lcbdm",
                            "author": "domotheus",
                            "score": 8,
                            "created_utc": 1653244287.0,
                            "response": "Do you keep up with the development around it at all? Everything's pretty much in the testing phase at this point. A public testnet is getting merged in 2 weeks.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9l2ml1",
                            "author": "Itchy_Ad_3659",
                            "score": 1,
                            "created_utc": 1653240048.0,
                            "response": "Remindme! In 5 months",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9l2qtc",
                                    "author": "RemindMeBot",
                                    "score": 1,
                                    "created_utc": 1653240098.0,
                                    "response": "I will be messaging you in 5 months on [**2022-10-22 17:20:48 UTC**](http://www.wolframalpha.com/input/?i=2022-10-22%2017:20:48%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/ethereum/comments/uv1slb/vitalik_buterin_on_ethereum_switch_to_proof_of/i9l2ml1/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fethereum%2Fcomments%2Fuv1slb%2Fvitalik_buterin_on_ethereum_switch_to_proof_of%2Fi9l2ml1%2F%5D%0A%0ARemindMe%21%202022-10-22%2017%3A20%3A48%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20uv1slb)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9lcc9d",
                                    "author": "Simple_Yam",
                                    "score": 1,
                                    "created_utc": 1653244299.0,
                                    "response": "Remindme! In 5 months",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}