{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uu3b39",
            "title": "Confused about ENS",
            "url": "https://www.reddit.com/r/ethereum/comments/uu3b39/confused_about_ens/",
            "author": "ScumFuckLotusBoy",
            "created_utc": 1653068264.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "ethereum",
            "selftext": "Just purchased my first ENS name and am trying to set the reverse record to my eth address. I used Metamask with a Ledger to purchase it. When I look on opensea and ledger live I can see the ENS token in my wallet, but when I view my account in the ENS app it says that my address doesn’t own any domains… if I search the name it lists my address as the controller but not the registrant. The name had expired and was purchase with a premium, premium period had around two days left. Is there just a delay for it to show up in my ens account or did I do something wrong? Thanks",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uu37ou",
            "title": "I need assistance with an old Ethereum wallet",
            "url": "https://www.reddit.com/r/ethereum/comments/uu37ou/i_need_assistance_with_an_old_ethereum_wallet/",
            "author": "jacksontoledo",
            "created_utc": 1653068077.0,
            "score": 3,
            "num_comments": 20,
            "subreddit": "ethereum",
            "selftext": "Hi Guys, \n\nAs the tittle states I need a little assistance to see if i can “recovering” some old Ether wallet. \n\nI do have some old files from (26-05-2016) on my Macbook Pro with show as follow: Library/Ethereum. \n\nI can see that i do have 12.01 GB of data and inside the Ethereum folder i do have the following: chaindata-testnet-nodes-dapp-keystore-nodedy, please note that this are folders. Inside the (chaindata) i can see 11.72 GB in which contain: (log and a lot of files ending as follows 292900.ldb etc. \n\nAlso there is a folder name (testnet) in which is 282.4 MB and inside that folder i can see other folder as follow: chaindata-nodes-dapp-nodekey.\n\nMy question is: \n\nwhat's the easiest way to access this ether or try to recover any ether from there. I honestly don’t know if there is anything there but i do remember back on those days try to mining ether/bitcoin with my MacBook pro and experimenting a bit with Ethereum.  \n\nI don’t even remember the name of the software that i did install. I did notice the file right now because i was cleaning the MacBook Pro and notice 12.01 GB of data and i could see the files contain this information. \n\nAny idea how can i find out if there is anything there? - The close thing i remember was playing with https://www.myetherwallet.com/ \n\nThank you so much for your time. \n\nPS: Honestly, i don’t know what to expect from this. Thanks guys.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9cuuif",
                    "author": "caploves1019",
                    "score": 8,
                    "created_utc": 1653069164.0,
                    "response": "Ignore all direct messages.\n\nDisregard that website or any others.\n\nLook for a wallet.dat file or similar in not the file folders.\n\nIf you enabled encryption, you'll want to remember the password as well. Otherwise nearly all that data is just blockchain info from years ago and not an indicator of any eth stored anywhere. You need your wallet dat file or a recovery seed if you have one (doubtful).",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cvh68",
                            "author": "jacksontoledo",
                            "score": 1,
                            "created_utc": 1653069447.0,
                            "response": "Thank you so much for the advice, i already got a lot of message lol but the post it is true. I can not see any file of folder under the name of [wallet.data](https://wallet.data) file or something similar. Thanks",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9cy69a",
                                    "author": "iMHackeRPiratE",
                                    "score": 3,
                                    "created_utc": 1653070676.0,
                                    "response": ".dat not data",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9czrhg",
                                            "author": "jacksontoledo",
                                            "score": 1,
                                            "created_utc": 1653071412.0,
                                            "response": "Unfortunately, I can not see any file or folder under wallet.dat - Thanks",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9dfxi4",
                                                    "author": "AdvocatusDiabo",
                                                    "score": 4,
                                                    "created_utc": 1653078810.0,
                                                    "response": "do you remember the what wallet was it? mist? Any .json files?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9e4zzv",
                    "author": "GSPandas",
                    "score": 5,
                    "created_utc": 1653090856.0,
                    "response": "Here comes the “Ethereum Tech Support” vigorously DMing OP lmao.\n\nJokes aside, ignore all DMs. Those that actually want to help you will do it here in public. Otherwise, all scammers.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fi4tt",
                            "author": "jacksontoledo",
                            "score": 1,
                            "created_utc": 1653122830.0,
                            "response": "Thank you so much, i already lost track the amount of DM I am getting... Thanks.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9dcvhp",
                    "author": "hteselekecnirp",
                    "score": 3,
                    "created_utc": 1653077418.0,
                    "response": "If there's a file in the keystore folder and you know the password you can access it with MEW under Access My Wallet -> Software -> Keystore.\n\nGood luck 🤞",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fjg41",
                            "author": "jacksontoledo",
                            "score": 2,
                            "created_utc": 1653124053.0,
                            "response": "Hi, thank you so much for the information. Now i need to remember the password. I don't have any idea. Any way, i can find a password crack o something like that. Thanks.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fq39j",
                                    "author": "hteselekecnirp",
                                    "score": 2,
                                    "created_utc": 1653130142.0,
                                    "response": "There's a chance to crack it with hashcat, but at first make a backup of the keystore file, open it with any text editor and check the address part with etherscan to see if there are any ETH on it at all.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9khuo9",
                                            "author": "jacksontoledo",
                                            "score": 2,
                                            "created_utc": 1653231146.0,
                                            "response": "Hi, thank you so much for your help. Unfortunately, no ETH on the wallet.  I did open the Keystore file and I manage to get the ETH, and it is empty. I do remember now the app and everything now. To be honest, I was a bit existing jajaja, but there is nothing there. I would like to take this opportunity to say thank you so much for your help. 658eeeb9742015ad48757dc30466999346cbe889",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}