{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ud1zgb",
            "title": "How many different DeFi dApps, across different blockchains do you use?",
            "url": "https://www.reddit.com/r/ethereum/comments/ud1zgb/how_many_different_defi_dapps_across_different/",
            "author": "ApolloniusVR-II",
            "created_utc": 1651061138.0,
            "score": 3,
            "num_comments": 18,
            "subreddit": "ethereum",
            "selftext": "For the poll, if you use multiple dApps on the same blockchain, this counts as 1 :), rollups count as a separate chain. It would be interesting to find out how many DeFi dApps across independent blockchains people are using.\n\n[View Poll](https://www.reddit.com/poll/ud1zgb)",
            "stickied": false,
            "comments": [
                {
                    "id": "i6e3yuc",
                    "author": "marcuspohl",
                    "score": 3,
                    "created_utc": 1651062009.0,
                    "response": "Big assumption that everyone uses DeFi. There’s    folks out there that read the news with all the bugs and thefts recently and are hesitant to do anything but hodl. Also, people avoiding transactions to not make their taxes unwieldy, seems like it was a struggle this year for many.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "tztlk3",
            "title": "White label ETH staking pools",
            "url": "https://www.reddit.com/r/ethereum/comments/tztlk3/white_label_eth_staking_pools/",
            "author": "iLoVeCrams",
            "created_utc": 1649512243.0,
            "score": 4,
            "num_comments": 34,
            "subreddit": "ethereum",
            "selftext": "Hi folks,\n\nI am looking for a partner (preferable that is yet for a longer term in the scene) that is providing whitelabel ETH Staking pools. \n\nWhat I specifically need is a protocol / organisation that has whitelabel pools available to implement on own web via API or similar, whereon I can set the rules i.e. conditions of term, withdrawal fee and so forth. \n\nTried to look around on the web but nothing of this specific is really findable other than stuff like Rocketpool and standard staking protocols. Recommendations are highly welcome.\n\nIn short words, I'd like to open a business, with staking pools from proven 3rd parties integrated on my web. I am not looking for developers or similar to create such, simply as I don't have any smartcontract / pool coding knowledge and can't judge whether they are trustable or not. I want to offer services to clients, based on good names in the crypto era.\n\nThanks for any information provided.",
            "stickied": false,
            "comments": [
                {
                    "id": "i41ko4c",
                    "author": "Perleflamme",
                    "score": 4,
                    "created_utc": 1649517481.0,
                    "response": "Why aren't you willing to use RocketPool, exactly? It's secured by public bounty and anyone can see the code for themselves. \n\nHow do you picture anything else to be better than that? If anything, whitelabel services are less secure than that: you've got to trust them and the justice system to pay you back in case they're having a problem. You don't have this sort of problems with trustlessness.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "txeodv",
            "title": "Make your ETH a part of history! A well-established Ukrainian paramedic group has posted their wallet address, and is collecting funds for helmets and body armor.",
            "url": "/r/ukraine/comments/tvymqo/urgent_support_request_for_hospitallers_medical/",
            "author": "claireandleif",
            "created_utc": 1649222266.0,
            "score": 3,
            "num_comments": 15,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "tvc59w",
            "title": "NFT Taxes Explained in Plain English (MUST READ for U.S.)",
            "url": "https://cryptotrader.tax/blog/how-are-nfts-taxed",
            "author": "stratguy56",
            "created_utc": 1649000565.0,
            "score": 4,
            "num_comments": 22,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "tudnnk",
            "title": "What does one do when a unauthorized transaction occurs?",
            "url": "https://www.reddit.com/r/ethereum/comments/tudnnk/what_does_one_do_when_a_unauthorized_transaction/",
            "author": "linusgoddamtorvalds",
            "created_utc": 1648886336.0,
            "score": 3,
            "num_comments": 35,
            "subreddit": "ethereum",
            "selftext": "So, I woke up, and I went to AtomicHub. There was a NFT project that I follow requesting EOS to be matched, pooled, and used to form a grant service.\n\nI thought I'd toss an EOS, but I had under a partial. I thought I'd swap ETH in Wombat, so I checked my wallet via Wombat, and saw that my ETH balance was 0.\n\nI knew this was incorrect because I'd had ~$16 ETH for some time.\n\nHere is the wallet on Etherscan. The last transaction occurred at a time I was sleeping. This transaction effectively drained the wallet to exactly 0 ETH (ignore the MNE, please):\n\n[0x1dfAb93f39aBf47dfcEAfD182Fb613EB16d86a24](https://etherscan.io/address/0x1dfab93f39abf47dfceafd182fb613eb16d86a24)\n\nThis is my most fleshed out wallet regarding networks.\n\nCurrently most of my funds are on KuCoin, Gemini, and Cake Defi.  Only 2 days ago, I was investigating staking Cake out of my own wallet as opposed to using Cake Defi platform.  I am glad I did not fully comprehend the procedure--heck, not even a little.\n\nThis was my first wallet.  It has been a fundamental part of what little I truly understand about crypto.\n\nNow for a stupid question: What do I do with the wallet?",
            "stickied": false,
            "comments": [
                {
                    "id": "i33q0k8",
                    "author": "shaggy_shiba",
                    "score": 4,
                    "created_utc": 1648904146.0,
                    "response": "make new private key\n\nmove everything to and address under the new private key",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "tsqixu",
            "title": "Where can I find high quality crypto content?",
            "url": "https://www.reddit.com/r/ethereum/comments/tsqixu/where_can_i_find_high_quality_crypto_content/",
            "author": "IceIceMoney",
            "created_utc": 1648696658.0,
            "score": 4,
            "num_comments": 42,
            "subreddit": "ethereum",
            "selftext": "Hello! Anyone have any recommendations on high quality content around crypto, NFTs and web3 in general? I’m a dev so the more technical the better. I’d appreciate if you guys could send the writers/podcasts/youtubers etc that you guys love. I’m looking for stuff that isn’t super spammy or just sensationalist like “hot coins” or just hyping stuff up. \n\nThank you!",
            "stickied": false,
            "comments": [
                {
                    "id": "i2tfnj3",
                    "author": "beefbrisketman",
                    "score": 3,
                    "created_utc": 1648707970.0,
                    "response": "Coin Bureau. YouTube videos can be long sometimes like at least 20 minutes but the content presented is quite good.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2t52cx",
                    "author": "HackLaddy",
                    "score": 5,
                    "created_utc": 1648700858.0,
                    "response": "Bankless. Great podcast(s) and YouTube videos. News, Cool interviews with influential people, and the Bankless Weekly Rollup is amazing!\n\n[https://banklesshq.com/](https://banklesshq.com/)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2t69aj",
                            "author": "ChunderHog",
                            "score": 3,
                            "created_utc": 1648701554.0,
                            "response": "Second Bankless.  Lots of very high profile interviews with crypto and DeFi thought and business leaders.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "tslw7r",
            "title": "Question on this fee...",
            "url": "https://i.redd.it/8qotrx20slq81.jpg",
            "author": "swifty714",
            "created_utc": 1648681824.0,
            "score": 4,
            "num_comments": 37,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i2shy0m",
                    "author": "Glum_Squirrel_1772",
                    "score": 9,
                    "created_utc": 1648689361.0,
                    "response": "Welcome to the real world bud",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "tsaq6q",
            "title": "Was the famous DAO attack on Ethereum actually a 'crime' in the normal sense?",
            "url": "https://www.reddit.com/r/ethereum/comments/tsaq6q/was_the_famous_dao_attack_on_ethereum_actually_a/",
            "author": "23times3-",
            "created_utc": 1648658786.0,
            "score": 3,
            "num_comments": 20,
            "subreddit": "ethereum",
            "selftext": "Hear me out...\n\nHaving read 'Out of the Ether' by Matthew Leising (great book btw for anyone looking to learn about the origins of Ethereum) I found myself considering the DAO attack and whether there was a theft and a crime committed?\n\nI guess this is more of a philosophical question as yes obviously everyone who sent Eth to the DAO was essentially entrusting their money and I don't condone someone taking millions of dollars from average people; however entrusting it to a smart contract which anyone could view the source code to is different to say entrusting it to an ordinary bank.\n\nIf everyone could view the source code and hence it's vulnerabilities then surely the responsibility is on the sender to know what they're sending their money to (granted you'd have to be a computer genius but still) then no crime has been committed because the laws of the contract are there in black and white.\n\nIt's a bit like sending your money to a bank whom you trust, but in their small print terms and conditions it says actually anyone might take your money for their own purposes and theres nothing we can do about it. Obviously no one would use a bank like that, and if your money was stolen you wouldn't say a crime has been committed as the bank stated that it might happen.\n\nI'm interested to hear people's thoughts as well as the legalities of what actually went down!\n\nThanks!",
            "stickied": false,
            "comments": [
                {
                    "id": "i2rpj62",
                    "author": "Trick_Brain",
                    "score": 3,
                    "created_utc": 1648676588.0,
                    "response": "Yes it is - if a bank screws you over in the small print terms, it’s often illegal as well.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2smb1e",
                    "author": "DarkJezter",
                    "score": 3,
                    "created_utc": 1648691338.0,
                    "response": "I would say it's complicated.  The DAO exploit relied upon a reentrancy bug, which exploits a subtle aspect of the virtual machine to violate otherwise perfectly reasonable assumptions in the contract code.\n\nToday, reentrancy exploits are common, but avoided through careful consideration of code execution order, and the inclusion of reentrancy guards.\n\nThe point is, it's not like the DAO contract contained a 'drain all funds' clause.  It's more like a flaw in the entire system, that invalidated specific clauses in many contracts. Funds are still stolen today because of this issue combined with contracts that aren't carefully written to mitigate it.\n\nThe space as a whole is more dangerous, and writing smart contacts is far more difficult because of this and similar flaws.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2qoh8y",
                    "author": "HeatSeekingPanther",
                    "score": 5,
                    "created_utc": 1648661913.0,
                    "response": "Hacking a cyber system is a crime the same way invading another country is a crime. The attacker is often sovereign (or sovereign via anonymity with good OPSEC) so punishing said crime is not strait forward and cannot be done from within a sovereigns legal system. It's morally bad, but I would argue that the accusation of crime and immorality in this case maybe misses the point.\n\nIn trustless control systems such as war and cyber security no one is trusted, and criminality is expected. There are no good guys and bad buys. You are either a winner or a loser, your defense was either adequate or inadequate. Morality plays no role in trustless systems. Is the lion that kills the gazelle morally bad? No, it was merely exploiting a poor defense for its own personal gain.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2sqkt6",
                            "author": "Perleflamme",
                            "score": 4,
                            "created_utc": 1648693303.0,
                            "response": "This is very well put. Thank you.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2qj2kj",
                    "author": "XGalaxy-EyesX",
                    "score": 4,
                    "created_utc": 1648659784.0,
                    "response": "Anyone can walk into a bank with a shotgun and peacefully tell the tellers \"empty their drawer into a bag\" and they'll do it. but we don't because it's wrong. Dao hacker should've committed a change in private and sought out a bug bounty because that's the right way to do things. It's software no software is perfect.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "tqz63v",
            "title": "How do I upload JSON files to opensea?",
            "url": "https://www.reddit.com/r/ethereum/comments/tqz63v/how_do_i_upload_json_files_to_opensea/",
            "author": "sonytt763",
            "created_utc": 1648558686.0,
            "score": 4,
            "num_comments": 17,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uhv6n0",
            "title": "Ethereum Inflation",
            "url": "https://www.reddit.com/r/ethereum/comments/uhv6n0/ethereum_inflation/",
            "author": "NoahsArkJP",
            "created_utc": 1651627278.0,
            "score": 14,
            "num_comments": 47,
            "subreddit": "ethereum",
            "selftext": "I’m really confused about ethereum’s inflation rate. I just googled and read it’s about 4.5% per year. That’s pretty high. Before I thought that the inflation tended toward’s zero because a fixed supply of ethereum is released every year which makes the ratio of newly minted ethereum to existing ethereum less and less. Please clarify what ethereum’s inflation algorithm is if there is one. Thanks",
            "stickied": false,
            "comments": [
                {
                    "id": "i78lelq",
                    "author": "PandemoniumX101",
                    "score": 29,
                    "created_utc": 1651628845.0,
                    "response": "You are missing two critical components: EIP-1559's burn mechanism and The Merge which will happen in the next few months (3-6'ish)\n\n[https://ultrasound.money/](https://ultrasound.money/)  \n\n\nThe bottom of that site has a small little FAQ that should help.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i78pj2r",
                            "author": "NoahsArkJP",
                            "score": 3,
                            "created_utc": 1651630651.0,
                            "response": "I thought I had replied to this but I don't see my reply. Thanks for sending this. The site you linked to says that the amount of eth decreasing each year is greater than the newly minted eth which creates a net decrease each year which in turn causes negative inflation. Three big questions arise from this:\n\n1. Is this decreasing inflation built into ethereum's algorithm?\n2. If yes, can this algorithm be changed, or is eth sufficiently decentralized to prevent the algorithm from changing.\n3. If the eth supply is decreasing, wont we end up with zero eth in the future?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i78pve4",
                                    "author": "PandemoniumX101",
                                    "score": 11,
                                    "created_utc": 1651630804.0,
                                    "response": "Please look at my comment history as I gave a very indepth response but auto-mod removed it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i78nowp",
                    "author": "BigEFF",
                    "score": 7,
                    "created_utc": 1651629833.0,
                    "response": "https://ultrasound.money",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7a4p2f",
                    "author": "ForbiddenOwl",
                    "score": 3,
                    "created_utc": 1651665183.0,
                    "response": "This may be a bit off-topic but I truly believe Ethereum is eventually going to flip BTC. A ton more utility, It's own incredible ecosystem and the foundation for many other ecosystem like Polygon's. Ethereum is the undisputed king.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i78op3n",
                    "author": "EvanVanNess",
                    "score": 5,
                    "created_utc": 1651630276.0,
                    "response": "it's been about 2% inflation with eip1559",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i79m1k8",
                    "author": "Olmops",
                    "score": 3,
                    "created_utc": 1651650429.0,
                    "response": "You are sort of correct regarding the \"fixed\" amount per year. The newly minted \"block reward\" is 2 ETH per block, so - although the number of blocks is not exactly fixed per year - you get roughly 4,5% when you put that in relation to all ETH currently in existence.\n\nBut (as others have noted):\n\n\\- you have the fee burn mechanism which is variable and lowers inflation\n\n\\- the block rewards were changed in the past, although not automatically as Bitcoin does it\n\n\\- this whole thing will change completely with Proof-of-Stake, [ultrasound.money](https://ultrasound.money) is a very good address to see the simulated effects\n\n\\- if you think about it, Bitcoin is technically also inflationary for the next 100+ years (=any relevant timespan), although the decreasing inflation never lets BTS exceed the mythical 21 millions. As of today, new supply and demand still affect BTC price! (someone has to buy 900 BTC at market price each and every day)\n\nSo, regarding Ethereum, do not get mad over that inflation thing. Short term, this will happen: Supply will grow a bit until the switch to PoS in a few months (July or August maybe?).\n\nThen, all of a sudden, supply will be zero as no new block rewards will be minted and all PoS rewards remain locked. The functionality to withdraw stakes and staking rewards is going to be added one release later (Shanghai release).\n\nTechnically, this means that the circulating ETH will decrease through burn (and probably more people staking and locking ETH). Then, at the Shanghai release (which I think will happen at least 6 months after the Merge), a lot of ETH (\\~1 million+) might rush into the market as the accumulated staking rewards since 12/2020 become unlocked.\n\nAfter that, we will have to see how everything plays out. Supply WILL be a lot lower than now. It could be that ETH becomes slightly deflationary or slightly inflationary, but I think in any case it will remain somewhere near zero. So despite all marketing that says otherwise, basically ETH will stop being inflationary like a hundred years before BTC.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uhv1mz",
            "title": "ETH defi?",
            "url": "https://www.reddit.com/r/ethereum/comments/uhv1mz/eth_defi/",
            "author": "OffTempestuousness",
            "created_utc": 1651626854.0,
            "score": 6,
            "num_comments": 17,
            "subreddit": "ethereum",
            "selftext": "Does anyone have any resources where I can learn more on ETH defi?\n\nI have MEW and am thinking of moving my DCA to buying ETH directly there and liquidity mining through their platform. \n\nI saw I can buy SKL too. I’m guessing that’s another ETH defi token? \n\nAfter crypto.com slammed me with staking and Cashback changes I want to move away from CEFI. \n\nI am a bit of an ETH maxi and have been staking with Coinbase but want to move away for obvious reasons with later investments.",
            "stickied": false,
            "comments": [
                {
                    "id": "i79gf0r",
                    "author": "Nonocoiner",
                    "score": 3,
                    "created_utc": 1651645846.0,
                    "response": "You can take a look at https://defirate.com, which is a list of both DeFi and CeFi projects.\n\nMost DeFi discussion takes place at the r/ethfinance daily.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i79j13o",
                    "author": "PinkPuppyBall",
                    "score": 3,
                    "created_utc": 1651647896.0,
                    "response": "You can get good returns on Arbitrum - an Ethereum Layer2 rollup. If you don't have big amounts I can recommend impermax, I've also heard good things about gmx but haven't used it myself.\n\nUse small sums and play around to get a feeling for it.\n\nA list of some of the dapps on Arbitrum https://portal.arbitrum.one/\n\nOverview of all Ethereum Layer2\n\nhttps://L2beat.com\n\nBridges, fiat onramps and some nice info\n\nhttp://Ethl2s.com\n\nThe best tip overall, don't get greedy. Don't reply to any direct messages you might have just received. If you see apy in the hundreds or thousands of percent then it's either a scam or return in a token that is rapidly losing value.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ui16c3",
            "title": "India: Can't ban crypto, let's tax it death",
            "url": "https://www.reddit.com/r/ethereum/comments/ui16c3/india_cant_ban_crypto_lets_tax_it_death/",
            "author": "akai_shuichi1",
            "created_utc": 1651649570.0,
            "score": 72,
            "num_comments": 28,
            "subreddit": "ethereum",
            "selftext": "How realistic is the country's dream to tax DeFi earnings? And what could be the possible ways a regulator could look at DeFi that way?\n\n[https://thelayer.xyz/india-plans-to-bring-20-tax-for-earning-via-defi-activities/](https://thelayer.xyz/india-plans-to-bring-20-tax-for-earning-via-defi-activities/)",
            "stickied": false,
            "comments": [
                {
                    "id": "i79vtkl",
                    "author": "yashptel99",
                    "score": 14,
                    "created_utc": 1651659022.0,
                    "response": "A quick way to make successful crypto startups move out of India. Like Wazirx recently did. And people who got rich from crypto too. The tax is literally same as gambling on a cricket team on dream eleven. That doesn't make sense at all. Crypto is way closer to stock market and securities than it is to gambling on dream11",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i79z74e",
                            "author": "hnr01",
                            "score": 6,
                            "created_utc": 1651661644.0,
                            "response": "The Securities Exchange Commission did not like this comment.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i79wrc5",
                            "author": "akai_shuichi1",
                            "score": 5,
                            "created_utc": 1651659787.0,
                            "response": "WazirX did not move out of India, it was its founders. And their moving out does not really affect the exchange's functioning cos Binance acquired it way back in 2019 itself. But what does play out is regulators shadow forcing banks to not provide banking services to crypto-focused companies. It's gotten so hard to do fiat and crypto transactions because of this. Even in P2P, USDT is going at a premium price of over 80 INR per coin. So much money is lost in just the process of getting into the crypto-sphere, and more loss is incurred while trying to get out. FML.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i79nmfi",
                    "author": "_m3r1u5_",
                    "score": 16,
                    "created_utc": 1651651797.0,
                    "response": "Blockchain can still flourish. Developers will just have to go by the usual method of having an actual useful product to pitch that attracts loans from banks or investments from venture capital. Imagine that.\n\nThere's an argument to be made that the highly speculative nature of cryptocurrencies actually hurts blockchain innovation and adoption. Time will tell as China and India eliminate or reduce the speculative currency aspect of the technology.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7a37w0",
                    "author": "osamabinlaidoffwork",
                    "score": 3,
                    "created_utc": 1651664296.0,
                    "response": "Will come back to bite us in the ass in a few years. Just watch. Once crypto goes mainstream even more and major outlets start accepting it, Indian vendors and merchants will end up losing a lot. Just how currently GST has increased prices by xyz amount.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uhu1rd",
            "title": "Made a rate limiter for token outflows for contracts to limit outflows within n timeframe relative to total assets to limit losses from hacks.",
            "url": "https://twitter.com/not_pr0/status/1521644649567461378",
            "author": "NOTPR0",
            "created_utc": 1651623686.0,
            "score": 12,
            "num_comments": 16,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}