{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxgof4",
            "title": "What inspired you to begin purchasing cryptocurrencies, and when did you begin?",
            "url": "https://www.reddit.com/r/ethereum/comments/uxgof4/what_inspired_you_to_begin_purchasing/",
            "author": "Fun_Art8013",
            "created_utc": 1653483072.0,
            "score": 5,
            "num_comments": 19,
            "subreddit": "ethereum",
            "selftext": "I'm interested because, as we went to cryptocurrency acceptance, everything sprang out at once, crypto, metaverse, and the entire issue is there in talks, the press, and on television.  \n\n\nWhich cryptocurrency caught your curiosity the most at first?  \n\n\nWhen ETH was not worth much a few years ago, I didn't anticipate anything extraordinary to happen, and it all happened unexpectedly. I'm pleased I made such a radical change in my life and began doing more study on cryptocurrency.  \n\n\nI remember, that because I didn't know anyone who was working with Ethereum at the time, I was on my own and couldn't receive any solid advice. I now use Metis thanks to various Reddit users who assisted me much by exposing me to L2 platforms, and I must state that these L2 solutions are crucial for dealing with petrol prices.  \n\n\nWhat did you find most confusing at the time?  \n\n\nMany of us work with cryptocurrencies and devote significant attention to them. How are you dealing with the recent dips, are you concerned, and have you considered selling crypto?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9xm3df",
                    "author": "ModernDayPeasant",
                    "score": 6,
                    "created_utc": 1653485689.0,
                    "response": "A documentary in 2018 inspired me to research and been hooked ever since. Inexperience and greed unfortunately leaves me in the red at the moment but my mentality has changed since then. Personally i feel freedom and independence being \"my own bank\" and regardless of the dollar value it gives me great pleasure to know a large portion of my money is not being held and used by banks to support drilling, fracking, war, and lobbying politicians into creating policies with which I disagree. Happy to be part of this new frontier and will continue to move what fiat I can into projects I believe in. Not planning on selling unless I can't put food on the table.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xnb47",
                    "author": "daxtaslapp",
                    "score": 3,
                    "created_utc": 1653486250.0,
                    "response": "to sell at a higher price",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y2fpz",
                    "author": "LesserMatryoshka",
                    "score": 2,
                    "created_utc": 1653492600.0,
                    "response": "I read a book called Debt: The First 5000 Years, and realized that the USD is about to zero out, and blockchain assets function very similarly to how humans naturally organize trade while promoting individual freedom and responsibility.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zb6vn",
                    "author": "Successful-Long3716",
                    "score": 2,
                    "created_utc": 1653510246.0,
                    "response": "Empaths for the greater good of humanity. Others motivated by profit. Others knowledgeable enough to comprehend the capabilities of cryptocurrency. Others for the meme of it. \n\nRegardless of why, it’s a hell of a lot more exciting than the traditional stock market IMO.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zl77k",
                    "author": "Rifleman80",
                    "score": 2,
                    "created_utc": 1653514441.0,
                    "response": "I heard about it on social media and after some research found it's a get rich quick scheme so as long as the trend is there it was an easy way to make a quick buck.\n\nAll things considered, just make sure not to be naive enough to believe cryptos are really going to help the lower social class. Let's call a spade a spade, it's a great way to make some easy money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xyvp2",
                    "author": "Soulstar205",
                    "score": 1,
                    "created_utc": 1653491163.0,
                    "response": "This is an unrelated question, but perhaps someone here can help. I have a token in one exchange, the wallet chain is polygon. I wanna send it to another exchange, where the wallet is erc20. \nAre there any dangers in doing this, will I get my tokens delivered?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xzeb8",
                            "author": "ledav3",
                            "score": 2,
                            "created_utc": 1653491372.0,
                            "response": "Maybe ask in r/0xPolygon",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9y3ikr",
                    "author": "peyotemccloud",
                    "score": 1,
                    "created_utc": 1653493026.0,
                    "response": "greed",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y6323",
                    "author": "c0horst",
                    "score": 1,
                    "created_utc": 1653494037.0,
                    "response": "Because my computer could mine it for free. That was pretty cool. Then I bought more graphics cards because I enjoyed building my mining rig and it was a fun hobby.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yiscm",
                    "author": "MuchFunSuchWow",
                    "score": 1,
                    "created_utc": 1653498981.0,
                    "response": "A guy working at google recommended ETH back in 2018, good times selling CS:GO skins and buying in at 100$/ETH",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ywru8",
                    "author": "Ok_Economics1981",
                    "score": 1,
                    "created_utc": 1653504448.0,
                    "response": "a new in taringa 2009",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9z6z70",
                    "author": "cjeans23",
                    "score": 1,
                    "created_utc": 1653508545.0,
                    "response": "That was when my friend was bragging to me about how he makes payments in crypto. He was using an app then called utrust. I didn't understand the whole thing, but that really brought crypto to my attention. I followed the rabbit hole, and here I am lol.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0g4qa",
                    "author": "laserdicks",
                    "score": 1,
                    "created_utc": 1653528671.0,
                    "response": "Honestly mining for free money. 2014.\n\nNowdays it's because the technology is bau of the future",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}