{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqp06h",
            "title": "Frequently Asked Questions + Weekly Discussion Thread",
            "url": "https://www.reddit.com/r/ethereum/comments/uqp06h/frequently_asked_questions_weekly_discussion/",
            "author": "AutoModerator",
            "created_utc": 1652680811.0,
            "score": 13,
            "num_comments": 55,
            "subreddit": "ethereum",
            "selftext": "**Welcome to the Weekly Discussion. Please read the disclaimer, guidelines, and rules before participating.**\n\nRules:\n\n* All [sub rules](https://www.reddit.com/r/Ethereum/about/rules/) apply in this thread.\n* Discussion topics must be related to Ethereum.\n* Behave with civility and politeness. Do not use offensive, racist or homophobic language.\n* Comments will be sorted by newest first.\n\nUseful Links:\n\n* [Ethereum.org](https://ethereum.org)\n* [ETHMerge.com](https://ethmerge.com/)\n\n**Reminder**\n\n/r/ethereum is a community for discussing the technology, news, applications and community of Ethereum. **Discussion of the Ether price or trading is not allowed.** Please keep those discussions to [/r/ethfinance](https://www.reddit.com/r/ethfinance) and [/r/ethstaker](https://www.reddit.com/r/ethstaker).\n\n&#x200B;\n\n**Frequently Asked Questions**\n\n**Where's the best place to buy ETH?**\n\nThere are many centralized exchanges that support Ethereum. If you live in the US, the most popular exchanges are Coinbase, Gemeni and Kraken. Coinbase users can use Coinbase Pro for lower fees.\n\n**When is Eth2 launching?**\n\nEth2 is a marketing term used to represent a number of updates to Ethereum. The Eth2 proof-of-stake chain first launched in December 2020. \"The Merge\", which is the event that will fully switch Ethereum's consensus to proof-of-stake, is estimated to be ready in early 2022, although there is no exact timeline. Other updates, such as data shards, will follow that update.\n\nVisit [ethmerge.com](https://ethmerge.com/) to learn more about \"The Merge\".\n\n**Do I need to do anything to update to Eth2? Will Eth2 create a new token?**\n\nNo, ETH holders *never* need to take any action to keep holding ETH. Ethereum users will be unaffected by the Eth2 upgrade. And the Eth2 updates will not create any new tokens.\n\n**How can I stake my ETH?**\n\nThe best way to stake your ETH: by running your own validator.\n\n* Running your own validator requires a modern computer and 32 ETH. Visit /r/ethstaker for more details\n\n**Why are Ethereum transaction fees so high?**\n\nLike most blockchains, Ethereum fees are determined by supply-and-demand. The large demand to use Ethereum has pushed transaction fees quite high (however, fees were just a few cents only 2 years ago). Fees are especially high during market volatility, and during NFT drops.\n\n**What is being done to lower Ethereum transaction fees?**\n\nEthereum fees are reduced by using layer-2 rollups. Rollups are scaling solutions that allow for significantly cheaper transactions, while still maintaining Ethereum's security.\n\nAdditionally, Eth2's data shards will make rollups even cheaper.\n\nWhile rollups are cutting-edge technology being actively developed, a number are already live on Ethereum mainnet. Visit [l2beat.com](https://l2beat.com/) to learn more about rollups.\n\n**What's the best wallet for Ethereum?**\n\nThe most popular tool for using decentralized applications is Metamask. However, for security reasons, we recommend using a hardware wallet such as a Trezor or Ledger.\n\n&#x200B;\n\nAre there questions you'd like to see added? Leave a comment below.",
            "stickied": true,
            "comments": [
                {
                    "id": "i8shi9v",
                    "author": "Nonocoiner",
                    "score": 8,
                    "created_utc": 1652682679.0,
                    "response": "We're getting close:\n\n* Mainnet shadow fork 5 estimated for next Thursday, May 19.\n\n* Ropsten upgrade to PoS estimated for June 8",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ta0x7",
                    "author": "AESTHTK",
                    "score": 3,
                    "created_utc": 1652704906.0,
                    "response": "W E N M E R G E\n\n(When it’s ready)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sgv9l",
                    "author": "MokolokoPlus",
                    "score": 2,
                    "created_utc": 1652682173.0,
                    "response": "I want to know if it’s more reliable mining or buying eth in terms of accumulating eth , two days ago I started to make dca on eth, bc i like it",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8sic3j",
                            "author": "420weedscopes",
                            "score": 3,
                            "created_utc": 1652683336.0,
                            "response": "Sooner or later the transition to POS will occur so there will be no more mining just staking issuance. Also there is still a gpu shortage so getting mining equipment for a good price isn't super easy. You're better off just spending the money on eth than all the hardware at this point imo. Be careful with your money.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8siyhb",
                                    "author": "MokolokoPlus",
                                    "score": 1,
                                    "created_utc": 1652683830.0,
                                    "response": "Ok I understand, thank u",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8ta3yl",
                            "author": "AESTHTK",
                            "score": 6,
                            "created_utc": 1652704952.0,
                            "response": "This is a must listen and answers your question:\n\nhttp://podcast.banklesshq.com/betting-the-fund-on-the-merge-hal-press-north-rock-digital\n\nMining ROI is getting less and less likely by the day.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8si8ey",
                            "author": "Nonocoiner",
                            "score": 2,
                            "created_utc": 1652683257.0,
                            "response": "If mining is profitable depends a lot on what you pay for electricity. Most of the ETH you mine you would need to sell to pay the electricity bills.\n\nIf you've already got a suitable graphics card and cheap electricity it might very well be still worth the trouble, but I would not invest in mining equipment right now, because Ethereum mining is expected to end later this year.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8sj0er",
                                    "author": "MokolokoPlus",
                                    "score": 1,
                                    "created_utc": 1652683872.0,
                                    "response": "A gtx 1050 of a laptop can be?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8sjstw",
                                            "author": "Nonocoiner",
                                            "score": 3,
                                            "created_utc": 1652684512.0,
                                            "response": "I don't think mining on any laptop is feasible, but I don't know enough about the technical details of mining to give advice on setups.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8sk3hc",
                            "author": "Perleflamme",
                            "score": 2,
                            "created_utc": 1652684751.0,
                            "response": "It mostly depends on your access to cheap cards and cheap electricity. If you already have the cards, then it could make sense if it's profitable enough to you. \n\nOtherwise, please be reminded that mining may not last long enough to justify buying a card specifically for mining purposes and reselling it afterwards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vsz3b",
                    "author": "Abject-Web-5956",
                    "score": 2,
                    "created_utc": 1652743664.0,
                    "response": "When you have an nft you basically have a url or location for an ifps that the image is stored on. That url or ifps info, is that stored on thr blockchain? If so, how? Is it like 'wallet address, data?'. Or is the wallet address a location to a file on the owners phone or wallet that has the location?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xu3hh",
                            "author": "Maswasnos",
                            "score": 2,
                            "created_utc": 1652791455.0,
                            "response": "If the NFT is in IPFS and isn't one of the ones stored on-chain, the on-chain NFT contains a URL pointing to the IPFS location. The Bored Ape contract holds all of this data as well as a register of which ETH addresses have which Ape NFTs. \n\nAs an example, here is the Etherscan contract page for the Bored Ape NFT set:\n\nhttps://etherscan.io/address/0xbc4ca0eda7647a8ab7c2061c2e118a18a936f13d#readContract\n\nIf you expand #20 \"tokenURI\" you can enter the token ID of any Bored Ape and it will output an IPFS URL. I entered \"1859\" because it was the first ape I saw on OpenSea, and that output this URL:\n\nipfs://QmeSjSinHpPnmXmspMjwiXyN6zS4E9zccariGR3jxcaWtq/1859\n\nIf you enter that into your browser it should take you to a basic webpage with the token info, which includes another IPFS URL:\n\nipfs://QmQx9x2ioChpipfHGeGEQXYSRwAWerdJTKoYKHjPPUuB7z\n\nIf you enter that into the browser, it will bring up the image of the Bored Ape which is stored in the IPFS distributed storage network.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zi3kp",
                                    "author": "Abject-Web-5956",
                                    "score": 2,
                                    "created_utc": 1652816862.0,
                                    "response": "So, generally, nfts are data stored on chain, usually a url, but the nft itself can be stored on chain ie image data if someone wanted to pay the gas simply because an nft is a uniquely identifiable blockchain transaction that can be programmed how you want.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zlba6",
                                            "author": "Maswasnos",
                                            "score": 1,
                                            "created_utc": 1652818190.0,
                                            "response": "Pretty much, yes. The main issue is that on-chain data has to be *extremely* small. Some NFTs like Art Blocks get around this by simply deploying the image generation algorithm to the chain, and then each individual NFT is actually just a number that gets plugged into the algorithm to create an output image.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i90wofy",
                    "author": "yolodogewtf",
                    "score": 2,
                    "created_utc": 1652839766.0,
                    "response": "It is easy for me to put a conceivable price on BTC - It is trying to be a digital version of gold, and I just have to look at the market cap of gold and see that it can 10x if it surpasses gold.  This is a “good case scenario” for BTC. \n\nIs there an analogy for ETH? What other asset is comparable to ETHs _purpose_ that has a market cap.  \n\nI don’t like “silver” since that seems odd…silver is valuable for being scarce and having industrial uses like making actual physical products.  If fact, having concrete physical use is why silver is worth less than gold, and scarcity is the main (but not only) value of silver. Scarcity is not the main driver of ETH’s value, the ability to run smart contracts is \n\nIs it aws? Maybe…but only sorta…I don’t think there will ever be a decentralized version of Netflix (runs on AWS) that more than 100 million people use, but what do I know… IMO there is not much demand for a decentralized AWS in consumer tech, but that’s a separate point…maybe AWS is nevertheless the best thing to help give a benchmark “good case scenario” value of ETH , even if I’m skeptical of that good case panning out \n\nThoughts?  Other things that ETH resembles that has a well defined market cap?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i923zc4",
                            "author": "Maswasnos",
                            "score": 1,
                            "created_utc": 1652870836.0,
                            "response": "Most people use oil as the analogy since oil powers our transportation network and so many other use cases.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9288gi",
                                    "author": "yolodogewtf",
                                    "score": 2,
                                    "created_utc": 1652873796.0,
                                    "response": "don’t quite buy that analogy.  \n\nGold is used as a base layer for making purchases.  Bitcoin is aiming to do the exact same, not just some fluffy analogy like “ETH is a transport layer/system”",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i928mrb",
                                            "author": "Maswasnos",
                                            "score": 5,
                                            "created_utc": 1652874054.0,
                                            "response": "Ethereum is aiming to be the network upon which the global economy runs. ETH is the asset that powers it. \n\nIt's not a 1:1 analogy but it gets the point across.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9ejwkp",
                                    "author": "kwaker88",
                                    "score": 1,
                                    "created_utc": 1653098718.0,
                                    "response": "However, oil is not money. If batteries become better, oil will be replaced.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ekagm",
                                            "author": "Maswasnos",
                                            "score": 1,
                                            "created_utc": 1653098925.0,
                                            "response": "It's just a simple analogy and I think we're way beyond it, but in that case oil is also critical in all kinds of other applications other than power. Nearly infinite use cases.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9emia4",
                                                    "author": "kwaker88",
                                                    "score": 1,
                                                    "created_utc": 1653100126.0,
                                                    "response": "But what drives the main economic value for oil?\n\nIf energy usecase is obsolete, then would it have nearly the same value? The demand for it will drop many-fold.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9emtwp",
                                                            "author": "Maswasnos",
                                                            "score": 1,
                                                            "created_utc": 1653100305.0,
                                                            "response": "Sure, I suppose. But we're not actually talking about oil here and this doesn't really apply to Ethereum.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9emzjw",
                                                                    "author": "kwaker88",
                                                                    "score": 1,
                                                                    "created_utc": 1653100395.0,
                                                                    "response": "Which about Ethereum makes it resistant to my analogy?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9en1zk",
                                                                            "author": "Maswasnos",
                                                                            "score": 1,
                                                                            "created_utc": 1653100432.0,
                                                                            "response": "Ethereum doesn't power cars or electric plants...",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9en5rw",
                                                                                    "author": "kwaker88",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653100491.0,
                                                                                    "response": "What does it power?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9enavn",
                                                                                            "author": "Maswasnos",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653100566.0,
                                                                                            "response": "Transactions on the Blockchain. There's no replacement technology for that.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i90z5y6",
                    "author": "yolodogewtf",
                    "score": 2,
                    "created_utc": 1652840952.0,
                    "response": "Why on earth is ETH doing a triple halving all the sudden this year? \n\nBTC was designed from the start to have a predictable and fixed halving schedules, as a way to ensure that BTC gets more scarce as time goes on in a predictable way. \n\nETH never had a halving before.  It’s value prop is to be a decentralized computing platform, not digital gold.  A halving for ETH makes no intuitive sense to me \n\nWhy is ETH doing a triple halving this year? Convince me this isn’t some sketchy attempt to do a one time thing to pump the price.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i927lqe",
                            "author": "MrVodnik",
                            "score": 5,
                            "created_utc": 1652873385.0,
                            "response": "It has nothing to do with BTC's halvings or monetary policy. It is not halving at all, but transition from PoW to PoS, which does not require as much inflation. The phrasing \"tripple halving\" is just a crypto twitter marketing to get more attention. \n\nThe move to PoS was planned from the very beginning of Ethereum. So nothing \"new\" or \"sudden\" in this move. The only novelty is that new people are starting to hear about it for the first time.\n\nEthereum had never set in stone its monetary policy. Vitalik and the rest of the team always stated that the inflation (or other monetary aspects) will be set according to the network's security needs. With transition to PoS, there is no more need to pay for the electricity. \n\nEthereum does not compete to be digital gold. Its goal is to be decentralized general purpose machine with highest security guarantees. If it became \"ultra sound money\" or \"store of value\" on the way, it is just a byproduct of being such a valuable (by utility, not by coins cap) asset.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9282rw",
                                    "author": "yolodogewtf",
                                    "score": 1,
                                    "created_utc": 1652873692.0,
                                    "response": "But why will there be a large drop in issuance of new ETH under PoS? \n\nWhy not keep the issuance rate the same and use PoS?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i929bdf",
                                            "author": "MrVodnik",
                                            "score": 5,
                                            "created_utc": 1652874483.0,
                                            "response": "Because there is no need for high issuance. In PoW consensus miners have huge cost in electricity. The more you pay them, the more of security they provide for the network. 4% inflation is quite high and at current ETH market cap it is worth \\~25 million USD a DAY... almost 10 billion USD a year. \n\nIn PoS consensus system, electricity costs for miners (now validators) should drop by 99.9%. Even thou, it is expected that 20-30% coins will be staked (\\~75 billion USD worth of ETH at current price) and they might earn anything between 10-20% APR from capturing new issuance, miner tips and MEV. Without \\*any\\* costs, they will earn way more than miners yearn today. \n\nThere is no need to give stakers/validators more. This would hurt non staking parties (standard ETH holders) and concentrate more and more ETH in the hands of few. \n\nThe additional benefit (\"by the way\") of low issuance is that burning mechanism will most likely be burning more ETH than there is created. This will make ETH a deflationary asset that benefits ALL ETH holders. This actually mean that there is no \"triple halving\" but \"infinite halving\". \n\nThe whole picture is so well thought that is makes it fascinating :)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9atxfb",
                                                    "author": "DontAskMeDudes",
                                                    "score": 3,
                                                    "created_utc": 1653030764.0,
                                                    "response": "I love you",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9dg4i7",
                                                            "author": "MrVodnik",
                                                            "score": 1,
                                                            "created_utc": 1653078898.0,
                                                            "response": "Thank you, I love you too, go and enjoy your life :)",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i92cpa0",
                                                    "author": "yolodogewtf",
                                                    "score": 2,
                                                    "created_utc": 1652876484.0,
                                                    "response": "That makes sense",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i923v3r",
                            "author": "Maswasnos",
                            "score": 2,
                            "created_utc": 1652870744.0,
                            "response": "It's not \"all the sudden\", it's been planned from the very beginning of ETH. The transition to PoS has been an extremely long time coming; it's only just now that people are starting to realize its implications for the supply dynamic.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i96an5j",
                    "author": "b-mw",
                    "score": 2,
                    "created_utc": 1652943289.0,
                    "response": "Why are 'rollups' or L2s not being utilized in most NFT projects? None of the blue chip nft projects use something like polygon (for example).",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96q7ue",
                            "author": "Maswasnos",
                            "score": 2,
                            "created_utc": 1652956928.0,
                            "response": "There is a sort of social \"premium\" attached to paying exorbitant amounts of money for NFTs. People simply don't place the same amount of value on an NFT they pay <$1 for versus one they pay >$100 for, even if that's just the gas fees. \n\nBut there are lots of NFT projects growing on rollups nonetheless. Check out TofuNFT for some of the top collections on Arbitrum and Quixotic.io for Optimism.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9aufsh",
                            "author": "Nonocoiner",
                            "score": 1,
                            "created_utc": 1653031204.0,
                            "response": "Not really into jpeg NFT's myself, but I think status plays an important role here. Ethereum L1 is the chain on which NFT's gained all the traction, and it has become the household name.\n\nOf course it's also the most secure and decentralized chain with NFT capabilities.\n\nEdit: true L2's (which Polygon isn't yet) of course inherit security from L1, but aren't as secure and as much adopted as L1 yet.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9dheqz",
                            "author": "MrVodnik",
                            "score": 1,
                            "created_utc": 1653079477.0,
                            "response": "My toke on it:\n\nIf you're going to pay (or earn in the future) hundreds of thousands dollars, sometime millions, $50 transaction fee is not a concern to you. \n\nIt is a little bit like physical art. You could put it up on streets in your town's downtown, which would be both cheap and many people would view them, but that would only take away some value. On the other hand, put in the prestigious gallery, preferably after flying it to New York or Paris, and you've already implied higher potential value to the buyer. \n\nArt is not about the pretty pictures. The value comes from non tangible aspects that are real only in people heads. I believe that Ethereum will stay main hub for high-value art NFTs for as long as Ethereum has data layer as part of its core protocol. It being expensive might actually add to the piece value...",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zi50x",
                    "author": "iPotCtrl",
                    "score": 1,
                    "created_utc": 1652816879.0,
                    "response": "If I have my ETH bridged to Arbitrum, can I deposit to Kraken from there or do I have to bridge it back to mainnet first?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90ky8j",
                            "author": "Nonocoiner",
                            "score": 3,
                            "created_utc": 1652834241.0,
                            "response": "Unless something recently changed Kraken doesn't support Arbitrum yet.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91djh8",
                                    "author": "iPotCtrl",
                                    "score": 3,
                                    "created_utc": 1652848841.0,
                                    "response": "True. I contacted support and they told me the same. Deposited to FTX . They support Arbitrum.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i927p74",
                            "author": "MrVodnik",
                            "score": 2,
                            "created_utc": 1652873448.0,
                            "response": "I did deposit ETH from Arbitrum directly to Binance, if you're looking for an alternative.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i993h82",
                    "author": "Visible9",
                    "score": 1,
                    "created_utc": 1652996050.0,
                    "response": "Is there any good place stake eth on l2 or sidechains? Mainnet is too expensive",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99qk96",
                            "author": "Maswasnos",
                            "score": 3,
                            "created_utc": 1653007365.0,
                            "response": "You can always buy rETH on Arbitrum, Optimism, zkSync, or Polygon. I believe stETH also has some options on zkSync.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}