{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v11fp3",
            "title": "Addressing the most common misconceptions about Account-bound tokens",
            "url": "https://timdaub.github.io/2022/05/30/addressing-the-most-common-misconceptions-about-account-bound-tokens/",
            "author": "TimDaub",
            "created_utc": 1653920911.0,
            "score": 13,
            "num_comments": 6,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iajsjjv",
                    "author": "coinfeeds-bot",
                    "score": 2,
                    "created_utc": 1653921915.0,
                    "response": "tldr; Authors Tim Daubenschütz, Raphael Roullet, and Rahul Rumalla, the authors of the Account-bound tokens specification EIP-4973, address the most common misconceptions about the concept of binding tokens to an account. \"Account-bound\" (ABTs) can't be misused to dox someone permanently on-chain, they argue. If you want to delete someone's account, there are many ways to do so.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak6rgm",
                    "author": "lorenzomofo",
                    "score": 2,
                    "created_utc": 1653928329.0,
                    "response": "Ain't this just Soul Bound Tokens by another name?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ial8l64",
                    "author": "Perleflamme",
                    "score": 1,
                    "created_utc": 1653945749.0,
                    "response": "I'm not yet seeing how it couldn't be used to air drop tokens that you can't get rid off. To me, you'd need your client to specifically list the SBT/ABT you'd want to see, to be sure you're not cluttered by garbage. Just like with ERC-20.\n\nAnd maybe also have a way to say you're agreeing with specific tokens, to show your own approval of them and the fact you consider them legit. Otherwise, other people won't be able to know which ones are legit to you or not and will have to see a torrent of garbage tokens.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}