{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uycyi9",
            "title": "Could Bitcoin be replaced by an ERC-20 token?",
            "url": "https://www.reddit.com/r/ethereum/comments/uycyi9/could_bitcoin_be_replaced_by_an_erc20_token/",
            "author": "tekmol",
            "created_utc": 1653586537.0,
            "score": 0,
            "num_comments": 20,
            "subreddit": "ethereum",
            "selftext": "One of the main arguments against Bitcoin is its energy consumption.\n\nOn  the other hand, it is often said that there will be no new blockchain  that achieves what Bitcoin has achieved: Being distributed without a  premine that makes the founders rich and with no way for the people in  power to inflate the supply.\n\nWhat would happen is an ERC-20 token  would be created that is distributed just as Bitcoin. In a way that  everyone who holds Bitcoin automatically owns the same amount of this  token? A fork of Bitcoin on the Ethereum blockchain, so to say.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia3so5u",
                    "author": "Perleflamme",
                    "score": 6,
                    "created_utc": 1653594171.0,
                    "response": "You're talking about wBTC? \n\nI mean, it already exists, it's just that it's not on the same network, which means it's not for the same purposes at all. \n\nHow do you distribute an ERC-20 to someone who's only got one wallet, a BTC wallet? Token representation isn't the only thing that matters. There are networks behind it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3hlvo",
                    "author": "Knurlinger",
                    "score": 3,
                    "created_utc": 1653589609.0,
                    "response": "https://wbtc.network",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3cqxe",
                    "author": "superboget",
                    "score": 12,
                    "created_utc": 1653587632.0,
                    "response": "Could smartphones be replaced by vegetarien burgers ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia3in4g",
                            "author": "ALiteralHamSandwich",
                            "score": 3,
                            "created_utc": 1653590036.0,
                            "response": "LMAO",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia4oegh",
                            "author": "btc_clueless",
                            "score": 3,
                            "created_utc": 1653608260.0,
                            "response": "Asking the tough questions",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia3xdo1",
                    "author": "hanniabu",
                    "score": 4,
                    "created_utc": 1653596139.0,
                    "response": "Bitcoin was ninja-mined, which is essentially a premine",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5ky6z",
                            "author": "KoreanJesusFTW",
                            "score": 2,
                            "created_utc": 1653624584.0,
                            "response": "Hello there fellow classmate of 2009-2010.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8hx3y",
                                    "author": "hanniabu",
                                    "score": 1,
                                    "created_utc": 1653683128.0,
                                    "response": "I wish, I can in 2017 like the mainstream pleb I am lol",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia5iyxp",
                            "author": "Meadowsauce",
                            "score": 1,
                            "created_utc": 1653623454.0,
                            "response": "This",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5kknx",
                    "author": "domotheus",
                    "score": 2,
                    "created_utc": 1653624366.0,
                    "response": "Technologically speaking, nothing prevents it. You could make a smart contract that issues a tokenized version of Bitcoin and you can claim them if you can prove you own UTXOs that were unspent at a specific block height. Then if you insist you can still code PoW into the smart contract to keep issuing new tokens the same way the current blockchain is doing, although there's no security benefit in doing that.\n\nThe real challenge is a social one, you would have be to get enough people to agree \"okay, starting at this specific block height, the Real™ bitcoin is the one that was issued by this smart contract\" which I don't see ever happening.\n\nAnd like others have said you have wBTC to wrap bitcoin onto Ethereum but this comes with its own trust/security assumptions. Maybe in the future we'll have trustless bridges with zk magic (I know someone is trying to build that on StarkNet)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia73hnm",
                            "author": "cannedshrimp",
                            "score": 1,
                            "created_utc": 1653661645.0,
                            "response": "While this would replicate the bitcoin token and tokenomics. You clearly point out that it doesn’t use the same consensus. Interesting concept, but still not bitcoin. Part of the appeal of bitcoin is its simplicity in comparison to other protocols. As a result, the lower case “b” network couldn’t ever really exist on top of anything else.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5p7kn",
                    "author": "EmilyLovs",
                    "score": 2,
                    "created_utc": 1653627176.0,
                    "response": "wBTC != BTC\n\n...and never will.\n\nYou can't get the same utility value or security with a wrapped asset than the native chain.  Wrapped asset introduce a whole new set of risks.  And are only good for what they are good for... Defi, so eventually the holder can swap back to the native chain at some point.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3a3yk",
                    "author": "here_4_crypto_",
                    "score": 4,
                    "created_utc": 1653586574.0,
                    "response": ">can gold be replaced by elonmoondoge",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3apvt",
                    "author": "thecolordarkroom",
                    "score": 0,
                    "created_utc": 1653586822.0,
                    "response": "No",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3uie0",
                    "author": "LiveDirtyEatClean",
                    "score": 0,
                    "created_utc": 1653594932.0,
                    "response": "I think Bitcoin isnt going anywhere. It won't be replaced as the best store of value coin. This is extremely useful in countries where people are monetarily debased.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3no1o",
                    "author": "Qbaca42",
                    "score": 1,
                    "created_utc": 1653592096.0,
                    "response": "No offense, but why ask this kind of question? Are you a bot? \n\nDYOR and make a judgement call. What do any of us random redditors have to contribute at a credible level?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4oodf",
                    "author": "btc_clueless",
                    "score": 1,
                    "created_utc": 1653608392.0,
                    "response": "The premise of the question doesn't really make sense. You can't and won't simply replace one coin for a completely different token.\n\nWhat could happen one day is that Bitcoin switches its protocol to PoS. This would mean a highly controversial hardfork that I suspect would fail like every other Bitcoin hardfork before that tried to change the protocol in a significant way.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5wa8y",
                    "author": "VRoid",
                    "score": 1,
                    "created_utc": 1653632139.0,
                    "response": "Could the Sun be replaced by moon?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia72vbs",
                    "author": "cannedshrimp",
                    "score": 1,
                    "created_utc": 1653661376.0,
                    "response": "Unpopular opinion here, but the energy usage concern is far overblown (especially relative to our general energy problems as a society). There is plenty of evidence by now that it’s not a problem.\n\nHere are a a couple of the many examples.\n\nhttps://www.axios.com/2022/05/24/crypto-bitcoin-mining-industry-demand-for-energy-renewables\n\nhttps://www.lynalden.com/bitcoin-energy/\n\nedit: another thread on why increasing flexible load capacity (which bitcoin is fantastic at) is a must for the upcoming energy transition. https://twitter.com/caroline_lee2/status/1529837834848374784?s=21&t=YT5P9zvN_Aabo2gFRSR_Dw\n\nAlso worth looking into the ideas of someone like Jeff Booth about how tying money creation to energy can help limit human consumption, which is another root cause of the climate problem. Printing USD is effectively printing oil.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}