{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqp06h",
            "title": "Frequently Asked Questions + Weekly Discussion Thread",
            "url": "https://www.reddit.com/r/ethereum/comments/uqp06h/frequently_asked_questions_weekly_discussion/",
            "author": "AutoModerator",
            "created_utc": 1652680811.0,
            "score": 9,
            "num_comments": 20,
            "subreddit": "ethereum",
            "selftext": "**Welcome to the Weekly Discussion. Please read the disclaimer, guidelines, and rules before participating.**\n\nRules:\n\n* All [sub rules](https://www.reddit.com/r/Ethereum/about/rules/) apply in this thread.\n* Discussion topics must be related to Ethereum.\n* Behave with civility and politeness. Do not use offensive, racist or homophobic language.\n* Comments will be sorted by newest first.\n\nUseful Links:\n\n* [Ethereum.org](https://ethereum.org)\n* [ETHMerge.com](https://ethmerge.com/)\n\n**Reminder**\n\n/r/ethereum is a community for discussing the technology, news, applications and community of Ethereum. **Discussion of the Ether price or trading is not allowed.** Please keep those discussions to [/r/ethfinance](https://www.reddit.com/r/ethfinance) and [/r/ethstaker](https://www.reddit.com/r/ethstaker).\n\n&#x200B;\n\n**Frequently Asked Questions**\n\n**Where's the best place to buy ETH?**\n\nThere are many centralized exchanges that support Ethereum. If you live in the US, the most popular exchanges are Coinbase, Gemeni and Kraken. Coinbase users can use Coinbase Pro for lower fees.\n\n**When is Eth2 launching?**\n\nEth2 is a marketing term used to represent a number of updates to Ethereum. The Eth2 proof-of-stake chain first launched in December 2020. \"The Merge\", which is the event that will fully switch Ethereum's consensus to proof-of-stake, is estimated to be ready in early 2022, although there is no exact timeline. Other updates, such as data shards, will follow that update.\n\nVisit [ethmerge.com](https://ethmerge.com/) to learn more about \"The Merge\".\n\n**Do I need to do anything to update to Eth2? Will Eth2 create a new token?**\n\nNo, ETH holders *never* need to take any action to keep holding ETH. Ethereum users will be unaffected by the Eth2 upgrade. And the Eth2 updates will not create any new tokens.\n\n**How can I stake my ETH?**\n\nThe best way to stake your ETH: by running your own validator.\n\n* Running your own validator requires a modern computer and 32 ETH. Visit /r/ethstaker for more details\n\n**Why are Ethereum transaction fees so high?**\n\nLike most blockchains, Ethereum fees are determined by supply-and-demand. The large demand to use Ethereum has pushed transaction fees quite high (however, fees were just a few cents only 2 years ago). Fees are especially high during market volatility, and during NFT drops.\n\n**What is being done to lower Ethereum transaction fees?**\n\nEthereum fees are reduced by using layer-2 rollups. Rollups are scaling solutions that allow for significantly cheaper transactions, while still maintaining Ethereum's security.\n\nAdditionally, Eth2's data shards will make rollups even cheaper.\n\nWhile rollups are cutting-edge technology being actively developed, a number are already live on Ethereum mainnet. Visit [l2beat.com](https://l2beat.com/) to learn more about rollups.\n\n**What's the best wallet for Ethereum?**\n\nThe most popular tool for using decentralized applications is Metamask. However, for security reasons, we recommend using a hardware wallet such as a Trezor or Ledger.\n\n&#x200B;\n\nAre there questions you'd like to see added? Leave a comment below.",
            "stickied": true,
            "comments": [
                {
                    "id": "i8shi9v",
                    "author": "Nonocoiner",
                    "score": 6,
                    "created_utc": 1652682679.0,
                    "response": "We're getting close:\n\n* Mainnet shadow fork 5 estimated for next Thursday, May 19.\n\n* Ropsten upgrade to PoS estimated for June 8",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ta0x7",
                    "author": "AESTHTK",
                    "score": 3,
                    "created_utc": 1652704906.0,
                    "response": "W E N M E R G E\n\n(When it’s ready)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sgv9l",
                    "author": "MokolokoPlus",
                    "score": 2,
                    "created_utc": 1652682173.0,
                    "response": "I want to know if it’s more reliable mining or buying eth in terms of accumulating eth , two days ago I started to make dca on eth, bc i like it",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8sic3j",
                            "author": "420weedscopes",
                            "score": 4,
                            "created_utc": 1652683336.0,
                            "response": "Sooner or later the transition to POS will occur so there will be no more mining just staking issuance. Also there is still a gpu shortage so getting mining equipment for a good price isn't super easy. You're better off just spending the money on eth than all the hardware at this point imo. Be careful with your money.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8siyhb",
                                    "author": "MokolokoPlus",
                                    "score": 1,
                                    "created_utc": 1652683830.0,
                                    "response": "Ok I understand, thank u",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8ta3yl",
                            "author": "AESTHTK",
                            "score": 4,
                            "created_utc": 1652704952.0,
                            "response": "This is a must listen and answers your question:\n\nhttp://podcast.banklesshq.com/betting-the-fund-on-the-merge-hal-press-north-rock-digital\n\nMining ROI is getting less and less likely by the day.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8si8ey",
                            "author": "Nonocoiner",
                            "score": 2,
                            "created_utc": 1652683257.0,
                            "response": "If mining is profitable depends a lot on what you pay for electricity. Most of the ETH you mine you would need to sell to pay the electricity bills.\n\nIf you've already got a suitable graphics card and cheap electricity it might very well be still worth the trouble, but I would not invest in mining equipment right now, because Ethereum mining is expected to end later this year.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8sj0er",
                                    "author": "MokolokoPlus",
                                    "score": 1,
                                    "created_utc": 1652683872.0,
                                    "response": "A gtx 1050 of a laptop can be?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8sjstw",
                                            "author": "Nonocoiner",
                                            "score": 3,
                                            "created_utc": 1652684512.0,
                                            "response": "I don't think mining on any laptop is feasible, but I don't know enough about the technical details of mining to give advice on setups.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8sk3hc",
                            "author": "Perleflamme",
                            "score": 2,
                            "created_utc": 1652684751.0,
                            "response": "It mostly depends on your access to cheap cards and cheap electricity. If you already have the cards, then it could make sense if it's profitable enough to you. \n\nOtherwise, please be reminded that mining may not last long enough to justify buying a card specifically for mining purposes and reselling it afterwards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vsz3b",
                    "author": "Abject-Web-5956",
                    "score": 2,
                    "created_utc": 1652743664.0,
                    "response": "When you have an nft you basically have a url or location for an ifps that the image is stored on. That url or ifps info, is that stored on thr blockchain? If so, how? Is it like 'wallet address, data?'. Or is the wallet address a location to a file on the owners phone or wallet that has the location?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xu3hh",
                            "author": "Maswasnos",
                            "score": 2,
                            "created_utc": 1652791455.0,
                            "response": "If the NFT is in IPFS and isn't one of the ones stored on-chain, the on-chain NFT contains a URL pointing to the IPFS location. The Bored Ape contract holds all of this data as well as a register of which ETH addresses have which Ape NFTs. \n\nAs an example, here is the Etherscan contract page for the Bored Ape NFT set:\n\nhttps://etherscan.io/address/0xbc4ca0eda7647a8ab7c2061c2e118a18a936f13d#readContract\n\nIf you expand #20 \"tokenURI\" you can enter the token ID of any Bored Ape and it will output an IPFS URL. I entered \"1859\" because it was the first ape I saw on OpenSea, and that output this URL:\n\nipfs://QmeSjSinHpPnmXmspMjwiXyN6zS4E9zccariGR3jxcaWtq/1859\n\nIf you enter that into your browser it should take you to a basic webpage with the token info, which includes another IPFS URL:\n\nipfs://QmQx9x2ioChpipfHGeGEQXYSRwAWerdJTKoYKHjPPUuB7z\n\nIf you enter that into the browser, it will bring up the image of the Bored Ape which is stored in the IPFS distributed storage network.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zi3kp",
                                    "author": "Abject-Web-5956",
                                    "score": 2,
                                    "created_utc": 1652816862.0,
                                    "response": "So, generally, nfts are data stored on chain, usually a url, but the nft itself can be stored on chain ie image data if someone wanted to pay the gas simply because an nft is a uniquely identifiable blockchain transaction that can be programmed how you want.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zlba6",
                                            "author": "Maswasnos",
                                            "score": 1,
                                            "created_utc": 1652818190.0,
                                            "response": "Pretty much, yes. The main issue is that on-chain data has to be *extremely* small. Some NFTs like Art Blocks get around this by simply deploying the image generation algorithm to the chain, and then each individual NFT is actually just a number that gets plugged into the algorithm to create an output image.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zi50x",
                    "author": "iPotCtrl",
                    "score": 1,
                    "created_utc": 1652816879.0,
                    "response": "If I have my ETH bridged to Arbitrum, can I deposit to Kraken from there or do I have to bridge it back to mainnet first?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90ky8j",
                            "author": "Nonocoiner",
                            "score": 1,
                            "created_utc": 1652834241.0,
                            "response": "Unless something recently changed Kraken doesn't support Arbitrum yet.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}