{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwkkvm",
            "title": "Getting involved in Web3 & DeFi - initial idea opinions welcome",
            "url": "https://www.reddit.com/r/ethereum/comments/uwkkvm/getting_involved_in_web3_defi_initial_idea/",
            "author": "pwrusr-com",
            "created_utc": 1653374396.0,
            "score": 5,
            "num_comments": 8,
            "subreddit": "ethereum",
            "selftext": "Hi all,\n\nDeFi, Web3 platforms & NFTs seem some of the most interesting use cases for cryptos rn.\n\nAs an ICT Professional with a passion for cryptos, I'm looking at getting professionally involved by offering something I believe could be of value to normal people (I know, I know - \"*it's early days for normies*\" but I'd really like to start somewhere!).\n\nGiven I do have very limited resources (and too many ideas!), I was planning on starting really small.\n\n* My initial idea is to introduce Enterprise or Commercial Windows Security solutions to normal Retail investors looking for a laptop dedicated to DeFi, Web3 Wallets crypto assets custody, TradFi or whatever else suits normal investors curious about cryptos & concerned abt security.\n\nValue is created by:\n\n1. Pre-configuring the full suite of security feats offered by a standard business laptop (Fingerprint Reader, Windows Hello, Bitlocker, Windows Backup).\n2. Deploy centrally managed Security Software (tentative solutions I am familiar with: Sophos, Threatlocker & Huntress).\n3. Monitor centrally managed Security Software warnings and-or Free email support.\n4. Free educational material about Web3 Wallet phishing scams or (more broadly), against User-targeting threats that can't be stopped via hw or sw security solutions.\n5. Paid-for Web3, DeFi, crypto or other ad-hoc consultations (only fundamentals - NFA).\n\nI did setup a mockup website requesting to collect some feedback (it's just a survey at this point) however unsure whether Ok to post here (if Okay, I'll update this post with a link below).\n\nThank you in advance for any response(s) - all constructive feedback welcome 👍",
            "stickied": false,
            "comments": [
                {
                    "id": "i9srbkh",
                    "author": "dinosnstuff",
                    "score": 2,
                    "created_utc": 1653394729.0,
                    "response": "No matter how much security software you want to bloat your device with, people will still click dumb links and hand out their seed phrases.\n\nYou’d be better off switching gears to anonymity and privacy focuses, and in that case just get a laptop and boot up Qubes OS.\n\nAlso, the idea that you want to centralize management of security software for decentralized finance users is laughable at its core.\n\nIf you want to do consults and education, start a YouTube channel and sell an e-book.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9sylig",
                            "author": "pwrusr-com",
                            "score": 1,
                            "created_utc": 1653398629.0,
                            "response": "Great feedback, thank you!\n\nGiven the target is normal retail investors, the assumption here is to be able to offer direct information aimed at clarifying specific knowledge gaps. Also, given the massive amounts of quality resources already available, no point in reinventing the wheel other than focusing on specific user-targeting security threats such as avoiding pass phrases leaks).\n\nIn my experience, the mentioned security solutions are designed to protect corporate users from the majority of security threats that may affect their businesses - Sophos for viruses & malware, threat locker for app whitelisting and huntress for cryptolocker type of ransomware. These work great in combination and do not significantly affect customers' computer performance (\"bloat\").\n\nThe choice of OS is determined by the target users (normal retail investors).\n1. it seems unreasonable to burden a laptop with the virtualisation complexities offered by Qubes OS.\n2. With Qubes OS, the initial setup costs would make the solution unable to scale (ofc, \"it depends\").\n3. With Qubes OS, the biometric security features would be unavailable.\n4. Most importantly, supporting end users on Qubes OS would be challenging.\n\nCyber security is a complex topic that demands significant research. Delegating security to cybersecurity management firms is considered standard business practice these days and centralised consoles offered by vendors allow cybersecurity management firms the capabilities to scale their business.\nThis is a clear benefit for retail investors because their software security concerns could be proactively addressed from these management consoles.\nI personally don't see this as a contradiction because the centralised security solutions offer more security than what's available today in the retail sector.\n\n👍",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}