{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "npj64y",
            "title": "Why the hate on Polygon?",
            "url": "https://www.reddit.com/r/ethereum/comments/npj64y/why_the_hate_on_polygon/",
            "author": "stackup_",
            "created_utc": 1622513145.0,
            "score": 82,
            "num_comments": 107,
            "subreddit": "ethereum",
            "selftext": "I noticed a lot of users on this sub have a bias against Polygon (matic) and I'm curious to know why? I understand it's not the favoured rollup solution to scaling but at the end of the day they've released a working solution that solves a big problem. And have found a way to at least utilise ethereum's security.\n\nIf it wasn't for Polygon, I know a lot of people wouldn't have been able to get into DeFi due to high fees and would still be waiting for rollups to get adopted. I don't think it's justified to shit on a team that's helping to increase DeFi adoption. Plus, I'm pretty sure most people barely understand (or care) about the different between scaling solutions like ZK rollups, optimistic rollups, or commit chains.",
            "stickied": false,
            "comments": [
                {
                    "id": "h05dc3q",
                    "author": "hehechibby",
                    "score": 63,
                    "created_utc": 1622513816.0,
                    "response": "Hmm I haven’t noticed any hate but I’d guess possibly due to it sorta being centralized? Don’t binance and 1 or 2 other nodes hold together like 55% of all staked matic",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h06ef5g",
                            "author": "eastsideski",
                            "score": 24,
                            "created_utc": 1622542311.0,
                            "response": "I'm just confused why people hate BSC but love Polygon, when they're pretty similar when it comes to decentralization.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "h08b8hs",
                                    "author": "Always_Question",
                                    "score": 3,
                                    "created_utc": 1622577209.0,
                                    "response": "Polygon is a commit chain based on the Ethereum base chain.  BSC make no commits to Ethereum, and is therefore less secure.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "h08j676",
                                            "author": "PaulMorphyTT",
                                            "score": 4,
                                            "created_utc": 1622580861.0,
                                            "response": "Either way, you rely on centralized validators ro secure the node. If matic validators colluded, they could commit whatever they want to Ethereum.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "h08z16w",
                                                    "author": "Always_Question",
                                                    "score": 3,
                                                    "created_utc": 1622588426.0,
                                                    "response": "I'd rather have a commit history on Ethereum than not have one.\n\nNevertheless, L2 rollups like Arbitrum and Optimism inherit the security guarantees of Ethereum and these will likely flourish more as a result.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "h06fecx",
                                    "author": "InquisitiveBoba",
                                    "score": -1,
                                    "created_utc": 1622543169.0,
                                    "response": "All the layer 2s are centralized",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "h06j1yo",
                                            "author": "eastsideski",
                                            "score": 2,
                                            "created_utc": 1622546152.0,
                                            "response": "Real L2s like Arbitrum, Optimism, ZKSync, inherit the security & decentralization of their L1 chain",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "h06v1y1",
                                                    "author": "mooremo",
                                                    "score": 6,
                                                    "created_utc": 1622553691.0,
                                                    "response": "For optimistic Roll-ups they inherit the security of their base chain. Not the decentralization, for Optimism and Arbitrum there is a sequencer that orders the transactions in the roll-up. The sequencer can extract all of the MEV from all transactions in that roll-up. Extracting this MEV is actually a part of Optimism's business model.\n\nThey are more decentralized than Polygon, but not as decentralized as ETH.\n\nI'm not sure how this applies to ZK proofs as I'm less familiar with those.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "h085ypu",
                                                    "author": "maddogstonks",
                                                    "score": 2,
                                                    "created_utc": 1622574787.0,
                                                    "response": "Just learned about ZKSync. Very interesting!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "h06f1jm",
                                    "author": "donkyote",
                                    "score": -4,
                                    "created_utc": 1622542860.0,
                                    "response": "particularly here you will see alot of BSC hate because its a rival chain (also a copy paste of ETH)\n\npolygon is a Layer 2 chain built on Etherium.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "h06j1q8",
                                            "author": "elphake",
                                            "score": 21,
                                            "created_utc": 1622546147.0,
                                            "response": "Polygon is not a L2, it's a side chain. An L2 would inherit Ethereum security",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "h06j4z4",
                                            "author": "eastsideski",
                                            "score": 8,
                                            "created_utc": 1622546216.0,
                                            "response": "It's not really a Layer 2, it's more of a sidechain. Layer 2s are as decentralized as the L1 chain, while Polygon is basically controlled by a multisig",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "h05elat",
                            "author": "stackup_",
                            "score": 9,
                            "created_utc": 1622514505.0,
                            "response": "I've seen it a few times in the comments. The argument that it's centralised I can understand. But I also don't know enough to tell if this would be a problem in the long run since I've heard that a lot of decentralised projects start of centralised anyways.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "h06xw3v",
                                    "author": "Hanzburger",
                                    "score": 5,
                                    "created_utc": 1622555154.0,
                                    "response": "I trust in what is presented today, not in promises of a better tomorrow.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "h05hg7h",
                            "author": "roberthonker",
                            "score": 6,
                            "created_utc": 1622516126.0,
                            "response": "Agreed, I've only seen positivity towards polygon",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "htagyd7",
                                    "author": "tofudiet",
                                    "score": 1,
                                    "created_utc": 1642576801.0,
                                    "response": "Trying to understand why they use matic rather than eth tho for gas.  Why use a new token?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "h06gwly",
                    "author": "Karyo_Ten",
                    "score": 13,
                    "created_utc": 1622544448.0,
                    "response": ">And have found a way to at least utilise ethereum's security.\n\nThat's the main grip. It doesn't utilize Ethereum's security, it's a sidechain with it's own consensus algorithm with power concentrated in Binance (30% validators) and that can be 51%-ed by 3 that collude.\n\nThe multisig is 5-of-8 and targeted hacks on 5 of those can kill the chain.\n\nPolygon as a generalized L2 project to federate all L2s is interesting, but the sidechain is a huge security target worth billions of dollars.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h06fxf1",
                    "author": "corpsemongo",
                    "score": 8,
                    "created_utc": 1622543629.0,
                    "response": "The future is ethereum + rollups, not ethereum + side chains. I don't hate it but as long as they don't release a real Layer 2 solution I don't love it either.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h8zpsbo",
                            "author": "nmplab",
                            "score": 1,
                            "created_utc": 1628999081.0,
                            "response": "Is there a good one as of today?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "h05h0q0",
                    "author": "pearli",
                    "score": 30,
                    "created_utc": 1622515885.0,
                    "response": "Its not necessarily hate, but restrained cautiousness. The \"centralisation\" argument is not a small problem. Let's look at DeFi/ Cryptocurrency environment currently, BSC is being exploited on a weekly basis; rug pulls; protocol exploits; and straight up dev thefts are occurring. \n\nNow, Polygon's devs control 5/8 of multisigs and this is concerning because they're anonymous and the general public doesn't know who they are. At the very least Polygone should not have a majority of the multisig and they should relinquish them to independent, well known figures in DeFi community; or give up then control to governance. \n\nBSC was everything that Polygone is now: fast adoption; low fees; easy to use DeFi for beginners; but at the cost of decentralization. I don't have a dog in this fight, but decentralizaton is important and Polygon have not addressed this.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h05klid",
                            "author": "stackup_",
                            "score": 15,
                            "created_utc": 1622517977.0,
                            "response": "I agree that decentralisation is important and pretty much the whole point of this entire space.\n\nAlso, I don't think the Polygon devs are anonymous. They've spoken publicly on several crpyto podcasts and their names are shown on the the website. The control of 5/8 multisigs is something I need to read up about though. Do you have any links to this?\n\nThe fact that BSC is being exploited on a weekly basis, to me, seems like it's due to easy access to DeFi in general and not a BSC specific problem. If DeFi on ethereum was just as accessible to everyone then I'm sure it would have the same problem. And with all the scaling solutions coming out, I'm guessing we'll see a lot more of them too.\n\n>BSC was everything that Polygone is now\n\nBSC to my understanding is a complete stand alone clone of Ethereum. Polygon has at least some reliance on the Ethereum network for checkpointing. Which imo is a lot better than what BSC started with.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "h06yyhs",
                                    "author": "Hanzburger",
                                    "score": 5,
                                    "created_utc": 1622555676.0,
                                    "response": "Checkpointing is not really reliance",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "h072f0w",
                                            "author": "stackup_",
                                            "score": 2,
                                            "created_utc": 1622557338.0,
                                            "response": "Care to expand on this? My understanding is that by committing the root hash to the ethereum base layer this provides a single source of validation that the matic network hasn't been tampered with. If someone was to somehow tamper with a block than the root hash changes and will no longer match whats stored on ethereum. Hence the reliance.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "h075nbw",
                                                    "author": "PorchBear816",
                                                    "score": 5,
                                                    "created_utc": 1622558849.0,
                                                    "response": "A lot more goes into overall Ethereum security than checkpointing.  An excel spreadsheet can checkpoint the eth blockchain, but that doesn't make it a fully secured solution.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "h07akdw",
                                    "author": "pearli",
                                    "score": 2,
                                    "created_utc": 1622561090.0,
                                    "response": "The multisig information is from Matic:\n\nhttps://docs.matic.network/docs/faq/commit-chain-multisigs/\n \n> I don't think the Polygon devs are anonymous\n\nYeah, my sentence could have been written better, I know the devs aren't anonymous, I meant the identities of the multisigs, who we know are part of Polygon, are unknown and not verified.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "h06dkj3",
                            "author": "the1stjohnsmith",
                            "score": 4,
                            "created_utc": 1622541531.0,
                            "response": "Conflating smart contract backdoors and node centralisation. These are distinct concepts.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "h064ywh",
                    "author": "mark_able_jones_",
                    "score": 12,
                    "created_utc": 1622533373.0,
                    "response": "I don't see why Eth 2.0 needs polygon. \n\n\"internet of blockchains\" is a buzzy, generic catchphrase that reminds me of HBO's Silicon Valley. \n\nI bet it's obsolete in two years.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h06fphi",
                            "author": "InquisitiveBoba",
                            "score": 4,
                            "created_utc": 1622543439.0,
                            "response": "After eth2.0 gets sharding and the merge then layer 1 should be scalable enough to do 100,000 tps which is more then enough for todays demand.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "h06m4fc",
                                    "author": "Computer_says_nooo",
                                    "score": 7,
                                    "created_utc": 1622548340.0,
                                    "response": "The same way 640kb of memory were more than enough RAM... Or are you too young to know the reference... ?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "h07c309",
                            "author": "RightBlacksmith9",
                            "score": 2,
                            "created_utc": 1622561762.0,
                            "response": "We need ETH 2.0 today.\nI'm tired of hearing about all these projects will be in the future.  I want to know and use what they can do today.\n\nI'm sure when eth 2.0 does launch and is successful then many of the level 2 solutions will be squeezed out.\nWho knows which tokens will blow up or disappear.\n\nI think Eth 2.0 if it works will do well.  Time will tell",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "h06x7rl",
                    "author": "PhiMarHal",
                    "score": 8,
                    "created_utc": 1622554811.0,
                    "response": "5/8 multisig, with remote developers.\n\nCentralisation works fine, up until the day catastrophic failure happens.\n\nI use Polygon and I like it, but I treat any crypto I send to it as my gambling playfund.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h093zd3",
                    "author": "Future-Can8989",
                    "score": 3,
                    "created_utc": 1622590943.0,
                    "response": "Most likely this is due to the fact that the price has increased, and people who did not have time to buy and started hating. For example, there is Parastate Ethereum on steroids, it makes it possible to combine with Polkadot.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h06dukh",
                    "author": "Hik_hik",
                    "score": 8,
                    "created_utc": 1622541787.0,
                    "response": "So far none of the purists have not understood the extent to which ease of use, access and decent UX triumphs things like decentralization & security with users. Polygon and BSC are the best examples of this. \n\nWhile they scream centralization, users are happy to move to chains that allows them to trade and farm without lot of fees.\n\nWe now see what is happening to farms on BSC, lots of scams but not surprised with that regard as most of them are copy paste farms from ETH. I don't think the same would happen on polygon because we have aave, curve on polygon already and more than copy paste farms, a lot fo existing L1 projects will move to polygon. \n\nNow let's compare the purists favorite solution Rollups with Polygon purely from a cost and entry/exit point of view. \nGas fees on arbitrum costs $2-3, gas fees on polygon costs < $0.0001 in most cases per transaction. $2-3 is a big improvement from $150, still $0.0001 is better than $3.\n\nEntry to polygon takes 7-10 minutes from L1, exit from polygon POS takes 45 mins. Whereas exit from arbitrum to L1 takes 7 days, and you can expedite that with paying more gas fees lol. \n\nGuess what people will prefer even after launch of rollups? still Polygon. Users go where there is liquidity, lowest fees and convenience.\n\nAlso don't forget that polygon is not just about sidechain, they include rollups whic are next in line on their roadmap.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h06zvpp",
                            "author": "Hanzburger",
                            "score": 7,
                            "created_utc": 1622556130.0,
                            "response": ">So far none of the purists have not understood the extent to which ease of use, access and decent UX triumphs things like decentralization & security with users.\n\nWhy even bother with all this then? Just use paypal and traditional finance or a CEX....",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "h0763qr",
                                    "author": "Hik_hik",
                                    "score": 0,
                                    "created_utc": 1622559056.0,
                                    "response": "My point is, people are fed up paying $200 for a swap. Crying foul at every solution is not going to make the users wait for the best solution in terms of decentralization.\n\nIf it's not EVM, they'll move to some other chain altogether, which is even worse for ETH.\n\nOn top of low fees, ease of access, on boarding most used protocols, good biz. dev is important, and that is where polygon won.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "h09c5pb",
                                            "author": "stackup_",
                                            "score": 2,
                                            "created_utc": 1622595155.0,
                                            "response": "Not sure why you got downvoted. I think you raised a valid point that there's more to a good product than it's tech alone and people wanted an acceptable solution today and not a perfect solution in the future.\n\nWhen the perfect working solution comes in the form of rollups it'll probably overtake matic eventually. But until then matic is what they have today.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "h08tuux",
                                            "author": "bryanwag",
                                            "score": -2,
                                            "created_utc": 1622585874.0,
                                            "response": "No one forces people to buy shitcoins on Uniswap or use Ethereum smart contracts at all. There are plenty of shitcoins on CEXs and plenty of CeFi for people to play with. If you paid $200 in gas voluntarily then that’s on you.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "h0a4kjy",
                                                    "author": "Hik_hik",
                                                    "score": 2,
                                                    "created_utc": 1622610666.0,
                                                    "response": "This type of attitude from ppl like you and gas costs is why pancakeswap does more volume than all other ethereum DEXs combined. Not just swaps, approving and confirming a transaction costs a lot of gas on yield farms (+ lending) too..you can't see that gas fees are prohibitively expensive for most people on L1 basically.\n\nThis is a major barrier of entry for small accounts and people just starting out on ethereum. It's not just swapping shitcoins, you can do a lot more on defi by the way. So keeping seething, while I enjoy my $0.0001 gas fees on polygon. \n\nCheers.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "h0df2ze",
                                                            "author": "bryanwag",
                                                            "score": 1,
                                                            "created_utc": 1622674540.0,
                                                            "response": "Who gives a shit about gamblers who clearly cannot afford to lose money but still want to anyway? BSC has scams everywhere and they will get wrecked sooner or later. Centralized projects are doomed for hacks just like no centralized exchange/company is safe from hacks. You take the risk and put your trust in 5 anonymous team members then you better can afford to lose all your money.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "h06ej8s",
                            "author": "eastsideski",
                            "score": 3,
                            "created_utc": 1622542412.0,
                            "response": "> exit from arbitrum to L1 takes 7 days\n\nFast exits mean that almost no users need to wait 7 days",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "h0a5bf4",
                                    "author": "Hik_hik",
                                    "score": 1,
                                    "created_utc": 1622611189.0,
                                    "response": "Last I checked, you could only do fast exit by paying more than normal L1 gas fees else you'd have to wait for 7 days. isn't that the case anymore?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "h0apqdp",
                                            "author": "eastsideski",
                                            "score": 1,
                                            "created_utc": 1622628633.0,
                                            "response": "Fast exits don't have to do with L1 gas fees\n\nFast exits mean basically \"selling\" your exit to a liquidity provider.\n\nSo if I have 100 Dai on L2, someone might be willing to buy my L2 Dai for 99.5 Dai on L1.\n\nYou'll still have to pay L1 gas fees, but it's a relatively inexpensive transaction.\n\nNote that this is a Optimistic Rollup fast withdrawal, you might be confusing it with a ZK rollup \"forced exit\", which is quite expensive, but only necessary if the rollup sequencer tries to censor you.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "h0asrmz",
                                                    "author": "Hik_hik",
                                                    "score": 2,
                                                    "created_utc": 1622631174.0,
                                                    "response": "I see, this is better than a sidechain exit then. Thanks for the info.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "h06s4lt",
                            "author": "stackup_",
                            "score": 2,
                            "created_utc": 1622552076.0,
                            "response": ">Gas fees on arbitrum costs $2-3\n\nThis is interesting, and I didn't realise Rollup fees were still a couple bucks. Do you have any source on arbitrum gas prices?\n\nAnd I agree with you. People have their own trade offs and the more choice there is the better imo.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "h0a4yga",
                                    "author": "Hik_hik",
                                    "score": 1,
                                    "created_utc": 1622610933.0,
                                    "response": "I used arbitrum testnet on MCDEX and made some transactions, gas fee was between $2-3 per transaction.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "h0a7bsz",
                                            "author": "Hik_hik",
                                            "score": 2,
                                            "created_utc": 1622612622.0,
                                            "response": "https://optimism.io/gas-comparison",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "h0a8x5k",
                                                    "author": "stackup_",
                                                    "score": 2,
                                                    "created_utc": 1622613816.0,
                                                    "response": "Thanks for the link. I assumed gas prices would be about the same as Matic. I guess further reductions would require eth2.0.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "h08t8cr",
                            "author": "bryanwag",
                            "score": 1,
                            "created_utc": 1622585570.0,
                            "response": "If they include rollups then what’s the point of going through Polygon when you can use rollups directly? Zk-rollups will be much cheaper than Optimistic rollups, so sidechains wouldn’t have any advantage.\n\nFor those who wants to play with DeFi but don’t have the money, it’s great they can use Polygon or BSC as a mock version of Ethereum. But using centralized solutions literarily add NOTHING to CeFi or a database beyond letting users practice. It is incredibly problematic when these users start thinking Polygon or BSC as something that can compete with Ethereum rather than just being a temporary mock network with real money before L2 matures. They will get wrecked thinking that way.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "h07ww6l",
                    "author": "sunbathman",
                    "score": 1,
                    "created_utc": 1622570806.0,
                    "response": "Polygon won’t even be in the top 20 in the next Bull run, it’s just something to play with while eth 2.0 is ready",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h0669js",
                    "author": "touchy_therapist",
                    "score": -7,
                    "created_utc": 1622534587.0,
                    "response": "Because deep down everyone who's holding big bags of eth and not diversifying are shit scared of the fact that matic and lots of others are going to steal huge amounts of ETH market share.\n\nEvery other reason is just a smoke screen the answer is fear plain and simple.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h069c92",
                            "author": "USERNAME_ERROR",
                            "score": 8,
                            "created_utc": 1622537542.0,
                            "response": "I dislike responses in the form “the only true reason is X and anyone claiming otherwise is lying”, particularly with no references.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "h06bbk3",
                            "author": "Tipschi",
                            "score": 4,
                            "created_utc": 1622539427.0,
                            "response": "That’s just wrong. The reason why Ethereum is Ethereum is because it’s decentralized. A centralized \"Blockchain\" eg. just a client-server system can be build by anyone. Matic is a highly centralized system like BSC with the difference that it somehow is in line with the bigger Ehthereum mission.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "h06242x",
                    "author": "Available_Split_6146",
                    "score": -3,
                    "created_utc": 1622530770.0,
                    "response": "If it wasn't for polygon, people wouldn't be on defi?\n\nWhat are you talking about? BSC is already filling that gap. People with less money are able to afford yield farming, providing Liquidity in BSC due to low gas fee.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h07ogfq",
                    "author": "South_Valuable4733",
                    "score": 1,
                    "created_utc": 1622567125.0,
                    "response": "I love it \nIts L2 cheap Trans",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h08ffg5",
                    "author": "GeerardfiveNine",
                    "score": 1,
                    "created_utc": 1622579134.0,
                    "response": "So what price can we expect in like 6months to a year?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h08gg0l",
                    "author": "Crypto_Economist42",
                    "score": 1,
                    "created_utc": 1622579600.0,
                    "response": "They have a token instead of using ETH to pay fees.\n\nThat's rent seeking behavior. It's inefficient and carries friction.\n\nThe future successful L2 layers will use ETH and not tokens",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h0ac2u9",
                    "author": "touchy_therapist",
                    "score": 1,
                    "created_utc": 1622616333.0,
                    "response": "I've been mining eth since it was at 18$ however not diversifying is pretty short sighted\n\nETH has some very big problems to solve which they have failed to in the past and if they don't move pretty quickly the price is going to take a big nose dive.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h0acmtp",
                    "author": "Mordan",
                    "score": 1,
                    "created_utc": 1622616800.0,
                    "response": "that amount of ignorance in this thread is astounding.\n\nPeople don't understand decentralization.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h05gd9k",
                    "author": "Townhouse-hater",
                    "score": -15,
                    "created_utc": 1622515514.0,
                    "response": "Who cares what other people think?  Seriously, it’s time for guy to man the fuck up. Do your own research, spend your own money and buy what you want and don’t worry about what anything else thinks or does. Do you. Laugh to the bank if it makes you happier. If you like polygon and buy it, then just sit back and wait for that beautiful multiplier to grow and enjoy life in the meantime. Shit…",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h05guad",
                            "author": "stackup_",
                            "score": 14,
                            "created_utc": 1622515783.0,
                            "response": "Lol why you mad tho. I don’t care what people think. I just wanted to start a discussion to learn more. Isn’t that the point of reddit?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "h05dotv",
                    "author": "Rocket_Emojis",
                    "score": -11,
                    "created_utc": 1622514008.0,
                    "response": "Matic is a ripoff of the Tendermint build created by Cosmos .",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h05f5m6",
                            "author": "stackup_",
                            "score": 11,
                            "created_utc": 1622514821.0,
                            "response": "Well for the sake of argument, why does this matter though? Everything on the internet can technically be a ripoff of something else. Matic has solved a problem for a lot of users and given them access to DeFi for fees that are less than a cent. I think this matters a lot more to people than it being a ripoff of some other product.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "h068pj2",
                                    "author": "Rocket_Emojis",
                                    "score": 2,
                                    "created_utc": 1622536937.0,
                                    "response": "So if something rips off matic and becomes more popular than it, you are all for it",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "h05qxbb",
                            "author": "ckh27",
                            "score": 2,
                            "created_utc": 1622522029.0,
                            "response": "Everything is but cosmos can’t get their act together to become wildly valuable through adoption which is heartbreaking because the tech is galaxy brain.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uscanu",
            "title": "How to send token URI to minting function of azuki's ERC721A",
            "url": "https://www.reddit.com/r/ethereum/comments/uscanu/how_to_send_token_uri_to_minting_function_of/",
            "author": "Fit-Dragonfly-6926",
            "created_utc": 1652878647.0,
            "score": 0,
            "num_comments": 4,
            "subreddit": "ethereum",
            "selftext": "I'm trying to mint nft using erc721A which is developed by Azuki.\n\nBut couldn't add token URI(NFT meta data) with mint function.",
            "stickied": false,
            "comments": []
        }
    ]
}