{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxm1bl",
            "title": "Anyone have good counter arguments from this article?",
            "url": "https://www.reddit.com/r/ethereum/comments/uxm1bl/anyone_have_good_counter_arguments_from_this/",
            "author": "Zyguard7777777",
            "created_utc": 1653498537.0,
            "score": 15,
            "num_comments": 17,
            "subreddit": "ethereum",
            "selftext": "Hello, today I found this article [https://lukeplant.me.uk/blog/posts/the-technological-case-against-bitcoin-and-blockchain/](https://lukeplant.me.uk/blog/posts/the-technological-case-against-bitcoin-and-blockchain/?fbclid=IwAR2Is70RfoNUq6uRwqD0pBUJ2RMQCzd1ybRAymtOOTbDrbry7mXn7fBx-4c) browsing the programming subreddit.  It gives many reasons against Bitcoin (and Ethereum). I was wondering if anyone has encountered rebuttal arguements against this article, as many of the points make sense to me. The many ones are: \n\n1. If a network got divided in 2, e.g. Russia cut off from the internet. But the bitcoin network in Russia was still running. Then the connect was restablished. How would the bitcoin transaction histories merge?  \n\n2. The ever rising cost of a transactions on the bitcoin network, not referring to the current affordable level, but the transaction cost goes up as the bitcoin price goes up. \n\n3. It's public nature, good in some cases. But if I had a private business, I don't want everyone to be able to see my transactions or balance amount.  \n\n4. Irreversibility, means that fraudulent transactions cannot be reversed like they can in a bank. \n\n5. (Ethereum specific) Smart contracts are very difficult, if not impossible to edit, so if you have a bug in your code (going to happen eventually) that could cause a huge lose of money, e.g. Ethereum's history  I like Bitcoin and cryptocurrency, and believe it is the future in many ways. However, I don't have good counter arguments for some of these objections to it.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9zbmo0",
                    "author": "shaggy_shiba",
                    "score": 7,
                    "created_utc": 1653510424.0,
                    "response": "You're likely to get a lot of takes on these, here's mine.\n\n1. u/semicryptotard is on the nose here with Bitcoin, and most PoW chains. Proof of Stake, at least in Ethereum's case, has a similar mechanism. There's a weight assigned to each block valued at the total number of attestations from validators, which increases with a larger number of validators. Although, I'll point out, being originated from Peer to Peer systems, just like with torrenting movies and music, it is exceptionally difficult to fully segment a network away from the peer to peer nets without major disruptions for the entirety of the internet. Enabling VPNs can always act as a short-circuit, meaning blockchains have a very high tolerance against this kind of forceful state-sanctioned split.\n2. Denominated in USD or Fiat terms, no, fees don't change with asset price. This is a supply vs demand function. Prices of transactions don't just \"Go Up\". In fact, required fees and cost to participate in the chain is a function of the available blockspace, not the cost of the native asset. There is a limited number of blockspace, and that blockspace is auctioned off. The markets will find a balance that the markets deem worthy. If the price of the native asset used for fees doubles, but the demand for blockspace stays the same, supply/demand will cause the fees to half, denominated in the native asset, or stay the same, denominated in USD. One additional use case that Ethereum (or Smart Contract Chains in general) has, is the value of the blockspace isn't just limited to transferring the native currency, but also the value generated by the Smart Contracts themselves. But again, supply/demand of blockspace.\n3. u/semicryptotard's take on Zero Knowledge tech. This privacy is coming. Doesn't exist at the moment at scale per se, but it is coming. There are mechanism already done today to circumvent this, such as generating fresh addresses. Each private key can have millions of addresses that it controls. From a 3rd party's perspective, these addresses are completely random, and unknown whether they seed form the same private key or not. While you could argue that 1 private key = 1 person or entity, by using multiple addresses, you generate a plausible deniability as to shuffling funds around your additional addresses. Other parties cannot prove your two addresses are, in fact, both controlled by you creating uncertainty and a bit of \"privacy\" via not knowing if you moved money between other accounts, or sent that money outbound.\n4. Reversing charges isn't really reversing charges. Its just another charge, but in the opposite direction. This is possible because the bank or CC company is acting on your behalf. If the vendor that initially charged you wants to stay in good standing with the CC company, they have to abide by the charge back.\n5. Bugs in code that could lead to huge losses in money isn't Ethereum (or smart contract) specific. This exists in traditional sense as well, just with more manual interventions available. By nature of smart contracts being fully visible, we're open-sourcing the code that makes these transactions happen, allowing for the person subscribing to the service to do their own bug hunt or research. I can't go to Bank of America and ask to have their code audited by my own hand-picked team before investing. I can, however, with Ethereum. In terms of immutability, there are design paradigms for smart contracts that do allow for upgradability. Crypto Companies split their one large contract into 10. Of these 10 contracts, one does nothing but store data, and is never replaced. Another contract is a router that resolves \"paymentProcessingContract\" to 0x998sd98j3k09jfd or whatever address. The Router contract can be updated to point to newly deployed contracts with corrected and fixed, now bug-less code.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zd9i3",
                            "author": "Zyguard7777777",
                            "score": 2,
                            "created_utc": 1653511091.0,
                            "response": "Thank you for responding in depth! So that I am getting this right, for point 4 you are saying that the middleman (cc company, e.g. eBay) that the crypto is going through could solve the fraud issue?\nI particularly like your reply to point 5. I hadn't thought of the open source checking that could take place to rip the code apart to prove no bugs exist.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9zw1c5",
                                    "author": "Maleficent_Plankton",
                                    "score": 1,
                                    "created_utc": 1653519263.0,
                                    "response": "The middleman could, but then they're on hook for the cost of the reversal. Currently,  DEXs and CEXs almost never refund customer mistakes unless they can do it at little cost to themselves.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9yyxhs",
                    "author": "semicryptotard",
                    "score": 1,
                    "created_utc": 1653505301.0,
                    "response": "1. The Bitcoin protocol would look at the two chains and decide which is the canonical chain based on the total amount of work expended (the system chooses the \"heaviest\" chain). In the case of a single country cutting themselves off, the amount of miners dedicated to that chain history would be much lower than the majority chain so once they \"reconnected\" all of their txn history would be wiped and balances would restore to the state prior to splitting off. In this situation, it may be better for Russia to simply fork BTC and let market forces decide on the valuation of their new chain. Chaotic for sure.\n2. Yes this is a fundamental issue with Bitcoin that bitcoiners generally refuse to fully engage with.\n3. They clearly have no idea what is being built by L2 cryptographers, specifically around Zero-Knowledge Proofs. Literally a week ago Ernst & Young released an optimistic rollup with ZK tech to make transactions between enterprises private. There are many other privacy-focused solutions in the pipe from numerous companies using this technology.\n4. Custodial institutions can work around this by taking on settlement finality risk. Liquidity providers in defi protocols could theoretically do the same for self-custodied wallets.\n5. Yes, the stakes are higher with immutable contracts, no argument there. As smart contract auditing matures and best practices are developed, fewer and fewer of these incidents will occur.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9z82q6",
                            "author": "doubeljack",
                            "score": 1,
                            "created_utc": 1653508983.0,
                            "response": ">Yes this is a fundamental issue with Bitcoin that bitcoiners generally refuse to fully engage with.\n\nYes, and when coupled with the fixed circulation limit of 21M it means there will come a day way in the future bitcoin will face an existential crisis. Something will have to give. It is not realistic for fees alone to sustain miners and guarantee the integrity of the network, while also keeping fees low enough for users to actually transact on the network.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9z8y15",
                                    "author": "oneoldfarmer",
                                    "score": 2,
                                    "created_utc": 1653509336.0,
                                    "response": "I suspect L2 solutions will sufficiently lower the transaction costs for daily use while on chain transactions will be limited to rare transactions and channel opening/closing where the high cost provides incentives for honesty and cooperation.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9zaaj8",
                                            "author": "doubeljack",
                                            "score": 2,
                                            "created_utc": 1653509888.0,
                                            "response": "The issue with this approach is that if the majority of transactions take place on L2 then fees are going to be relatively small because there won't be much competition, and that means there won't be much security on L1. Miners need to make a profit or they don't mine.\n\nI'm telling you now, bitcoin is going to fail catastrophically at some point in the distant future if a major change to the protocol doesn't happen. The current approach is infeasible with negligible block rewards. Rewards alone keep the network secure, and when they go away transaction fees need to offset that which means huge fees. Failure then becomes a self fulfilling prophecy.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9zo9p7",
                                                    "author": "esotericunicornz",
                                                    "score": 1,
                                                    "created_utc": 1653515766.0,
                                                    "response": "Lol. So the fees are both too high to use and too low to sustain the network. Got it. Bitcoin will he just fine.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9zar9n",
                                            "author": "semicryptotard",
                                            "score": 1,
                                            "created_utc": 1653510071.0,
                                            "response": "I'm pretty skepitcal there will be enough base layer txn demand to keep BTC secure in the long run. Transaction volume remains low (maybe due to the hodler culture BTC pushes), and I think the vast majority of txn volume will move to chains with more functionality (be that Ethereum or another L1). Next few years will be quite telling!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9z9tuh",
                            "author": "Zyguard7777777",
                            "score": 1,
                            "created_utc": 1653509700.0,
                            "response": "Thanks for responding! This is mostly making sense to me.\nI have a couple of point that I'm not fully understanding:\n\n2. I'm guessing the way that Ethereum overcomes this is from sharing and ZK rollups, to lower the transaction cost by x10-100. Is that correct?\n\n4. For custodial institutions, wouldn't that be adding a middleman that would need to be trusted? Also, can you explain the theoretical mechanism for the LP you mention?\n\n(Edit: mobile formatting)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ytvjc",
                    "author": "Successful-Walk-4023",
                    "score": 1,
                    "created_utc": 1653503312.0,
                    "response": "Having a hard time understanding case #1. I can't wrap my brain around a divided network with the same protocol. Honestly seems like in said case the cryptoasset market would cease to exist in that country? I have no idea...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zd6va",
                            "author": "FaceDeer",
                            "score": 1,
                            "created_utc": 1653511060.0,
                            "response": "It'd have to be an extremely \"tight\" barrier since the bandwidth necessary to keep updated on Ethereum's blockchain is not all that high. Now that services like Starlink are coming online it might be nigh impossible to lock a country down that hard, at least not without suppressing the Internet entirely.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9z567g",
                    "author": "No-Significance-1581",
                    "score": 1,
                    "created_utc": 1653507823.0,
                    "response": "1. If internet got cut off or suddenly all connects were only within a certain country. Everyone would stop using their 'version' as you know the only valid chain would be the majority or rest of the world. Your coins would still be fine as to the rest of the world your coins are still untouched.\n\n2.high price does not equate to higher fees. \n\n3. If you are a private business and you dont want anyone to see your transactions there are tons of technologies that enable privacy. Zero knowledge proofs.\n\n4.Irreversible also protects you from people reversing transactions that were otherwise legitimate against your will. Plenty of examples of centralized authorities executing reversals or halting. Im not going to go into why decentralization is far superior to centralized solutions.\n\n5. There are smart contracts that have been proved to be free of runtime errors i.e the beacon chain deposit https://consensys.net/blog/research-development/20039/\n\nBugs and errors are not only in blockchain. I cant count the billions if not trillions of dollars lost because of errors in centralized solutions. The open source nature allows anyone and EVERYONE the opportunity to find and locate issues in the code. This cannot be said about centralized solutions.\n\nHonestly these points are hardly a challenge.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9z8ze1",
                            "author": "Zyguard7777777",
                            "score": 1,
                            "created_utc": 1653509351.0,
                            "response": "Thanks for taking the time to answer!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ypmll",
                    "author": "Cadillacvibe",
                    "score": -1,
                    "created_utc": 1653501645.0,
                    "response": "Following this",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxlxkc",
            "title": "We are thrilled to share that Audius has now surpassed ONE MILLION tracks",
            "url": "/r/audius/comments/uxlwvn/we_are_thrilled_to_share_that_audius_has_now/",
            "author": "michael2-audius",
            "created_utc": 1653498252.0,
            "score": 0,
            "num_comments": 3,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}