{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxhvig",
            "title": "Geth v1.10.18 (Sharblu) is released! PoS transition enabled on Ropsten testnet.",
            "url": "https://github.com/ethereum/go-ethereum/releases/tag/v1.10.18",
            "author": "fjl",
            "created_utc": 1653486777.0,
            "score": 68,
            "num_comments": 6,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9xostg",
                    "author": "fjl",
                    "score": 8,
                    "created_utc": 1653486926.0,
                    "response": "After a long train of maintenance releases, we are happy to announce this feature release of Geth!\n\n**This release is ready for the Merge transition on the Ropsten testnet**, and will activate the Merge on Ropsten **when the testnet reaches a total difficulty of 43531756765713534**. Please ensure you have a beacon chain node configured for the transition. You can find more information about preparing for the Merge in our guide:\n\n<https://geth.ethereum.org/docs/interface/merge>\n\nThe tracing subsystem has been another focus area of this release cycle. We have replaced the JavaScript interpreter used by the tracing engine with [Goja](github.com/dop251/goja), which offers slightly better performance and implements many ES6 language features. There are minor differences in JS tracing semantics: The built-in functions `memory.slice`, `memory.getUint`, `stack.peek` will now throw an exception and interrupt tracing when accessing out-of-bounds data. They previously returned an empty value instead.\n\nThis release contains further breaking changes to tracing APIs. Be sure to check the tracing changelog section. Please also report any incompatibilities you encounter.\n\nFor the full changelog, please go to the release page at <https://github.com/ethereum/go-ethereum/releases/tag/v1.10.18>",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}