{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v12szg",
            "title": "Will all the stakers sell post ETH merge crashing the price?",
            "url": "https://www.reddit.com/r/ethereum/comments/v12szg/will_all_the_stakers_sell_post_eth_merge_crashing/",
            "author": "Giga79",
            "created_utc": 1653924813.0,
            "score": 63,
            "num_comments": 39,
            "subreddit": "ethereum",
            "selftext": "###I want to go over some things to help dispel common FUD.\n\nRead through this to help understand ETH issuance.\n\nIf anyone wants help with staking, Rollups, or mumbo jumbo ask in a comments! \n\n---\n\n- Ethereum (Proof of Work) creates roughly 13,500 new Ether per day that gets paid to miners for security\n- That has a value of approx $27M USD at today's price\n- Miners have high costs so sell most of what they earn\n\nIf ETH POW hit $10,000 there would be $135,000,000 of new coins for sale each **day** that need to be bought first before the price can go up another cent\n\nRight now since we're crabbing around $2000 that means miners are selling approx $27M per day **and people are buying $27M per day** at a crabs pace.\n\n---\n\n- Ethereum (Proof of Stake) creates roughly 10% as much Ether as POW, there will be no more mining\n- That has a value of approx $3M USD at today's price\n- Stakers have no maintenance costs so often compound their interest instead of selling\n- Block times are decreasing from 13s-ish to always 12s\n- POS uses 99.95% less electricity but does nothing for scaling or fees\n\nThe Beacon (POS) chain went live last December. Since then a total of 12.5M ETH has been locked up in staking and lately that has been accruing approx 1500 ETH/day in new issuance. \n\nOnly a 4 validators are able to enter or exit a spot every epoch. An epoch happens every 32 blocks - there are 225 epochs per day so a maximum of 900 validators can stake or unstake in one day.\n\nSince it requires 32 ETH to be a validator that means a max of 28,800 ETH can be staked or unstaked each day.\n\n---\n\n#FOR 6 MONTHS AFTER THE MERGE NO ONE WILL BE ABLE TO ACCESS THEIR STAKED COINS\n\nNot having miners for 6 months is like taking 13500x180x2000 **$5Bln** of sell pressure off the market!\n\nBut that means stakers have over **12 months** of banked stake ready to withdraw all at the same time!\n\nAssuming stakers were getting 1500 ETH/day the entire time (an over estimation) they'll have almost 550,000 ETH to sell! That's like **$1Bln** at today's price!\n\nThey'll be able to sell a maximum of 28,800 Ether per day or create about $57M of new sell pressure for at *most* 20 days. That's like turning 2x POW issuance on for three weeks after not having a drop for 6 months. \n\n###After 20 days of 2x POW issuance, ETH will become ultra scarce again.\n\nOnly about 1500 ETH/day can reach the markets, about $3M, into an environment where people are paying $27M/day in a bear market.\n\n---\n\nNext time the price inches towards $10,000 that means $15M new Ether will be entering the markets instead of $135M. The majority of fees are burned leading to approx $10-30M taken out of circulation every day. ETH will be more scarce post merge than ever before, and I don't have enough!\n\nTo worry about a crash in price is a valid concern. Miners haven't added that kind of sell pressure since ETH was worth $4000! But after the merge all transaction tips go to stakers adding 5-10% onto today's APR, and if half of stakers leave that'll add another 5-10% onto what the remaining get. Staking ETH is already enticing to me now so if it can offer 20% everyone will want to do it.\n\nWhat do you think will happen? Will everyone stake or unstake?",
            "stickied": false,
            "comments": [
                {
                    "id": "iak3ym2",
                    "author": "FaceDeer",
                    "score": 36,
                    "created_utc": 1653927106.0,
                    "response": "There's also an exit queue that limits the amount of Ether that can be released from the staking contract each day, if a large number of stakers all try to withdraw their stake at once it still won't cause a surge in supply rushing to the markets.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ial3g0u",
                            "author": "flyfree256",
                            "score": 3,
                            "created_utc": 1653943287.0,
                            "response": "Correct me if I'm wrong, but that's the exit queue like if you want to fully exit your validator. Taking the excess off down to 32 ETH but keeping your validator running doesn't count as an exit. So, depending on how they build withdrawals there might be an initial sell wave, but my guess is depending on what happens over the next 6-8 months most people will just turn around and create more validators with their excess ETH.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iak391h",
                    "author": "joenastyness",
                    "score": 16,
                    "created_utc": 1653926792.0,
                    "response": "There will initially be volatility then it will settle out.  The less validators the higher the reward.  There is enough incentive to continue staking.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak15nk",
                    "author": "Sir_Lagz_Alot",
                    "score": 57,
                    "created_utc": 1653925860.0,
                    "response": "I can’t speak for everyone, but I know what I’ll do. \n\nI’ll keep staking.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakbgxk",
                            "author": "Puddingbuks26",
                            "score": 15,
                            "created_utc": 1653930403.0,
                            "response": "Same here!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iakeajj",
                            "author": "rmvaandr",
                            "score": 10,
                            "created_utc": 1653931648.0,
                            "response": "Staking revenue will nearly double post-merge so most will probably stick (stake) around.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iakfz8k",
                            "author": "socalquest",
                            "score": 6,
                            "created_utc": 1653932400.0,
                            "response": "Me too. Stake and HODL all the way to $6M. GLTA!!!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ial288m",
                                    "author": "pazsworld",
                                    "score": 1,
                                    "created_utc": 1653942716.0,
                                    "response": "Keep staking is like re-arranging the chairs on the titanic. You can have my staked ETH at a discount if only I can release them from the Coinbase prison.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ial4ih3",
                            "author": "Manateeboi",
                            "score": 1,
                            "created_utc": 1653943792.0,
                            "response": "I’ll stake more eth",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iakwyur",
                    "author": "domotheus",
                    "score": 5,
                    "created_utc": 1653940210.0,
                    "response": "Good stuff! Slight nitpick:\n\n>Only a 4 validators are able to enter or exit a spot every epoch. An epoch happens every 32 blocks - there are 225 epochs per day so a maximum of 900 validators can stake or unstake in one day.\n\nThis value is outdated, every additional 65,536 validators increase it by 1. Just today it went up to 6!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakfoky",
                    "author": "trelles90",
                    "score": 3,
                    "created_utc": 1653932269.0,
                    "response": "The beacon chain went live December 2020\\*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak8uco",
                    "author": "AmateurStockTrader",
                    "score": 7,
                    "created_utc": 1653929248.0,
                    "response": "Well written",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakig8u",
                    "author": "bandoonparade",
                    "score": 2,
                    "created_utc": 1653933513.0,
                    "response": ">Only a 4 validators are able to enter or exit a spot every epoch. An epoch happens every 32 blocks - there are 225 epochs per day so a maximum of 900 validators can stake or unstake in one day.\n\n>Since it requires 32 ETH to be a validator that means a max of 28,800 ETH can be staked or unstaked each day.\n\nCan't a single validator stake with more than 32 ETH?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakmerj",
                            "author": "sargontheforgotten",
                            "score": 5,
                            "created_utc": 1653935302.0,
                            "response": "No",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ial1n0u",
                            "author": "Karyo_Ten",
                            "score": 2,
                            "created_utc": 1653942436.0,
                            "response": "Some made that costly mistake and put 64ETH on a single validator. They earn the same as 32 ETH 💀",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iak5z55",
                    "author": "RoBiK75",
                    "score": 4,
                    "created_utc": 1653927987.0,
                    "response": "No.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakfwi4",
                    "author": "socalquest",
                    "score": 3,
                    "created_utc": 1653932367.0,
                    "response": "Raoul Pal will dump all of his. LOL GLTA!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakjyc0",
                    "author": "Mallardshead",
                    "score": -5,
                    "created_utc": 1653934190.0,
                    "response": "Yes.\n\n[https://twitter.com/tenderscore/status/1530790900749676544?s=20&t=zb1Yw7R9K2UF9i5lV5zvkw](https://twitter.com/tenderscore/status/1530790900749676544?s=20&t=zb1Yw7R9K2UF9i5lV5zvkw)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakzpi5",
                            "author": "Old-Lavishness-9546",
                            "score": 2,
                            "created_utc": 1653941511.0,
                            "response": "The owl and snow owl. Nice!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iakqni9",
                            "author": "tootapple",
                            "score": 1,
                            "created_utc": 1653937239.0,
                            "response": "This is basically saying ETH is worthless because it isn’t money and is built upon derivative coins that will eventually fail, causing the entire ETH network to unravel? Right?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iakt3xv",
                                    "author": "Mallardshead",
                                    "score": -1,
                                    "created_utc": 1653938399.0,
                                    "response": "Yes that the network's provisioned liquidity is the worst of both worlds: it's derivative and it's centralized, painting an enormous target on itself for regulation(s). The ethereum network doesn't actually do anything without this stuff. It's a network of vaporware and middleware. Its only unique trick so far is selling jpegs called NFTs. The world is not going to get tokenized, that's nonsense because it's inefficient, antagonistic, and expensive.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaku1c9",
                                            "author": "tootapple",
                                            "score": 1,
                                            "created_utc": 1653938831.0,
                                            "response": "Thank you. Obviously you are getting downvoted in this sub, but I guess I never thought of it this way. It’s good to know the “bear” case if you will. I guess I never really heard major negative things about ETH outside of it not being BTC.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ial2vl8",
                                                    "author": "Mallardshead",
                                                    "score": 1,
                                                    "created_utc": 1653943018.0,
                                                    "response": "I respect your open mind. Really do.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iakdujf",
                    "author": "DudeIMaBear",
                    "score": -3,
                    "created_utc": 1653931450.0,
                    "response": "I don’t think I have a choice, it’s staked. Up or down the good thing is they are holding it hostage so I can’t do anything about it",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ial452i",
                            "author": "IamAFlaw",
                            "score": 1,
                            "created_utc": 1653943617.0,
                            "response": "You did something about it. You agreed to this and now you are forced to stick through it while you poop yourself.\n\nThe old you made a choice. He knew you couldn't hold so he made you hold. It is his future you are fucking with.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iakvzr9",
                    "author": "_Zazu95_",
                    "score": 1,
                    "created_utc": 1653939754.0,
                    "response": "I’m staking!!!! Is this a long Term game",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakzhbo",
                    "author": "Jengus_Roundstone",
                    "score": 1,
                    "created_utc": 1653941403.0,
                    "response": "No. Coinbase won’t let me.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ial1m55",
                    "author": "Digital-Exploration",
                    "score": 1,
                    "created_utc": 1653942425.0,
                    "response": "I will keep staking; 100%",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ial3y9g",
                    "author": "jps_",
                    "score": 1,
                    "created_utc": 1653943529.0,
                    "response": "We would think, after all these years of contra-indications, that folks would assume the price of ETH is not dependent on mining rewards.  Not in the short term, not in the long term.   \n\nYes, it's based on the marginal supply/demand curve.   But \"supply\" does not mean \"newly minted ETH\".\n\nAnd the notion that mining rewards are the major contributor, or even a big contributor to \"supply\" is a fallacy.  \"Supply\" means the **total** number of people who are copacetic letting go their ETH at or around the current price and it's just as influenced by a holder of 0.1ETH as it is by someone with 1,000 ETH, because pricing is to some extent artificial, and to some extent opaque, and to some extent made in backroom deals (yes, it shouldn't be that way, but it is).  \n\nFurthermore, there is so much ETH that was minted back in the day at fractions of the current price and so much more that exchanged hands at fractions of the price. Not to mention that a primary use-case for ETH is to fling money from place to another, possibly going through DeFi  on the way, which is series of paired buy / sell transactions where the ETH isn't being sold, it's just being rented.  And the majority of \"renting\" ETH happens on the exchanges, which are setting the price.\n\nLong story short, unless price drops significantly, the amount of ETH willing to change hands at just about price is *significantly* larger than all the ETH that will be mined that day, that month, or even that year.\n\nBut don't take my word for it.  Do some math.\n\nThere are a million transactions per day, and only 6,000 blocks per day. It's pretty clear miners selling are going to be a vast minority of these transactions. Yes, they are not all buy/sell price-setting transactions... But still... 6 million Coinbase users transact at least once per month. That's more than 6 million pricing transactions per year.  How many of them can possibly be miners?  Even if every miner dumps everything, and only on Coinbase and nowhere else, that would still only be 180K transactions (because they aren't stupid enough to suffer per-transaction friction. And that's if every single mining reward is sold and none are aggregated.  And all are on Coinbase.  \n\nIt's just implausible that miners \"dumping\" mining rewards set the price.  It's more like they suffer the price.  And that's why hash rate goes up and down with price!\n\nAs a thought experiment, wonder what happens if mining rewards go to zero.  Will the price go to infinity?  of course not not, but why not? Extrapolate that reason back to present day, and it still holds true with nonzero mining rewards. \n\nIf anything, POW mining contributes to setting a floor for the price, because of the ratchet effect and actual hard costs of keeping the system running.  But again, that's obviously not deterministic, because the actual hard costs of POW are vastly less than the market cap. \n\nWhile it's true that theoretically the rate of 'inflation' of ETH might have some long-term price influence, that is qualitatively true but quantitatively irrelevant.  It's like me saying that the growth of my hair is increasing my weight. Which is true but not entirely meaningful compared to all the other contributory factors to my weight.\n\nSorry to rant on your parade. \n\nTLDR, this whole analysis is based on a false premise.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}