{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzejk1",
            "title": "Why has BTC accrued more value than ETH?",
            "url": "https://www.reddit.com/r/ethereum/comments/uzejk1/why_has_btc_accrued_more_value_than_eth/",
            "author": "Foamform",
            "created_utc": 1653707675.0,
            "score": 26,
            "num_comments": 121,
            "subreddit": "ethereum",
            "selftext": "I am struggling to grasp why BTC has accrued more value than ETH since ETH has way more transactions/usage happening on it's network. I get that there is more of a scarcity model going on with the hard cap of BTC vs. the inflation of ETH but I would think that with so much more demand for usage the inflation would be cancelled out (especially with the anticipation of a higher burn rate through future usage coming up with ETH 2.0).  \n\n\nCan someone help me understand what factors (contributing to value accrual) I am missing here? Does it basically just come down to BTC being a first-mover and having better memes? Is it partially due to the higher costs per transaction on BTC?",
            "stickied": false,
            "comments": [
                {
                    "id": "ia9v13d",
                    "author": "Ok_Computer1417",
                    "score": 78,
                    "created_utc": 1653708064.0,
                    "response": "IMO, ETH is the only cryptocurrency with a chance to exceed the market of BTC. Currently it boils down to the fact the although ETH has achieved so much, the majority of it worth in still priced into “promise”. It’s the fuel of the Internet of the future, but it’s imperfect, adapting, and hasn’t truly reached its full potential. BTC, however, has since day one proven to perfect at its singular mission: a deflationary asset in a inflationary world.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabdq36",
                            "author": "MillennialBets",
                            "score": -5,
                            "created_utc": 1653747881.0,
                            "response": "BTC is deflationary? You sure about that one buster?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabg5zn",
                                    "author": "uwdjah",
                                    "score": 17,
                                    "created_utc": 1653749070.0,
                                    "response": "Well actually it is true, theres a fixed amount thats only ever going to exist, meanwhile coins get lost, so the total supply when everything has been mined will in effect be deflationary. While the circulating supply currently is inflationary, in a long term view it'll actually be deflationary since the lost coins will never be replaced once everythings been mined.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iacaxx2",
                                            "author": "kingsauvage",
                                            "score": 2,
                                            "created_utc": 1653763630.0,
                                            "response": "BTC key loss rate likely parallels that of ETH key loss rate so it’s probably net neutral from a comparison perspective",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iabo3tv",
                                    "author": "1O01O01O0",
                                    "score": 3,
                                    "created_utc": 1653752814.0,
                                    "response": "Technically it is in inflation until all bitcoin are mined. But technically it is deflationary because the rate at which it inflationary is halved and people lose their Keys.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iabgcha",
                                    "author": "Ok_Computer1417",
                                    "score": 9,
                                    "created_utc": 1653749160.0,
                                    "response": "Yes, 100% sure.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iac2w4s",
                                    "author": "Gabalpwnz",
                                    "score": 2,
                                    "created_utc": 1653759739.0,
                                    "response": "Sad you're getting downvoted here, BTC is inflationary for the next \\~100+ years.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iabncx0",
                                    "author": "Nichoros_Strategy",
                                    "score": 1,
                                    "created_utc": 1653752464.0,
                                    "response": "It’s most likely not technically right now, but may as well be seen as such by comparisons.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabnhy2",
                                            "author": "MillennialBets",
                                            "score": -9,
                                            "created_utc": 1653752528.0,
                                            "response": "No. It’s not deflationary. At all. It’s still inflationary for long time as well. You’re just wrong.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iabnqx1",
                                                    "author": "Nichoros_Strategy",
                                                    "score": 3,
                                                    "created_utc": 1653752645.0,
                                                    "response": "...you can’t know without knowing how many coins have been lost recently, if coins lost is higher than coins mined, it’s deflationary, I said right now it’s probably not, in the future it is more likely to be at a given time.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iabo4xh",
                                                            "author": "MillennialBets",
                                                            "score": -8,
                                                            "created_utc": 1653752828.0,
                                                            "response": "This is a dumb argument. Bitcoin is inflationary.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iabolvi",
                                                                    "author": "Nichoros_Strategy",
                                                                    "score": 5,
                                                                    "created_utc": 1653753047.0,
                                                                    "response": "Simply saying that it probably is right now but depending on lost coins it can also be considered deflationary at that time, the only reason this matters is that practically zero currencies in this day and age are truly deflationary, so the fact that Bitcoin is walking that line so closely is something else, and every halving it gets even closer. I can assure you that in 50-100 years Bitcoin will be deflationary at most times.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iabpagj",
                            "author": "zero_is_a_mirror",
                            "score": -7,
                            "created_utc": 1653753363.0,
                            "response": "Eth is for sure. But Chainlink can also exceed the MC of bitcoin or ethereum with time... according to citi-group but also my hopium",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacloka",
                                    "author": "KlopKlop10293",
                                    "score": 1,
                                    "created_utc": 1653768800.0,
                                    "response": "> But Chainlink can also exceed the MC of bitcoin or ethereum with time... according to citi-group but also my hopium\n\nAccording to me dogecoin can exceed 10 times btc mcap\n\nSource: trust me bro",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iaavc0w",
                            "author": "songbolt",
                            "score": -13,
                            "created_utc": 1653736950.0,
                            "response": "Isn't BCH better than BTC at being money? Lower transaction fees and less USD volatility, no?\n\nIt appears neither BTC nor BCH is a store of value (looks like BCH has lost more USD-price than BTC, but has had less volatility from speculators):\n\nhttps://tradingeconomics.com/united-states/money-supply-m1\n\nhttps://www.coingecko.com/en/coins/bitcoin/usd\n\nhttps://www.coingecko.com/en/coins/bitcoin-cash/usd\n\nhttps://www.coingecko.com/en/coins/ethereum/usd\n\nIt seems a fundamental question is \"What can I actually do with this thing?\" As far as I know I can't buy anything I need -- food, electricity, water, sewage, housing, Internet, cellphone -- with any of it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabpd4j",
                                    "author": "Nichoros_Strategy",
                                    "score": -1,
                                    "created_utc": 1653753398.0,
                                    "response": "Lol, yeah so stable, it only missed out on like 100x gains",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabsx75",
                                            "author": "songbolt",
                                            "score": 1,
                                            "created_utc": 1653755063.0,
                                            "response": "If you bought and sold at the right times, which perhaps most didn't, since the price has fallen.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iabzyzf",
                                                    "author": "Nichoros_Strategy",
                                                    "score": 1,
                                                    "created_utc": 1653758354.0,
                                                    "response": "So when was the right time to buy BCH?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iacbz68",
                                                            "author": "songbolt",
                                                            "score": 1,
                                                            "created_utc": 1653764135.0,
                                                            "response": "If you wanted to speculate, when its fiat currency price was at local minima preceding the local maxima.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iacclng",
                                                                    "author": "Nichoros_Strategy",
                                                                    "score": 1,
                                                                    "created_utc": 1653764439.0,
                                                                    "response": "Ok, is that ratio very good in terms of timely buying opportunities compared to Bitcoin?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iad3c6s",
                            "author": "johnfintech",
                            "score": 1,
                            "created_utc": 1653777139.0,
                            "response": "It's easier to understand BTC as \"gold replacement\" (somewhere to park money for safety, store of value) than it is to understand ETH as the virtual machine of the future, because the former (money parking) has been happening and has been needed for centuries, while the latter (that future) hasn't even started happening yet. BTC doesn't need innovation to accrue value. ETH does. The best thing BTC could do is not change (just like gold did). That's also the worst thing ETH could do. But that's also what makes ETH more interesting. It's antithetical to boring. All the technological innovation of that future will happen on structures like ETH, not BTC (please don't mention Lightning as innovation).",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaaxop7",
                    "author": "LivingFlow",
                    "score": 13,
                    "created_utc": 1653738626.0,
                    "response": "BTC has no legitimate competition. It’s building a highly secure store of value. Ethereum is amazing but there are countless Layer 1s nipping at its heels. BTC is gold while ethereum is the internet. The problem is there are countless additional internets that want a piece.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabjwug",
                            "author": "Terror3y3z",
                            "score": 3,
                            "created_utc": 1653750854.0,
                            "response": "This is what people don't get. You literally cannot compare eth and btc. its like apples and cars. But I would also say that part of your statement is incorrect. I know a few chains that would disagree with you about competition with btc. Looking at you Monero.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabn0hw",
                                    "author": "Nichoros_Strategy",
                                    "score": 3,
                                    "created_utc": 1653752303.0,
                                    "response": "Monero may be good for what it is designed to do but it has an extra hurdle of actually being listed on exchanges for distribution, most of which see it as a regulatory problem.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabr39l",
                                            "author": "Terror3y3z",
                                            "score": 2,
                                            "created_utc": 1653754205.0,
                                            "response": "So you want Bitcoin the ultimate in decentralization to be regulated?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iabrdvh",
                                                    "author": "Nichoros_Strategy",
                                                    "score": 4,
                                                    "created_utc": 1653754346.0,
                                                    "response": "Yep, the more accepted it is by society, the more adoption there will be. No one can change the code, that’s where decentralization comes into play.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaaek5a",
                    "author": "yndkings",
                    "score": 35,
                    "created_utc": 1653722012.0,
                    "response": "Btc is the only one that doesn’t have a foundation/group of people controlling it. It’s the only coin that has been defended by enthusiasts through a chain war. If eth has a contentious failure to PoS or similar then it could prove itself investable, but right now it’s just a project. Btc is also the only one the sec consider not to be a security, which soon could be very important.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabfu90",
                            "author": "John_Sknow",
                            "score": 2,
                            "created_utc": 1653748914.0,
                            "response": "SEC also implies that Litecoin is not a security as well.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaac4p4",
                    "author": "VRoid",
                    "score": 10,
                    "created_utc": 1653719928.0,
                    "response": "What kind of screwed up and ignorant comments are here? Jesus!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaalada",
                            "author": "Nonocoiner",
                            "score": 10,
                            "created_utc": 1653728137.0,
                            "response": "The trolls are usually the first to comment in threads like these.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacsz2l",
                                    "author": "wooktar",
                                    "score": 1,
                                    "created_utc": 1653772254.0,
                                    "response": "They seem genuine. This sub is completely overrun by clueless newbies.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaak5p1",
                    "author": "Global-Tour5395",
                    "score": 10,
                    "created_utc": 1653727110.0,
                    "response": "Bitcoin is simple, Ether is complex. Complex is scary and simple is not.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabjoh9",
                            "author": "Terror3y3z",
                            "score": 1,
                            "created_utc": 1653750749.0,
                            "response": "You cannot compare btc and eth. its like comparing fiat to the internet.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iablu2o",
                                    "author": "Global-Tour5395",
                                    "score": 1,
                                    "created_utc": 1653751749.0,
                                    "response": "I’m not sure if you’re agreeing with me or telling me off…",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaac098",
                    "author": "LoganGyre",
                    "score": 5,
                    "created_utc": 1653719820.0,
                    "response": "IMO the current downtrend is hitting eth harder because so many new assets run on the eth platform. when one of them struggles it’s likely the investor has many more projects that will also suffer at the same time. This leaves less money available to dump into eth. right now btc is seeing more large institutions begin to buy in as an alternative to real estate which is giving it a slight advantage. In the long run the merge will start eth on the path to flipping btc, the fact that it was heading their before the merge was the anomaly for most people.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iab9ezd",
                    "author": "PinkPuppyBall",
                    "score": 4,
                    "created_utc": 1653745662.0,
                    "response": "Holy shit you made all the trolls come out in full force with this thread.\n\nMarket cap is a lagging indicator. Its the only metric that Ethereum hasnt passed bitcoin in. It will soon enough, but as you can see not everyone thinks so.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9w8ui",
                    "author": "shaggy_shiba",
                    "score": 18,
                    "created_utc": 1653708721.0,
                    "response": "Honestly, and might be bit of a hot take, but I feel its first mover advantage completely.\n\nSomeone going from \"Magic Internet Money\" all the way to \"Rollup-Centric, Regenerative Staking, Supply Managing, Sharded blockchain that hosts arbitrary terms and value *at* *scale*\"...\n\nIs kinda a long journey. Adoption will be slow, and Bitcoin is simpler to understand in self-sovereignty, trustless relationships and value store, and near infinite uptime. Ethereum has all of those features, but they're much easier things to understand early.\n\nOnce Bitcoin isn't a crazy topic and is more mainstream, moving to Ethereum will be easier to grasp.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaavj8n",
                            "author": "songbolt",
                            "score": 2,
                            "created_utc": 1653737101.0,
                            "response": "I'm concerned it might never succeed through this obscurity. COWON made better products than Apple -- not only an m4a player, but plays several other music formats AND has a radio receiver AND can record the radio AND has a video player AND a touch screen! -- but I was the only one I ever saw using a COWON D2 music player; everyone else had iPod. (I think this COWON D2 was cheaper, too.)\n\nSo it is possible that marketing beats utility.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabhtz8",
                                    "author": "Bruhmuh",
                                    "score": 0,
                                    "created_utc": 1653749873.0,
                                    "response": "Apple products had great interfaces and were easy to use. Bitcoin is simpler in design and easier to understand than Ethereum.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabjkez",
                                            "author": "Terror3y3z",
                                            "score": 4,
                                            "created_utc": 1653750696.0,
                                            "response": "Thats an imperfect analogy. Microsoft beats apple in market share for PCs and Samsung beats apple in market for phones.. You can't compare a store of value and a service system. The only thing ETH and BTC have in common is that they use block chain tech.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iabkey8",
                                                    "author": "Bruhmuh",
                                                    "score": -4,
                                                    "created_utc": 1653751086.0,
                                                    "response": "Don't have time for perfect analogies, btc>eth kekw",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iac2oh2",
                                    "author": "deinterest",
                                    "score": 1,
                                    "created_utc": 1653759639.0,
                                    "response": "Apple got big on marketing and coolness. Also their products looked good, which matters when things like that became fashionable. Utility is definitely not all there is to it when you want the general public to buy something.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iab986s",
                    "author": "klyde_donovan",
                    "score": 3,
                    "created_utc": 1653745561.0,
                    "response": "BTC is the hardest currency ever to exist. Eth is a different way of doing finance in general. The first has intrinsic value just for being what it already is. The other needs to compete with existing financial structures and be better than them.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabjzyn",
                            "author": "Terror3y3z",
                            "score": 1,
                            "created_utc": 1653750894.0,
                            "response": "Thats just not true. Ones a store of value and ones a service. You can't compare them.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iac9dr7",
                                    "author": "navidshrimpo",
                                    "score": 3,
                                    "created_utc": 1653762872.0,
                                    "response": "You just compared them.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iabgh4w",
                    "author": "Either-Advantage",
                    "score": 4,
                    "created_utc": 1653749224.0,
                    "response": "I think ETH can and will eventually surpass BTC as far as price and adoption is concerned. Especially with L2s such as Polygon being built on-top of it. Eth is going to be the foundation of web3 as we know it IMO.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac5owg",
                    "author": "Sorry_Attitude_",
                    "score": 2,
                    "created_utc": 1653761078.0,
                    "response": "Ethereum is more akin to the internet, a platform on which many people buy and sell, you cannot have skyrocketing values when you want people to use your platform which requires you to pay gas, I mean for getting a NFT recently from Angelblock i paid like 10$ just for the transfer, which is ridiculous if you wanna do a lot of activity\n\nEthereum has to balance Gwei as well as value which keeps it down sometimes \n\nMeanwhile Bitcoin is just straight up P2P transfers, there is nothing smart happening on it and for someone just wanting permissionless trustless money that can go anywhere, it is the best choice, can't be hacked in a smart contract nor stolen from a cold wallet\n\nNot to mention Ethereum is younger lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacow4q",
                    "author": "EfgKh4EE3eTb9HPwe3iy",
                    "score": 2,
                    "created_utc": 1653770293.0,
                    "response": "Patience grasshopper",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaa1537",
                    "author": "Remarkable-Hall-9478",
                    "score": 5,
                    "created_utc": 1653711714.0,
                    "response": "People fundamentally misunderstand the purpose of utility networks if they’re wondering this question. \n\nIn fact, the utility networks that do accrue large valuations are likely doing so via not being as utile as they are purported or they claim to be. \n\nIf Ethereum is to ever reach the “promised” levels of utility, I.e. a state that approximates the ideal form of the broader crypto promise of a “better world” etc etc. then it will necessarily have to have a much higher velocity of money and lower unitary costs for using it in any form. These lowered costs and higher velocities are positives for utility but apply negative price pressure. In fact, if the utility increases are significant enough, then the infrastructure costs of maintaining the network security are dependent upon the inflationary mechanisms which cause further price decreases. If the inflation-driven extraction of value from the coin holders and buyers isn’t high enough to support infrastructure costs, then the size of the validator pool shrinks accordingly and the network’s security and decentralization suffer, which further decreases the fair value of each ether. \n\nTL;DR: it doesn’t matter how much you want to moon, the economics of a healthy utility network do not support this conclusion. If Ethereum succeeds, individual ether will be significantly cheaper and the moon potential of the coins decreases.\n\nMost here would call this counterintuitive, but it’s not. It’s merely counterintuitive when you have some internal “get rich” narrative (even in the face of all logic which dictates that rising from $1 to $4000 was the “get rich” period, and that is in the past). When one’s intuition is somehow trained o to completely irrational and mathematically unsubstantiated notions, which humans are prone to do, it can seem jarring, or even hostile to read this, but again, it’s not. If you want Ethereum to succeed you want the world to have a great utility network and all of the things enabled by/invented because of it, not have another abusive toxic financial ecosystem geared around making legacy rent seekers lots of money.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabpuvo",
                            "author": "zero_is_a_mirror",
                            "score": 5,
                            "created_utc": 1653753631.0,
                            "response": "L2s\n\nand there is something to be said for a high L1 token price which enables a certain level of security. how would it make sense if a network is transacting trillions of dollars of value but can be taken down by $44billion?? or $4billion?? \n\nthe price of eth is a section of its security and the cost of attacking the network",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iab5nfx",
                            "author": "sapeur8",
                            "score": 9,
                            "created_utc": 1653743569.0,
                            "response": "Are you aware of L2s? Transaction costs can go down without ETH price going down.\n\nI'm of the opinion that a higher value of ETH is better since it means more security for the validation of the chain. Also, it would be a larger amount of trustless collateral that can be used to grow the network of stablecoins, etc.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabfxeg",
                                    "author": "DaKlipster2",
                                    "score": 8,
                                    "created_utc": 1653748956.0,
                                    "response": "I think your right. The total number of ETH vs the amount value in the chain also shouldn't stop people from using it. That's like saying a dollar should be cheaper.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabj6cg",
                                            "author": "Terror3y3z",
                                            "score": 6,
                                            "created_utc": 1653750517.0,
                                            "response": "Yeah, it sounds like they are confusing price ETH with price of gas fees.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iabjje7",
                                                    "author": "DaKlipster2",
                                                    "score": 2,
                                                    "created_utc": 1653750683.0,
                                                    "response": "That I can see as a problem. I think as the layer 2's become more seamless it won't be a problem at all.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iab79on",
                                    "author": "Remarkable-Hall-9478",
                                    "score": -6,
                                    "created_utc": 1653744478.0,
                                    "response": "Yes, I'm aware of L2s lmao. \n\nI don't think you fully understood the comment you're replying to, FWIW.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iab916f",
                                            "author": "sapeur8",
                                            "score": 7,
                                            "created_utc": 1653745455.0,
                                            "response": ">will necessarily have to have a much higher velocity of money and lower unitary costs for using it in any form. These lowered costs and higher velocities are positives for utility but apply negative price pressure. In fact, if the utility increases are significant enough, then the infrastructure costs of maintaining the network security are dependent upon the inflationary mechanisms which cause further price decreases\n\nThis doesn't make sense to me. L2s can allow higher velocity without applying negative price pressure or increasing the costs of network security. Please enlighten me",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iab8trv",
                            "author": "bauhaus_robot",
                            "score": 3,
                            "created_utc": 1653745342.0,
                            "response": "Transactions need to be cheap. Not eth.Massive volume is what would drive eth price up",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iac2490",
                            "author": "domotheus",
                            "score": 3,
                            "created_utc": 1653759368.0,
                            "response": "Velocity of money with PoS is [arguably higher when you have low inflation](https://dataalways.substack.com/p/manipulating-the-velocity-of-money), and a good part of the value proposition is that the network is secure and resilient, which is enforced by the staking collateral being valuable. \n\nAnd with EIP1559 there are pretty good mechanisms to take the protocol revenue and flow it back to Ether itself, which has plenty of [cool feedback loops](https://i.imgur.com/CAycxbt.png) linking value, utility and scaling together.\n\nTo be clear I'm not expecting ETH to moon, but it will definitely reach an equilibrium where it has near 0% inflation when burn = issuance, and from there you can take the protocol-revenue in USD and work out [what price ETH would have to be](https://www.reddit.com/r/ethfinance/comments/rnsk2r/fundamental_valuation_models_of_ethereum/) to get such an equilibrium. The x100s are behind us for sure, but as long as there's solid revenue from the high demand for blockspace (either from users directly or L2s), ETH will be a pretty good asset to hold.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaa41bq",
                            "author": "viva1992",
                            "score": 2,
                            "created_utc": 1653713694.0,
                            "response": "Yep, exactly. For eth to be useful, it needs to be cheap, but if eth is cheap, most right now will be disappointed because they are not holding eth to use it, but to get rich.\n\nIt’s like people hoarding oil before we figured out a way to refine it and make it useful.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaa7v6e",
                    "author": "Nonocoiner",
                    "score": 1,
                    "created_utc": 1653716517.0,
                    "response": "Bitcoin just had a headstart, and it's issuance has been lower over the past years.\n\nAfter the merge Ethereum will have both the superior technology and monetary policy, and the market cap  will follow at some point",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabdger",
                            "author": "cannedshrimp",
                            "score": 2,
                            "created_utc": 1653747747.0,
                            "response": "A consistent monetary policy is far more important than a tight monetary policy in a public money. The way the supply has changed over time will always be a mark on Eth as a completely open money. Eth does a lot of things really well, but BTC is better as an open money.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabpt2d",
                                    "author": "Nonocoiner",
                                    "score": 2,
                                    "created_utc": 1653753608.0,
                                    "response": "Fair point.\n\nI personally think the more flexible monetary policy of Ethereum, combined with the minimum viable issuance policy, has it's advantages. It already has made the implementation of an improved fee market possible, and will provide a security budget that is sustainable long term, without high inflation.\n\nBut I definitely understand a simple and stable policy has it's merits too.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iabktg1",
                                    "author": "Terror3y3z",
                                    "score": -1,
                                    "created_utc": 1653751274.0,
                                    "response": "IMO these cant even be compared. Its like comparing gold to the internet.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaadvh2",
                    "author": "aaaanoon",
                    "score": 0,
                    "created_utc": 1653721417.0,
                    "response": "Everyone knows BTC. It has little merit other than that - comparatively.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabdhus",
                            "author": "cannedshrimp",
                            "score": 0,
                            "created_utc": 1653747768.0,
                            "response": "Incorrect",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia9vba4",
                    "author": "BoondocksNotASaint",
                    "score": -2,
                    "created_utc": 1653708217.0,
                    "response": "Gold has more value than silver right? Same idea. Just look at the colors chosen for both and then apply that logic to how the general population who knows little to nothing about either’s usage would view them. Same reason you get think about fast food even if you’re full. All major companies (aside from Taco Hell) use mostly red and gold in their emblems. The colors incite hunger.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaafbb6",
                            "author": "sailing_to_the_stars",
                            "score": 0,
                            "created_utc": 1653722678.0,
                            "response": " Underated comment.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iabkaoh",
                            "author": "Terror3y3z",
                            "score": 1,
                            "created_utc": 1653751032.0,
                            "response": "1. Orange means gold?\n2. You cannot compare a store of value(BTC) and a service environment(ETH)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabnqej",
                                    "author": "BoondocksNotASaint",
                                    "score": 1,
                                    "created_utc": 1653752638.0,
                                    "response": "Everyone here is so used to HODL’ing and having diamond hands that in some regard they’ve forgotten about the boomers who don’t have a clue what BTC and ETH do. The people that treat it like a regular stock because their broker of the past 40 years now advised to invest in it. Tell your average 65yo almost retiree that you have diamond hands and see how he/she looks at you. Now add in the massive brokerages that see their returns dwindling because we’re not investing with them like our parents and grandparents did, so they’re going to describe it to their clients way worse than I just did. These are the people that are still plugged into the matrix as it were. You have to try and understand their perspectives on it too. It’ll make the current dip make more sense.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaalyd7",
                    "author": "JunoKat",
                    "score": 1,
                    "created_utc": 1653728748.0,
                    "response": "I think it’s utility vs store of value.\n\nUtilities capture value in a shorter time period: Think monthly income spent on telecom services, contracts, tax, etc\n\nStores of value capture generational value: Think castles, land, rare art, inheritance.\n\nIn the beginning, I thought only utilities have real value. As I learn more, I realised that a digital  option for generation value storage is actually very useful: Land can be drown in water from global warming, gold confiscated by bad governments (dictators), corporations come at go.\n\nAll in all, I think both Eth and Btc will co-exist in the future, playing at different ball games.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaaexge",
                    "author": "Adamn27",
                    "score": -6,
                    "created_utc": 1653722339.0,
                    "response": "BTC is finite. Ethereum is leaded by an autistic kid and is a copy.  \n\n\nBoo Hooo downvote fanboys!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabll25",
                            "author": "Terror3y3z",
                            "score": 3,
                            "created_utc": 1653751632.0,
                            "response": "You get downvoted for being ignorant and trolling. Not because I'm a fanboy, fanboy.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacdice",
                                    "author": "Adamn27",
                                    "score": 0,
                                    "created_utc": 1653764865.0,
                                    "response": "Boo Hooo internet stranger is ignorant mommy I press arrow!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iaawgty",
                            "author": "songbolt",
                            "score": 2,
                            "created_utc": 1653737771.0,
                            "response": "BTC has 21 x 10^14 units. Relative to the number of people on Earth (~8 x 10^9 ), it's not clear that BTC's finiteness is relevant. \n\n260,000 units per person on Earth if everyone uses BTC.\n\nThere's 1.55 x 10^11 grams of gold on Earth, 19 grams per person on Earth if everyone uses gold.\n\nSo much for finiteness -- if that's the deciding factor, we should all buy gold.\n\nMore to the point, the finiteness argument neglects human governance. China has banned Bitcoin. The USA are on a track now to do so as well (along with ETH and any other threat to their fiat currency).",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaay1fm",
                                    "author": "Adamn27",
                                    "score": -5,
                                    "created_utc": 1653738867.0,
                                    "response": "Boo Hooo btc is finite but it doesn't matter!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaa3m9s",
                    "author": "BlockChainR3volution",
                    "score": 1,
                    "created_utc": 1653713398.0,
                    "response": "Its was out 6 years b4 eth. N eth needed bitcoin to get started 🤷🏻‍♂️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaabui1",
                    "author": "upintheayem",
                    "score": 1,
                    "created_utc": 1653719688.0,
                    "response": "[Bitcoin as an investment](https://www.sec.gov/comments/sr-cboebzx-2018-040/srcboebzx2018040-4064523-169183.pdf)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabomc0",
                    "author": "iiJokerzace",
                    "score": 1,
                    "created_utc": 1653753053.0,
                    "response": "Not sure how many here realize this but networks like ETH will have the entire value split among its ecosystem.\n\nIt's possible an erc20 token could have a larger market cap than ETH.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaa9yhb",
                    "author": "VRoid",
                    "score": -6,
                    "created_utc": 1653718146.0,
                    "response": "Very simple! \n\nBTC: limited supply\n\nETH: unlimited supply (or infinite supply)\n\nCapice?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iablg7q",
                            "author": "Terror3y3z",
                            "score": 4,
                            "created_utc": 1653751568.0,
                            "response": "Thats not quite accurate. BTC: Finite supply ETH: controlled supply.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaac79h",
                            "author": "IamAFlaw",
                            "score": -7,
                            "created_utc": 1653719990.0,
                            "response": "BTC = garbage.\n\nThe only thing going for it is there are a lot of people who can only think of Bitcoin when you say crypto. That is pretty much the only thing going for it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaavqap",
                                    "author": "songbolt",
                                    "score": 1,
                                    "created_utc": 1653737246.0,
                                    "response": "u/VRoid gave an argument (or at least most of one: two premises). You give only a conclusion, no premises.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaalted",
                    "author": "Letsmakeitawsome",
                    "score": 0,
                    "created_utc": 1653728627.0,
                    "response": "1. Decentralized, secure p2p payment system\n2. Hard cap of underlying asset \n3. First time in human history we can instantly monetize energy which location is irrelevant- BTC mining.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaa1wdx",
                    "author": "n8dahwgg",
                    "score": -1,
                    "created_utc": 1653712222.0,
                    "response": "You have to understand monetary theory and history deeply to know the answer to this, and it isn’t a quickie.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaay3z0",
                            "author": "n8dahwgg",
                            "score": 1,
                            "created_utc": 1653738916.0,
                            "response": "This would get downvoted in an eth sub lol",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaa946s",
                    "author": "ImpeccableArchitect",
                    "score": 0,
                    "created_utc": 1653717488.0,
                    "response": "Several things, the gas fees make eth almost unusable, and while btc is slow to adapt, sidechains are coming that will be able to do the smart contracts and programmable money that eth does. Fixed supply, decentralised network, and a long term plan that while slower than we would all like, has turned out to be resistant to forks, government regulation,  and attacks. Dont get me wrong: i wanted eth to succeed, but the main reason i gave up on it was the gas fees. If i needed programmability right now i would look to cardano and haskell. Or smartBCH. Or just wait, that will come to btc eventually.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iab4cts",
                            "author": "PunpunParker",
                            "score": 3,
                            "created_utc": 1653742833.0,
                            "response": "So BTC will succeed in your view when they start copying ETH? Interesting take. Sidechains are coming to BTC to be more like ETH ... Well L2 are improving ETH too and they are fixing the transaction costs.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaagmun",
                    "author": "Just-Blow-Into-It",
                    "score": -5,
                    "created_utc": 1653723864.0,
                    "response": "Bitcoin = Bitcoin  \nEthereum = Shitcoin  \n\njokes aside Bitcoin and Ethereum aren't in the same category.\n* Bitcoin is money.\n* Ethereum is smart contracts.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabp6iv",
                    "author": "zero_is_a_mirror",
                    "score": 0,
                    "created_utc": 1653753312.0,
                    "response": "uhhh cuz its older... more years to grow the network",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaa5gyl",
                    "author": "heyhihowyahdurn",
                    "score": -1,
                    "created_utc": 1653714726.0,
                    "response": "It’s older and isn’t controlled. Also without the 2.0 upgrade Eth is kinda underwhelming",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaasv5z",
                    "author": "JohnMaddn",
                    "score": -1,
                    "created_utc": 1653734981.0,
                    "response": "It has accrued more value than ETH because it has accrued more value than ETH. \n\nFew will understand.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaauppr",
                    "author": "songbolt",
                    "score": 1,
                    "created_utc": 1653736485.0,
                    "response": "Why are you saying 'value'? It has *more USD price*, but that's not the same thing as value, right? Value is how good something is, no? So the question is whether \"digital gold\" or \"unstoppable computer fuel\"/\"digital oil\" is more valuable to an individual, right?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabcilh",
                    "author": "Inviction_",
                    "score": 1,
                    "created_utc": 1653747282.0,
                    "response": "\"I don't understand why my favorite one isn't everyone else's favorite\"\n\nCome off it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabocuo",
                    "author": "Newguyiswinning_",
                    "score": 1,
                    "created_utc": 1653752931.0,
                    "response": "Ape investors only care about BTC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabpefe",
                    "author": "Balderino",
                    "score": 1,
                    "created_utc": 1653753416.0,
                    "response": "The way I see it right now - BTC is to crypto like gold is to the dollar back in the day.\n\nAll other cryptos prices are based on the performance of BTC and we will see this pattern for a while until we see something \"flip\" bitcoin which we have no idea if or when it will happen!\n\nOfc there are altcoin seasons where alt coins outperform BTC but these cycles go in circles as of right now - also I know there are a looooot of people in crypto, but it is still a very young market compared to other currencies and commodities.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac3f6y",
                    "author": "Inevitable_River_509",
                    "score": 1,
                    "created_utc": 1653759992.0,
                    "response": "Because anything else than Bitcoin is a shit coin. Please don’t get angry it’s just my honest opinion.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacmhle",
                    "author": "PSUBagMan2",
                    "score": 1,
                    "created_utc": 1653769203.0,
                    "response": "Because it has more of the mindshare.  Everyone knows what Bitcoin is.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacs0h8",
                    "author": "BigPlayCrypto",
                    "score": 1,
                    "created_utc": 1653771777.0,
                    "response": "Don’t worry it’s a test",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacsje6",
                    "author": "LiveDirtyEatClean",
                    "score": 1,
                    "created_utc": 1653772038.0,
                    "response": "It's hard to imagine why BTC is so valuable in the first world when we have a \"decent\" financial system. IMO our financial system is incredibly fucked, but not compared to the third world.  In countries where their currency is completely debased, incorruptible, store of value cryptocurrency is immensely valuable.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad0p9j",
                    "author": "madogss2",
                    "score": 1,
                    "created_utc": 1653775859.0,
                    "response": "Time, Fixed amount, And who has control",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad3d00",
                    "author": "manxkarst",
                    "score": 1,
                    "created_utc": 1653777151.0,
                    "response": "Haha well BTC actually used to be used as a currency in the beginning. HODL didn’t exist. The original purpose of bitcoin was to be used to do transactions online. It was very successful in the beginning at this. Now BTC has failed as a currency, because the price has gone too high and now people think it’s a type of long term investment instead of spending it. ETH has utility beyond what bitcoin can ever do but it is still more volatile. ETH can’t be used for transactions because it’s price changes too wildly. Stablecoins will be the future of transactions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaa0467",
                    "author": "Cute-Touch-1524",
                    "score": -11,
                    "created_utc": 1653711049.0,
                    "response": "Bitcoin is a ponzi that has not burst. There’s no more reason for btc than doge",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaa20ou",
                            "author": "n8dahwgg",
                            "score": 0,
                            "created_utc": 1653712303.0,
                            "response": "Nice thesis paid account. You’re kinda obvious",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaankvg",
                    "author": "michelmx",
                    "score": -2,
                    "created_utc": 1653730295.0,
                    "response": "Ethereum is very useful if you want to create and sell instamined tokens to retail investors.\n\nTake that away and what is ethereum actually good for?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaap6oi",
                    "author": "lalalahahahalol",
                    "score": -4,
                    "created_utc": 1653731747.0,
                    "response": "ITT: copium\n\nEth has nothing on btc.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaau42f",
                    "author": "Jezzes",
                    "score": -3,
                    "created_utc": 1653736002.0,
                    "response": "It's Bitcoin and not a crypto",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaabalf",
                    "author": "KatzenShaft",
                    "score": 0,
                    "created_utc": 1653719238.0,
                    "response": "One thing is BTC is practically a household name, most people know of it. Eth not so much, the google searchs for Eth were 15% of BTCs amount of google searches. \n\nObviously other factors are present.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaawn8m",
                    "author": "Common_Consideration",
                    "score": 0,
                    "created_utc": 1653737896.0,
                    "response": "Alot of other networks have higher transactions and otherwise same technology as etherium currently has, they are still worth less then eth. Technology and utility does not equal value, and high throughput will counteract the token value, at in the \"short\" term. Scaling issues particularly for both bitcoin and etherium actually helped them accure their value. Transactions being limited increases the value/scarcity of transactions. Higher throughput on the other hand frees up the network, lowers value of each individual transaction. creating less need/scarcity for the token.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabq0hx",
                    "author": "Lbaseball06",
                    "score": 0,
                    "created_utc": 1653753703.0,
                    "response": "Proof of work. First mover. Most secure. Unidentified creator.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabqmkf",
                    "author": "Ham_Sinkie",
                    "score": 0,
                    "created_utc": 1653753986.0,
                    "response": "The same reason gold is worth more than silver even though silver has more technical utlitly.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}