{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxzgvd",
            "title": "With the merge coming, how big of an issue are staking pools like Lido?",
            "url": "https://www.reddit.com/r/ethereum/comments/uxzgvd/with_the_merge_coming_how_big_of_an_issue_are/",
            "author": "ismashugood",
            "created_utc": 1653539192.0,
            "score": 9,
            "num_comments": 32,
            "subreddit": "ethereum",
            "selftext": "From posts I'm reading, Lido has 1/3 of all staked ETH.  \n\nIs this going to be an issue?  With people holding less than 32Eth clearly wanting a piece of the staking pie, they're all going to flock to staking pools.  And they're all going to flock to big names and pools with a reputation, usually stemming from other stakers who will \"vouch\" for one.  Because let's face it, we're all lazy and it's more reassuring to stake in a pool that doesn't have just 3 other people.\n\n&#x200B;\n\nButerin has talked about staking pools \"self throttling\".  Is that really the solution going forward?  Everyone self imposing restrictions through altruism for the system's integrity.  I just can't see that being viable.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia1giqx",
                    "author": "Longjumping-Basket62",
                    "score": 7,
                    "created_utc": 1653551267.0,
                    "response": "Rocketpool is newer than Lido and maybe that's why people don't use it that much but it offers a real decentralised option for people with less than 16 ETH to stake just by buying rETH.\n\nStill, if Lido or Allnodes or any other platform becomes a threat to the network it is always possible to apply a penalty by slashing if the platform raises above a certain participation rate. The network should be flexible enough to apply incentives or penalties to make sure it can continue growing safely. Simply trusting in the good faith of Lido or any other third parties is not a good policy, you need to clearly show the path to follow to all stakers.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1oh98",
                            "author": "Proud_Reserve3029",
                            "score": 3,
                            "created_utc": 1653558383.0,
                            "response": "Slashing means they did something wrong. As far I can see they have done nothing wrong. Doing this will set a really bad precedent for eth. I mean they done nothing wrong so Eth devs can just slash anyone they don’t like. If so proof of stake will end up being a monopoly for eth devs to do what they want. it’s going to eventually drive everyone away",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1yfhg",
                                    "author": "Longjumping-Basket62",
                                    "score": 1,
                                    "created_utc": 1653565705.0,
                                    "response": "They've done nothing wrong until they do. If their staking model turns out to be a potential risk to the whole network because it promotes centralization, then someone is actually doing something wrong, even though it's unintentional and they always meant to do good. A 51% attack would be much worse than applying penalties to avoid dangerous centralization; it could actually be the end of Ethereum itself.\n\nOf course it would be much better if this could be solved by incentivizing decentralized staking away from Lido or cloud services. Maybe we should think more about this. \n\nPoS needs to be decentralized, not a monopoly of the devs, Lido or anyone else. It's a matter of setting up clear principles and rules and make every party stick to them.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia17bs2",
                    "author": "semicryptotard",
                    "score": 6,
                    "created_utc": 1653543783.0,
                    "response": "The Rocket Pool team and community is working to enable greater capital efficiency/scaling. \n\nRight now with all the chaos there is an empty deposit pool so you should be able to deposit at will for rETH.\n\nFor those wanting to make larger deposits, there is a whale looking to deploy a huge amount of ETH into validators and has currently queued up a \"test\" of 100 validators that are waiting for ETH. Go deposit in chunks of 1500 ETH!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1g8zm",
                    "author": "FreitasAlan",
                    "score": 5,
                    "created_utc": 1653551023.0,
                    "response": "How is that different from the incentives in mining pools?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia14dya",
                    "author": "greatgoogelymoogely",
                    "score": 1,
                    "created_utc": 1653541681.0,
                    "response": "Vb talked of \"self throttling\" though fee hikes. Since the world doesn't work on altruism we have to pull incentives into the mix.\n\nThe essence of what is being suggested is really just capitalism. Lido can reduce market share by operating less competitively\n\nI think in this crypto world, idealistically trustless, but really quite the opposite-- Lindy plays a huge role. \n\n I am excited to see capitalism have a real shake in what is probably the free-est market there has been... ever. Hopefully we are able to find ways to program altruistic outcomes along the way.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia19kes",
                    "author": "yourmo4321",
                    "score": -6,
                    "created_utc": 1653545502.0,
                    "response": "Requiring 32 eth to stake is insane. It's literally \"hey are you well off? Want to be more well off? Fuck the little guy come with me\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1afo2",
                            "author": "ausgear1",
                            "score": 6,
                            "created_utc": 1653546184.0,
                            "response": "you can buy rETH at any value and contribute to staking in a decentralized way. More decentralized than using a mining pool or a staking pool",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia1b4ex",
                            "author": "Tyaigan",
                            "score": 2,
                            "created_utc": 1653546734.0,
                            "response": "don't you think there is a little more than that ?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia1kx32",
                            "author": "semicryptotard",
                            "score": 2,
                            "created_utc": 1653555218.0,
                            "response": "I mean it's certainly a major improvement from the original implementation which was 1,500 ETH.\n\nThanks to BLS singnature aggregation they can run waaaaay more validators and thus are able to reduce the capital requirement.\n\nAll of the liquid staking services allow you to contribute as little as 0.1 ETH to their deposit pools so you can earn while retaining liquidity of the asset for use in defi, check out Rocket Pool's rETH!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1rgqj",
                                    "author": "Sad_Table_3289",
                                    "score": 1,
                                    "created_utc": 1653560865.0,
                                    "response": "I'm wondering what reward would you get if you stake 0.1 ETH and why would you do that?! with just 0.1 eth you can get a GTX 1660S and get 30$ a month that beats the 0.005 you'll get from staking.\n\nReally hope POS wil fail big",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia2rthr",
                                            "author": "semicryptotard",
                                            "score": 2,
                                            "created_utc": 1653579360.0,
                                            "response": ">GTX 1660S\n\nJust looking at GPU prices tells me that (at least at current ETH prices) that wouldn't be possible or you're buying used on ebay, the card could die and you're screwed and of course the hardware itself depreciates over time.\n\nWhatever meager profit you generate will also be cut down by nearly 30% with electricity costs, then another what, 20-35% based on your tax bracket?\n\nMeanwhile, using a staking pool requires zero effort on your part while rETH accrues value relative to ETH so it doesn't result in a taxable event. You can sit there and let it accumulate value for years then cash it in for long-term capital gains. Yields will boost post-merge (maybe 8-10%?) but I would guess settle in the 4-6% range in the medium term.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia2tiu9",
                                                    "author": "Sad_Table_3289",
                                                    "score": 1,
                                                    "created_utc": 1653580047.0,
                                                    "response": "I’m just saying that I have nearly 2 gh/s that I paid for between 25-27k $ and they still give me around 2k each month. But I’ll never have 32 eth to stake on my own or can sford to have them blocked for a very low income",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia2w0qp",
                                                            "author": "semicryptotard",
                                                            "score": 2,
                                                            "created_utc": 1653581035.0,
                                                            "response": "Well, that's why I'm suggesting a liquid staking token, at least you can use it elsewhere in defi.\n\nIf you're actually living off the cashflows then yea, you're out of luck. The PoS consensus mechanism is far more efficient and emits much less ETH. \n\nIf I were you I would amass as much ETH as possible and stop selling it.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia2xk8y",
                                                                    "author": "Sad_Table_3289",
                                                                    "score": 1,
                                                                    "created_utc": 1653581641.0,
                                                                    "response": "I have already breaked even, and I’ll continue to mine even after Pos because I have almost free power, I understand the Pos advantages for the chain, but I really believe that whales will take it all and will lead to centralisation. We will live and see",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia2parq",
                                            "author": "semicryptotard",
                                            "score": 1,
                                            "created_utc": 1653578343.0,
                                            "response": "You get the exact same reward you would get if you staked 100 ETH in a liquid staking pool.\n\nIf you're asking how much you're getting vs. the node operator, commissions range from 10-15% of rewards, so if the APR was say 5% (0.05 vs. your 0.005, not sure where you're getting that), at 10%  commission you would be making 4.5% and paying 50 basis points to the operator.\n\nIn exchange, you retain liquidity of the ETH via the staking derivative (rETH, stETH, swETH depending on the provider). You can then use it for lending/borrowing/LP'ing in Defi.\n\nSome of us are interested in providing security for the chain post-merge, not sure why you are wishing a disastrous outcome for the chain that's making you money.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia22gkb",
                            "author": "domotheus",
                            "score": 2,
                            "created_utc": 1653568073.0,
                            "response": "Like everything else in this space, it's a trade-off\n\nhttps://notes.ethereum.org/@vbuterin/serenity_design_rationale?type=view#Why-32-ETH-validator-sizes\n\nDespite what it looks, Ethereum PoS actually optimizes to have as many block producers as it possibly can, time to finality and p2p overhead are the blockers. Other chains have a few hundreds/thousands block producers with built-in delegated staking, Ethereum can safely have up to a million.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia1jxu9",
                            "author": "Shadowsfury",
                            "score": 1,
                            "created_utc": 1653554331.0,
                            "response": "Only because of recent price runs - it really wasn't much if you go back pre covid",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia14o6x",
                    "author": "lanatork",
                    "score": 1,
                    "created_utc": 1653541883.0,
                    "response": "Yes, that’s a quite risk. PoS in Ethereum needs a greater than 66% vote of the validators to finalise a block. Finalise in this context means that this block and all the blocks before will be forever part of the blockchain and there can’t be a reorganisation of blocks to undo them. That’s a change in regards to PoW and one of the big advantages that PoS has over PoW. So Lido could block that if they wanted to. There is no financial gain for them, as the protocol would slowly take away their stake funds, but it would create problems for people who wait until a transaction is finalised.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1hfe4",
                    "author": "AnyInformation9485",
                    "score": 1,
                    "created_utc": 1653552069.0,
                    "response": "Check how rocketpool works and then shit-talk :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia14gbh",
                    "author": "UnrulySasquatch1",
                    "score": 0,
                    "created_utc": 1653541729.0,
                    "response": "Lido has a total of just shy of 8% according to this which combines all their known staking addresses:\n\nhttps://beaconcha.in/pools\n\nSo no, I don't think it will be an issue",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia173ri",
                            "author": "semicryptotard",
                            "score": 2,
                            "created_utc": 1653543621.0,
                            "response": "That is incorrect. Total stake is over 4m ETH at this point, they are around 32%",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1j6km",
                                    "author": "thecultofoil",
                                    "score": 0,
                                    "created_utc": 1653553649.0,
                                    "response": "No they have 32% of all staking pooled eth. Places like Coinbase, binance, rocketpool, stakewise, etc\n\nThey only have 8% of the total of staked eth when you include people who are solo staking with 32 eth",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1ktgs",
                                            "author": "semicryptotard",
                                            "score": 2,
                                            "created_utc": 1653555124.0,
                                            "response": "That [beaconcha.in](https://beaconcha.in) page isn't detecting things properly.\n\nLido currently has over 90% market share of the liquid staking market and 32% of total staked ETH. \n\n\\~10.6% of all ETH is currently staked, a little over 12.6m ETH across \\~400k validators.\n\nhttps://dune.com/hildobby/ETH2-Deposits\n\nOf that, Lido's 21 node operators currently run 4.1m ETH across nearly 130k validators. You can literally go into their DAO node operator registry and see how many validators each company is running vs. how many validators they've been allocated by governance.\n\n[https://mainnet.lido.fi/#/lido-dao/0x55032650b14df07b85bf18a3a3ec8e0af2e028d5/](https://mainnet.lido.fi/#/lido-dao/0x55032650b14df07b85bf18a3a3ec8e0af2e028d5/)\n\nHope this clears things up for everyone. This is clearly a problem and people should look at Rocket Pool. Other services like Swell are also coming to market soon, so there will be increasing liquid staking diversity in the coming months.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ia1l81v",
                                            "author": "ma0za",
                                            "score": 1,
                                            "created_utc": 1653555496.0,
                                            "response": "Thats false. They have nearly 100% of liquid stakers and nearly 40% overall",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}