{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uue8nq",
            "title": "dApps. Developer Update:",
            "url": "https://www.reddit.com/r/ethereum/comments/uue8nq/dapps_developer_update/",
            "author": "Lupexlol",
            "created_utc": 1653102201.0,
            "score": 3,
            "num_comments": 12,
            "subreddit": "ethereum",
            "selftext": "feels like there are more investors and devs here than there are users.\n\nWe dont even do auth services for our apps, we just assume there is no one using  them.\n\nWe never do code reviews, no one knows anything anyway.\n\nWe never waste time on app architecture, everyone says what tech they wanna use and after everyone finishes we send random transactions between contracts. most of them get rejected because msg.sender!=owner. We don’t like people talking to our contracts.\n\nCI/CD? we only deploy to test by running javascript/python scripts locally. No one deploys on main network, that’d be stupid, have you seen the gas prices? \n\nNext week we’ll have a summit where we’ll decide if we fork ethereum and deploy it on amazon. We’ll call it Ethereum DeDecentralised.\n\nIf the proposal passes we’ll make a startup and integrate ethereum with it.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ese8k",
                    "author": "Perleflamme",
                    "score": 2,
                    "created_utc": 1653103343.0,
                    "response": ">We dont even do auth services for our apps, we just assume there is no one using them.\n\nConnecting a wallet is an auth service, by design. If you wanted accounts using email sign in and such, you're welcome back to web2. \n\n>We never do code reviews, no one knows anything anyway.\n\nEver heard of public bounties? \n\n>Next week we’ll have a summit where we’ll decide if we fork ethereum and deploy it on amazon. We’ll call it Ethereum DeDecentralised.\n\n>If the proposal passes we’ll make a startup and integrate ethereum with it.\n\nThat doesn't make any sense. Next time, try to understand what decentralization means.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9eszfu",
                            "author": "Lupexlol",
                            "score": 1,
                            "created_utc": 1653103667.0,
                            "response": "1) yeah but everyone uses web 2 integration and they need off chain users for api keys and stuff\n\n2)that’s a joke. Link me your github \n\n3)it was a joke rofl. \n\nBruh learn to smile from time to time, so salty, lol.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9etr2p",
                                    "author": "Perleflamme",
                                    "score": 1,
                                    "created_utc": 1653104101.0,
                                    "response": "Not salty, just answering to obvious FUD. \n\nA joke is told as a joke. What you did isn't a joke or is a very badly framed one. One like \"hey, you're family's dead. What? Why are you taking it so seriously? It was a joke! \"\n\nPro tip: for it to be a joke, you'd first need to show the lack of seriousness. If you're not aware of it, there are many people here who are dead serious when they're asserting any unbacked claims like yours. \n\nAs such, your behavior is completely identical to theirs from the point of view of an oursider. Don't be surprised if you're treated like they are.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9eu8bh",
                                            "author": "Lupexlol",
                                            "score": 1,
                                            "created_utc": 1653104368.0,
                                            "response": "where is your github bro? I wanna prove a couple of those points 😆",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ex20f",
                                                    "author": "Perleflamme",
                                                    "score": 1,
                                                    "created_utc": 1653106057.0,
                                                    "response": "Proving a point with one github? Do you know the basics of logic? I'll help you: one counter example is enough to disprove a point, but one example isn't enough to prove a point. \n\nBesides, I thought you said it was a joke. You're finally claiming it wasn't a joke? \n\nSo, do you understand what a public bounty is?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9fb0p9",
                                                            "author": "Burford_Brown-eye",
                                                            "score": 1,
                                                            "created_utc": 1653116437.0,
                                                            "response": "Fight the FUD perleflamme!!",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9fbvrc",
                                                                    "author": "Perleflamme",
                                                                    "score": 1,
                                                                    "created_utc": 1653117166.0,
                                                                    "response": "I'm not doing much, actually, apart from ensuring they talk more. It's crazy how easily they disprove themselves in only three comments.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}