{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upkvf5",
            "title": "the only way the Ethereum would ever accomplish mainstream status is through this merge. Energy consumption will go down by 99% meaning that Ethereum will finally be able to experience mass mainstream adoption.",
            "url": "https://www.reddit.com/r/ethereum/comments/upkvf5/the_only_way_the_ethereum_would_ever_accomplish/",
            "author": "pihip2",
            "created_utc": 1652545826.0,
            "score": 172,
            "num_comments": 113,
            "subreddit": "ethereum",
            "selftext": "Some people are really underestimating what this merge means exactly. A lot of people know that it will definitely drive consumption WAY lower, but not many realize that this means Ethereum is going one step forward towards attaining mainstream status.\n\nAside from the fact that retail companies are pushing all in for eco-friendliness, these companies can’t operate on Ethereum as long as it's PoW.\n\nOf course, we still need to wait for sharding for Ethereum to actually start showing its real efficiency, but there are already enough scaling solutions to compensate for that in my opinion.\n\nThese scaling solutions and L2s aren’t playing. Polygon alone has already partnered with so many mainstream traditional companies like Ernst & Young, Dolce & Gabbana, Twitter, Instagram and most importantly Stripe which is a BIG step for crypto as a whole considering Stripe is the 6th largest Fintech company in the world and the 5th most used payment app in the US.\n\nAnd the fact that this company is using Ethereum (even if it’s through an EVM chain like Polygon) insights a lot of hope that Ethereum is on the right path toward mainstream adoption.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8lkjgu",
                    "author": "Thin-Course-4054",
                    "score": 107,
                    "created_utc": 1652549792.0,
                    "response": "I honestly don't think energy consumption was/is the barrier against mass mainstream adoption",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lvcxr",
                            "author": "frank__costello",
                            "score": 12,
                            "created_utc": 1652554731.0,
                            "response": "The people who hate crypto & NFTs because of the \"energy consumption\" will just move on to another reason to hate them\n\nIt's just an excuse",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lw85h",
                                    "author": "FaceDeer",
                                    "score": 4,
                                    "created_utc": 1652555132.0,
                                    "response": "Some of htem, maybe. Others are genuine. And regardless, the other major PoW cryptocurrencies will continue to draw fire that Ethereum will no longer be receiving.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8lnkp3",
                            "author": "Dry-Hurry-7598",
                            "score": 38,
                            "created_utc": 1652551175.0,
                            "response": "Lol it’s more like wtf does eth do for the general public right now. But most off all developement of legitimate projects can’t commence whilst gas fees are this high",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ly8c6",
                                    "author": "Thin-Course-4054",
                                    "score": 9,
                                    "created_utc": 1652556075.0,
                                    "response": "lol kind of a good point. My best answer would be that Eth runs other popular layer 2 networks. If you like transacting with eth you should be using those instead of the L1 chain. I paid almost 200 to move 2k worth of eth yesterday 😅. I had no other option though cause i had to get it bridged off the terra network. RIP.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ltyjp",
                    "author": "Shaitan87",
                    "score": 7,
                    "created_utc": 1652554084.0,
                    "response": "It will solve some of the loudest fud at least, though I imagine the haters will just move on to a different aspect they don't like.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ltn8h",
                    "author": "OrigamiMax",
                    "score": 13,
                    "created_utc": 1652553938.0,
                    "response": "If you think energy consumption is what’s stopping the average person on the street from adopting ethereum, I’ve got a bridge right over here to sell you",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lc5z8",
                    "author": "homrqt",
                    "score": 29,
                    "created_utc": 1652545998.0,
                    "response": "And the gas fees? That has certainly hindered adoption as well.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8llrxg",
                            "author": "pyr0phelia",
                            "score": 10,
                            "created_utc": 1652550357.0,
                            "response": "POS will do very little, if anything, to reduce the gas fees.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8lcrn2",
                            "author": "pihip2",
                            "score": 29,
                            "created_utc": 1652546261.0,
                            "response": "I actually addressed that in the post...  \nAs I said, L2s are taking care of that plus sharding is on the way. It's a process",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ln7g4",
                                    "author": "Dry-Hurry-7598",
                                    "score": 3,
                                    "created_utc": 1652551003.0,
                                    "response": "Is on the way is a big understatement like a 7 year understatement",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8ld2nq",
                                    "author": "homrqt",
                                    "score": 8,
                                    "created_utc": 1652546400.0,
                                    "response": "Sorry, I meant that the gas fees will have to come down first. The energy efficiencies alone will not allow mass mainstream adoption.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ln4id",
                                            "author": "TenBillionDollHairs",
                                            "score": 5,
                                            "created_utc": 1652550965.0,
                                            "response": "Mainstream won't use L1. Mainstream will use L2, so even if L1 gas fees remain high (which they should because there's a lot of demand), they don't notice because they are only paying for their tiny share of the L1 fees. \n\nL1 will have high fees, but it will be processing exponentially greater volumes of business on those same fees. User fees will decrease, but you want L1 fees to be high so people run nodes and so people can't clog or attack the network.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8lv1mv",
                                            "author": "frank__costello",
                                            "score": 3,
                                            "created_utc": 1652554583.0,
                                            "response": "L1 gas fees will never come down, L2 is the future (and the present) for cheap transactions",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8lk98z",
                                            "author": "DavidKens",
                                            "score": 7,
                                            "created_utc": 1652549662.0,
                                            "response": "Why does L1 gas matter for L2s?\n\nIn a mass adoption scenario CEXes have liquidity on L2s",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8ldtf4",
                                            "author": "pihip2",
                                            "score": 7,
                                            "created_utc": 1652546726.0,
                                            "response": "Oh okay. yeah, I get you but as I said it's all a process and we're already on the right path. The merge is a necessary part",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8lon9u",
                            "author": "lostharbor",
                            "score": 3,
                            "created_utc": 1652551652.0,
                            "response": "layer 2 solves that",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8lgkg2",
                            "author": "OtherDetective",
                            "score": 6,
                            "created_utc": 1652547975.0,
                            "response": "They will go down slightly after merge and drop drastically after sharding.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8m0te1",
                    "author": "TrymWS",
                    "score": 5,
                    "created_utc": 1652557294.0,
                    "response": "Energy consumption is not the problem with eco-friendlyness, that’s just a marketing tactic and diversion from the real culprits, the fossil fuel industry burning coal and gas for electricity and heat. Oil for cars, etc.\n\nWe don’t demand fossil fuels, we demand energy and transportation. It can be clean, and we can use orders of magnitude more energy with clean energy.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upml2a",
            "title": "Can what happened to Luna, happen to Ethereum?",
            "url": "https://www.reddit.com/r/ethereum/comments/upml2a/can_what_happened_to_luna_happen_to_ethereum/",
            "author": "slotia92",
            "created_utc": 1652550844.0,
            "score": 7,
            "num_comments": 31,
            "subreddit": "ethereum",
            "selftext": "Ive never owned any Luna and I'm not exactly sure what happened with but on the Luna sub, the attempted suicide posts are rising.\n\nI've always considered UST a scan and have a bit more trust in USDC. Not sure if what happened to Luna was direct effect of something sketchy happening with UST.\n\nWhile I understand that the basic principle of crypto is to only invest what you can afford to lose, it is still horrifying, the thought of an investment being wiped out overnight.\n\nMy question and please ELI5 is, can this happen to Ethereum? And this may be a very complex answer but I'm trying to have a conversation.\n\nTIA.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8lvte4",
                    "author": "frank__costello",
                    "score": 30,
                    "created_utc": 1652554942.0,
                    "response": "No, not possible\n\nLuna was an L1 blockchain with an algo-stablecoin built in\n\nEthereum is a neutral blockchain. People can build algo-stablecoins on top, but it doesn't affect the blockchain itself\n\nAlso, the LUNA token was designed in a way that it would inflate if the price of UST dropped, which is what lead to the crazy hyperinflation that drove the token to $0.\n\nEther is predictably issues, unplanned inflation of ETH is not possible",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lwubn",
                    "author": "Silver-Contribution9",
                    "score": 9,
                    "created_utc": 1652555423.0,
                    "response": "If you mean “can ETH go to zero” the answer is 100% yes, but yea it would be a different root cause",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lw29l",
                    "author": "Vigilias",
                    "score": 3,
                    "created_utc": 1652555057.0,
                    "response": "Not quite. \n\nHowever this was a well thought out attack by one of the biggest investment firms in existence. \n\nIf they threw their weight at anything they could do some short term damage. Can they take Eth with them like LUNA, probably not.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uplzsw",
            "title": "dapp creator forum?",
            "url": "https://www.reddit.com/r/ethereum/comments/uplzsw/dapp_creator_forum/",
            "author": "Sagan-Man",
            "created_utc": 1652549058.0,
            "score": 3,
            "num_comments": 1,
            "subreddit": "ethereum",
            "selftext": "Hi, I'm a person who makes eth dapps.  \nBut, nobody here cares about or wants my self-promotion.  \n\n\nWanted to see if someone would point me to a community that wants to hear about the things eth dapp creators make. thanks!",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uppre5",
            "title": "Vitalik himself said that the goal of Ethereum isn’t million-dollar pictures of monkeys, it’s to accomplish meaningful things in the world.",
            "url": "https://www.reddit.com/r/ethereum/comments/uppre5/vitalik_himself_said_that_the_goal_of_ethereum/",
            "author": "DeliciousNectarine8",
            "created_utc": 1652560336.0,
            "score": 17,
            "num_comments": 4,
            "subreddit": "ethereum",
            "selftext": "I’m not against NFT art, after all its another integral part of the Ethereum ecosystem. However, I am against the HUGE amounts of resources that are being poured in the NFT market. Resources that will not result in anything of real utility or impact in the real world.\n\nVitalik’s vision is for Ethereum to be the portal which people will use to integrate themselves and their lifestyle into the digital world. His vision is for Ethereum to be able to solve real world problems and eventually, down the line, make decentralization the norm and end the tyranny of centralized authorities over our lives. I know this may sound a bit “poetic” right now but this is the real long term vision.\n\nThis is exactly why I love to see that there are indeed a select few projects that have been following this vision, a lot of which are DAOs which fits great with Vitalik's ideals. There are DAOs out there like BitDAO aiding this vision with more than $500 million ETH in their treasury being allocated toward expanding the DeFi space on Ethereum and improving its adoption rates. Crazy to think that a DAO is the 43rd largest ETH holder meaning that they truly do believe in the long term vision of Ethereum.\n\nHopefully we keep seeing more resources being allocated toward the utilitarian side of Ethereum cause this is the only way to prove that crypto will indeed solve everyday problems and make life all the better. All these billions of dollars combined can be put into much better use. But that's just my (and Vitalik's) personal opinion.",
            "stickied": false,
            "comments": []
        }
    ]
}