{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "url8b4",
            "title": "What's the APR for stake ETH?",
            "url": "https://www.reddit.com/r/ethereum/comments/url8b4/whats_the_apr_for_stake_eth/",
            "author": "mkiob",
            "created_utc": 1652790122.0,
            "score": 11,
            "num_comments": 23,
            "subreddit": "ethereum",
            "selftext": "\nI know currently it's possible to do staking using some third parties platforms or validator aggregators. Can anyone say what's the current APR for stake ETH and the expected APR after merge?\n\nAlso, will it be a stable and guaranteed APR? Has network usage and charged fees any influence on APR level?\n\nIf possible would like also to know how different is the staking APR of you have at least 32E and run a house by yourself. Is it require much technical knowledge to do that?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8xtc7f",
                    "author": "Maswasnos",
                    "score": 26,
                    "created_utc": 1652791054.0,
                    "response": "https://ethereum.org/en/staking/\n\n4.3% APR right now for a basic solo validator. \n\nAverage APR post-merge is really hard to guess since it's dependent on network traffic/congestion. Could be around 10% APR, but could also be less. If you're in a big pool I think 6-10% is likely for several months post-merge. \n\n> Also, will it be a stable and guaranteed APR? Has network usage and charged fees any influence on APR level?\n\nThere is a base \"guaranteed\" APR that will lower over time as more validators join the network. Then there is the APR from block tips, which is highly variable and will also get lower as more validators join the pool. Block tips will go up during periods of high congestion, mainly NFT mints. \n\n> If possible would like also to know how different is the staking APR of you have at least 32E and run a house by yourself. Is it require much technical knowledge to do that?\n\nSolo staking APR is 4.3% currently; pooled staking is 10-25% less than that due to the pool fees. It's not too technical, there are great guides on /r/ethstaker.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8y1bcb",
                            "author": "mkiob",
                            "score": 5,
                            "created_utc": 1652795049.0,
                            "response": "Thank you, very well explained.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yypfs",
                                    "author": "Sterlingz",
                                    "score": 1,
                                    "created_utc": 1652808970.0,
                                    "response": "Also to note - and this is absolutely key - staking on other L1s is a *net negative*.\n\nTake Cardano, for example. The staking returns are *purely* from printing new tokens. So if staking APR is 7%, that's actually 7% new tokens diluting existing holders. This goes for pretty much all L1s, aside from BNB, if I'm not mistaken.\n\nNow consider tax - assuming that applies to you, your returns are actually negative.\n\nToday, and definitely post-merge, staking returns come mostly from fees and blockchain usage, so holders aren't diluted into the ground.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8zcvbd",
                            "author": "Perleflamme",
                            "score": 3,
                            "created_utc": 1652814719.0,
                            "response": "The 10% will probably be very temporary. Validator fee will naturally decrease overtime, as it will be perceived as unnecessarily high. \n\nAnd if it doesn't, it will attract many more people to the staking activity and will decrease the reward anyway. Just like staking rewards when it started attracted so many people we're at more than 10% ETH staked and ~4% of reward.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xt7q8",
                    "author": "kristoforo22",
                    "score": 5,
                    "created_utc": 1652790986.0,
                    "response": "Currently it’s about 4% per 32 ETH stake. There is an inverse “yield curve”; the more validators, the lower the return. Post merge it’s supposed to go up significantly (I’ve seen 5-10% APR predictions, but don’t want to spread rumors; I don’t think any definitive statement on this has come out yet. As I understand it, this higher level of APR will be in effect in the immediate-term post-merge, but will also decline as more and more validators come online.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zd64a",
                            "author": "Perleflamme",
                            "score": 2,
                            "created_utc": 1652814840.0,
                            "response": "The nice perk is that such additional reward is supposed to be available even without unstaking, since it's the validator's fee paid by users requesting transactions. \n\nI guess staking will become pretty popular once people realize that they can already benefit from their stakes.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xwtq0",
                    "author": "NabyK8ta",
                    "score": 3,
                    "created_utc": 1652792866.0,
                    "response": "Here’s a spreadsheet with some good guesses on\n\nhttps://docs.google.com/spreadsheets/d/1vrK5sY5ooq-F8dcyRhmmAJ5YtgkvWKWP3OfGCZIYxSA/htmlview#gid=0",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8y8605",
                    "author": "ivgur",
                    "score": 1,
                    "created_utc": 1652798082.0,
                    "response": "around 4.5% now but its volatile due  to the amount staked.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yle91",
                            "author": "iamjide91",
                            "score": 1,
                            "created_utc": 1652803595.0,
                            "response": "Still cool IMO.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8z8glp",
                    "author": "MadeMan-uk",
                    "score": 1,
                    "created_utc": 1652812916.0,
                    "response": "Where will we be able to stake for 10% rewards after the merge?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z9lmd",
                    "author": "LiveDirtyEatClean",
                    "score": 1,
                    "created_utc": 1652813380.0,
                    "response": "4.9% post merge is posted to the website",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90jfpq",
                            "author": "mkiob",
                            "score": 1,
                            "created_utc": 1652833528.0,
                            "response": "Some people said here in the comments that it could be around 10% post merge.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}