{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uu8n91",
            "title": "Crypto veterans, let's give some good tips for newcomers when it comes to these crypto drops",
            "url": "https://www.reddit.com/r/ethereum/comments/uu8n91/crypto_veterans_lets_give_some_good_tips_for/",
            "author": "AlpsNeither",
            "created_utc": 1653083450.0,
            "score": 0,
            "num_comments": 11,
            "subreddit": "ethereum",
            "selftext": "Have you noticed how many people are concerned after the recent crypto drops, and I was puzzled as to why some people sold their Ethereum or Bitcoin? There are various reasons why this is a bad idea. How are you managing the issue as a whole?  \n\n\nI must admit that were actually several points where I considered quitting, especially when I learned I'd have all these troubles with high gas prices and sluggish transactions, which were so unpleasant at the start, I felt helpless, and I even considered spending more money on gas fees than on purchasing more Ethereum haha.  \n\n\nHow did you feel when you first dealt with this issue?  \n\n\nHowever, I didn't know anyone who was working with Ethereum at the time, so I couldn't get any solid advice, I was on my own. Thanks to several Reddit users who helped me a lot by introducing me to L2 platforms, I now use Metis and I must say that these L2 solutions are essential for dealing with gas expenses.  \n\n\nThis is why I'm writing this since most of the individuals who started selling Ethereum and are afraid of losing everything are probably new here. All of this will not continue. Shortly, we will have a merge, and things will be a lot smoother. When it comes to cryptocurrency investment, time and patience are everything.  \n\n\nGuys, keep in mind that we're talking about the second-largest crypto, that the majority of stablecoins are placed on Ethereum's blockchain, that Ethereum has the most developers working on its blockchain, and that Ethereum leads the NFT market, dApps, DAOs, and so on. So there's no reason to be concerned.  \n\n\nSo, veterans do you have any tips for newbies?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9e5diq",
                    "author": "zonesaplenty",
                    "score": 6,
                    "created_utc": 1653091053.0,
                    "response": "You will not be a millionaire tomorrow. Nor next week. 2026, however......",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dqpht",
                    "author": "seito935",
                    "score": 2,
                    "created_utc": 1653083776.0,
                    "response": "I can’t sell my eth if it’s staking 😎\nEdit: just wait it out, don’t panic it’s the easiest thing to do for your mind in this time",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9eeheo",
                    "author": "x2c3v4b5",
                    "score": 1,
                    "created_utc": 1653095925.0,
                    "response": "Buy BTC and ETH only. Never sell. Never time the market. Generally, buy as much as you, as often as you can, and be patient. 70/30 or whatever you like. Very easy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fvecb",
                            "author": "Vegas_42",
                            "score": 1,
                            "created_utc": 1653134205.0,
                            "response": "This is a solid advice. Time in the market beats timing the market. I agree. Nothing wrong with this strategy.\n\nBut I can't ignore the big picture, that's why I decided to swap 20% of my holdings to USDC and set limit orders all the way down to $24k and $1,400. This works as a hedge against the slow bleeding. Yes, in case of a huge pump I miss the gains for these 20%.\nBut I'm ok with this deal.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9fqbzg",
                    "author": "Adamn27",
                    "score": 1,
                    "created_utc": 1653130343.0,
                    "response": "It is hard to buy in the next shitcoin ponzi and make a 100x bagger. 99% of the time you will lose with that strategy. Buy real coins only, Bitcoin and Ethereum and be patient. It is not a sprint but a marathon.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9drpn6",
                    "author": "TheEdger60",
                    "score": -3,
                    "created_utc": 1653084243.0,
                    "response": "I sold 1/3 of my eth to raise cash. I'll buy back in at a much cheaper price. We are looking at March 2020 lows. You have to look at the much bigger picture. Watch bonds and DXY. Eth 1400 sometime in the n3xt month. Maybe much sooner if the slow motion crash accelerates. If you are not a trader. Best position right now - cash.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9e7usg",
                            "author": "RusticScentedMale",
                            "score": 3,
                            "created_utc": 1653092364.0,
                            "response": "Wait so you are telling people that if they are not traders, they should trade?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ebhww",
                            "author": "DrunKronos",
                            "score": 2,
                            "created_utc": 1653094310.0,
                            "response": "Source \"trust me bro\".",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}