{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwfwud",
            "title": "What's the strategy of the merge ?",
            "url": "https://www.reddit.com/r/ethereum/comments/uwfwud/whats_the_strategy_of_the_merge/",
            "author": "br4infreze",
            "created_utc": 1653357039.0,
            "score": 0,
            "num_comments": 8,
            "subreddit": "ethereum",
            "selftext": "As far as I know there will be a merge of difficulty bomb gradually making it harder to mine new blocks.\nThis will happend before the PoS merge ?\nWhat is the strategy here ? \nWon't there be a point in time where no one will be able to sign blocks, or at least slow down transaction time ?\n\nBtw, Vitalik also tweeted something about removing transaction from chain, should this raise some brows..?\n\nThanks !",
            "stickied": false,
            "comments": [
                {
                    "id": "i9s42mx",
                    "author": "edmundedgar",
                    "score": 5,
                    "created_utc": 1653375791.0,
                    "response": "With the difficulty bomb, before blocks get seriously slow, one of the following will happen:\n\n   * The merge is here, so no need to change the difficulty bomb, just do the merge\n   * The merge is close enough to schedule, so do a new release which removes the difficulty bomb and just put the scheduled merge into the software\n   * The merge could be a while, make a little new release that just postpones the difficulty bomb to a new date.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rkq7x",
                    "author": "Perleflamme",
                    "score": 4,
                    "created_utc": 1653362412.0,
                    "response": ">Btw, Vitalik also tweeted something about removing transaction from chain, should this raise some brows..?\n\nAny consensus can remove anything that has not already hit finality. It's just that PoS allows for a definite finality, while PoW allows for indefinite finality tied to an ever-increasing cost (which means you can safely assume that, beyond a very expensive cost, it is expected to be a somewhat definite finality).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v5jnh",
                    "author": "domotheus",
                    "score": 1,
                    "created_utc": 1653432314.0,
                    "response": "The difficulty bomb starts off slow but eventually grinds the whole chain to a halt if nothing gets done. But delaying the bomb is a one line change so that's the easiest hard fork ever.\n\nThe hope is to not have to delay the bomb and merge before the chain stops completely, with 20-25 second blocks being deemed acceptable, after which we hopefully merge and then there's no more difficulty bomb ever and blocks come in at exactly 12 seconds each after PoS",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}