{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut0jm7",
            "title": "Cloudflare to Support Ethereum by Launching Validator Nodes | CoinMarketCap",
            "url": "https://coinmarketcap.com/alexandria/article/cloudflare-to-support-ethereum-by-launching-validator-nodes",
            "author": "BlazingJava",
            "created_utc": 1652956839.0,
            "score": 214,
            "num_comments": 23,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i96rkhf",
                    "author": "GuessWhat_InTheButt",
                    "score": 6,
                    "created_utc": 1652957921.0,
                    "response": ">Today, we are excited to announce the start of our experiments for the next generation of web3 networks that are embracing Proof of Stake; beginning with Ethereum. Over the next few months, Cloudflare will launch, **and fully stake**, Ethereum validator nodes on the Cloudflare global network as the community approaches its transition from Proof of Work to Proof of Stake with “The Merge.” These nodes will serve as a testing ground for research on energy efficiency, consistency management, and network speed.\n\nSo they're going to stake themselves? This is not an offer to their customers?\n\nEdit: Recent discussion: https://www.reddit.com/r/ethereum/comments/ura484/cloudflare_is_experimenting_with_running_pos_nodes/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97y1qq",
                    "author": "BreakingIllusions",
                    "score": 5,
                    "created_utc": 1652978231.0,
                    "response": "Good guy Cloudflare.\n\nPlus the tools you can play with on a free account are awesome.\n\nI am not paid by Cloudflare, just a network nerd who loves what they're doing.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97z5b6",
                            "author": "elmosworld37",
                            "score": 4,
                            "created_utc": 1652978673.0,
                            "response": "You're a network nerd in a crypto sub so I gotta ask, doesn't the increasing centralization of network traffic through Cloudflare servers concern you?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i984pz2",
                                    "author": "BreakingIllusions",
                                    "score": 3,
                                    "created_utc": 1652980903.0,
                                    "response": "Do you mean network traffic generally, or crypto traffic/validators specifically?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i985fl1",
                                            "author": "elmosworld37",
                                            "score": 1,
                                            "created_utc": 1652981189.0,
                                            "response": "General network traffic, which might be off topic idk but decentralization is supposed to be a big deal around here",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i98h5kt",
                                                    "author": "Sorry_Attitude_",
                                                    "score": 2,
                                                    "created_utc": 1652985960.0,
                                                    "response": "It is decentralized and permisionless, youre not a moral guideline, anyone that wants to host it can host it\n\nChain wasnt made for you to decide who uses it and who doesnt",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i96szuj",
                    "author": "coinfeeds-bot",
                    "score": 19,
                    "created_utc": 1652958918.0,
                    "response": "tldr; Cloudflare has committed to helping research and experiment with the next generation of blockchains. It has not and will not run proof-of-work infrastructure on its network. Cloudflare announced its experimental Ethereum Gateway three years ago. It allows users to interact with the network without installing any additional software on their computers.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9895ms",
                    "author": "Either-Advantage",
                    "score": 2,
                    "created_utc": 1652982681.0,
                    "response": "I'm pretty sure this is going to be on a L2 like Polygon Hermez and not on Ethereum itself. I'd rather use Cloudflare over something like Google or AWS personally. I think they provide a good service so I'm interested.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98hi8u",
                            "author": "henkgaming",
                            "score": 2,
                            "created_utc": 1652986104.0,
                            "response": "They’re staking so that’s by definition main net",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i98husz",
                            "author": "domotheus",
                            "score": 1,
                            "created_utc": 1652986244.0,
                            "response": "Lol yet another (probably paid) polygon shill trying to work some way to talk about polygon in random conversations\n\nthat user history hella sus bro",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i988b1d",
                    "author": "BreakingIllusions",
                    "score": 1,
                    "created_utc": 1652982341.0,
                    "response": "Whether centralisation is an issue depends on the context.\n\nFor Ethereum validators, definitely a problem, but I don't see Cloudflare suggesting they're going to do anything that compromises security by spinning up millions of nodes. Centralisation of Ethereum nodes removes security from users and there's little they can do about it.\n\n\nIn contrast, no-one is forcing you to use Cloudflare for your network traffic. It's a free market, and a good product. If it starts being a bad product, it'll cost companies money in downtime, and they'll move elsewhere.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97brqp",
                    "author": "apexisalonelyplace",
                    "score": -11,
                    "created_utc": 1652968996.0,
                    "response": "So eth nodes on the cloud?\nThis is not good",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97dc0c",
                            "author": "T0Bii",
                            "score": 7,
                            "created_utc": 1652969685.0,
                            "response": "Did you read the article?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97fadn",
                                    "author": "apexisalonelyplace",
                                    "score": -10,
                                    "created_utc": 1652970532.0,
                                    "response": "Yes. They’re launching proof of stake nodes on their network which is cloud based. Did you read something I missed?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i97gq06",
                                            "author": "namtaru_x",
                                            "score": 12,
                                            "created_utc": 1652971149.0,
                                            "response": "Having validators in the cloud is not inherently a problem. Having a majority of validators in the SAME cloud is more of an issue.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i97mo9g",
                                            "author": "Wonderful_Background",
                                            "score": 3,
                                            "created_utc": 1652973639.0,
                                            "response": "Do you know that the cloud is just someone else’s computers?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i985y3f",
                                                    "author": "AmIHigh",
                                                    "score": 2,
                                                    "created_utc": 1652981397.0,
                                                    "response": "Don't forget the most important part.\n\nIt's connected the internet.  GASP!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i97ubki",
                                            "author": "T0Bii",
                                            "score": 3,
                                            "created_utc": 1652976739.0,
                                            "response": ">which is cloud based   \n\nThat's not inherently bad.  \n\nWhat would be bad is launching a service where other people can stake on their cloud. Which cloudflare doesn't do.  \n\nIf a business stakes in their own data center, that's totally fine but still is considered (private) cloud.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i97hseu",
                                            "author": "aclima",
                                            "score": 2,
                                            "created_utc": 1652971602.0,
                                            "response": "in the [full article](https://blog.cloudflare.com/next-gen-web3-network/) it says the following:\n\n> Over the next few months, Cloudflare will launch, and fully stake, Ethereum validator nodes on the Cloudflare global network as the community approaches its transition from Proof of Work to Proof of Stake with “The Merge.” These nodes will serve as a testing ground for research on energy efficiency, consistency management, and network speed.\n\n...\n\n> As part of our experiments Cloudflare has not and will not run our own Proof of Work infrastructure on our network.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}