{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ustwdv",
            "title": "Major players in the market have been buying up and holding ETH like never before. I’m not worried about the future of Ethereum one bit",
            "url": "https://www.reddit.com/r/ethereum/comments/ustwdv/major_players_in_the_market_have_been_buying_up/",
            "author": "DeliciousNectarine8",
            "created_utc": 1652929730.0,
            "score": 18,
            "num_comments": 20,
            "subreddit": "ethereum",
            "selftext": "Ethereum just went below 2k again which is never a good thing. It’s far away from the near 5k levels it was at 6 months ago and I’m seeing some people a bit concerned and other quite frankly panicking.\n\nAnd while its normal for people to be frustrated at times like these (after all no one likes to lose money), I think that Ethereum investors and fanatics in particular shouldn’t be that concerned.\n\nAside from the price action being relatively much better than other alts, Ethereum is probably the most reliable out of all chains and will always get the job done at the end of the day.\n\nThis is why I’m not too surprised seeing so many whales buying up ETH like its candy. Look at Etherscan and see the top 50 accounts and how much they’re stacking up. BitDAO alone has been adding more than 360 ETH on a DAILY basis and has already accumulated more than $500 million worth of ETH in its treasury.\n\nSeeing all these whales and legitimate projects are stacking up ETH at this ever increasing rate gives me solace and bolsters by belief in Ethereum more and more. This is only a phase and we should be back on track as soon as the market goes green again.",
            "stickied": false,
            "comments": [
                {
                    "id": "i95rnxr",
                    "author": "Either_Sign651",
                    "score": 8,
                    "created_utc": 1652930590.0,
                    "response": "Always follow the whales.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95uvuz",
                            "author": "AESTHTK",
                            "score": 1,
                            "created_utc": 1652932347.0,
                            "response": "👀\n\nhttp://podcast.banklesshq.com/betting-the-fund-on-the-merge-hal-press-north-rock-digital",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95uuhe",
                    "author": "AESTHTK",
                    "score": 2,
                    "created_utc": 1652932325.0,
                    "response": "The merge will do very little for users or scaling (use Optimism and Arbitrum today!), but it will do a whole lot for tokenomics.\n\nThis is a must listen:\n\nhttp://podcast.banklesshq.com/betting-the-fund-on-the-merge-hal-press-north-rock-digital\n\nEverybody on the sub should understand what’s happening here. Invest the 90 minutes to listen to this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95sr99",
                    "author": "StackinAndRackin",
                    "score": 2,
                    "created_utc": 1652931170.0,
                    "response": "I want it to go down so I can accumulate.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95t8t2",
                            "author": "DeliciousNectarine8",
                            "score": 1,
                            "created_utc": 1652931430.0,
                            "response": "Make DCA your best friend. Its the most tried and and tested way to make consistent profits so far.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i95veto",
                            "author": "mrdeezy",
                            "score": 1,
                            "created_utc": 1652932649.0,
                            "response": "People who say this are always full of shit",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95sakc",
                    "author": "Perleflamme",
                    "score": 1,
                    "created_utc": 1652930925.0,
                    "response": ">And while its normal for people to be frustrated at times like these (after all no one likes to lose money)\n\nIt's not normal, because no one lost money, except people who leveraged and got liquidated. Apart from them, no one lost money. So, being frustrated isn't normal. To lose money, you'd need to sell low. If anyone sold low, it's their own decision. Being frustrated for this means there should be some internal discussion within that person about whether or not they were agreeing with the fact of selling low, because clearly no one forced such person to sell low.\n\nPeople should stop reacting to pump & dump schemes and similar temporary volatility. Otherwise, they're bound to lose. It's hard to time the market. Really hard. And if you understand the tech, you'd easily realize it's not even needed to profit from it, really.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95t37t",
                            "author": "DeliciousNectarine8",
                            "score": 2,
                            "created_utc": 1652931347.0,
                            "response": "It's not that easy to stay calm and composed when you bought near ATH and are down by more than 50%\n\nStill, the fundamentals are still there and will always be there. Not worried one bit.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95v1qz",
                                    "author": "Perleflamme",
                                    "score": 1,
                                    "created_utc": 1652932442.0,
                                    "response": "It's way better than ensuring you're selling at 50%. The \"hodl\" term comes from this, after all: the sense of urgency or distress is transcribed into a letter inversion. \n\nWithout liquidation problems, people who aren't calm or at least hodling either invested emergency funds or don't understand the fundamentals.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i95u7yl",
                    "author": "PNW-Mastermind",
                    "score": 1,
                    "created_utc": 1652931970.0,
                    "response": "I’m bullish on ETH long term & I won’t sell my ETH for shit but the whole reason for the big red shift is because there’s more major players exiting their positions than BUYING & HODLiNG Let’s call a spade a spade here please.. We don’t move markets, not even close whales do & there will be some small amounts of Green Day’s here and there & if we’re fortunate we’ll begin trading sideways but don’t be surprised if more violent down swings come through winter. If you gotta sell to pay rent well then sell but DCA your way back in, there will be an upward bounce but trying to time it is a waste of TIME itself & remember the whole purpose of capital gains is for the value of time. Let’s keep it simple here come on",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95v1xf",
                    "author": "Efficient_Exit_2106",
                    "score": 1,
                    "created_utc": 1652932445.0,
                    "response": "I'm not worried about the future of yahoo one bit!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95s0np",
                    "author": "SAGA_EJ1",
                    "score": -2,
                    "created_utc": 1652930778.0,
                    "response": "Lol it's going down to $700s.. I'm bout to unstake and go to BTC.. even VITALIK agrees.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95srsx",
                            "author": "DeliciousNectarine8",
                            "score": 1,
                            "created_utc": 1652931178.0,
                            "response": "source? (trust me bro I do TA)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95toj5",
                                    "author": "SAGA_EJ1",
                                    "score": 0,
                                    "created_utc": 1652931670.0,
                                    "response": "https://twitter.com/AltstreetBet?t=5q3fmJjb3zQhbpxvax5Oyg&s=09",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i95u6gj",
                                            "author": "DeliciousNectarine8",
                                            "score": 3,
                                            "created_utc": 1652931946.0,
                                            "response": "Everyone, sell all your ETH. Some crypto influencer on twitter called Goblinstreet Bets said so",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i95ugx0",
                                                    "author": "SAGA_EJ1",
                                                    "score": -1,
                                                    "created_utc": 1652932111.0,
                                                    "response": "Check his stats. . He does all crypto. He doesn't shill.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i95urvs",
                                                            "author": "DeliciousNectarine8",
                                                            "score": 1,
                                                            "created_utc": 1652932283.0,
                                                            "response": "Plot twist: You're him",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i95v2fn",
                                                                    "author": "SAGA_EJ1",
                                                                    "score": 1,
                                                                    "created_utc": 1652932453.0,
                                                                    "response": "Was just trying to help.. no worries brother. Ima unstake and go BTC.. AND DCA. I'm done with ALTS . Had my fill the last 2 years.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i95tw47",
                                            "author": "No_Travel6306",
                                            "score": 2,
                                            "created_utc": 1652931785.0,
                                            "response": "This is your source ? Yea, no.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}