{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0pqpd",
            "title": "What’s the end game of ETH?",
            "url": "https://www.reddit.com/r/ethereum/comments/v0pqpd/whats_the_end_game_of_eth/",
            "author": "yolodogewtf",
            "created_utc": 1653876222.0,
            "score": 217,
            "num_comments": 254,
            "subreddit": "ethereum",
            "selftext": "To be a currency used in everyday transactions across  the globe?  \n\nSeems that’s not at all the trajectory of ETH, more niche stuff like smart contracts (defi,nfts, stablecoins) \n\nBTC seems a lot better for something like a digital version of a currency like the usd/gold \n\nUSD/gold has no analogy of smart contracts or anything.\n\nIf the end game is not a currency for day to day stuff, what is the end game?  Please don’t say web3, I have yet to see a web3 app with more than 1k users(exaggerating but you get the idea…)opensea does not count since it’s a niche collectibles website not some new version of email, social media etc… I am incredibly skeptical of any “sprinkle crypto to social media projects/companies”…the average joe could give half a shit about owning their own data",
            "stickied": false,
            "comments": [
                {
                    "id": "iahzw1e",
                    "author": "domotheus",
                    "score": 101,
                    "created_utc": 1653878040.0,
                    "response": "The point of Ethereum as the \"world computer\" is that anyone can use it to do whatever they want, and no one can prevent anyone from using it. But by itself, it doesn't really enforce an end goal or specific use-cases. That's up to people/communities/companies/countries to decide what they want to do with it.\n\n>To be a currency used in everyday transactions across the globe? \n\nNot really. Ether-the-currency's \"true\" use-cases are to secure Ethereum-the-network, and to be the currency you use to pay for gas fees when you use the network. Of course it's still a scarce asset, if you want to use it as money or collateral or whatever if you want but that's entirely up to you.\n\n>more niche stuff like smart contracts (defi,nfts, stablecoins) \n\nThese things are niche today, but they're just a subset of what's possible with turing complete smart contracts (which is pretty much infinitely many things). If you can imagine it, you can code it. Including non-financial use-cases which will continue emerging as computation capacity scales.\n\nTo me it's pretty cool that you can have truly open-sources apps where the back-end always runs the same code as-is that you can audit yourself. Sure, the average joe doesn't give a shit about that, but it's not much different from how I can install Linux and reap the benefits of an open source OS without necessarily having to audit every line myself, because if something funky's going on then it's likely someone somewhere will have caught it. Compared to proprietary black box stuff where you're at the mercy of whatever central authority running code they claim to be running, collecting all the data they can on you, etc. But overall the fact that you *can* audit everything yourself is a good reason to trust it (that's pretty much what *weak subjectivity* is all about)\n\n>USD/gold has no analogy of smart contracts or anything.\n\nThe whole financial system is the analogy. You can have whole companies or nations using smart contract to trustlessly settle stuff with each other, being sure everything will always runs the same way and cutting a lot of inefficiencies from human error, having to verify everything, suing each other when someone doesn't hold up their contractual obligations, etc.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajf108",
                            "author": "Soggy_Stargazer",
                            "score": 4,
                            "created_utc": 1653914887.0,
                            "response": "Holy fucking shit.   A voice of reason in the darkness. \nSo many people have forgotten the original ethereum faq where they themselves stated in no uncertain terms that eth was not a currency but a token to pay for compute. \n\nI have been saying for years that the crypto economy will be a complex weaving of chains together to bring new capabilities into existence with a smart contracts/computing platform like Ethereum as the engine powering it. \n\nImagine an autonomous data center, fueled by crypto, managed by AI/ML, driven by smart contracts.  Market analysis set prices, internal algorithms define and manage networks and hardware maintenance activities and digital assistants managing service calls and interacting with vendors.  I will admit, not a wholly original idea on my part.  Inspired by things like RPO and Demon by Daniel Suarez.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iai0fyf",
                            "author": "yolodogewtf",
                            "score": 25,
                            "created_utc": 1653878324.0,
                            "response": "Cool, this makes sense.  \n\nToo many people, both in this sub and the BTC sub think they are competing with each other…they really aren’t. \n\nBut the general cryptocurrency sub is all shitcoin casino talk \n\nWish there was a good “BTC and Eth are cool but different, and we don’t care about dumb doggy coins and shit” sub",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iai1rfo",
                                    "author": "Oxidative",
                                    "score": 30,
                                    "created_utc": 1653878987.0,
                                    "response": "Yeah that place exists and it's called r/ethfinance. A lot of us moved there over the last few years to avoid all the btc/eth maximalism prevalent in other subs. We tend to have a much less 'zero-sum-game' mentality and think that many chains will have their place heading into the future.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iai1tag",
                                            "author": "yolodogewtf",
                                            "score": 5,
                                            "created_utc": 1653879013.0,
                                            "response": "Niiiice! Thanks",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iai72yf",
                                                    "author": "sammyhats",
                                                    "score": 10,
                                                    "created_utc": 1653881696.0,
                                                    "response": "Yeah I can vouch for r/ethfinance being great for high quality discussions. Lots of smart people over there. Check out the daily.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaix2ba",
                                                            "author": "crydud",
                                                            "score": 1,
                                                            "created_utc": 1653900846.0,
                                                            "response": "I can confirm. Definitely the best cryptocurrency subreddit!",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iaigxfs",
                                    "author": "MattKozFF",
                                    "score": 1,
                                    "created_utc": 1653887671.0,
                                    "response": "There will be other smart contact platforms competing with Eth, likely in a trade off between security, scalability, and speed.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaiwsnn",
                                            "author": "AESTHTK",
                                            "score": 2,
                                            "created_utc": 1653900600.0,
                                            "response": "Yep, but *competing with Ethereum Layer 2s\n\nEthereum is becoming a settlement chain, layer 2 will be the user layer.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iak23y0",
                                                    "author": "MattKozFF",
                                                    "score": 1,
                                                    "created_utc": 1653926286.0,
                                                    "response": "No I mean their will be competing settlement layers and all of the world will NOT run on Ethereum",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iaj64kd",
                                    "author": "Exotic_Natural_4682",
                                    "score": 0,
                                    "created_utc": 1653908827.0,
                                    "response": "They are competing\n\nWhy? Because ETH does everything BTC does, but better",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iajf373",
                                            "author": "yolodogewtf",
                                            "score": 1,
                                            "created_utc": 1653914923.0,
                                            "response": "Like have a cap on the supply??? Nope!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iajtzq3",
                                                    "author": "sluttyseinfeld",
                                                    "score": 1,
                                                    "created_utc": 1653922592.0,
                                                    "response": "ETH will be deflationary following the merge",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iai241x",
                    "author": "FaceDeer",
                    "score": 29,
                    "created_utc": 1653879162.0,
                    "response": "Smart contracts aren't \"niche\", they're fundamental.\n\nWith smart contracts you can make as many day-to-day currencies as you need, with whatever characteristics you need. There doesn't have to be just one be-all and end-all currency. Just look at fiat currencies, there's hundreds of them.\n\nYou can also make all sorts of other things that aren't day-to-day currencies. DeFi, prediction markets, ENS, file hosting, silly monkey jpegs, and on and on and on. Things that haven't been thought of yet. Ethereum is for all of that, it's a generalized infrastructure.\n\nThe \"end goal\" is just to get better and better at doing this stuff.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iai2kvk",
                            "author": "yolodogewtf",
                            "score": 7,
                            "created_utc": 1653879403.0,
                            "response": "Cool, realizing this more now.  \n\nVery helpful discussion in this post !",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iai42ei",
                                    "author": "FaceDeer",
                                    "score": 10,
                                    "created_utc": 1653880177.0,
                                    "response": "No problem. I take it you were approaching Ethereum with the assumption that it was all about Ether, when in fact Ether is just a tool that Ethereum makes use of to accomplish its real goal.\n\nThe purpose of a car is not to make gasoline expensive. Cars take you places, the gasoline is just there to make it function.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaig2dn",
                                            "author": "hazed-and-dazed",
                                            "score": 4,
                                            "created_utc": 1653887084.0,
                                            "response": "Car and gas is good analogy. \n\nAlso gas on the ethereum network helps solve the Tragedy of the Commons where unrestricted access to a resource (the ethereum network in this case) is detrimental to everyone",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaigm61",
                                                    "author": "Perleflamme",
                                                    "score": 2,
                                                    "created_utc": 1653887458.0,
                                                    "response": "I agree with both points.\n\nIt's sad it can't be used for many other commons, though, as the specific of this common good is pretty rare: any transaction execution is the same as any other.\n\nYou can't have this property in the physical world: you always have difference between different physical entities. And service always is different anyway.\n\nI guess the only way to have some generic gas resource would be to have platforms of scarce instruction executions and such scarcity is handled by a generic gas resource. I'm yet to be able to find another use. It would be wonderful.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iahz5h7",
                    "author": "EmperorCip",
                    "score": 313,
                    "created_utc": 1653877654.0,
                    "response": "The \"end game\" is to be the world's super computer. It's open source software. You can technically build whatever your imagination leads you to on it. NFTs as a store for property rights. Defi for loans and deposits. Crypto gaming as a way for fans to get a say in videogame decision making. These are just the current tangible possibilities. They will be expanded upon in time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iai01ym",
                            "author": "yolodogewtf",
                            "score": 78,
                            "created_utc": 1653878123.0,
                            "response": "So basically all the stuff it does today, but more mature versions of it \n\nI totally believe that!  I like that you’re not saying “will be used to buy groceries or other everyday items”.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iai0z8c",
                                    "author": "3141666",
                                    "score": 45,
                                    "created_utc": 1653878594.0,
                                    "response": "> buy groceries \n\nWell, some people insist in getting haircuts with ETH but I feel like that's not what it was intended for.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iai6ni0",
                                            "author": "Tangerine2016",
                                            "score": 91,
                                            "created_utc": 1653881469.0,
                                            "response": "I got a haircut with ETH but not the kind thst involves a barber",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaim1t5",
                                                    "author": "sashiimi688",
                                                    "score": 12,
                                                    "created_utc": 1653891387.0,
                                                    "response": "A double-digit % haircut? 😌",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iairtdw",
                                            "author": "T4mvv1lc0xx",
                                            "score": 8,
                                            "created_utc": 1653896127.0,
                                            "response": "Gas fees will make any haircut ridiculously expensive",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaiwiqi",
                                                    "author": "lavastorm",
                                                    "score": 3,
                                                    "created_utc": 1653900352.0,
                                                    "response": "https://l2fees.info getting cheaper all the time with rollups.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iai1xcf",
                                            "author": "EmperorCip",
                                            "score": 4,
                                            "created_utc": 1653879069.0,
                                            "response": "It's more like a quirk. People like showing off.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iajgenu",
                                            "author": "epiGR",
                                            "score": 2,
                                            "created_utc": 1653915685.0,
                                            "response": "Nothing wrong with that if you are willing to pay the fees. L2s though, that’s definitely a valid way to pay for daily things.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iaigbm3",
                                            "author": "syfus",
                                            "score": 3,
                                            "created_utc": 1653887258.0,
                                            "response": "Na. I use USDC to pay for haircuts ;p",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iaitpeu",
                                    "author": "kybernetikos",
                                    "score": 9,
                                    "created_utc": 1653897798.0,
                                    "response": "I'm currently using zksync as an L2, and it's definitely viable for purchasing groceries and everyday items.  Running stablecoins, fast and cheap transactions. If your transaction is more than about 20 dollars, the fees are less than credit card processors charge.  And there's a great roadmap for the future too - even cheaper transactions as the ethereum network upgrades and full arbitrary smart contract support as zksync2 comes to mainnet.\n\nUsage as a currency isn't the guiding aim of ethereum, but ability to be used to create tokens that can be daily use currencies is part of the aim.\n\nI think ultimately ethereum (or some other smart contract chain that gets critical mass of ecosystem) will win too.  There's no point in not having whatever you use to pay your daily bills tokenised on the smart contract platform with all the financial services you want to access.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaiwor9",
                                            "author": "AESTHTK",
                                            "score": 4,
                                            "created_utc": 1653900505.0,
                                            "response": "Argent is excellent. Everybody should try it out.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iajhn0x",
                                                    "author": "angrydeanerino",
                                                    "score": 2,
                                                    "created_utc": 1653916383.0,
                                                    "response": "Specially now that fees are super low so you can create the wallet which costs some gas",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iaiio7s",
                                    "author": "jet2686",
                                    "score": 5,
                                    "created_utc": 1653888880.0,
                                    "response": "The way I see it is that Ethereum the smart contract layer. The imagination is the limit here, as the logic is built into the contract so it can do and trigger *anything*.\n\nThat said, ETH is the \"gas\". This so to speak does make it a sort of currency/asset. In order to interact with the smart contract that exists on the Ethereum blockchain, you *must* use ETH.\n\nA lot of people don't grok that ETH and Ethereum are 2 different parts of a system.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iaj82pd",
                                    "author": "TotalRepost",
                                    "score": 4,
                                    "created_utc": 1653910315.0,
                                    "response": "It’s great for diets. Last year I was eating way too much red meat and now I’m just eating ramen.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iajgv8g",
                                            "author": "yolodogewtf",
                                            "score": 1,
                                            "created_utc": 1653915944.0,
                                            "response": "😄",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iaj7blb",
                                    "author": "Lets_go_ride_bikes",
                                    "score": 3,
                                    "created_utc": 1653909748.0,
                                    "response": "I think it’s to be the “internet of value”. I don’t understand why web 3 is so bad, I feel like it’s branding? Something that can do whatever the internet can (get a mortgage, trade securities, on an exchange, reserve a table at a restaurant, buy music…) but with ownership tied into it. Which will also enable tons of new ideas that haven’t been thought of yet. It’s definitely the “world computer” but that only makes sense if it connects people together to do exchanges of value. The today internet exchanges information which has been transformative. This will be transformative too. I guess does that make the web 3 thesis too narrow?\n\nI GENUINELY want to ask the bitcoin community the same thing. I know it’s “bitcoin is the greatest store of value asset of all time” and even if we assume that’s a true statement, do they think that it will become the world reserve currency? Like nation states are gonna be ok with random Crypto Bros who were early have more wealth than an entire trading block? Like really? I am not anti bitcoin but really want to understand this! I feel like I grasp the Ethereum endgame more",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iajfzrn",
                                            "author": "yolodogewtf",
                                            "score": 1,
                                            "created_utc": 1653915455.0,
                                            "response": "I do think BTC will be held by many countries to diversify their balance sheets \n\nI don’t necessarily think it’ll replace all fiat",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iaicmg1",
                                    "author": "plaenar",
                                    "score": 17,
                                    "created_utc": 1653884883.0,
                                    "response": "You will buy groceries with fiat on your credit card but it gets settled on Ethereum or an L2 without you knowing about it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iain863",
                                            "author": "professorswamp",
                                            "score": 2,
                                            "created_utc": 1653892316.0,
                                            "response": "not fiat, a stablecoin eth token",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iairzbf",
                                                    "author": "majorpickle01",
                                                    "score": 7,
                                                    "created_utc": 1653896273.0,
                                                    "response": "A stablecoin is in essence fiat currency one step removed. It's basically the equivalent to a voucher",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaiwopf",
                                                            "author": "lavastorm",
                                                            "score": 2,
                                                            "created_utc": 1653900504.0,
                                                            "response": "https://www.bitcoininsider.org/article/105628/stablecoin-rai-launches-pure-decentralized-alternative-defi ?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iaiznap",
                                                                    "author": "majorpickle01",
                                                                    "score": 1,
                                                                    "created_utc": 1653903207.0,
                                                                    "response": "another step removed, but ultimately it's going to be redeemed into USD or local currency for purchasing - unless decentralized currencies completely overtake and dominate national currencies they are essentially less easy to use limiting forms of money. I'm not too sure nation states will willing give up a nationally regulated currency for internal markets. international markets? sure",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "iaizsro",
                                                            "author": "professorswamp",
                                                            "score": 0,
                                                            "created_utc": 1653903346.0,
                                                            "response": "You are assuming the stablecoin is pegged to fiat",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "iaivs3x",
                                                    "author": "abzzdev",
                                                    "score": 1,
                                                    "created_utc": 1653899682.0,
                                                    "response": "A fiat stablecoin XD",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "iaizdf4",
                                                    "author": "Justin534",
                                                    "score": 1,
                                                    "created_utc": 1653902952.0,
                                                    "response": "A stablecoin eth token? You mean dai?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaizux5",
                                                            "author": "professorswamp",
                                                            "score": 1,
                                                            "created_utc": 1653903403.0,
                                                            "response": "something like that but with a different stability mechanism, not pegged to fiat",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iaik0zy",
                                    "author": "Sharkytrs",
                                    "score": 2,
                                    "created_utc": 1653889841.0,
                                    "response": "since crypto is \"programmable money\" you'll find once the scene matures there will be a currency for specific tasks.\n\nIm fairly sure the entire scene will not be decentralized, its just the base layers that will be, like BTC to store value, and ETH to use the giant cloud computer.\n\nthe end point on the coin to pay your rent will most likely be centralized though",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iai5pai",
                                    "author": "sammyhats",
                                    "score": 4,
                                    "created_utc": 1653880970.0,
                                    "response": "Who’s saying that eth will be used to buy groceries?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iai1u0b",
                                    "author": "EmperorCip",
                                    "score": -4,
                                    "created_utc": 1653879023.0,
                                    "response": "Of course not! It is an investment tool, after all. And it's also deflationary. You don't pay for consumer goods with hard money. That'd be just idiotic.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaihrvt",
                                            "author": "dynamicallysteadfast",
                                            "score": 4,
                                            "created_utc": 1653888245.0,
                                            "response": "This way of thinking really annoys me.\n\nLike you're supposed to have an endless supply of \"bad money\" to use as actual money, and the hard money is never to be spent.\n\nWhy do you have any bad money, you should have swapped it all for good money. Loans? Then why not take a max-loan and buy more hard money with it?   \n\nI changed all my \"bad\" money for good money years ago, and spend it when I need to buy things.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iaj1uwh",
                                    "author": "Cruxiaz",
                                    "score": 1,
                                    "created_utc": 1653905207.0,
                                    "response": "Everyday items would be stuff for a layer2 imo. And multiple can coexist.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iajeylq",
                                    "author": "MothsAflame",
                                    "score": 1,
                                    "created_utc": 1653914847.0,
                                    "response": "It's not hard or crazy to imagine charging a pegged amount and auto-converting through a pool from whatever currencies they accept to their preferred stablecoin.\n\nGrocery store LPs anyone?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iajsv3m",
                                    "author": "sluttyseinfeld",
                                    "score": 1,
                                    "created_utc": 1653922065.0,
                                    "response": "Stablecoins are the only thing that have a chance at being used as actual money. BTC will never be a currency it is too volatile and people only hold it because they think it will increase in value.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iaipjii",
                            "author": "freistil90",
                            "score": 5,
                            "created_utc": 1653894202.0,
                            "response": "I’ve thought about this initial use case for quite a bit the last few weeks. Has ETH actually any chance of achieving this or is this out of the window like BTC being a replacement of money? Every time you read “ETH is muchhhh to expensive to achieve this and it’s hard to actually pull this off with its architecture” you read something like “yeah but what about L2s and so on” - yes. I get that they exist and what they do. But doesn’t that implicitly underline that ETH -can’t- be used as a practical distributed computer and requires god knows how many additional layers and helpers to achieve this that in the end compromise a lot of the claims that Ethereum makes, like being fully decentralised and neutral (which ETH is but then many L2s aren’t and if for anything practical on ETH you have to involve subpar other solutions then…). If that’s the endgame for ETH, then it’s seriously off-target.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaj61pg",
                                    "author": "cryptobarf",
                                    "score": 4,
                                    "created_utc": 1653908763.0,
                                    "response": "I think it does have a very good shot. Right now it’s all about ‘the merge’ and so on, but that isn’t the endgame for eth. Once the merge is completed, there’s another phase require to enable withdrawals for those who have staked, and then it moves to sharding. I haven’t checked in the last 6 months or so, but IIRC sharding is the key phase that would lower gas while massively increasing eth’s processing power. I also believe that Vitalik sees L2/rollups as essential short term, but less required as the eth network continues to improve. \n\nSo much time and energy is going into the switch to POS, when that phase is completed I think we’ll see more innovation, and faster",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaj7cgk",
                                            "author": "hulkklogan",
                                            "score": 4,
                                            "created_utc": 1653909766.0,
                                            "response": "Part right, part wrong.\n\nLayer 2s for Ethereum are here to stay.  Sharding is being engineered to maximize for rollups, *not* every day users.  The roadmap, after merge, withdrawals, and sharding, is mostly about reducing state bloat so Ethereum nodes can be lighter and lighter.\n\nThe argument is that no decentralized blockchain will ever be able to handle the world's traffic without adding modularity.  All L1s will likely work with L2 chains at some point, or they will have their own scaling solutions (example: Avalanche subnets).  Even then they may need L2s",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iaj94m3",
                                            "author": "freistil90",
                                            "score": 1,
                                            "created_utc": 1653911080.0,
                                            "response": "But at the same time, Solidity doesn’t even process floating point numbers yet, how can one talk about its potential to be a supercomputer yet? The insane amount of effort that went into efficient FOPS with SIMD, MIMD etc, that’s all not even remotely a topic on Ethereum. It’s essentially impossible to do any type of scientific computing (the by far largest use case for supercomputers) on it. While I get the appeal, calling it a “supercomputer” already is a bit misleading. It might become one in 20-30 years.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iai2dcg",
                            "author": "tendiesholder",
                            "score": 11,
                            "created_utc": 1653879297.0,
                            "response": "I like Ethereum because it's an insane combination of mass adoption and general purpose.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iainfr6",
                            "author": "FadedPoster",
                            "score": 3,
                            "created_utc": 1653892484.0,
                            "response": "To add another specific example onto this, the stock market will most likely be rebuilt on top of Ethereum. It’s a no brainer because of the amount of naked stocks that are traded. You can’t do that on blockchain.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iajez6v",
                                    "author": "alphamini",
                                    "score": 5,
                                    "created_utc": 1653914857.0,
                                    "response": ">You can’t do that on blockchain.\n\nIsn't that a perfect example of why they *wouldn't* rebuild it on the blockchain then? Or maybe you have a lot more faith in the integrity of the ultra-wealthy than I do.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iajhsdx",
                                            "author": "FadedPoster",
                                            "score": -2,
                                            "created_utc": 1653916466.0,
                                            "response": "Maybe. I would hope that the demand would force that change",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaji5oj",
                                                    "author": "alphamini",
                                                    "score": 3,
                                                    "created_utc": 1653916674.0,
                                                    "response": "Don't get me wrong - I think the technology is suited for it, but I think saying it will \"most likely\" happen implies that things that make sense normally happen. I disagree there.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iajxd02",
                            "author": "FlipDetector",
                            "score": 1,
                            "created_utc": 1653924147.0,
                            "response": "not a supercomputer but a state machine. the resource is not for computation (thats where its screwed) but to provision compute resources as needed and wrap up when not needed leading to perfect efficiency.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iai7fdv",
                            "author": "WholeGalaxyOfUppers",
                            "score": -1,
                            "created_utc": 1653881878.0,
                            "response": "AGI",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iai4f3i",
                            "author": "shib_army",
                            "score": 0,
                            "created_utc": 1653880348.0,
                            "response": "Like in matrix movie?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iai0rno",
                    "author": "jmh300",
                    "score": 6,
                    "created_utc": 1653878485.0,
                    "response": "Like VB recently said... For anything that needs to address the double spending problem in a decentralized way. For all the rest you've got master... I mean legacy, web2 or whatever",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iai3r9y",
                    "author": "Fheredin",
                    "score": 7,
                    "created_utc": 1653880015.0,
                    "response": "The endgame for Ethereum is to be the backbone of the web. By that, I mean that it won't literally eat all other coins and platforms, but that the most important value transactions will use it for security, the governance operations of many platforms will rely on it, and that most web platforms will rely on an L2 built on or another blockchain talking to Ethereum for daily use.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iai108f",
                    "author": "icecube404",
                    "score": 15,
                    "created_utc": 1653878608.0,
                    "response": "Personally I think that eventually the entire defi ecosystem will settle value on Ethereum.\n\nIn traditional financing, banks transact with each other throughout the day everytime you buy something with a credit card or send or receive money. They don't actually send or receive the money every time we make a transaction - this would be too cumbersome. They make notes of credits and debits and change the numbers in their bank accounts. They send these lists of credits and debits through the automated clearing houses. This is like an L2 rollup. \n\nThe federal reserve then takes the batches of credits and debits three times a day, and settles them by debiting and crediting actual money to different banks. \n\nI think Ethereum will eventually be a decentralized final settlement layer, where different protocols and chains meet to settle their debts. Other chains and protocols will probably interface with each other directly and create ledgers and records of credits and debits each is owed - but when they both tally everything up and it comes time to actually transfer the money, I think it will go through Ethereum.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaimsxe",
                            "author": "sashiimi688",
                            "score": 2,
                            "created_utc": 1653891973.0,
                            "response": "Interbank transacting is a pain in the ass. Can’t wait for the day when banks use L2 for transactions",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iahyo2a",
                    "author": "geman777",
                    "score": 6,
                    "created_utc": 1653877407.0,
                    "response": "Why not a currency for day to day stuff. L2 is basically just getting rolled out, it will be cheaper for venders to take a l2 transaction than pay the credit card %. This is not even years away, its basically ready now, just is new and needs to gain some traction.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iahyuze",
                            "author": "yolodogewtf",
                            "score": 1,
                            "created_utc": 1653877504.0,
                            "response": "Same with BTC and Lightning too \n\nI just see a lot less traction for payments than BTC (no atms, a lot more places in the world accept BTC for payments than ETH, the only exceptions are for things like NFTs, which are niche examples)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iai62w2",
                                    "author": "BuyETHorDAI",
                                    "score": 5,
                                    "created_utc": 1653881167.0,
                                    "response": "Speculative crypto assets like BTC or ETH shouldnt be used for payments. That's what stablecoins like DAI or RAI attempt to be used for. Sorry, but Bitcoinization is a fantasy.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaicv3w",
                                            "author": "Blockchain_Benny",
                                            "score": 0,
                                            "created_utc": 1653885033.0,
                                            "response": "Magic Internet Money my dude",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iai1nho",
                                    "author": "Perleflamme",
                                    "score": 3,
                                    "created_utc": 1653878932.0,
                                    "response": "Last time I checked, LN didn't solve real world use case of few sellers having millions of buyers. I don't see how BTC is supposed to handle that with way less than 10 TPS. \n\nWhatever you do with LN, you need to settle the transaction at some point in time and you need to do it once for each pair of people transacting. I'm not seeing Amazon waiting for months to retrieve its few orders per client and paying, for each such client, the amount of BTC the Bitcoin network would require. \n\nAnd even then, Amazon isn't the only company that exists. I've they flood the total TPS of Bitcoin, what else is there left for other companies? How much more will it cost per transaction? \n\nNo, really, BTC is yet to solve its scalability issues. State channels are cool, but only for repeated microtransactions for each pair of people.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iai68oi",
                            "author": "LeopardPretty7956",
                            "score": 1,
                            "created_utc": 1653881251.0,
                            "response": "it’s about to start at gamestop",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iai232g",
                    "author": "jzia93",
                    "score": 4,
                    "created_utc": 1653879149.0,
                    "response": "I think ultimately to redefine ownership structures between companies and individuals. At the moment, the majority of your data is managed on your behalf by large tech institutions, and you have no real ownership of your digital identity, despite how much time and energy you invest into it.\n\nWhen you enable data exchanges between two parties on decentralized networks, you remove the intermediary (Apple, Google, Facebook whatever), and that starts opening a lot of doors. IMO, it also addresses a number of challenges with crony capitalism, corporate insiders, backdoor deals and the like, because all parties on decentralized networks play by the same, transparent rules.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahzcc4",
                    "author": "olihowells",
                    "score": 16,
                    "created_utc": 1653877754.0,
                    "response": "ETH will be the gas needed to fund smart contract transactions. Those who stake ETH will earn staking rewards from the gas fees from the users of ETH. Kind of like dividends from a stock.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iahzy2i",
                            "author": "Perleflamme",
                            "score": 1,
                            "created_utc": 1653878069.0,
                            "response": "ETH is not gas. Otherwise, there wouldn't be a gas price constantly changing between ETH and gas. It's just that ETH is used to buy gas on the spot, whenever you need it. \n\nThere used to be a gas token, but it wasn't ETH and it doesn't even exist anymore.\n\nEdit: it seems many people don't know the difference about key concepts of Ethereum, notably about ETH and gas. Here, for you:\n\nhttps://ethereum.org/en/developers/docs/gas/\n\nI didn't expect so many people to be so strongly misinformed and still being so strongly attached to claiming so plain wrong statements. I mean, it's public knowledge, you can see about it yourself on the Internet. Laziness isn't a reason to spread misinformation.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iai6hvj",
                                    "author": "hazed-and-dazed",
                                    "score": 9,
                                    "created_utc": 1653881386.0,
                                    "response": "Isn’t gas paid in gwei which is a denomination of ETH? So this means you pay for transactions using ETH at the end of the day? \n\nI think you are referring to GAS token (gastoken.io) which is a completely different project that uses a smart contract to tokenise gas — storing them when it’s cheap and using it when fees are expensive.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iai6zou",
                                            "author": "Perleflamme",
                                            "score": 0,
                                            "created_utc": 1653881650.0,
                                            "response": "Your physical gas is paid in USD, right? Yet is USD the physical gas? No? Do you put USD in your gas tank? No? Well, don't confuse the commodity with the currency.\n\nIn the Ethereum network, ETH is the native currency, while gas is the native commodity. Both are scarce and you can pay the latter only with the former, but that's all. ETH is not gas and is not a gas token either. \n\n>You are referring to GAS token (gastoken.io) which is a completely different project that uses a smart contract to tokenise gas — storing them when it’s cheap and using it when fees are expensive.\n\nYes, I'm referring to this token, which was by definition a gas token, allowing you to actually store gas for the future. ETH doesn't do that. It's not a gas token at all, hence the gas price that fluctuates over time.\n\nEdit: just to be clear and avoid misunderstandings, I'm not claiming there was a time when ETH wasn't used to pay gas. It was always used to pay gas. It's just that it never was gas or even a gas token.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaijnai",
                                                    "author": "jet2686",
                                                    "score": 5,
                                                    "created_utc": 1653889566.0,
                                                    "response": "I'm not sure I follow this logic, nor do I agree with the analogies being made.\n\nTerminology is important when building concepts, however I feel your definition takes things to far.\n\nEthereum is the programmable blockchain layer, ETH is the gas that interacts with the program/smart contract.\n\nGiven this case, why is ETH not considered a gas token?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iain0c2",
                                                            "author": "Perleflamme",
                                                            "score": 1,
                                                            "created_utc": 1653892140.0,
                                                            "response": ">ETH is the gas that interacts with the program/smart contract.\n\nNo, this is plain wrong. Gas is what is bought by spending ETH. Gas is not ETH. Otherwise, there wouldn't be a gas price at all.\n\nThe fact you feel the definitions take things too far is not an argument, just a feeling. The truth is these definitions are exact and don't go too far at all.\n\n>Given this case, why is ETH not considered a gas token?\n\nI already explained: because there's a gas price that fluctuates over time. ETH is a currency (notably, a cryptocurrency) and gas a commodity you buy with such currency.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iajp7my",
                                                                    "author": "jet2686",
                                                                    "score": 1,
                                                                    "created_utc": 1653920325.0,
                                                                    "response": "Though you came/come off a bit too argumentative, after digging through the Ethereum white paper I can't fully refute your statements.\n\n\"Gas\" seems to be defined as a way to calculate how much compute resources are needed to process a transaction. Price is calculated based on chain bandwidth and the amount of data being processed in the transaction.\n\nEther, even when interacting with a smart contract, definitely falls in line more with a currency as it's used to exchange services.\n\nThere is still a tight coupling between compute resources and ether (or it's smaller denominations, gwei), which to me still feels conflated, but I won't dive deeper here.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "iaiwzjn",
                                                    "author": "AESTHTK",
                                                    "score": 3,
                                                    "created_utc": 1653900776.0,
                                                    "response": "I know you’re getting downvoted, but readers should know - this is accurate.\n\nThere is a proposal to make gas multivariate, but until then gas is basically a proxy for “blockspace”.\n\nETH is used to purchase blockspace in an auction, paid in GWEI.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "iaihouh",
                                                    "author": "hazed-and-dazed",
                                                    "score": 1,
                                                    "created_utc": 1653888187.0,
                                                    "response": "Ok. I see your point re: the commodity and its underlying currency \n\n\nIs GAS token still relevant? I remember reading up on it years ago.. is it being used for anything useful today?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaimpaj",
                                                            "author": "Perleflamme",
                                                            "score": 2,
                                                            "created_utc": 1653891894.0,
                                                            "response": "Sadly, since the London Hard Fork of last August, it's not relevant anymore. Devs had to get rid of the code instruction that allowed gas refund and, as such, that allowed for the mechanism the gas token depended on. As such, the gas token is dead.\n\nWe could probably have something similar, though, but it would need to be made natively, as it would interact with the burn mechanism itself.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "iaimwfd",
                                                            "author": "PrawnTyas",
                                                            "score": 2,
                                                            "created_utc": 1653892052.0,
                                                            "response": "Gas tokens (there are a few) were a temporary ‘fix’ that actually had several negative effects on the network. As Ethereum scales/moves to L2’s and Rollups, gas tokens aren’t economically viable and become obsolete.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "iaim75g",
                                                    "author": "PrawnTyas",
                                                    "score": 1,
                                                    "created_utc": 1653891504.0,
                                                    "response": "~~None~~ Some of this isn’t true. The reason ETH exists is to fund transactions on the Ethereum blockchain. \n\nGAS token was launched in 2018 (IIRC) much later than Ethereum itself. There were several attempts at ‘gas tokens’, Chi from 1inch being another. They were an attempt at making gas cheaper, not replacing ETH.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaimuna",
                                                            "author": "Perleflamme",
                                                            "score": 1,
                                                            "created_utc": 1653892013.0,
                                                            "response": ">None of this is true. The reason ETH exists is to fund transactions on the Ethereum blockchain.\n\nCare to explain how it goes against what I said? It's still not gas and it's still not a gas token. Otherwise, there wouldn't be a gas price at all. \n\n>GAS token was launched in 2018 (IIRC) much later than Ethereum itself. There were several attempts at ‘gas tokens’, Chi from 1inch being another. They were an attempt at making gas cheaper, not replacing ETH.\n\nIndeed. So what?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iain2yc",
                                                                    "author": "PrawnTyas",
                                                                    "score": 1,
                                                                    "created_utc": 1653892199.0,
                                                                    "response": "I’d be happy to. So I understand your thought process though, could you explain what you mean by ‘eth isn’t gas and it’s still not a gas token’?\n\nIn your mind, what is ‘gas’?\n\nEdit - nvm, I get what you’re saying. You don’t pay gas with gas tokens, they’re ERC20’s. You still pay for the tx with ETH, the gas token uses Ethereum’s storage refund feature to make the transaction more ‘efficient’ and therefore cheaper. \n\nETH is the only way to pay for transactions, there is no other token.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iaip2qk",
                                                                            "author": "Perleflamme",
                                                                            "score": 2,
                                                                            "created_utc": 1653893819.0,
                                                                            "response": "Gas is a unit of computation and blockspace in a cryptocurrency network. In Ethereum, there is on average ~15M gas per block and at most ~30M gas per block, so every ~12-13 seconds. It's a scarce resource of how much Ethereum's world computer can be used.\n\nETH is a token that is also scarce. There are less than 120M of them and they're notably issued at 2 ETH per block to miners. ETH is used to buy gas and compute transactions.\n\nHere, you can see the difference I make between the two concepts. If you're willing to know more about it, you can learn more about it directly on the Ethereum foundation website.\n\nhttps://ethereum.org/en/developers/docs/gas/",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iaipca4",
                                                                                    "author": "PrawnTyas",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653894039.0,
                                                                                    "response": "I don’t need to ‘learn’ about it. \n\nYou asked me to explain the bit you had wrong, I’m asking you to explain the concept in your own words so I better understand your thought process and can then explain your apparent misunderstanding in a way you’ll align with. \n\nGas tokens aren’t used to pay gas. Ether is.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iaire4w",
                                                                                            "author": "Perleflamme",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653895762.0,
                                                                                            "response": ">Gas tokens aren’t used to pay gas. Ether is.\n\nAgain, I never said the opposite. I said ETH isn't gas and ETH isn't a gas token either.\n\n>You asked me to explain the bit you had wrong\n\nI didn't. I asked what your point was, not that I needed you to explain what I \"had wrong\". Gas isn't ETH. ETH isn't gas. It's two different concepts. The fact you buy gas with ETH isn't a reason to confuse the two concepts. If you confuse the two concepts, it means you are misunderstanding it and that you need to learn more about it. The link was to ensure you can. Whatever you do with it is then your own choice.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iaid65r",
                                    "author": "plaenar",
                                    "score": 2,
                                    "created_utc": 1653885227.0,
                                    "response": "Right. But it is the only asset that CAN be used to pay for gas. Because it must be burned to cover the base fee.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaiek11",
                                            "author": "Perleflamme",
                                            "score": 1,
                                            "created_utc": 1653886093.0,
                                            "response": "I completely agree. But it's not a gas token and it's not gas either.\n\nI'm sorry if it sounds pedantic, but the distinction is important, as several ETH haters make that confusion to spread misinformation and insult the Ethereum network.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iaj3qq2",
                                    "author": "olihowells",
                                    "score": 1,
                                    "created_utc": 1653906869.0,
                                    "response": "How is this relevant to what I’m saying? ETH is still used to fund transactions",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iahzqa7",
                            "author": "yolodogewtf",
                            "score": -9,
                            "created_utc": 1653877955.0,
                            "response": "So it’s basically reached it’s end goal, but in an immature state. \n\nWhich is fine, I’d totally believe that!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iai5nka",
                                    "author": "ThatBitchTsundere",
                                    "score": 2,
                                    "created_utc": 1653880944.0,
                                    "response": "...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iai76fx",
                                            "author": "torvaman",
                                            "score": 2,
                                            "created_utc": 1653881746.0,
                                            "response": "dont think he's getting it",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaibxw1",
                                                    "author": "Koolaidolio",
                                                    "score": 0,
                                                    "created_utc": 1653884454.0,
                                                    "response": "Low effort post tbh, let’s just downvote and move on",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iai5nn2",
                    "author": "stackup_",
                    "score": 3,
                    "created_utc": 1653880945.0,
                    "response": "There’s probably many different “end goals” depending on who you ask, just like how the internet has been used in all sorts of ways.\n\nWhat I’m personally excited about is a single settlement layer for the internet which everyone can use to settle value on. IMO, if we can solve certain scalability and usability problems along the way, this has huge benefits for users everywhere.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaikf6x",
                    "author": "Doppelex",
                    "score": 4,
                    "created_utc": 1653890138.0,
                    "response": "The ultimate version of it will be invisible.\nNormies will interact with Defi through centralised permissioned and insured portals.\nThe rails behind it will use ETH scaling solutions/subnets/shards which then get secured through the Main chain which is the most secure and decentralised.\n\nSelf custody and the current wild west will never appeal to Joe/Stacy shmoe who are average, prudent, lazy investors and like to use financial services but not stress at every step that they are going to lose their money\n\nYou might pay with your debit card which will do an USDC transfer instead of all the costly pipe they have to go through currently.\n\nOr you could have most random small insurance claims run through smart contract. \nYou go to the portal, you submit your claim, if oracles agree with your claim smart contracts execute a payment behind the scenes.\n\nEtc…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaiiaoe",
                    "author": "mathiros",
                    "score": 3,
                    "created_utc": 1653888611.0,
                    "response": "The endgame are planetary scale L3 apps and games which settle on a L2 which settle on L1-Ethereum, which is the most secure L1 in the world. It enables ordinary people like you and me to extract value vertical from L3 to L1, which is the difference to economics today in web2.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaisp6i",
                    "author": "Olmops",
                    "score": 3,
                    "created_utc": 1653896910.0,
                    "response": "As with all tools, people will learn over time where to use them. Not everything needs to be a smart contract, but there are applications that really profit from them. Take the mentioned gaming for instance - it will be \"just\" the ultimate worldwide standard for trading virtual assets.\n\nPayments: with the algorithmic issuance price fluctuations are inevitable (still think they will smaller), so using ETH for native pricing of everyday goods may still be far down the road or never come. But maybe - and that is a political thing - countries could choose Ethereum as the platform for their CBDCs. CDBCs could solve many issues we have today IF done properly. Basically, what if a country just releases a stablecoin on Ethereum? They can program whatever regulations/privacy/administrative features they want and perfectly guarantee stability.\n\nSo, the endgame for ETH is being fuel for all these applications. More sort of a commodity than a currency, or at least a hybrid.\n\nRegarding the endgame of Bitcoin I see an angry mob of environmentalists smashing lambo windows and sinking yachts which will ultimatively hurt the BTC price.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaiafx3",
                    "author": "Locko_O",
                    "score": 4,
                    "created_utc": 1653883547.0,
                    "response": "https://vitalik.ca/general/2021/12/06/endgame.html\n\n/Thread",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaiikos",
                    "author": "disposable_account01",
                    "score": 2,
                    "created_utc": 1653888812.0,
                    "response": ">niche stuff\n\nContracts are the literal backbone of civil law and commerce. Hardly “niche”.\n\n>seems a lot better\n\nHow so?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaiz8bl",
                    "author": "Justin534",
                    "score": 2,
                    "created_utc": 1653902819.0,
                    "response": "To simply be an open permissionless and censorship resistant smart contract platform anyone can build on. ETH is only a currency in the sense that you spend it to execute smart contracts on Ethereum. It also does have many properties of a useful currency so people might use it as a general purpose currency, nothing is really stopping them. Though right now I would say it's primarily just the currency used to be able to participate in the Ethereum economy and ecosystem.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajh4ff",
                            "author": "yolodogewtf",
                            "score": 1,
                            "created_utc": 1653916091.0,
                            "response": "Agree - it has a lot of stickiness since to participate in defi you need Eth",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaj6ux7",
                    "author": "Swole_Bodry",
                    "score": 2,
                    "created_utc": 1653909402.0,
                    "response": "Ether I don’t think will function well as money, but Ethereum can host the money ie through stable coins or other alternative currencies like Olympus or Meter. Ether in this case functioning as the fuel powering every transaction on ethereu",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajap1r",
                    "author": "m4n13k",
                    "score": 2,
                    "created_utc": 1653912163.0,
                    "response": "Ethereum endgame is a democracy. If currency is decentralized and governments are decentralized by DAOs, then humanity will be much more democratic. As today we have constant meaningless fights and wars just to get power. It has to change and Ethereum is the best technology that can make it possible.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajg1v6",
                            "author": "yolodogewtf",
                            "score": 0,
                            "created_utc": 1653915488.0,
                            "response": "Lol",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iai739w",
                    "author": "Cryptolution",
                    "score": 4,
                    "created_utc": 1653881701.0,
                    "response": "> Please don’t say web3, I have yet to see a web3 app with more than 1k users\n\nYou sound like Paul Krugman talking about the internet in 1998.\n\n>“The growth of the Internet will slow drastically, as the flaw in ‘Metcalfe’s law’—which states that the number of potential connections in a network is proportional to the square of the number of participants—becomes apparent: most people have nothing to say to each other! By 2005 or so, it will become clear that the Internet’s impact on the economy has been no greater than the fax machine’s.”\n\nYes I understand that this new technology doesn't have a large amount of users. Similarly very few people used Bitcoin in 2011.\n\nIt's hard to be rational with the person who isn't rational, so I won't try 🤷\n\nAs for eth anyone who answers won't have the answer. Because it's a open network and what happens on it is up to developers and end users in the future. There is a reasonable amount of short-term that we can speculate on but long-term we literally have no idea. Anyone who claims to know is lying.\n\nThere is no end game. That is literally the best answer you're going to get. I know it's the answer you don't want but tough shit, life ain't here to serve you.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahx8qq",
                    "author": "IamAFlaw",
                    "score": -1,
                    "created_utc": 1653876678.0,
                    "response": "Slaying all blockchains. There can be only one. PoS ETH + shading. everything else can be side chain or L2.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iahz7qm",
                            "author": "EmperorCip",
                            "score": 10,
                            "created_utc": 1653877686.0,
                            "response": "\"Maximalism\" is not how this game goes.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iai2rg6",
                                    "author": "FaceDeer",
                                    "score": 3,
                                    "created_utc": 1653879501.0,
                                    "response": "Generally speaking, no, but I can foresee a situation where Ethereum is able to handle most of the functions that other blockchains would handle in a more efficient manner than individual blockchains would.\n\nPeople can go ahead and keep using those other blockchains even so. It would just be kind of silly. Nothing wrong with doing silly things, the economy would collapse if nobody ever did anything silly. But it's fine to point out that Ethereum's aiming to be the best-in-breed for all those various functions.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iahzu6z",
                                    "author": "IamAFlaw",
                                    "score": 1,
                                    "created_utc": 1653878013.0,
                                    "response": "I just think it is the best with most probability of mass adoption. Once the ball starts rolling on mass adoption of a blockchain, they will pick one and everyone will want to pick it to simplify rather than have to do cross chain crap. Chains can be side chains of Ethereum at that point so moving assets between them will be much easier. All popular/big sidechains will be supported right from banks where you don't need to bridge shit.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iai0y4c",
                                            "author": "Perleflamme",
                                            "score": 2,
                                            "created_utc": 1653878579.0,
                                            "response": "You're forgetting that blockchains can specialize themselves and provide more than other blockchains, for very specific use cases. There are lots of compromises to make whenever you build a blockchain, Vitalik recently talked about many of them.\n\nUnder such circumstances, there's really no reason to believe only one blockchain can cover all use cases. Maybe the blockchain that would actually solve other use cases ETH doesn't provide the best it could isn't yet born, but believing there will be only one in the end is a very strong claim that is not supported by currently grasped knowledge.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iai1i7o",
                                                    "author": "IamAFlaw",
                                                    "score": 2,
                                                    "created_utc": 1653878855.0,
                                                    "response": "Yeah I mean there can be other blockchains used for completely different irrelevant stuff, but why build the whole infrastructure and try to secure it when you can build it as a sidechain on Eth? If Eth gets the mass adoption, and lots of people use it, it's L2s, and build their own side chains, it would only make sense to build as a side chain, even if it is only to validate the chain's security.\n\nOnce mass adoption gets traction, it would be easier to upgrade Eth to meet new needs than to fuck around moving to different blockchains. If mass adoption comes Eth can upgrade its blockchain to meet whatever is required of it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iai2go4",
                                                            "author": "Perleflamme",
                                                            "score": 1,
                                                            "created_utc": 1653879345.0,
                                                            "response": ">but why build the whole infrastructure and try to secure it when you can build it as a sidechain on Eth?\n\nBecause you can get better results for specific use cases, by choosing different options on the compromises you have to make.\n\nWhat you seem not to understand is that it's a matter of lots of compromises. Ethereum simply can't do everything at best of what's possible.\n\nEthereum is a world computer. A generic one. Like traditional computers, you'll end up seeing some computers being more specific, specially designed to way better solve some problems rather than others.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iai3650",
                                                                    "author": "IamAFlaw",
                                                                    "score": 1,
                                                                    "created_utc": 1653879716.0,
                                                                    "response": "I dunno man. This is how I envision the future of blockchain tech. I see one main backbone blockchains with many side chains doing all sorts of stuff but connecting back with the main backbone. Kinda like how the internet is. I still have my local net that I can run at any speed. Do whatever I want with, and still have access to the internet we all connect to.\n\nI see Ethereum as having the best chance of being the internet of blockchains. That's what it was made for anyway.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iai608z",
                                                                            "author": "Perleflamme",
                                                                            "score": 2,
                                                                            "created_utc": 1653881128.0,
                                                                            "response": "The Internet being in such a way is the problem that allowed many corporations to have such power over the Internet: it institutes centralization. Let's not repeat this problem with blockchains. \n\nFortunately, the lack of possibility to prevent alternatives in crypticurrencies ensures centralization can't happen and that, instead, there will be alternatives.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iahxfv4",
                            "author": "yolodogewtf",
                            "score": 1,
                            "created_utc": 1653876783.0,
                            "response": "Ok…  it what will it be used for? \n\nBuying groceries?  \n\nBeing the backend of my interest earning bank acct?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iahxtt3",
                                    "author": "IamAFlaw",
                                    "score": 1,
                                    "created_utc": 1653876981.0,
                                    "response": "It could be both. A grocery store can have its own sidechain for payments and or points collection. A bank can have its own sidechain with or without smart contracts.\n\nEthereum is meant to be the internet of blockchains.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iahymps",
                                            "author": "yolodogewtf",
                                            "score": 1,
                                            "created_utc": 1653877388.0,
                                            "response": "You can do all that with BTC too \n\nWho cares if a side chain for points is decentralized on a smart contract 🤷‍♂️ \n\nThe money itself should not be centrally managed, but I could care less if something like grocery points were done on a super centralized mysql backed service",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iahyzql",
                                                    "author": "IamAFlaw",
                                                    "score": -1,
                                                    "created_utc": 1653877572.0,
                                                    "response": "BTC can't do anything yet, maybe in time, but chances are BTC has no future. They are too arrogant to advance fast enough, the network is slow and stupid. Criminals hold a lot of it. And PoW has no real future in todays energy starved planet and climate change.\n\nI consider BTC garbage and I think the only reason it is #1 is because of lost wallets, criminals still in jail, and newbs that know nothing about crypto and think of no other crypto than BTC. It's bubble will burst any time I think.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iahzjff",
                                                            "author": "yolodogewtf",
                                                            "score": 0,
                                                            "created_utc": 1653877856.0,
                                                            "response": "Why would a country prefer a currency managed by Vitalik over managing their own vs one that is barely managed \n\nOne that is barely managed (BTC) is far closer to something like gold.  \n\nBTC is way way way way way more like gold than ETH will ever be.  Limited supply, no central authority determining its roadmap.  \n\nEth has many valid use cases \n\nReplacing gold will never ever be one tho",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iai0czy",
                                                                    "author": "IamAFlaw",
                                                                    "score": -1,
                                                                    "created_utc": 1653878283.0,
                                                                    "response": "It's not managed by Vitalik.\n\nBTC is nothing like gold. I don't fall for that bullshit. It's a bubble and it will burst because in the end it's garbage tech in today's standards. I don't think anyway.\n\nBTC will never replace gold lol. BTC is a power hungry, slow, dumb blockchain and it's days are numbered. I don't think it has a future. I don't know when the bubble will burst but it will burst.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iai1frn",
                                                                            "author": "yolodogewtf",
                                                                            "score": 1,
                                                                            "created_utc": 1653878819.0,
                                                                            "response": "“BTC is nothing like gold”\n\nName one intrinsic property that gold has that makes it a 12 trillion dollar asset that Bitcoin doesn’t have?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iai1ztm",
                                                                                    "author": "IamAFlaw",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653879103.0,
                                                                                    "response": "It's physical? It's price doesn't swing up and down like a yoyo? It's not going to be banned in countries like China? The world's never going to hate gold for needlessly consuming a ton of power? Gold isn't a bubble that will burst?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iai36t0",
                                                                                            "author": "yolodogewtf",
                                                                                            "score": 3,
                                                                                            "created_utc": 1653879726.0,
                                                                                            "response": "Gold being physical is not what gives it intrinsic value \n\nHaving predictable and limited supply are, along with it not eroding easily (I.e not decreasing in supply)",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "iai2oxp",
                                                                                            "author": "yolodogewtf",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653879463.0,
                                                                                            "response": "Look at gold in the late 1800/early 1900s buddy",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "iaiifu3",
                                                                                            "author": "TheFcknVoid",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653888714.0,
                                                                                            "response": ">The world's never going to hate gold for needlessly consuming a ton of power?\n\nIt should? The majority of that mined gold is not going toward any kind of meaningful manufacturing.. instead being stockpiled to serve as the same kind of store of value that BTC is? Not to mention the gold mining practices are just as horrible, which is never mentioned?\n\nGold mining will always damage the earth. Power consumption for BTC mining can get better, as long as we actually pursue better sources of energy (which I admit I am skeptical of), because I think humans will capitalism ourselves to death in the next 2-3 decades.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "iai0r45",
                                                                    "author": "SAnthonyH",
                                                                    "score": -2,
                                                                    "created_utc": 1653878477.0,
                                                                    "response": "Bitcoin is dead mate, just accept it. \n\nEth does what btc does, but a 1000 times better.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iai0yyz",
                                                                            "author": "yolodogewtf",
                                                                            "score": 2,
                                                                            "created_utc": 1653878590.0,
                                                                            "response": "So Eth has a massively predictable shrinking supply like BTC right? \n\nNope! That is soooo valuable from a savings standpoint, and monetary policy view",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iai3huu",
                                                                                    "author": "FaceDeer",
                                                                                    "score": 3,
                                                                                    "created_utc": 1653879883.0,
                                                                                    "response": "Eth doesn't, but Ethereum can. You can spin up an ERC-20 token with whatever issuance pattern you like. You can even have it issued via the same PoW-driven algorithm as BTC, [here's a quick tutorial](https://lightrains.com/blogs/how-to-create-mineable-erc20-tokens/).\n\nIf \"digital gold\" is what you're after, there's an easy way to accomplish that too. You can spin up a new instance of MakerDAO and peg it to the value of an ounce of gold instead of to the US dollar.\n\nI'm not aware of any major tokens that have done this. Since the capability is there I assume it's likely due to a lack of demand for these features.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "iai0g6l",
                                                                    "author": "domotheus",
                                                                    "score": -2,
                                                                    "created_utc": 1653878327.0,
                                                                    "response": "> a currency managed by Vitalik \n\nit's not managed by Vitalik lol. You'd be surprised at how more bottom-up it is vs. the top-down vision people typically have, and how everything happens out in the open. It's very, very far from \"vitalik can give himself a million eth in secret\". The Ethereum Foundation doesn't rule with an open fist, read up on [its philosophy of subtraction](https://ethereum.foundation/philosophy/)\n\nThe protocol will also eventually ossify into something sustainable that no one controls or can take down or change on a whim. It just takes longer than Bitcoin to get there because there's way more problems to solve. In the mean time some kind of governance is necessary, but there is community involvement at every step of the way in theory",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iai0n4h",
                                                                            "author": "yolodogewtf",
                                                                            "score": 1,
                                                                            "created_utc": 1653878424.0,
                                                                            "response": "I agree, I was exaggerating \n\nBTC is way less centrally governed and purposefully has fewer bigger changes (much like gold does) tho, you gotta admit",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iai1css",
                                                                                    "author": "domotheus",
                                                                                    "score": 4,
                                                                                    "created_utc": 1653878777.0,
                                                                                    "response": "I admit it, BTC's protocol has ossified and its culture of soft forks makes it easier to have nodes vote directly on what features they want to add (segwit, taproot, etc), although that does limits the set of new functionalities possible.\n\nIt's sold as a feature that what you see is forever what you get, and I get where they're coming from, but IMO the whole thing ossified way too fast and there are serious issues about the blockchain's long-term viability going forward as issuance drops to 0, and the vibe of the BTC community is to pretty much handwave those issues away.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iai1pux",
                                                                                            "author": "yolodogewtf",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653878966.0,
                                                                                            "response": "Right, like the fact that there will be less incentive to have a very decentralized set of miners 50 yrs from now is a real risk.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "iai16wq",
                                                                                    "author": "Perleflamme",
                                                                                    "score": 3,
                                                                                    "created_utc": 1653878697.0,
                                                                                    "response": "It's not exaggerated, it's plain wrong. Ethereum isn't centrally managed at all.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iai0isa",
                            "author": "SAnthonyH",
                            "score": -1,
                            "created_utc": 1653878363.0,
                            "response": "I agree with this 100%.  Anything built in the future will be built on Ethereum.  There is no alternative.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iai1fzi",
                                    "author": "SAnthonyH",
                                    "score": 0,
                                    "created_utc": 1653878822.0,
                                    "response": "To the guy who downvoted me, you've probably invested in a very bad choice.  You have time to fix it while Eth is dipped.  After the merge, we cant help you.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iahygyk",
                    "author": "mannaman15",
                    "score": 1,
                    "created_utc": 1653877303.0,
                    "response": "Man came in here asking the tough questions…\n\n*grabs popcorn*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaihibu",
                    "author": "Classic_Contract7635",
                    "score": 1,
                    "created_utc": 1653888063.0,
                    "response": "Btc is not dead lol. It is ALWAYS going to be the catalyst of the crypto market. If you don’t realize that, you’re truly lost",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iainqjb",
                    "author": "Newguyiswinning_",
                    "score": 1,
                    "created_utc": 1653892728.0,
                    "response": "Fucking LOL thinking BTC is endgame. BTC was the prototype. It is not built to last and even the creators told people to move on. Gtfo with this bullshit",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaib9vy",
                    "author": "DCC808",
                    "score": 0,
                    "created_utc": 1653884047.0,
                    "response": "Centralized control 👍",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iai9wdi",
                    "author": "z0d14c",
                    "score": 1,
                    "created_utc": 1653883244.0,
                    "response": "Don't really understand why you think BTC is a better alternative currency than ETH. eth's L1 chain will never be enough to support all the financial transactions of the world, but neither will BTC. Eth, on the other hand, has L2s that conceivably could, is more environmentally friendly (so it can not receive as much pushback as BTC), and the smart contacts don't hurt either.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iail9lt",
                            "author": "Casino_Insider",
                            "score": 0,
                            "created_utc": 1653890775.0,
                            "response": "BTC has a L2 solution with the Lightning Network, but it's splitting the community apart because true maximalists are pro decentralization/PoW for security and LN is more centralised and less secure.\n\nIn the end the Bitcoin community will destroy Bitcoin by diverging from the original whitepaper and trying to make it a store of value (hint hint, a store of value doesn't fluctuate in price like BTC does and crypto prices will always be compared to fiat or equivalent). Bitcoin wasn't meant to be the slug that it is today, it was meant to be peer to peer digital cash, BCH is much closer to the original vision in that sense and it's evolving in the right direction.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaihnvx",
                    "author": "DishEcstatic9710",
                    "score": 1,
                    "created_utc": 1653888168.0,
                    "response": "ETH3",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaiku2f",
                    "author": "Sw33tN0th1ng",
                    "score": 1,
                    "created_utc": 1653890450.0,
                    "response": "*dismisses the whole point of crypto* \n\n\"Hey, what am I missing?\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iail56z",
                    "author": "PrawnTyas",
                    "score": 1,
                    "created_utc": 1653890683.0,
                    "response": "There isn’t an ‘end game’. Ethereum will never be ‘finished’. It’s an open source platform that allows people to build whatever they like on, nobody knows where that will go.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iais0f5",
                    "author": "TimoSci",
                    "score": 1,
                    "created_utc": 1653896301.0,
                    "response": "Difficult question. That's like asking what's the end game of The Internet in 1997. Or what's the end game of electricity in 1890.\n\nLike the inventions above ETH is a network with a high universality. It's difficult to predict what the main applications are going to be.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajkr8q",
                            "author": "yolodogewtf",
                            "score": 0,
                            "created_utc": 1653918071.0,
                            "response": "Not really - communicate with everyone instantly, and get info instantly",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaj5bjm",
                    "author": "Mirved",
                    "score": 1,
                    "created_utc": 1653908193.0,
                    "response": "Currency is the niche. Do you really feel that the average Joe needs a digital currency? What can he do with it that he can't do with his euros or dollars right now. The real use case is when ETH becomes the backbone of many digital services. It will become like swift/https or tcp-ip protocols that you use without even noticing. People typing in 20+ character addresses sending money around has very little use case and is not the big innovation that crypto is trying to bring.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajgf2m",
                    "author": "educatemybrain",
                    "score": 1,
                    "created_utc": 1653915691.0,
                    "response": "The most obvious use case is to run the worlds first global financial system. The current financial system is a mess of different protocols and parts and companies tying things together, and is mostly US centric. It's currently impossible for most people to even buy shares on the US market, let along invest in companies in say Argentina, or Tanzania. \n\nOnce we have financial rails that any person in any country can use we can finally have a system where capital flows to where it's needed most, instead of most of it ending up in Silicon Valley companies and other rich tech hubs.\n\nEthereum is the oil of this financial system, everyone pays it to transact. As the technology continues to improve costs will come down to 0.001% of what they are now and for most people whatever finance app they use will hide those fees so most people won't even know they're using Ethereum.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahyd7p",
                    "author": "mrdeezy",
                    "score": -5,
                    "created_utc": 1653877251.0,
                    "response": "It’s pretty cool tech, but if you guys think it will ever be used by the masses or used as a currency you are crazy. It’s mainly a secondary store of value to bitcoin and something for rich people to play with. What will be profitable for it is it’s use by the banking system. Nobody but the biggest geeks use or are going to use layer 2’s.\nIt’s slow and absurdly expensive and that’s the problem. If you were to get a ten k eth. You are going to do a token swap for what 3000 dollars? It’s so dumb.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iahzo6m",
                            "author": "Perleflamme",
                            "score": 6,
                            "created_utc": 1653877924.0,
                            "response": "https://L2fees.info\n\nAbsurdly slow and expensive? By what measure, exactly? The BTC 20 minute block time?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iai4sbr",
                                    "author": "mrdeezy",
                                    "score": -1,
                                    "created_utc": 1653880520.0,
                                    "response": "Dumb ethereum maxi’s 😂",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iai5nkr",
                                            "author": "Perleflamme",
                                            "score": 1,
                                            "created_utc": 1653880944.0,
                                            "response": "Not an argument. \n\nCare to give your definition of a maxi? Anyone who doesn't believe BTC is the only crypto that is not worthless? \n\nI'm not a maxi. I believe many cryptocurrencies is way better than only one.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iai8dw0",
                                                    "author": "mrdeezy",
                                                    "score": 1,
                                                    "created_utc": 1653882387.0,
                                                    "response": "My comment wasn’t to you, it was to the people downvoting my post. I hate the cultish behavior of crypto and how people willfully and ignorantly deny anything that does not fit their own bias. I like btc, and have owned a lot of eth in my life. I just don’t really care for it. I think there are companies building heavily on chains that can smoke ethereum. Although ethereum has the best dev team, it has cultural significance with Nft’s, banks use it etc. I just think it’s funny to say bitcoin is slow, and it’s purpose is to store wealth, allegedly. The speed isn’t as important as it is with a layer 1. Eth is slow and expensive compared to the competition that’s coming on strong. I am not a maxi, I like tech. I don’t think it’s close to adoption at all. I got really cynical about crypto in general and now just trade it. I don’t care what it does.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iaibp7l",
                            "author": "BHKbull",
                            "score": 2,
                            "created_utc": 1653884308.0,
                            "response": "Thousands of people from all walks of life are already using L2’s like Loopring. I’m not a geek, I’m a carpenter. I know more than some around here, but I’m certainly no blockchain expert. But I do know that participating in Liquidity Pools, swapping tokens / trading assets, and stashing my slave wages on Ethereum L1 or Loopring L2 has given me far better returns than anything available in the ancient legacy financial system, even with the volatility and crashes. Hell of a lot better than Bitcoin would have too within the same timeframe, and I’ve actually been welcomed in the Ethereum community and treated with respect, unlike the Bitcoin community, or the legacy financial system.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaictk4",
                                    "author": "mrdeezy",
                                    "score": 1,
                                    "created_utc": 1653885006.0,
                                    "response": "Great post, I think the L2’s are excellent. I just don’t think regular folks will use them. It’s hard enough to get them to use the layer 1.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaiejyw",
                                            "author": "BHKbull",
                                            "score": 0,
                                            "created_utc": 1653886092.0,
                                            "response": "There are lots of groups working tirelessly on making participation more palatable for the masses. A year and a half ago I knew absolutely nothing about blockchain or even investing/ using financial instruments, etc. Started small on centralized exchanges like coinbase, quickly realized centralized exchanges were taking advantage of me just as bad as banks and brokers. Heard about DeFi, heard about L2, took a deep dive, and here I am. Didn’t know shit about investing whatsoever, let alone in blockchain. Now I’m using complex financial instruments that were once exclusively available to massive institutions and market makers, on my frickin’ phone. It’s not hard to learn, and more and more people will be willing to learn as they realize the life-changing potential in having true custody and control over their finances. ETH Layer 2 is the future. Be your own bank!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iahx4s0",
                    "author": "Biddycola",
                    "score": -8,
                    "created_utc": 1653876622.0,
                    "response": "End game = XRPvSEC\n\ndon’t hate the game, hate the SEC and William Hinnman. They dumb as fuuuuckk",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iahxbvj",
                            "author": "yolodogewtf",
                            "score": 4,
                            "created_utc": 1653876725.0,
                            "response": "What does that have to do with the long term vision of ETH?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iahxdt6",
                                    "author": "Biddycola",
                                    "score": -8,
                                    "created_utc": 1653876754.0,
                                    "response": "Bro dyor",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iahxh9x",
                                            "author": "yolodogewtf",
                                            "score": 5,
                                            "created_utc": 1653876804.0,
                                            "response": "Bro, I did and can’t find a good answer",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iahyuws",
                                                    "author": "mannaman15",
                                                    "score": 1,
                                                    "created_utc": 1653877503.0,
                                                    "response": "I think he might be trying to say something about how it’s looking like XRP might actually win the lawsuit brought against them by the SEC, headed at the time by mr Hinman. \nXRP is a money transfer system as I understand it that slaughters current systems in use. \nSomebody correct me if I’m wrong",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iahz765",
                                                            "author": "yolodogewtf",
                                                            "score": 2,
                                                            "created_utc": 1653877678.0,
                                                            "response": "I see, I thought he was saying ETH was gonna go the wayside like xrp did in a battle with the sec",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iai72rf",
                                                                    "author": "Biddycola",
                                                                    "score": 2,
                                                                    "created_utc": 1653881693.0,
                                                                    "response": "It definitely meets one (if not all) of the Howie tests used to determining what is (or is not) a security, whereas xrp clearly doesn’t meet a single prong of the howie test, is all I’m saying. \n\nAny sort of corruption I don’t want to be the source of reasoning, because I’d only be called a fuddist. You need to learn the corruption to eth on your all owns. \n\nI still HODL eth with that said, as a hedge against US corruption..",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iajdho9",
                                                                            "author": "mannaman15",
                                                                            "score": 1,
                                                                            "created_utc": 1653913962.0,
                                                                            "response": "So you are suggesting that if the SEC goes after ethereum as a security, they will likely win and shut eth down?",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iai7evf",
                    "author": "joekercom",
                    "score": 0,
                    "created_utc": 1653881871.0,
                    "response": "Stablecoins are the only true cryptocurrency, ETH, BTC or any volatile asset will never be used as or viewed as a currency.  BTC is a store of value, ETH is many things, the backbone of a decentralized world computer, much better than being a currency.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaiojog",
                    "author": "Mallardshead",
                    "score": 0,
                    "created_utc": 1653893382.0,
                    "response": "The endgame is to be an IOU database and go to zero. That's just how it's designed:\n\nhttps://twitter.com/tenderscore/status/1530790900749676544?s=20&t=ZpTySbLAflu5CRHGzkpJOg",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iai4epu",
                    "author": "online_finance_throw",
                    "score": 1,
                    "created_utc": 1653880343.0,
                    "response": "It is by far the most reasonable of all coins to be the future of currency, in the future governments will be forced to accept taxes in ETh as th epopulace uses it more and more, its literally inevitable",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iai689i",
                    "author": "houston187",
                    "score": 1,
                    "created_utc": 1653881245.0,
                    "response": "I like to think of it like the early internet. There were skeptics and it could be difficult to see it's potential. But now in 2022, we couldn't function without it. I can only hope it's (ETH) importance and functionality is realized in my lifetime. I have high confidence.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iai8f3g",
                    "author": "HeadMembership",
                    "score": 1,
                    "created_utc": 1653882405.0,
                    "response": "If Bitcoin is \"gold\", eg a store of value, then Ethereum (the blockchain) is the global banking system, of which eth is the security system.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaib107",
                    "author": "MisterYumYum8",
                    "score": 1,
                    "created_utc": 1653883898.0,
                    "response": "financial freedom to the masses. No more centralized identities controlling the flow of capital. Every transaction is visible and everyone plays by the rules. True financial equality",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaibh0s",
                    "author": "Vignaroli",
                    "score": 1,
                    "created_utc": 1653884168.0,
                    "response": "It'll be the dominant derivatives market maker with smart contracts.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaibheo",
                    "author": "omniumoptimus",
                    "score": 1,
                    "created_utc": 1653884174.0,
                    "response": "The point of ETH, ether, is to pay people for validating transactions on the Ethereum network. That’s it. You can certainly use it for other things, but that’s not its intended use. \n\nThe point of BTC, Bitcoin, was to represent monetary value that could be sent as peer-to-peer transactions. It was not meant as digital gold. It’s really hard to use Bitcoin as a currency because no one know what it will be worth tomorrow. So, for instance, is your chicken dinner later this week going to cost 0.000001 Bitcoin or 2 bitcoin. No one knows.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaicocc",
                    "author": "Father_of_Wolverine",
                    "score": 1,
                    "created_utc": 1653884917.0,
                    "response": "They guy who sold me said \"lambos\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaifq5z",
                    "author": "it_aint_ralph_thoo",
                    "score": 1,
                    "created_utc": 1653886861.0,
                    "response": "Remind me! 10 hours",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaifsve",
                            "author": "RemindMeBot",
                            "score": 1,
                            "created_utc": 1653886910.0,
                            "response": "I will be messaging you in 10 hours on [**2022-05-30 15:01:01 UTC**](http://www.wolframalpha.com/input/?i=2022-05-30%2015:01:01%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/ethereum/comments/v0pqpd/whats_the_end_game_of_eth/iaifq5z/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fethereum%2Fcomments%2Fv0pqpd%2Fwhats_the_end_game_of_eth%2Fiaifq5z%2F%5D%0A%0ARemindMe%21%202022-05-30%2015%3A01%3A01%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20v0pqpd)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaig1ug",
                    "author": "WhatBands",
                    "score": 1,
                    "created_utc": 1653887075.0,
                    "response": "I think ETH is to be the worlds computer and it will work with BTC not against it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaigbee",
                    "author": "syfus",
                    "score": 1,
                    "created_utc": 1653887253.0,
                    "response": "So, think of it this way. BTC is a currency, akin to USD. It is simply a currency. ETH and other smart contract blockchains are much closer to a commodity. A good example being Oil. Oil is used in multiple processes to deliver other products and is traded as an asset. ETH is used in the process of computing within a blockchain to do something. From defi, to tokens, to gaming. Its primary function is to not simply be a currency, but to be the fuel to drive many other things. That could also be in the use of sending a basic currency transaction in the case of USDC or USDT... so yea... I would argue that ETH is a CryptoCommodity, not a CryptoCurrency.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaiqsam",
                    "author": "Rvp1090",
                    "score": 1,
                    "created_utc": 1653895238.0,
                    "response": "just changing the currency we use is not enough. Ethereum is what financial products are built on.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajcj6h",
                    "author": "TnekKralc",
                    "score": 1,
                    "created_utc": 1653913357.0,
                    "response": "I'm quite confident gods unchained has more than a 1000 players",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajefx5",
                    "author": "shwekhaw",
                    "score": 1,
                    "created_utc": 1653914537.0,
                    "response": "I don’t think BTC will ever be like gold. Look at current market. Gold out perform S&P and you know where BTC is.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajgteg",
                            "author": "yolodogewtf",
                            "score": 1,
                            "created_utc": 1653915916.0,
                            "response": "Lol \n\nLook at the post 12 years, not 12 weeks",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iajipwl",
                    "author": "birdman332",
                    "score": 1,
                    "created_utc": 1653916979.0,
                    "response": "ETH is not and never will be money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajjd7r",
                    "author": "hashzzz",
                    "score": 1,
                    "created_utc": 1653917332.0,
                    "response": "Ethereum never aimed to be day to day money, it's the financial internet money. Basically a Decentralized internet banking ecosystem",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajmc69",
                    "author": "11th-plague",
                    "score": 1,
                    "created_utc": 1653918890.0,
                    "response": "I’m not sure there is an “end game” for any dynamic, evolving system.  There are goal posts and milestones and outcomes to tell investors, but it’s natural to progress forever (well, unless you’re a “conservative Republican” and your best days are behind you.)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajmwfc",
                    "author": "micr0s0ft1",
                    "score": 1,
                    "created_utc": 1653919179.0,
                    "response": "On chain child pornography",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajx3c4",
                    "author": "FlipDetector",
                    "score": 1,
                    "created_utc": 1653924024.0,
                    "response": "the end games is a new beginning. a new era. the Aquarius where datacenters submerge into the ocean and we slowly cook the rest of the fishes before the flood comes. I might be wrong who can tell",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak1309",
                    "author": "ItsAConspiracy",
                    "score": 1,
                    "created_utc": 1653925827.0,
                    "response": "I'm especially keen on what EY is doing with Nightfall.\n\nERP systems have revolutionized the internal transactions of corporations, but *between* corporations things are still a mess. Nobody trust each other, nobody wants to trust  a third party to run a centralized database, so it's a bunch of complicated, slow, and expensive mutual auditing.\n\nEthereum can do the same thing for those transactions that ERP systems did for internal corporate stuff, and EY has open sourced the tech to do that at scale, without losing the privacy that corporations need. Once we have data sharding, Ethereum will be able to run a substantial portion of the global economy.\n\nAnd of course, because of 1559, in that world every ETH holder would be effectively collecting fees on all those transactions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak1610",
                    "author": "Either-Advantage",
                    "score": 1,
                    "created_utc": 1653925865.0,
                    "response": "I personally think Ethereum's end-game is to be the foundation of what we call \"web3\". To be the bedrock of everything we build. From massive ecosystem's like Polygon's to ZK rollups, services, NFT, DeFi and everything in between. Just my opinion though.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak1zx9",
                    "author": "not_stoic",
                    "score": 1,
                    "created_utc": 1653926237.0,
                    "response": "Rugpull you guys.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iai4r00",
                    "author": "indian_bro",
                    "score": -3,
                    "created_utc": 1653880504.0,
                    "response": "Exit scam",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iai81ph",
                    "author": "SAGA_EJ1",
                    "score": -1,
                    "created_utc": 1653882202.0,
                    "response": "4 digits. 😐",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iai8a0v",
                    "author": "Ok-Nefariousness1340",
                    "score": -1,
                    "created_utc": 1653882328.0,
                    "response": "Global reserve currency",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaiyzoz",
                    "author": "michelmx",
                    "score": -1,
                    "created_utc": 1653902599.0,
                    "response": "so many different projects are being built on Ethereum.\n\nThe end for most of these projects comes when all their instamined tokens are sold.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iai3sd2",
                    "author": "jonog75",
                    "score": 0,
                    "created_utc": 1653880030.0,
                    "response": "You all are waaaay too smart for me.  Just tell me if the price will go back up?!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaiw14k",
                    "author": "WhatMixedFeelings",
                    "score": 0,
                    "created_utc": 1653899909.0,
                    "response": ">BTC seems a lot better for something like a digital version of a currency like the usd/gold \n\nPublic ledger is a disaster, imo. Global currency should be private, anonymous, like Monero.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaj0bmm",
                    "author": "towjamb",
                    "score": 0,
                    "created_utc": 1653903831.0,
                    "response": "With oracles, you can tokenize the value of ... anything, and freely buy, sell, trade, invest or collateralize. Mind-boggling potential.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaj104g",
                    "author": "Dannyf97",
                    "score": 0,
                    "created_utc": 1653904447.0,
                    "response": "There are many things I like about Ethereum, the recent biggest thing I’m looking forward too is in fact web3 innovation. I think the biggest thing is waiting on IPFS + Ethereum (other coins like filecoin ect..). It is currently used mainly for storing nft jpegs but there is a lot more opportunity. I have been researching the area for my company who are interested in publishing documents to a blockchain so they can be verified and certain nothing about the file has been changed. My only issue with my research currently is that IPFS is still new so its to stand the test of time and some innovation is needed to be certain the documents are stored forever. But the use case to being able store data without relying on a central company existing for 100s of years is interesting.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaj5zu2",
                    "author": "Exotic_Natural_4682",
                    "score": 0,
                    "created_utc": 1653908722.0,
                    "response": ">BTC seems a lot better for something like a digital version of a currency like the usd/gold\n\nno, not really - it has worse monetary policy, it has worse throughput, it shits up the environment, it doesn't integrate with web3/is not programmable/composable, its security is in question as issuance drops, etc.\n\nNarratives aside, ETH does everything BTC does, but just better",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajf8e0",
                            "author": "yolodogewtf",
                            "score": 1,
                            "created_utc": 1653915008.0,
                            "response": "BTC has a fixed supply, Eth does not.  \n\nPredictable limited supply is valuable \n\nIf you don’t believe me just look at golds value",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iajfkc0",
                                    "author": "Exotic_Natural_4682",
                                    "score": 2,
                                    "created_utc": 1653915204.0,
                                    "response": "The only \"\"\"valuable\"\"\" part is that it makes BTC more scarce\n\nETH has dynamic issuance, but the net effect is likely to be \\*deflation\\*, so again, better than whatever BTC has going on, because net effect is much less issuance than BTC.\n\nAnd this is before we start talking about BTC becoming more and more insecure as issuance drops, until at some point they'll have to make changes to supply, making this a moot point.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iajgpax",
                                            "author": "yolodogewtf",
                                            "score": 1,
                                            "created_utc": 1653915852.0,
                                            "response": "I don’t think BTC will replace fiat since it is deflationary \n\nDoesn’t mean that it won’t be very valuable and that countries and Individuals won’t want to diversify and hold BTC",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iajju3v",
                                                    "author": "Exotic_Natural_4682",
                                                    "score": 1,
                                                    "created_utc": 1653917582.0,
                                                    "response": "I mean you did say it was better as a currency comparing it to USD and gold. \n\n>Doesn’t mean that it won’t be very valuable and that countries and Individuals won’t want to diversify and hold BTC\n\nsure, but it's really mostly a narrative ponzi; functionally its simply a terrible version of ETH",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iajjxtt",
                                                            "author": "yolodogewtf",
                                                            "score": 1,
                                                            "created_utc": 1653917638.0,
                                                            "response": "It won’t replace all fiat \n\nIt will still be used in exchange for goods and services",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iajm450",
                                                                    "author": "Exotic_Natural_4682",
                                                                    "score": 1,
                                                                    "created_utc": 1653918775.0,
                                                                    "response": "...but why would ETH not just be the one to do that? It makes so much more sense, lol - its the de facto token of the most used blockchain network (meaning everything you can buy on web3 gets priced in ETH), it's used \\*way\\* more, has rollups to handle throughput and scale, doesn't shit on the environment, its programmable, and so on\n\nIf you stop taking BTC narratives at face value and actually start looking at what the two projects *are*, BTC makes \\*no sense\\*",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaj6q67",
                    "author": "hulkklogan",
                    "score": 0,
                    "created_utc": 1653909299.0,
                    "response": "Ether, the asset, will become something like a digital bond, but that bond can increase in value in addition to APR earned.  \n\nAfter the merge with PoS, staking rewards will increase.  Estimates are anywhere from 8-15%. That's clearly not a currency, but a security. You can comfortably stake and HODL your ETH while using stablecoins as currency.  \n\nETH's value is/will be derived from the chain being a shared global computer.  Applications built upon Ethereum have their own value, but because block space is scarce and users have to use Ether for gas, they also build demand and value for Ether.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaj93h6",
                    "author": "EKEEFE41",
                    "score": 0,
                    "created_utc": 1653911057.0,
                    "response": "Bitcoin is gold, eth is oil.\n\nThe analogy really works",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajg0mp",
                            "author": "yolodogewtf",
                            "score": 1,
                            "created_utc": 1653915469.0,
                            "response": "How is Eth oil?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iajaqx6",
                    "author": "305andy",
                    "score": 0,
                    "created_utc": 1653912197.0,
                    "response": "You're a soon to be Bitcoin maxi. Welcome to the club.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajg7a0",
                            "author": "yolodogewtf",
                            "score": 2,
                            "created_utc": 1653915572.0,
                            "response": "I’ve been on the BTC train for well over a year now \n\nBeen more skeptical of the full in BTC maxis, but also want to learn more before I make a final call or not. \n\nI mean, visa, Amex and stripe are all looking into Eth stuff too now…",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iajd4fz",
                    "author": "BlankEris",
                    "score": 0,
                    "created_utc": 1653913730.0,
                    "response": "speculative hopium, as evidenced by still trying to determine an use case 8 years later.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}