{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0wfw0",
            "title": "How Do Kwon, Terra could have set Ethereum, crypto industry at large back 10 years",
            "url": "https://cryptoslate.com/op-ed-how-do-kwon-terra-could-have-set-crypto-back-10-years/",
            "author": "blade818",
            "created_utc": 1653903204.0,
            "score": 319,
            "num_comments": 168,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iaj15t6",
                    "author": "Kira__________",
                    "score": 291,
                    "created_utc": 1653904591.0,
                    "response": "I really hate kwon. All these fucking moonbois ain’t helping either. Quit with the shitcoins already.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaj1qvq",
                            "author": "blade818",
                            "score": 63,
                            "created_utc": 1653905108.0,
                            "response": "100%",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iak1b0t",
                            "author": "doives",
                            "score": 30,
                            "created_utc": 1653925927.0,
                            "response": "Check out the Safemoon sub. People are still defending this scam. It's actually fascinating, as it gives quite a bit of insight in cult psychology.\n\nAfter the endless warnings, I can't feel bad for these people anymore.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iakvs00",
                                    "author": "NamisKnockers",
                                    "score": 4,
                                    "created_utc": 1653939652.0,
                                    "response": "Denial is a stage of grief",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ial0p8n",
                                    "author": "kshucker",
                                    "score": 3,
                                    "created_utc": 1653941990.0,
                                    "response": "I got in that shit when there were less than 1,000 people holding by pure dumb luck. I saw a very very pretty fiat number one morning. And then all downhill from there. Couldn’t stand that sub and “community” calling that one guy “papa” all the time. Ended up selling for a profit a few months ago and I’m pretty sure I’d still be in the green right now but if it wasn’t for coming across it by dumb luck early on, no fucking way would I hold any of it.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iaks2m0",
                                    "author": "DreadnaughtHamster",
                                    "score": -1,
                                    "created_utc": 1653937912.0,
                                    "response": "I have about 1% or 2% of my portfolio in SM, so barely anything and I’m not worried at all if it goes up or down. But just out of curiosity, what are some things you’ve heard about it being a scam?\n\nEdit: and for the record, it’s extremely unwise to yolo into anything that’s not BTC or ETH. Percentage-ing down with a varied portfolio can be way safer.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ialfpc2",
                                    "author": "fartknoocker",
                                    "score": -5,
                                    "created_utc": 1653949279.0,
                                    "response": "Safemoon is up 64% in the last 14 days while ETH is down 7%. I guess you don't like making money.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ialvd4n",
                                            "author": "kshucker",
                                            "score": 4,
                                            "created_utc": 1653957336.0,
                                            "response": "What’s the 3 month look like?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iajhdc3",
                            "author": "YuanJZ",
                            "score": 57,
                            "created_utc": 1653916231.0,
                            "response": "I work at one of the smaller exchanges and the amount of people who want to get rich off buying shitcoins is astounding. They just refuse to pick \"blue chip\" tokens like BTC and ETH and wonder why do their coins get rugged 90% within a few weeks post listing",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ial6qp7",
                                    "author": "Daikataro",
                                    "score": 10,
                                    "created_utc": 1653944852.0,
                                    "response": ">They just refuse to pick \"blue chip\" tokens like BTC and ETH and wonder why do their coins get rugged 90% within a few weeks post listing\n\nSOME, and I mean very few, actually know what they're risking and act accordingly.\n\nLet's say you throw 50 bucks each, at 10 dog shitcoins. 9 of them tank, 100% loss, you're 450 bucks in the red. One of them was Shiba Inu, your 50 bucks are now 10k, you're 9,500 in the green.\n\nSome people like lottery tickets.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iamf46c",
                                            "author": "user260421",
                                            "score": 1,
                                            "created_utc": 1653967706.0,
                                            "response": "Okay, but then they should stop complaining about the losses. It's a decision, no one forced them to invest in shitcoins.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iakgfgi",
                                    "author": "_m3r1u5_",
                                    "score": 36,
                                    "created_utc": 1653932597.0,
                                    "response": "\"Blue chip\" (in quotations) indeed. Because even that's essentially meaningless in crypto.\n\nHey, 50% down is better than 90% down, but \"blue chip\" is a little farfetched.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iakw4mk",
                                            "author": "abesWaves",
                                            "score": 7,
                                            "created_utc": 1653939818.0,
                                            "response": "Woah you can’t say that /s",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iamf0ym",
                                            "author": "user260421",
                                            "score": 2,
                                            "created_utc": 1653967653.0,
                                            "response": "My feelings towards eth are hurt, please apologize /s",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ial7gcy",
                                    "author": "Thezla",
                                    "score": -5,
                                    "created_utc": 1653945196.0,
                                    "response": "So tell me, how are you supposed to \"get rich\" buying ETH or BTC? You think those are gonna pump 50-100x? The people recommending people to only buy ETH or BTC are maxis who bought in early and already got their 100x or whatever.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ialh6yi",
                                            "author": "Avennite",
                                            "score": 5,
                                            "created_utc": 1653950025.0,
                                            "response": "Eth will likely go down to about 700 usd in this bear market. I get you're not going to be rich unless you have Tens of thousands of dollars to toss at it. This is why you look at other projects that have utility. Chainlink will likely hit 1 usd, it will also likely surpass its ath. So you can buy a good project with fundamentals in the bear market and still get your x100.  There are likely a few more projects like this. There is a difference between shib or some other meme trash and good projects.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iamey9j",
                                    "author": "user260421",
                                    "score": 1,
                                    "created_utc": 1653967609.0,
                                    "response": "Why is it astounding that so many people want to get rich quick? I mean the level of ignorance on this planet has reached new highs imho\n\nThey don't even know what the project they invested in is doing and I literally read about an *investor* in luna who didn't know what ust was \n\nI think they choose the investment based on the \"catchiness\" of the name",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iamflb1",
                                            "author": "YuanJZ",
                                            "score": 1,
                                            "created_utc": 1653967985.0,
                                            "response": "Apologies, I meant it in the context of really going for the shitcoins of the shitcoins. Like... Doge is a memecoin, and then theres Shibainu, and then theres King Shiba... then some random variation of dog....   \n\n\nAnd these tokens have funky tokenomics like more than 10% tax so they induce a slippery slope hostage feeling... basically red flags everywhere. Its just sad and painful to see that people who are poor and poorly educated get preyed upon by shitcoin founders whose main objective is to rug the moment they hit a certain market cap.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iajmo7w",
                                    "author": "Any-Nefariousness773",
                                    "score": -93,
                                    "created_utc": 1653919060.0,
                                    "response": "Lol Shiba Inu is a blue chip. Half you guys just don't understand that some of these shit coins are actually building stuff. The name of the coin has no reference to the quality of a project just like the cover of a book has no reference to the material inside the book.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iajnwy6",
                                            "author": "idiot382",
                                            "score": 32,
                                            "created_utc": 1653919683.0,
                                            "response": "What is Shiba Inu building? Honestly asking",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iajqpjl",
                                                    "author": "Any-Nefariousness773",
                                                    "score": -62,
                                                    "created_utc": 1653921046.0,
                                                    "response": "Are you kidding? They have many many real world partnerships like John Richmond, red bull and have ties to wellys fast food chain that will buy back 20% of shib with there earnings to burn shib. Also they have playside studios building a game that will earn you crypto back with nfts. They have there own Blockchain Shibarium coming this year with a layer 2 solution and bridge. You will be able to use bnb on the eth network through shibarium. They have a shi stable coin coming with 3 out of 5 tokens already available. One is a currency, one is a store of value and the third bone token is the gas for shibarium. They are taking crypto into the real world with real utility and changing the space for ever. Their layer 2 will be unique as their is no other layer 2 like the one that will launch with in a few months and lead this bear market. They have a life metaverse with land being sold as we speak. Shiba swap 1.0 took the world by storm and had more money locked than any other exchange to date. Shiba swap 2.0 will be even better as they will have better defi pools and also have tools for investing your business into the crypto space. This will be called shib financial ecosystem",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iajwnpd",
                                                            "author": "OfWhomIAmChief",
                                                            "score": 44,
                                                            "created_utc": 1653923828.0,
                                                            "response": "No offense but that sounds like a bunch of nonsense",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iakrt65",
                                                                    "author": "DreadnaughtHamster",
                                                                    "score": 6,
                                                                    "created_utc": 1653937787.0,
                                                                    "response": "I even have a little bit of shib, but yeah that’s nonsense. If shib does what doge did, it’ll just be happenstance. It’ll be fun, sure, to see it rise, but don’t believe that shib is some massive eth killer based on incredible math and blockchain fundamentals.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iam714k",
                                                                            "author": "LarryLovesteinLovin",
                                                                            "score": 3,
                                                                            "created_utc": 1653963309.0,
                                                                            "response": "All you need are enough bag holders to convince the next round of bagholders it’s worth.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iamb608",
                                                                                    "author": "DreadnaughtHamster",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653965477.0,
                                                                                    "response": "Hmmmm. That…makes a lot of sense. 🤔",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "iajyclo",
                                                                    "author": "Any-Nefariousness773",
                                                                    "score": -8,
                                                                    "created_utc": 1653924599.0,
                                                                    "response": "The layer 2 solution is a zk roll up. There will be 2 chains and gas fees will be fractions of a penny. Alot of you guys are just hating on the logo and can't see the tech behind this type of project. You're not thinking very objectively. The top 3-10 coins will always rotate in and out. This proves there is always going to be the next big token.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iakanpf",
                                                                            "author": "OTK22",
                                                                            "score": 10,
                                                                            "created_utc": 1653930048.0,
                                                                            "response": "Loopring already exists as a zKrollup layer 2 protocol on ethereum. They have real world partnerships and a patent for a decentralized stock exchange. Why are you shilling shib on an ethereum subreddit.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iakdgds",
                                                                                    "author": "Any-Nefariousness773",
                                                                                    "score": -1,
                                                                                    "created_utc": 1653931277.0,
                                                                                    "response": "I'm not shilling anything",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iakh3fr",
                                                                                            "author": "Optimal-Peanut7535",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653932898.0,
                                                                                            "response": "This guy clearly bought too much shiba and is in too deep lmaoo",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "ialeaq4",
                                                                                            "author": "Trixteri",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653948583.0,
                                                                                            "response": "you quite literally are..",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "ialghhp",
                                                                                            "author": "Repulsive-Ad3460",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653949667.0,
                                                                                            "response": "You sure, because it sounds like you’re on here shilling an Ethereum ERC 20 token, as an Ethereum killer. 🧐",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "ialwtgy",
                                                                    "author": "orielbean",
                                                                    "score": 1,
                                                                    "created_utc": 1653958077.0,
                                                                    "response": "It’s that hype marketing garbage that’s unprovable and yet breaking all the records.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "iajwydb",
                                                                    "author": "Any-Nefariousness773",
                                                                    "score": -9,
                                                                    "created_utc": 1653923962.0,
                                                                    "response": "That's okay. You will just have to miss out on the gains again before you believe in the project. Maybe you'll never believe in it. That's on you.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iake01h",
                                                                            "author": "korben2600",
                                                                            "score": 10,
                                                                            "created_utc": 1653931518.0,
                                                                            "response": "Yes, we're missing out on the memecoin that's down -87% from its ATH. The \"decentralized\" memecoin whose top 10 holders hold 64% of its supply. Whose top 50 holders hold 80% of its supply. The memecoin where just 16% of holders have held longer than a year.\n\nThat's the crypto that's gonna flip ETH and BTC with its long term success, right? What even separates it from any other memecoin like doge?\n\nYou sound exactly like every other cryptobro that's invested way too much into their coin of choice and must continue try to prove it to themselves that it's still a good investment. Good luck, I guess.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iam513l",
                                                                                    "author": "Any-Nefariousness773",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653962273.0,
                                                                                    "response": "Funny because half of the BTC supply is held by 2224 wallets that hold over 1000 BTC each and yet you wanna call out another coin for the same exact thing hmmm funny how that works.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "iakejue",
                                                                                    "author": "Any-Nefariousness773",
                                                                                    "score": -3,
                                                                                    "created_utc": 1653931764.0,
                                                                                    "response": "Bro it's an ecosystem not just a coin. Luck is the crossroad where preparation meets opportunity.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iakr9sz",
                                                                                            "author": "roox911",
                                                                                            "score": 5,
                                                                                            "created_utc": 1653937530.0,
                                                                                            "response": "> meme is the meme where meme meets meme",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "ialgomy",
                                                                                            "author": "Datejust44",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653949769.0,
                                                                                            "response": "!RemindMe 1 year „laugh on OP“",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "iajr6vb",
                                                            "author": "idiot382",
                                                            "score": 21,
                                                            "created_utc": 1653921276.0,
                                                            "response": "No, I'm not kidding, I haven't researched Shiba much because I've never heard the value of it explained beyond hype.\n\nYou did list a lot of stuff but it all sounds incredibly complicated - what does it offer that's different than what other coins or chains are already doing well? Not arguing with you but it still reads like a lot of hype and not much innovation to me.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iajrth2",
                                                                    "author": "Any-Nefariousness773",
                                                                    "score": -14,
                                                                    "created_utc": 1653921574.0,
                                                                    "response": "Yes it is due to them actually taking there time with the ecosystem. Alot is not out yet but coming this year. Its an ecosystem all the token support the other token and projects. Alot is not clear yet! Like how holding there store of value token will benefit you. As I've been holding there store of value token leash and it's hit $10,000 twice now but it sits at $450 today. Still haven't sold as I'm waiting on utility and massive gains. I'm still accumulating all the tokens they pump together so it's a win win win situation.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "iajs81s",
                                                                    "author": "Any-Nefariousness773",
                                                                    "score": -13,
                                                                    "created_utc": 1653921764.0,
                                                                    "response": "Just do some research of the shib financial ecosystem. It's a platform for you to build your business on the black chain.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iajscrv",
                                                                            "author": "idiot382",
                                                                            "score": 3,
                                                                            "created_utc": 1653921826.0,
                                                                            "response": "Aye aye, thanks man",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iajt4ju",
                                                                                    "author": "Any-Nefariousness773",
                                                                                    "score": -6,
                                                                                    "created_utc": 1653922187.0,
                                                                                    "response": "Shiba went up 50,000 % in a year solidifying it's #16 spot by market cap proving it's worthy of more than a meme coin. The devs set out to shock the world and create something real. This year alot of that will finally be revealed. I wish shytoshi will reveal him self though.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iak8iwy",
                                                                                            "author": "Big-Economy-1521",
                                                                                            "score": 13,
                                                                                            "created_utc": 1653929106.0,
                                                                                            "response": "Sorry but everything you’re saying is just screaming “memecoin” I know it’s upsetting to you as an investor but the way you’re talking here cements these instincts even more. Good luck.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "iak9l31",
                                                                                            "author": "PsychedelicHell",
                                                                                            "score": 5,
                                                                                            "created_utc": 1653929574.0,
                                                                                            "response": "If only you put your 'research' and money into ETH instead.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "ial8okg",
                                                                                            "author": "Death_Strider16",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653945795.0,
                                                                                            "response": "Did you know he went back and deleted all of his tweets and blog posts recently? That sounds like he's trying to disappear even more",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "ialfxet",
                                                            "author": "Repulsive-Ad3460",
                                                            "score": 1,
                                                            "created_utc": 1653949390.0,
                                                            "response": "Ha ha 😂 you tripping",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ial460y",
                                            "author": "Emperors_Finest",
                                            "score": 3,
                                            "created_utc": 1653943630.0,
                                            "response": "Shiba Inu only existed to try and take momentum out of doge (which atm is doing ok and pretty stable). \n\nOn top of that, the creator of Shiba Inu just nuked his social media and replaced it with some Bhuddism or hindu thing for possibly a new scam token. It's Ogre.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ialfswd",
                                            "author": "Repulsive-Ad3460",
                                            "score": 1,
                                            "created_utc": 1653949327.0,
                                            "response": "Lol 😆 fool",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iak3xfj",
                            "author": "yorickdowne",
                            "score": 4,
                            "created_utc": 1653927092.0,
                            "response": "Shitcoins are quitting already. 🍿",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iakgnvu",
                            "author": "_m3r1u5_",
                            "score": -4,
                            "created_utc": 1653932703.0,
                            "response": "So what you're saying is that the US and Europe should follow China's lead and ban or severely restrict cryptocurrency so blockchain tech can actually thrive relatively free of scams?\n\nhttps://forkast.news/how-blockchain-technology-shaking-up-courtrooms-asia/",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ial6ewu",
                            "author": "Daikataro",
                            "score": 0,
                            "created_utc": 1653944696.0,
                            "response": ">All these fucking ~~moonbois~~ LUNAtics ain’t helping either.\n\nYou're thinking Safemoon, which is a different type of Ponzi.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iajkfdh",
                    "author": "rorykoehler",
                    "score": 36,
                    "created_utc": 1653917898.0,
                    "response": "They're not setting crypto back at all because this level of shithousery comes with the territory.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajoccg",
                            "author": "idiot382",
                            "score": 4,
                            "created_utc": 1653919896.0,
                            "response": "People that lost life savings in Luna probably won't be back ever. A lot of scared money left the market because of the UST fiasco. It will take time to bring that money back",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iak5n63",
                                    "author": "Environmental-Kiwi78",
                                    "score": 8,
                                    "created_utc": 1653927845.0,
                                    "response": "You have a scarcity mindset. Nobody gives a shit about retail investors who lost money. \n\nThere’s ample amounts of new parties who will adopt as the market, and infra matures. People being salty and bailing are only hurting themselves further after getting knocked down.\n\nDumb",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iak8ubt",
                                            "author": "idiot382",
                                            "score": 3,
                                            "created_utc": 1653929248.0,
                                            "response": "Wasn't saying what anyone should or shouldn't do. But whether you like it or not, or admit it or not, scams are bad for adoption and retention in crypto, and in pretty much any product category. Shouldn't be that hard to agree with.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iakkfo5",
                                                    "author": "Environmental-Kiwi78",
                                                    "score": -1,
                                                    "created_utc": 1653934409.0,
                                                    "response": "You arent getting what im saying. \n\nScam or no scam, the general trend stays the same. \n\nIf there’s a huge global ban, that causes all crypto to die — sure. Follow up and throw your tomatoes at me. Otherwise, its all part of the ride.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iakmm83",
                                                            "author": "idiot382",
                                                            "score": 1,
                                                            "created_utc": 1653935393.0,
                                                            "response": "Okay, so do you think the UST catastrophe didn't turn away any prospective new investors and won't be used as an example of why not to get into crypto? Because that's really all I'm saying here.\n\nIt sounds like you think that my point is that crypto will die out at some point or that there will be a crypto winter that lasts for years. Just to be clear, that's not what I'm saying...I still hold all of my coins.\n\nMy point is that scams slow down adoption, ergo setting back the crypto industry, which is what this comment thread was about. There are literally thousands of FUD articles written about these scams, those articles turn a percentage of prospective entrants away or slow their entry to the market, ergo setting back the crypto industry's pace of growth. Businesses went bankrupt due to Luna/UST, so it's very likely that other business that are considering building around/with crypto tech & partners will reconsider their approach, timelines, or even their entry to the market altogether right now. This would set back crypto's adoption timeline as well.\n\nI don't know how to break it down any simpler for you so hopefully that makes sense. No tomatoes, I think we're just having two different conversations. Cheers",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iakq6xf",
                                                                    "author": "Environmental-Kiwi78",
                                                                    "score": 0,
                                                                    "created_utc": 1653937025.0,
                                                                    "response": "You still arent getting it. \n\nWhile your statement is true, you are missing the forest for the trees",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iaktbkg",
                                            "author": "Oldcadillac",
                                            "score": 1,
                                            "created_utc": 1653938496.0,
                                            "response": "> Nobody gives a shit about retail investors who lost money.\n\nTo quote Samwise Gamgee in the Two towers film:\n\n“Don’t you know who you sound like!?!”",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ial3h0u",
                                                    "author": "Environmental-Kiwi78",
                                                    "score": 1,
                                                    "created_utc": 1653943300.0,
                                                    "response": "Im a jaded retail investor whos done well in this market.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iamf6rr",
                                            "author": "cylemmulo",
                                            "score": 1,
                                            "created_utc": 1653967749.0,
                                            "response": "I'd say my view is moreso, big scams bring attention and not usually attention that will be good for your wallet. Whether it's regulations or whatever else. Big difference between btc dropping and people losing money thank a guy running a Ponzi scheme gets away with it then does a pump and dump immediately after.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ialb8xv",
                                    "author": "Layer_4_Solutions",
                                    "score": 1,
                                    "created_utc": 1653947062.0,
                                    "response": "Frankly, anyone who put money into Luna is fairly dumb and was going to lose that money at some point regardless.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iald182",
                                    "author": "SnarkyZK",
                                    "score": 1,
                                    "created_utc": 1653947958.0,
                                    "response": "People dumb enough to invest in terra would rventaully lose there money anyway.\n\nIn a way, it's a good thing for the ecosystem they lost money because it means less dumb money pushing for unsafe practices.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iajtf8p",
                                    "author": "Burns__",
                                    "score": 0,
                                    "created_utc": 1653922324.0,
                                    "response": "I do not hold Luna but due the market crash because of Luna my portfolio is down by alot, been in crypto since 2019 and now I can't wait to get out of it. \n\nMy biggest regret was supporting the scene instead of taking profit.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iak77zj",
                                            "author": "ItsAConspiracy",
                                            "score": 3,
                                            "created_utc": 1653928530.0,
                                            "response": "I'm sure LUNA contributed but the stock market has been crashing too. Crypto is going down with it, just like it did in spring 2020.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaj7kpe",
                    "author": "No_Mastodon_34",
                    "score": 9,
                    "created_utc": 1653909935.0,
                    "response": "I’d love to be back in 2012",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajtnna",
                            "author": "billyfudger69",
                            "score": 7,
                            "created_utc": 1653922435.0,
                            "response": "Yeah I would have CPU mined Bitcoin. :/",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iakklth",
                                    "author": "korben2600",
                                    "score": 6,
                                    "created_utc": 1653934487.0,
                                    "response": "But would you have sold at $1? $10? $1000? $10k? $50k?\n\nI like to think I'm the type of person that would've held onto a huge nestegg through the ups and downs, the multiple year long bear markets. Truth is, I probably would've been like the majority of people and cashed out super early. Crypto sentiment was really, really bleak at some points in its history.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iakme24",
                                            "author": "billyfudger69",
                                            "score": 2,
                                            "created_utc": 1653935293.0,
                                            "response": "Honestly I have no clue but so far I haven’t sold any of the Bitcoin I received from mining through NiceHash, I’m not a cryptocurrency trader or investor rather I’m just a person who finds Bitcoin neat. (I don’t have any accounts to buy/sell cryptocurrency.)\n\nWhen I was younger I knew about Bitcoin when it was at $300 but I didn’t do anything with this knowledge and I continued on with my life to later find out it’s at $65-70K, oh well. I also knew about Ethereum before the mining boom in 2017 and yet again I didn’t do anything with that knowledge because I didn’t see what Ethereum’s use case was at the time, now I know.\n\nDo I regret early on missing two very interesting blockchain currencies? Maybe a little bit but at the same time I don’t dwell on the fact I missed them but it does make an interesting story to tell to newer people.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaj3fpm",
                    "author": "coinfeeds-bot",
                    "score": 6,
                    "created_utc": 1653906604.0,
                    "response": "tldr; The collapse of Terra could be the last opportunity for the old guard to make a play for control over digital assets such as cryptocurrencies and NFTs. Terra’s collapse wiped out over $30 billion from the combined market cap of crypto. Now, just weeks after this devastating event, a new blockchain named LUNA has launched with a fully diluted $5.8 billion market cap.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajumh0",
                    "author": "account4cryptopostin",
                    "score": 23,
                    "created_utc": 1653922888.0,
                    "response": "This whole thing was completely avoided by people with half a brain. \n\nI feel for people who were greedy and lost money they couldn't afford to lose, but tuition at the school of hard knocks is expensive.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak6t1e",
                    "author": "EricC137",
                    "score": 11,
                    "created_utc": 1653928349.0,
                    "response": "How did Terra have anything to do with Ethereum?? It is a separate blockchain and had no affect on ethereum at all. To say this event slowed crypto adoption when prices and new user metrics have been falling for 7 months straight is just bad reporting. And set back 10 years?!? Dude, put down the crack pipe and take off the tin foil hat. TerraLuna’s collapse barely even made a splash in the pond. That was the craziest thing about it. A 10 billion dollar platform wiped out overnight and the only people that got wrecked were over-risked moonbois. Soooo many people (including myself) called the UST crash a month or more ahead, I can provide proof from twitter if you guys want to see it",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaklopb",
                            "author": "korben2600",
                            "score": 3,
                            "created_utc": 1653934972.0,
                            "response": "It was plain to see that it was unsustainable. What rational person thought 20% APR was reasonable? Compounding that rate, you've doubled your money in less than 4 years. For just staking cash? Come on.\n\nFor those with means cash has been cheaper than ever. Look at the Fed's reverse repo book sitting at $2 trillion. Institutions could get cash for essentially 0%. Why would they need to borrow from retail at 20%? Too good to be true as they say.\n\nEven Vitalik said as much: [No genuine investment has a 20% return each year](https://www.bloomberg.com/news/articles/2022-05-26/ethereum-founder-buterin-blasts-defi-model-in-terra-critique)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaky5f0",
                                    "author": "EricC137",
                                    "score": 2,
                                    "created_utc": 1653940768.0,
                                    "response": "Yea the 20% APY plus using bitcoin as a backing when it was near all time highs was just a recipe for disaster. I was pretty vocal on Twitter about the potential fiasco if the bitcoin collateral drops in value and the stable coin becomes under-collateralized and sure enough it happened",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ialcppn",
                            "author": "KingLeo23",
                            "score": 1,
                            "created_utc": 1653947795.0,
                            "response": "It came close. Their plan with FRAX to create the 4pool on curve would likely have outcompeted 3pool which is a major source of liquidity for a lot of DeFi projects. I think the whole ecosystem got lucky the tumor got excised when it did prior to further metastasis.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaj2qe4",
                    "author": "whyNadorp",
                    "score": 60,
                    "created_utc": 1653905989.0,
                    "response": "I'm not sure about this article. I think it could be the opposite actually. hopefully the luna shitshow will bring more regulations. I enjoy innovation and such, but since there's no way to distinguish between scammers and irresponsible developers, then just make people accountable for what they do. it will raise the costs, but hopefully avoid catastrophes like luna.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajp88t",
                            "author": "NekkerBE",
                            "score": 18,
                            "created_utc": 1653920333.0,
                            "response": "Wasn’t the whole point crypto being anti-regulation and decentralised?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iakjtz7",
                                    "author": "korben2600",
                                    "score": 11,
                                    "created_utc": 1653934134.0,
                                    "response": "So, from my perspective, as someone who's watched and used crypto since 2016, the crypto community has fractured into three disparate groups:\n\n* the originalists who argue crypto should maintain its decentralized nature (Monero probably being the biggest proponent of this group)\n* those looking to transform crypto into more than just electronic currency (Ethereum probably carrying the biggest support in this respect)\n* speculators chasing profits who don't care either way\n\nIt appears to me Ethereum is looking to be the platform that \"legitimizes\" crypto into something that has real world uses outside of drug sales, money laundering, and global remittance. And it seems that NFTs will largely enable this transformation.\n\nAnd not the NFTs we've seen so far with overpriced monkey-themed art pieces as vehicles for money laundering. Think games with collectible trading cards like Illuvium or getting a temporary, transferrable NFT to your hotel room that [unlocks the door](https://twitter.com/blockworks_/status/1482404012758638598) and allows access to services like the minibar. These are the more legitimate ideas that will allow crypto to expand into something bigger than its ever been.\n\nWill people continue to argue that crypto should remain decentralized and outside the purview of the law? Yes, and privacy coins like Monero will likely continue to exist regardless of regulatory oversight. But its clear that the future of crypto where it continues to see wider and wider adoption (and thus price growth) is through its more legitimate aims.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ialm8cf",
                                            "author": "InfiniteState",
                                            "score": 1,
                                            "created_utc": 1653952600.0,
                                            "response": "This doesn't make any sense. Ethereum cares **a lot** about decentralization. If it's not decentralized, why bother running it on a blockchain? Just spin up an AWS node with an EVM.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iam07y5",
                                            "author": "Ok-Nefariousness1340",
                                            "score": 1,
                                            "created_utc": 1653959815.0,
                                            "response": "Legitimate aims aren't incompatible with basic autonomy and privacy. Without permissionlessness, you might as well go back to centralized systems, there is just about zero value to the sort of project you're describing over a widely adopted mobile app if the blockchain version is subject to central control anyway.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iajr2aj",
                                    "author": "whyNadorp",
                                    "score": 3,
                                    "created_utc": 1653921215.0,
                                    "response": "Yeah, it used to be a selling point. Some crypto like btc and monero is still going in that direction, some other crypto is just going in the general direction of “intelligent money”. Anyway more regulation means more costs but more guarantees also, so it’s not necessarily bad. The far-west is nice for a while but in the long term not many want to have to shoot a gun just to do some day to day operation. Also there’s no way to oppose regulations (out of getting politically active), sooner or later they’re coming.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iajvr59",
                                            "author": "shim__",
                                            "score": 1,
                                            "created_utc": 1653923410.0,
                                            "response": "Smart contracts provide guarantees, government agencies introduce risk.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iak7ls2",
                                    "author": "ItsAConspiracy",
                                    "score": 2,
                                    "created_utc": 1653928699.0,
                                    "response": "Yeah but a stablecoin indexed to fiat is a bridge between crypto and centralized legacy systems, pretty much by definition. If we want full unregulated decentralization, we should go ahead and use ETH as currency.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iaj5zw2",
                            "author": "blade818",
                            "score": 3,
                            "created_utc": 1653908724.0,
                            "response": "It's a valid point - my worry is that regulation will now be easier to come through with a centralized focus. crypto needs to mature sure, scammers need weeding out definitely, but does this not just give CBDCs a quicker route to take a hold on the industry?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iajf5xw",
                                    "author": "mcsnoogins",
                                    "score": 5,
                                    "created_utc": 1653914968.0,
                                    "response": "There will always be countries with lax regulations compared to others",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iajin4x",
                                    "author": "mcsnoogins",
                                    "score": -1,
                                    "created_utc": 1653916938.0,
                                    "response": "There will always be countries with lax regulations compared to others",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iajyevz",
                                    "author": "Remarkable-Hall-9478",
                                    "score": 1,
                                    "created_utc": 1653924627.0,
                                    "response": "The decentralized ethos would say the individuals in the network need to be independently resilient to scams. \n\nBut crypto culture is about literal Ponzi schemes all day every day to “drive adoption”. Widescale adoption in this example is literally ponzi’ing to the maximum degree, making sure that you as an early “investor” get gigantic returns at the expense of the most number of people — those people which are necessary pawns in order to make profits. \n\nBecause of this, and the fact that everyone is so desperate to swindle someone else out of money, the majority of this space is filled with flat-out idiots that have no business in a technical industry whatsoever. Average Joe MFers that don’t know the first thing about opsec, investing, computer science, economics, fucking any of it. The space is now riddled with morons that are just trying to cash out and act smart. It’s equivalent to pollution in the community and it’s these dumb MFers that are buying stuff like Luna and Verge and any number of stupid scam bullshit. \n\nTheir presence in the ecosystem is a drag on progress of all forms, and they should not be welcome, but they bring money and that’s what this whole space is about now. There are very very very few if any actually impactful projects that aren’t really just some elaborate plot to make the founders rich while maybe, possibly, occasionally, incidentally delivering something that improves the world.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iaj42k3",
                            "author": "mat0c",
                            "score": 33,
                            "created_utc": 1653907151.0,
                            "response": "Agreed. Imagine the Luna implosion instead came in 10 years time, enabled by a lack of regulation, and then destroyed trillions of dollars of value rather than billions.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ial0yl8",
                                    "author": "bastardicus",
                                    "score": 4,
                                    "created_utc": 1653942111.0,
                                    "response": "The point is moot. No ponzi can run that long with the returns luna was offering.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iaj60vd",
                                    "author": "blade818",
                                    "score": 5,
                                    "created_utc": 1653908744.0,
                                    "response": "this is a very good point!",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iajbvjr",
                                    "author": "AbbreviationsLevel73",
                                    "score": 1,
                                    "created_utc": 1653912937.0,
                                    "response": "bro, if luna was ar trillions valuation they could have never brought it down, they killed it when luna got to the appropriate size, it was just about right, btw all algo stablecoins fail because of human nature,",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iajh7vb",
                                            "author": "PinkPuppyBall",
                                            "score": 15,
                                            "created_utc": 1653916144.0,
                                            "response": "It was never going to work because it was an actual ponzi scheme. It couldn't get \"too big to fail\", that was just part of the lies from kwon.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iajv7fp",
                                                    "author": "RecommendationNo6041",
                                                    "score": -5,
                                                    "created_utc": 1653923155.0,
                                                    "response": "With more liquidity on curve on that day, a depeg could not have been so easily triggered.\n\nThe timing of the attackers was immaculate. The perfect heist.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iakhyuy",
                                                            "author": "PinkPuppyBall",
                                                            "score": 5,
                                                            "created_utc": 1653933293.0,
                                                            "response": "This is undermining what actually happened. A huge ponzi scheme collapsed. The 4pool was never going to make up for the fact that UST was printing from LUNA which had fundamentally no value. It wasnt an attack. The heist was kwon making away with billions.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iakj14a",
                                                                    "author": "RecommendationNo6041",
                                                                    "score": 1,
                                                                    "created_utc": 1653933775.0,
                                                                    "response": "So if the token of a growing Top10 crypto ecosystem has no „fundamental value“ - what coin has?\n\nTokenomics and relations between Luna and Ust were well-described. People took the risk. I strongly hesitate to call this a scam.\n\nDisclaimer: I probably lost more than most and still don‘t feel scammed by Kwon, no matter his personality traits.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "ial1209",
                                                            "author": "bastardicus",
                                                            "score": 2,
                                                            "created_utc": 1653942158.0,
                                                            "response": "Source: your ass?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ial45uf",
                                                                    "author": "RecommendationNo6041",
                                                                    "score": -2,
                                                                    "created_utc": 1653943628.0,
                                                                    "response": "Read up you moron. Forensics have been conducted by now.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iajl6d3",
                                            "author": "HEX_helper",
                                            "score": 4,
                                            "created_utc": 1653918291.0,
                                            "response": "Not if they are over collateralised",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iajx9u7",
                                                    "author": "AbbreviationsLevel73",
                                                    "score": 5,
                                                    "created_utc": 1653924105.0,
                                                    "response": "then thats not an algo stable",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iak2dp6",
                                                            "author": "HEX_helper",
                                                            "score": 1,
                                                            "created_utc": 1653926407.0,
                                                            "response": "What would you call it then?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iakdko7",
                                                                    "author": "AbbreviationsLevel73",
                                                                    "score": -1,
                                                                    "created_utc": 1653931329.0,
                                                                    "response": "a con",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iam8k8l",
                                                                            "author": "brokebuffett",
                                                                            "score": 1,
                                                                            "created_utc": 1653964102.0,
                                                                            "response": "A Kwon job?",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iam2z3n",
                                    "author": "songbolt",
                                    "score": 1,
                                    "created_utc": 1653961227.0,
                                    "response": "in less than 10 years time billions of dollars today will already be worth trillions [at the rate we're going](https://fred.stlouisfed.org/series/M1SL) ...",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iallq03",
                            "author": "InfiniteState",
                            "score": 2,
                            "created_utc": 1653952334.0,
                            "response": "Why do we need more regulations? What Do Kwon is already illegal in the US, Singapore, and Korea, and he's being investigated and will likely face charges in all three countries.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaj37bd",
                            "author": "WhatBands",
                            "score": 3,
                            "created_utc": 1653906398.0,
                            "response": "I was thinking the same thing. Regulators have already been looking into crypto but now they have a forcing action against them which was the collapse of Luna. After there is regulation in place that will accelerate crypto like never before.  I believe the crash of Luna accelerated Crypto into the future.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iakdjmq",
                            "author": "cryptosperm",
                            "score": -1,
                            "created_utc": 1653931316.0,
                            "response": "Is the move to POS begging for ETH to face regulation?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iakhd3i",
                            "author": "truesoul42",
                            "score": 1,
                            "created_utc": 1653933018.0,
                            "response": "I keep hearing this, \"hopefully it brings regulation\". What sort of regulation do you think can stop anonymous scams (not talking about Luna). I'm actually curious, do you have any high level examples of regulations you would like to see implemented?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iakvvqx",
                            "author": "Thomas5020",
                            "score": 1,
                            "created_utc": 1653939701.0,
                            "response": "Mmm yeah that's just what we need the government getting involved!!\n\nThe same government that would love to wipe crypto from the face of the earth or tax is 99.99%. \n\nYeah that'll go well for us won't it. The whole point is unregulated and unrestricted. Why does everyone constantly beg big government to clamp down on crypto?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ialb2r3",
                            "author": "Layer_4_Solutions",
                            "score": 1,
                            "created_utc": 1653946976.0,
                            "response": "Regulation makes it hard for new, small players to enter the market.\n\nIt also isn't effective in an international crypto system. The US can restrict what US devs do, but not what developers  in China or Russia do.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iam6yz9",
                            "author": "superworking",
                            "score": 1,
                            "created_utc": 1653963278.0,
                            "response": "The push was already on and the Tether battles were well known. I think people are vastly overestimating how much this one network being a shit show has done to a space that was already seeing massive changes and growing government intervention.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iamesh0",
                            "author": "cylemmulo",
                            "score": 1,
                            "created_utc": 1653967512.0,
                            "response": "Not disagreeing with maybe some regulation and definitely consequences. But there are definitely ways to tell if people are scamming for a lot of them. if there's some 18% interest you should assume its a scam.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iajxhgs",
                    "author": "ZER0GR4V1TY420",
                    "score": 3,
                    "created_utc": 1653924204.0,
                    "response": "What about all the dumb people who supported him and advertised his coins? He is a grifter obviously but lots of people did this to themselves and the crypto space.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iak65ir",
                            "author": "Environmental-Kiwi78",
                            "score": -13,
                            "created_utc": 1653928065.0,
                            "response": "I supported him, and to some extent still do. \n\nHes not a grifter — just arrogant and blunt. I respect his ability to tell people to fuck off. This space is hard as fuck to do anything, and most projects will fail. At least he pushed the line and inspired a ton of new ideas, dApps in the space that will live on past the simple algostable.\n\nIf you dont like it, dont use the protocol. Pretty simple.\n\nAs far as advertising, I dont feel bad at all for anyone who read my comments and opinions and made their own decisions. I dont give financial advice, just share information. People need to make their own decisions.\n\nFeel bad for ppl that lost money, but suck it up and learn to not overinvest.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iakewh8",
                                    "author": "Zanena001",
                                    "score": 9,
                                    "created_utc": 1653931922.0,
                                    "response": "Do you realize his \"ability\" is what lead to his demise? Having a hard skin and ignoring feedback are completely different things. You support someone who has caused many suicides and lost people their lifesavings and hasn't even said a word about it, if you check his Twitter he is still behaving like nothing major happened.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iakk52n",
                                            "author": "Environmental-Kiwi78",
                                            "score": -2,
                                            "created_utc": 1653934275.0,
                                            "response": "Socially maybe, but its hard to directly equate causation without adding in bias for a logical narrative. \n\nSuicides are self inflicted. There was no direct target for cyberbullying or abuse. Good luck holding up any suits in court. \n\nBlock his twitter then. I dont get the incel rage this has caused. Really. Ive been a luna bull for so long, and lost a chunk myself, but you dont see me bitching about it. \n\nShit happens.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iakm1iq",
                                                    "author": "Zanena001",
                                                    "score": 1,
                                                    "created_utc": 1653935134.0,
                                                    "response": "It's not about proving it in court, its about being human and feeling sorry for someone who was so devastated he decided to take his own life. We are not talking about future degens here, but people who where promised APY on a \"stablecoin\".\n\n>I dont get the incel rage this has caused\n\nFor me it's not rage, but loathing.\n\n>lost a chunk myself, but you dont see me bitching about it\n\nMaybe you haven't lost enough or you don't need those money as much as those people.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iakq1lt",
                                                            "author": "Environmental-Kiwi78",
                                                            "score": 1,
                                                            "created_utc": 1653936955.0,
                                                            "response": "There are no such things as free lunch.\n\nI made sure I didnt fuck around with money I couldnt afford to lose. We all had the same options available, and the same information.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iajnuyt",
                    "author": "silverfox_g",
                    "score": 9,
                    "created_utc": 1653919655.0,
                    "response": "$ rm * Do Kwon *",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajpbl4",
                            "author": "saggy777",
                            "score": 9,
                            "created_utc": 1653920379.0,
                            "response": "You forgot -rf",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaktwog",
                                    "author": "awesomeplenty",
                                    "score": 2,
                                    "created_utc": 1653938771.0,
                                    "response": "Sudo",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ial5q47",
                                            "author": "NewChallengers_",
                                            "score": 1,
                                            "created_utc": 1653944372.0,
                                            "response": "sudo cp (LUNAmktcp*6,000,000,000,000) -r",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ial7516",
                                    "author": "AlphaGainzzz",
                                    "score": 1,
                                    "created_utc": 1653945044.0,
                                    "response": "Sudo rm -rf Do\\_Kwon",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iakdih4",
                    "author": "AndyBonaseraSux",
                    "score": 2,
                    "created_utc": 1653931302.0,
                    "response": "“It’s not there to protect you, it’s there to protect you”\nWhat does that even mean",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakfwj9",
                    "author": "Sea_Arrival_6107",
                    "score": 2,
                    "created_utc": 1653932367.0,
                    "response": "Bear market exposed all shitcoins",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ial54pa",
                            "author": "Emperors_Finest",
                            "score": 2,
                            "created_utc": 1653944085.0,
                            "response": "To be honest, if the crypto market cut down to just lile the top 20 crypto currencies (stable coins don't count) I think it would be healthier for the market.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iakho7v",
                    "author": "SAnthonyH",
                    "score": 2,
                    "created_utc": 1653933158.0,
                    "response": "He crashed the eth price just before the merge, and removed a coin from the market completely, freeing up Ethereum to gain more room to grow and get a larger MC post merge,  potentially increasing my wealth after I was able to buy the dip. \n\nI will forever be grateful to that evil magnificent bastard.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakj1m3",
                    "author": "krepkiyoreshek2",
                    "score": 2,
                    "created_utc": 1653933781.0,
                    "response": "So more time to accumulate",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakn536",
                    "author": "dantebayer",
                    "score": 2,
                    "created_utc": 1653935627.0,
                    "response": "In 2009, Bernie Madoff lost investors $60 billion. He was sentenced to 150 years in prison.\n\nIn 2022, Do Kwon lost investors $60 billion after Luna collapsed to $0. He then created Luna 2.0",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaksuoh",
                    "author": "offthewall1066",
                    "score": 2,
                    "created_utc": 1653938279.0,
                    "response": "Lol, 10 years. 1 year in crypto is like 10 years in any other industry. Not gonna listen to some random website making a 100 year proclamation",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakw6yt",
                    "author": "F0rtysxity",
                    "score": 2,
                    "created_utc": 1653939848.0,
                    "response": "Do they mean 10 human years or 10 crypto years?\n\n10 crypto years is like 2 human months. And 10 human years means this won’t recover until the year 2945.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakwxy0",
                    "author": "Late_Yak9855",
                    "score": 2,
                    "created_utc": 1653940199.0,
                    "response": "Kwon might have ruined reputation not knowingly for so many projects. This can affect eth obviously and especially projects like CCD that are working hard to implement crypto to the masses.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialeqyi",
                    "author": "DrGarbinsky",
                    "score": 2,
                    "created_utc": 1653948809.0,
                    "response": "It wasn't just Do Kwon. It was Kwon and thousands of morons that thought an algorithmic stable coin was a good idea.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajxpgj",
                    "author": "Mallardshead",
                    "score": 1,
                    "created_utc": 1653924306.0,
                    "response": "Nobody is adopting \"crypto\". Crypto is a scam. They may adopt bitcoin which is not \"crypto\". Do Kwon is a natural continuation of that whole scammy space. There have been plenty before him and there will be plenty after. Nobody learns. Look at LUNA 2.0. What we need is regulation. Eliminate shitcoins like ETH e al by designating them what they are: securities. There is bitcoin and there is crypto. Crypto is a scam.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakbry6",
                    "author": "Fheredin",
                    "score": 1,
                    "created_utc": 1653930539.0,
                    "response": "I am in the middle of writing a blog post/ pseudo-whitepaper explaining why and how to redeem Luna Classic. It's not impossible (but it's not free or instant, either). TL;DR: You need a multi-component algorithm. Use arbitrage as a short-term price trimtab and use a permanent income stream to bleed excess liquidity off and to adjust the macro price. \n\nI think that crypto is an exceedingly judgey community. The attitude that everything is a shitcoin is exactly why we have so many shitcoins; it's easier to discard a broken project and fork off make a new one (which usually becomes another terrible project) than it is to fix a broken project. But the real lessons which make the community grow involve looking a hard problem in the eyes and doing the hard work to fix it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakubbj",
                    "author": "xiwefe2",
                    "score": 1,
                    "created_utc": 1653938962.0,
                    "response": "HE should not been allowed to enter crypto + a complete review of his business would be a nice start te show this multi $billion scammer that he sucks..luckily if in the future every startup in crypto would go with AngelBlock fundraising we can get rid of greedy VC's once and for all..democratizing is the only true solution imo. Got their NFTs just cuz of the use cases,innovative..reveal today",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ial0ffr",
                    "author": "Odd_Ad7489",
                    "score": 1,
                    "created_utc": 1653941861.0,
                    "response": "I hope that this is not the case, not all projects have to fail only because terra had bad leadership. There are projects that are focused on solving different issues and some have privacy in mind like CCD that have alot in the works, and i really hope market recovers soon.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ial0ww0",
                    "author": "JP4G",
                    "score": 1,
                    "created_utc": 1653942089.0,
                    "response": "Do Kwon moved the industry forward by forcing the topic of algorithmic stablecoins at investor and provincial tables alike. The trial by fire decentralized computing must face was never going to be easy. Plus side is a lot of market froth is being suffocated",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ial2tvr",
                    "author": "chester21469",
                    "score": 1,
                    "created_utc": 1653942996.0,
                    "response": "Poop",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ial5277",
                    "author": "Cecilia_Wren",
                    "score": 1,
                    "created_utc": 1653944051.0,
                    "response": "Oh no!\n\nAnyway",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ial7x1g",
                    "author": "Lokeycommie",
                    "score": 1,
                    "created_utc": 1653945421.0,
                    "response": "How do or how does? Who wrote this?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ialj3d4",
                            "author": "blade818",
                            "score": 1,
                            "created_utc": 1653950991.0,
                            "response": "His name is Do Kwon lmao",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ialbzgd",
                    "author": "ConceptualWeeb",
                    "score": 1,
                    "created_utc": 1653947431.0,
                    "response": "Wtf is this title? I had an aneurism trying to read it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iald9lh",
                    "author": "Drewsapple",
                    "score": 1,
                    "created_utc": 1653948072.0,
                    "response": "Other than paraphrasing a comment Vitalik said about UST’s design, this has nothing to do with Ethereum.\n\nGo cry on r/CryptoCurrency or r/terraluna and keep the discussion in this sub relevant.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ialj0fx",
                            "author": "blade818",
                            "score": 1,
                            "created_utc": 1653950949.0,
                            "response": "Ngl it’s a fair comment",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ialkac4",
                    "author": "cryptolamboman",
                    "score": 1,
                    "created_utc": 1653951600.0,
                    "response": "Done Clown?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialm99l",
                    "author": "luquoo",
                    "score": 1,
                    "created_utc": 1653952614.0,
                    "response": "Lol that last sentence",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialr04l",
                    "author": "Critical_Soup806",
                    "score": 1,
                    "created_utc": 1653955091.0,
                    "response": "That was a shit article",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialvph5",
                    "author": "stoneelm7474",
                    "score": 1,
                    "created_utc": 1653957512.0,
                    "response": "That’s ridiculous  people have a short memory and really has nothing to do with the legit projects",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialxvnz",
                    "author": "ShaneTwenty20",
                    "score": 1,
                    "created_utc": 1653958620.0,
                    "response": "it is not Luna or Kwon - it is the large exchanges that put their trade profits ahead of due diligence that they should be doing for their collective good - \n\nthey are the ones that lose by showing the world's regulators that the best positioned industry entities will not red flag problematic projects (ie not list them) of course the rest of lose to :(",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}