{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyxvdx",
            "title": "All You Need To Know About Soulbound Token, An Nft That Ethereum Co-founder Calls The Future",
            "url": "https://www.livemint.com/news/world/explained-know-about-soulbound-token-an-nft-that-ethereum-co-founder-calls-the-future-11653571677762.html",
            "author": "MarianneJohn",
            "created_utc": 1653656940.0,
            "score": 15,
            "num_comments": 36,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia73xhi",
                    "author": "coinfeeds-bot",
                    "score": 3,
                    "created_utc": 1653661832.0,
                    "response": "tldr; Ethereum co-founder Vitalik Buterin has proposed soulbound tokens (SBTs), non-fungible tokens (NFTs) that a person can earn based in part on their job and education history. Unlike regular NFTs, SBTs would represent a person's reputation and accomplishments, a kind of \"extended resume\". \"The idea is to bolster people's social identities by customizing them with unique, non-exchangeable badges,\" he said.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7dyc2",
                            "author": "mcsnoogins",
                            "score": -7,
                            "created_utc": 1653666000.0,
                            "response": "Sounds a bit like money",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia9mu6l",
                                    "author": "anor_wondo",
                                    "score": 4,
                                    "created_utc": 1653703717.0,
                                    "response": "you can send money.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia8bjzj",
                    "author": "xiwefe2",
                    "score": 4,
                    "created_utc": 1653680245.0,
                    "response": "Soulbound, sounds like klaus schwabs plan for Crypto lmfao",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia90xp9",
                            "author": "Crypto_Economist42",
                            "score": 2,
                            "created_utc": 1653692254.0,
                            "response": "Terrible name",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iachjzc",
                                    "author": "xiwefe2",
                                    "score": 1,
                                    "created_utc": 1653766758.0,
                                    "response": "The whole concept is terrible, packed into something fun, rights will be taken away..smh those freaking big tech boomers wan't to digitaly enslave humanity",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia72zji",
                    "author": "Psukhe",
                    "score": 3,
                    "created_utc": 1653661427.0,
                    "response": "I gotta say I don't get it completely, I understand not being able to transfer an NFT, but if your keys are compromised you are basically screwed right? If your lucky enough not to be immediately drained you can't transfer to a new wallet I imagine.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8615w",
                            "author": "domotheus",
                            "score": 4,
                            "created_utc": 1653677775.0,
                            "response": "This is where smart wallets and social recovery come in",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia9bbte",
                    "author": "FlowersforAl-Anon",
                    "score": 3,
                    "created_utc": 1653697611.0,
                    "response": "Didn't Black Mirror do an episode already?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia732zv",
                    "author": "Mallardshead",
                    "score": 9,
                    "created_utc": 1653661469.0,
                    "response": "Here's what you need to know:\n\n* It's social credits masquerading as a cute coin\n* It's another VC marketing word\n* It's the opposite of what bitcoin stands for\n* It's a shitcoin\n* It's Gattica before the genetic science\n* Your gym will hand them out for running on a treadmill for 30 minutes a day for a year straight, and then your healthcare company will raise or lower your rate based on your performance. Endless bullshit like that",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia9fsq5",
                            "author": "EntireInflation8663",
                            "score": 12,
                            "created_utc": 1653699985.0,
                            "response": "Sounds like you skimmed the article and have no idea what you're talking about.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iahqe9r",
                                    "author": "Perleflamme",
                                    "score": 1,
                                    "created_utc": 1653873167.0,
                                    "response": "He knows pretty well what he's talking about ( /s ): he's using the very same argument states use to discredit BTC. XD\n\nHis argument basically is: \"look at all the horrible *possibilities* this tech offers. We can't let it happen! \"\n\nIn short, it's projection.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia9ylfm",
                                    "author": "Mallardshead",
                                    "score": -6,
                                    "created_utc": 1653710101.0,
                                    "response": "No, it seems I've simply skipped the preamble and saw past the euphemism. \n\nSoulbound: VC language for social credits. I'll leave that to China",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia9mq99",
                            "author": "anor_wondo",
                            "score": 7,
                            "created_utc": 1653703658.0,
                            "response": "bitcoin maxis really are built different. they don't have eyes to read lol",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iab15sw",
                            "author": "Tricky_Troll",
                            "score": 3,
                            "created_utc": 1653740918.0,
                            "response": "Your biased wording and excessive use of hyperbole doesn't give me faith in the merit of your opinion. And I say that as someone who shares serious concerns around uses of soulbound tokens in the use case you specified in your last point.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iab7ess",
                                    "author": "Mallardshead",
                                    "score": 0,
                                    "created_utc": 1653744559.0,
                                    "response": "Hard not to condemn this stuff in the harshest terms. Cardano did this same thing in Ethiopia. Terrifying how it actually works and how they're supposed to follow people their entire lives from school grades to job attendance. For Vitalik to even suggest this stuff is disturbing. He is no ally.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iad21be",
                                            "author": "Tricky_Troll",
                                            "score": 2,
                                            "created_utc": 1653776503.0,
                                            "response": "Well who says it has to go to that level of detail? I see no issue with soulbound passports, drivers licences and diplomas. But I agree if it starts being used for every little thing that is just far too much.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iad3s5r",
                                                    "author": "Mallardshead",
                                                    "score": 1,
                                                    "created_utc": 1653777359.0,
                                                    "response": "If it can be it will be. No clue what this guy is thinking. It's a great way to divide people further.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iadeg8t",
                                                            "author": "Tricky_Troll",
                                                            "score": 2,
                                                            "created_utc": 1653782910.0,
                                                            "response": "I mean, we can create social credit scores without soulbound tokens so by your logic every country should have a social credit score by now.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iadg61z",
                                                                    "author": "Mallardshead",
                                                                    "score": 1,
                                                                    "created_utc": 1653783837.0,
                                                                    "response": "Oh they should have them? Why is every country totalitarian like China? Do these countries you group with one another vote? Choose representation? Can the poorer ones afford the infrastructure that ETH provides? This is an example of blockchains being used nefariously. I think you know that though. You respect Buterin. It's ok to disagree with him. These things can be programmed into anything--like money. Stuff like this has to be condemned in the harshest terms, otherwise we end up in the Orwellian place we claimed blockchain would abolish. C'mon now Tricky-Troll.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iadhlwt",
                                                                            "author": "Tricky_Troll",
                                                                            "score": 2,
                                                                            "created_utc": 1653784631.0,
                                                                            "response": "Ultimately while I share a strong concern for their misuse, I don't see them as inherently bad. Soulbound tokens are being used for Optimism's governance system to avoid their governance from becoming yet another plutocracy. My objection to your original comment was more around how you seemed to suggest that they're only a bad thing. I fully agree in the idea that they can be used for bad and we need to push back to prevent them from being used nefariously but that doesn't mean that all of their use cases are bad.\n\nOh and my username is a misnomer that dates back to trolling in Battlefield 4, so not trolling in the true sense of the word.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iad8t00",
                            "author": "TimoSci",
                            "score": 2,
                            "created_utc": 1653779906.0,
                            "response": "\"Social credits\" sounds scary.  But we have been using credentials (eg. references, degree certificates) for 100s of years. Nothing new under the sun.\n\nBy moving them onto the blockchain make are simply making them harder to fake, is all.\n\n\"social credits\" are only scary if they are mandatory like in China. The system proposed here is 100% voluntary.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaddd1s",
                                    "author": "Mallardshead",
                                    "score": 1,
                                    "created_utc": 1653782324.0,
                                    "response": "Oh is that all? Putting it on a transparent blockchain that the world can see and simple computer programs can cull? No. Soulbound tokens that can be programmed into anything...like money? That's a global CBDC.\n\nIt never fails to amaze me the things people will shill for and accept if it can make them a fast and easy dollar. \n\n\"100% voluntary\" LOL. So is KYC. If you don't provide it, no service. \n\nIt's products like this and ethereans like yourself that will help this blockchain fail.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iahq3in",
                                    "author": "Perleflamme",
                                    "score": 1,
                                    "created_utc": 1653873011.0,
                                    "response": "Yeah, it's very ironic that he's alarming about the *potential* misuses of a tech, while it's exactly the same disingenuous tactic that states use to discredit BTC. \n\nAnd they aren't even realizing how close the two behaviors are. So ironic...",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia7bztg",
                            "author": "bandoonparade",
                            "score": -8,
                            "created_utc": 1653665195.0,
                            "response": "You realize you're becoming a buttcoiner, right?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7e290",
                                    "author": "Mallardshead",
                                    "score": -3,
                                    "created_utc": 1653666044.0,
                                    "response": "Not interested in cbdc's and not interested in social credits. If I wanted those I'd move to China. You're turning into an apologist for centralization and invasive VC products.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia7ecol",
                                            "author": "bandoonparade",
                                            "score": 6,
                                            "created_utc": 1653666162.0,
                                            "response": ">Not interested in cbdc's and not interested in social credits.\n\nBut you're obviously REALLY interested in Ethereum, considering how much time you spend in this sub talking about it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia7goa9",
                                                    "author": "Mallardshead",
                                                    "score": 1,
                                                    "created_utc": 1653667114.0,
                                                    "response": "Just another notch. I've got Iron Finance, Terra, and hope to earn one for ETH then the USD (hyperinflation 3Q 2023). 🥋",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia8mqy4",
                    "author": "Crypto_Economist42",
                    "score": -7,
                    "created_utc": 1653685370.0,
                    "response": "Terrible name. \n\nGimmicky marketing.\n\nAnd if glen weyl has anything to do with it, it will become a radical far left communist China version of social credit score. \n\nNot sure why vitalik has moved so far left. He used to be libertarian minded. \n\nThen again -- It might not be so bad If commies start using ethereum. It will just bring in more customers. \n\nPrice will go up, and we'll all have more \"capital\".  :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaeb6m6",
                    "author": "Nogo10",
                    "score": 1,
                    "created_utc": 1653802772.0,
                    "response": "What is this? Non transferable tokens have been around since 2018,  the use cases.. credit score and reputation? Visa already had that for decades.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8u12q",
                    "author": "Single-Lobster1947",
                    "score": -4,
                    "created_utc": 1653688861.0,
                    "response": "One day he will come back to btc...this is so dumb",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uyxqzq",
            "title": "Getting private Too short while Deploying a contract.",
            "url": "https://www.reddit.com/r/ethereum/comments/uyxqzq/getting_private_too_short_while_deploying_a/",
            "author": "kirrttiraj",
            "created_utc": 1653656553.0,
            "score": 2,
            "num_comments": 3,
            "subreddit": "ethereum",
            "selftext": " **Getting Error while Deploying a SmartContract on TestNet and I'm Getting Private Key Too short Error. Can someone Help? the Value of process.env.PRIVATE\\_Key is Logging perfectly but I think there's some problem with that** \n\n&#x200B;\n\nhttps://preview.redd.it/brr1n02co0291.png?width=1081&format=png&auto=webp&s=9ad387a21e1725481d7122271312e92ef1a6cc15",
            "stickied": false,
            "comments": []
        }
    ]
}