{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "siszdw",
            "title": "Deflation is economically sound for Ethereum",
            "url": "https://www.reddit.com/r/ethereum/comments/siszdw/deflation_is_economically_sound_for_ethereum/",
            "author": "AElowsson",
            "created_utc": 1643819580.0,
            "score": 46,
            "num_comments": 50,
            "subreddit": "ethereum",
            "selftext": "Some recent comments on this subreddit have suggested that Ethereum should be made inflationary to spur economic activity, so I wanted to give my perspective on why deflation is economically sound for Ethereum.\n\nTL;DR: *Inflation* of a fiat currency erodes savings and *deflation* can bankrupt debtors, slow down economic activity, and lead to unemployment. Central banks balance by targeting a 2 % inflation, keeping some margin for lowering nominal interest rates to 0 % in recessions. For Ethereum, the potential issue with deflation is restricted to slower economic activity. Participants have two attractive choices in the proof-of-stake ecosystem, locking up their tokens for staking or participating in the smart-contract economy. Issuance of new tokens to stakers is the only source of inflation in the system. Inflation can thus be produced by increasing the yield, but this will slow down activity, not increase it, since it incentivizes people to lock up their tokens for staking instead of interacting with smart contracts. A deflationary Ethereum where the burn rate is higher than the issuance rate attracts capital and developers that wish to capture that capital. Thus, deflation is economically sound for Ethereum considering its forthcoming proof-of-stake consensus.\n\n\\--------------------------------------------------------\n\nFrom time to time, it is suggested that cryptocurrencies should be inflationary like fiat currencies so that users are motivated to spend their tokens, not just hold them. It is important to understand the difference between a central bank trying to balance the desire for high employment and low steady inflation of its fiat currency system with that of a proof-of-stake cryptocurrency trying to make its smart-contract economy flourish, maximizing network effects.\n\nCentral banks commonly target a 2 % inflation. A too high inflation will erode real wages and savings, lead to rising tensions between social groups and costly periods of disinflation. Periods of deflation on the other hand are often associated with economic crises and bursting bubbles. As demand falls, companies reduce their workforces. Debtors have a hard time paying back their loans denominated in nominal terms and the subsequent defaults remove liquidity, risking a deflationary spiral. Wages would need to fall each year to keep up, but a downward wage rigidity can be expected. In the absence of workers accepting yearly pay cuts, unemployment may rise further. The fact that people can increase their wealth by hoarding cash is also detrimental to economic activity in periods of deflation. Thus, a 2 % inflation target gives central banks some margins down to 0 % so that they can lower nominal interest rates in recessions to spur economic activity, avoid deflation traps, and reduce unemployment.\n\nThe realities of proof-of-stake cryptocurrencies like Ethereum are a little different. Deflation causes a rise in the value of the ETH token, but wages are not denominated in ETH and neither are mortgages. Deflation does not bring potential unemployment or spiraling debt burdens. It is rather a fall in price that can be destabilizing, with cascading liquidations among those that lent out their tokens in return for some other form of value, like stablecoins.\n\nThe risks of reduced economic activity due to increased wealth from hoarding cash stands out as the most applicable also for Ethereum (hoarding ETH in this case). Certainly, it is desirable with high economic activity and demand. It brings developers to the ecosystem and helps build the network effects that cement Ethereum as the engine of Web3. But now consider the two most interesting options available to token holders in proof-of-stake Ethereum. They may lock up their tokens by staking them, earning yield, or they may use the tokens for economic activity, interacting with smart contracts. Issuance of new tokens to stakers is the only source of inflation in the system. The higher the yield, the higher the inflationary pressure. The higher the yield, the more desirable to lock up tokens instead of participating in the economy. Thus, the relationship between deflation and economic activity is *reversed* in comparison with the fiat economy.\n\nStakers are a vital part of the ecosystem and should of course be rewarded for their work. But venturing far away from minimum viable issuance to produce inflation will simply constitute a transfer of wealth from those that participate to those that lock up their tokens. Of course, not all forms of \"participation\" may result in high transaction volume. But the mere fact that capital is available and ready to be deployed is arguably important for enticing smart-contract developers to build. If the staking yield is pushed up to produce inflation, the tough competition from the yield of the staking contract discourages development on the chain. It is perhaps not surprising that innovation and economic activity exploded on Ethereum. The promise of an economically sound proof-of-stake consensus in the future in combination with 0 % yield due to proof of work in the short term is an attractive proposition for developers because it produces a lot of capital willing to invest in their DApps. Higher-than-needed staking yield would also force willing participants into a “money lego” of staking derivates, which brings systematic risks to any ecosystem of DApps dependent on them. In a deflationary Ethereum, people can hold ETH tokens without seeing their savings eroded and use them for transactions whenever needs in their daily life arise.\n\nNaturally, it would be possible to produce inflation without pushing up the staking yield if the issued tokens could fund some other desirable development. The problem is that public goods funding is very tricky and would undoubtedly lead to friction in the community. Ethereum is not all-encompassing in the same way that fiat money is within a country. Participants can leave the Ethereum economy at any time if they perceive that their holdings are diluted for questionable reasons or projects. This is a good thing. By preserving the value of the token, we attract people to the ecosystem in open competition. Another way to look at this is to recognize that the deflationary pressure comes from high demand for blockspace (via the burn mechanism of EIP-1559) and the inflationary pressure exists to keep the chain secure through issuance. As long as the chain is secure, deflation is a sign of an in-demand protocol.\n\nOne last thing in relation to [Gresham's law](https://en.wikipedia.org/wiki/Gresham%27s_law):  \"bad money drives out good\", which is often quoted in support of inflationary policies. It is important to note that Gresham's law is applicable for two forms of money with different inherent value but where legal-tender laws specifies that they must be exchanged for the same value. This is not applicable for Ethereum, especially considering the fact that competing forms of money in crypto, including ETH, can easily be reacquired on the open market after using it for payment. For all these reasons, I believe that deflation is economically sound for Ethereum.",
            "stickied": false,
            "comments": [
                {
                    "id": "hvavpez",
                    "author": "domotheus",
                    "score": 21,
                    "created_utc": 1643823300.0,
                    "response": "There's a few key things that are always forgotten by people who say \"no one is gonna want to spend Ether if it's deflationary and always goes up in value\", and you mentioned a few of them, so I'll just add:\n\n1. Ether is not inherently deflationary, it only becomes deflationary when so many people actively use it enough that the burn rate outpaces the issuance rate. There is some equilibrium point where issuance = burn, at which point the supply may very well inflate something like 0.5% every year by issuing 2% and burning 1.5% (numbers pulled out of my ass but you get it)\n\n2. Ethereum's blockspace is what people are after, not Ether. Ether is just the asset you use to pay for Ethereum's blockspace. If you want to use Ethereum, you *have* to spend Ether.\n\nPoint 2 is the crux of my overall long-term thesis for Ethereum and Ether. If you spend $100 on blockspace, then you have to burn $100's worth of Ether on blockspace. You don't do that unless the economic utility you get out of that blockspace exceeds the $100 you spent on it. So as long as Ethereum is in demand, people have to spend Ether to meet that demand.\n\nSo when you're spending $100's worth of Ether on Ethereum blockspace, there's a few ways to do it:\n\n1. Buy $100's worth of Ether at today's prices and immediately spend it\n\n2. Use it from your Ether bag that you bought at a lower price months/years ago, so the $100's worth of Ether you're spending today only cost you $75 back when the price was lower\n\n3. Use it from the yield you got from staking ETH. You put up some fixed amount of ETH in staking and now you're getting rewards essentially for free, and you're spending those rewards on blockspace.\n\nIf Ether is an inflating/depreciated asset, then the best move is 1. But if it's an appreciative asset, then 2 and 3 are the way to go. And in terms of network security, you want the staking collateral to have a high value to make sure attacks are very very costly. So the more people hoard/stake, the more economic value the whole network has, which furthers solidifes Ethereum's selling point as a secure settlement layer to move value around and post any kind of data with guaranteed availability.\n\ntl;dr Having Ether be an appreciative asset is good for the network, its holders, its users, and its stakers. I'm never gonna get tired of sharing [this diagram](https://i.imgur.com/3bPV35a.png) lol",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hvb1s51",
                            "author": "AElowsson",
                            "score": 10,
                            "created_utc": 1643825520.0,
                            "response": "Ah yes nice perspectives! I made an [ethresearch post](https://ethresear.ch/t/circulating-supply-equilibrium-for-ethereum-and-minimum-viable-issuance-during-the-proof-of-stake-era/10954) detailing the circulating supply equilibrium for Ethereum last summer. I am currently writing a little longer text on this topic and this post was extracted from one of the subsections.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hvb2l1x",
                                    "author": "domotheus",
                                    "score": 5,
                                    "created_utc": 1643825822.0,
                                    "response": "Woah you're that guy! I've had your post bookmarked and referred to it a bunch of times in the past. Great stuff!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hvb3p14",
                                            "author": "AElowsson",
                                            "score": 6,
                                            "created_utc": 1643826237.0,
                                            "response": "Thanks! Yup, hope to post an update around the end of February or something, hard to know. Feel free to follow me on [twitter](https://twitter.com/weboftrees) for updates :)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hvbra0t",
                                    "author": "casualcryptotrader",
                                    "score": 2,
                                    "created_utc": 1643835084.0,
                                    "response": "Fantastic work sir.\n\nI will be reading this later tonight with a bowl. I’ve skimmed the article already and I really appreciate the actual math and social science that goes into this kind of paper.\n\nAny thoughts on the value of Eth and how it would effect the eco system? Sorry if that’s already covered in the paper.\n\nThanks again for the write up!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hvamlbs",
                    "author": "Ferdo306",
                    "score": 4,
                    "created_utc": 1643820003.0,
                    "response": "I see ETH more as an oil than money so I don't think inflation/deflation has the same impact as it has on fiat or btc in terms of spending",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hvdnvhy",
                            "author": "johnfintech",
                            "score": 1,
                            "created_utc": 1643863078.0,
                            "response": "The analogy of btc = digital gold and eth = digital oil is a flawed one, and people should really stop quoting it blindly. Innovation, and more importantly, pressure to innovate, are essential in Ethereum, but irrelevant for oil ... in fact, it's one reason why the latter is dying. People who view Ether as just an admission ticket to the EVM and which has no reason to get expensive are missing important aspects.\n\nWhether it makes sense to talk about inflation in the Ethereum context wrt ot its token Ether is another matter, but the answer is yes, it does make sense. It does so for all legal-tender like \"assets\" (Ether is essentially legal tender in Ethereum). There are further reasons why it makes sense, one being that for quite a while longer people will continue to regard the value of Ether in fiat and so will the revenues from staking.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hvddjws",
                    "author": "johnfintech",
                    "score": 1,
                    "created_utc": 1643858323.0,
                    "response": "Or, you know, one could read Booth's book, The Price of Tomorrow.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hvevxi0",
                    "author": "shim__",
                    "score": 1,
                    "created_utc": 1643892374.0,
                    "response": "The whole idea that inflation is good when a central bank does it is simply flawed, yes it does spur consumption which might seem good in the short term but does so at the cost of good investments.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hvifesr",
                    "author": "ItsAConspiracy",
                    "score": 1,
                    "created_utc": 1643943544.0,
                    "response": "Also, deflationary ETH works great as backing for a stablecoin, which completely avoids any potential issue.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hvap5ix",
                    "author": "hurassam",
                    "score": -1,
                    "created_utc": 1643820920.0,
                    "response": "We need not fucking inflation asset.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hvbe1te",
                            "author": "FaceDeer",
                            "score": 5,
                            "created_utc": 1643830069.0,
                            "response": "We need whatever makes Ethereum work best.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hveyjoa",
                                    "author": "Crypto_Economist42",
                                    "score": 1,
                                    "created_utc": 1643893782.0,
                                    "response": " price appreciation   . It drives adoption",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}