{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "qoo2go",
            "title": "Ethereum Gas Fees will be it's Waterloo",
            "url": "https://www.reddit.com/r/ethereum/comments/qoo2go/ethereum_gas_fees_will_be_its_waterloo/",
            "author": "ShopDiesel",
            "created_utc": 1636290040.0,
            "score": 198,
            "num_comments": 280,
            "subreddit": "ethereum",
            "selftext": "I'll probably receive tons of downvotes for saying this:\n\nIf the Ethereum Network can't fix its gas fees, it won't be used by the the average consumer. \n\nI know thinking this feels unreasonable since most of us use it and stomach the gas fees.\n\nThe reason why developers are still developing on the network is because there's a favorable equilibrium between supply and demand.\n\nThis demand is coming from us, early adopters.\n\nBut when the 85% enter into the market, the only thing they'll care about is the usecase; if it improves their lives in some way. \n\nDuring mass adoption, gas fees won't improve anything.\n\nTheir demand will influence supply to give them something that has extremely high TPS, high security, high autonomy, and many DApps. I forgot to mention, a FREE user experience.\n\nMainstream consumers are accustomed to a free internet experience. The Ethereum Network is the antithesis to free. \n\nAnd there's no guarantee that ETH 2.0 sharding will actually lower gas fees.\n\nThat's why I'm long-term bearish on Ethereum.",
            "stickied": false,
            "comments": [
                {
                    "id": "hjorbzg",
                    "author": "KaiSosceles",
                    "score": 56,
                    "created_utc": 1636301228.0,
                    "response": "Literally every time someone mentions high gas fees, that person, guaranteed, mentions NOTHING about L2s. L2’s need a marketing boost or something cuz people are absolutely oblivious.\n\nIf you can mention high gas fees in L1 and make a case for why L2s are not a viable future—you have a post. If you mention high gas fees on L1 and don’t mention anything about L2, go fucking educate yourself.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjqfp7u",
                            "author": "darklord444",
                            "score": 7,
                            "created_utc": 1636325227.0,
                            "response": "Okay please explain how easy to use l2s will be in a few years time and if my mum will be able to use it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjr28gj",
                                    "author": "KaiSosceles",
                                    "score": 9,
                                    "created_utc": 1636335417.0,
                                    "response": "It will be at least as “easy” as L1s are right now because Fiat Onramps will take you directly to L2 and you’ll never have to interact with L1. As far as how much easy-er it will be, I don’t know, but all of crypto needs to be easier L2’s or not, for your mum to adopt. ^.^",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hjr29xa",
                                    "author": "jcm2606",
                                    "score": 4,
                                    "created_utc": 1636335437.0,
                                    "response": "You will be able to withdraw your assets from a centralised exchange like Coinbase, Kraken or Crypto.com directly to an L2, without ever touching the L1 network yourself. Simply set up a wallet within an L2 (same process as on the L1 network), move your assets from the cex to the L2, and once you're in the L2, you can continue using the L2 as if it were the L1 network, while paying a fraction of the fees.\n\nThe only difference is the process of getting onto an L2. Right now, yes, it's relatively difficult, because L2s are still very young, need to mature more and need more adoption (both from users and cexs). The ecosystem within an L2 should be the exact same as the L1, provided your dapps have deployed to the L2 (a lot have deployed to L2s like Arbitrum, and more are being deployed).\n\nSo, if you're complaining about anything other than getting onto an L2, you're not complaining about L2s, you're complaining about the state of using cryptocurrencies, and hence the state of the crypto space in itself. Any other L1 will be just as difficult to use, and so this argument doesn't hold any water, *if you're complaining about anything other than getting onto an L2.*",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjr3zii",
                                            "author": "darklord444",
                                            "score": 0,
                                            "created_utc": 1636336249.0,
                                            "response": "Thanks that is quite informative, so let me ask this. What does the eth L1 offer that makes it so valuable that we are all scrambling to make l2s work? Is it the network effect? The time in the market? The developers? Is it trusted/decentralised?\n\nWhy would the market just not migrate to a better option in the future that runs everything on a layer one?\n\nI am bullish on eth and I love the project don’t get me wrong. But it seems like (metaphor) a boat that keeps getting patched to stop if from sinking by the load of it’s own cargo. What happens when it can no longer patch something in time or a more attractive boat comes along?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hjr5feq",
                                                    "author": "jcm2606",
                                                    "score": 3,
                                                    "created_utc": 1636336930.0,
                                                    "response": "> What does the eth L1 offer that makes it so valuable that we are all scrambling to make l2s work?\n\nIt is the only smart contract chain that has been battle tested and proved that it is secure and reliable enough for mass adoption. Sure, it's expensive to use, but not once has it become genuinely unusable (as in, not responsive, ie crashed).\n\nEvery other smart contract chain that is available right now has the potential to be more secure and reliable than Ethereum, I'm not going to deny that, but they have yet to prove it.\n\nSome chains just haven't hit critical mass when it comes to adoption, others have intentionally throttled the network while under development. Some even already hit the point where they become unresponsive (Solana inadvertently rendered itself unusable by basically attacking itself with a denial-of-service type attack a little while ago).\n\nThat, plus the fact that it's where the majority of value and networking lies, makes it very valuable for the bigger players, who prioritise security and reliability over how cheap the network is to use. And since users naturally gravitate to the network with the most adoption, they will end up using Ethereum over others, until others see enough adoption to overtake Ethereum.\n\n> Why would the market just not migrate to a better option in the future that runs everything on a layer one?\n\nAlready answered this above, but I will add that it's basically impossible for an L1 smart contract chain to scale enough to support mass adoption on a global scale. What TPS do you think is necessary? 10k? 100k? Try millions. That's what it'd take for mass adoption on a global scale.\n\nThis is why rollups are such an important innovation, because they can deliver that TPS for the end user by using the L1 TPS more efficiently, by bundling hundreds, even thousands of L2 transactions into a single L1 transaction.\n\nhttps://np.reddit.com/r/ethfinance/comments/pk57n7/why_rollups_data_shards_are_the_only_sustainable/",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hjrwyss",
                                                            "author": "darklord444",
                                                            "score": 0,
                                                            "created_utc": 1636352258.0,
                                                            "response": "Thank you 🙏 you actually addressed my main concerns",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hjqokz0",
                                    "author": "_SmolBeannn_",
                                    "score": 1,
                                    "created_utc": 1636329103.0,
                                    "response": "Man, what?? haha how does one even answer this? \n\nEase of use is subjective. Bridging to, and utilizing L2’s isn’t difficult imo for example. How much simpler can it get in a few years? Who knows, stick around and see for yourself, likely to improve quite a bit.\n\nReddit doesn’t know if your mom will be able to use L2, so help mom out you dingdong",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjr2w9l",
                                            "author": "darklord444",
                                            "score": 1,
                                            "created_utc": 1636335732.0,
                                            "response": "My mum is a reference to people 45 plus. If you use the word layer 2 with anyone who is not in the crypto space I assure you they are already zoning out. So my question is if eth main net is permanently expensive. How easy will it be to use eth via l2s in the future and how will it compare to other blockchains that are obviously trying to take Eths market share and don’t need constant patches or l2s to operate?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hjsc8sf",
                                                    "author": "anor_wondo",
                                                    "score": 1,
                                                    "created_utc": 1636365247.0,
                                                    "response": "these other blockchains need you to change your network in metamask too.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hjr2rm2",
                                    "author": "robotfightandfitness",
                                    "score": 1,
                                    "created_utc": 1636335671.0,
                                    "response": "I know your mum quite well and something something joke",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hjoug1u",
                    "author": "yogofubi",
                    "score": 25,
                    "created_utc": 1636302476.0,
                    "response": "How many times do we have to say this? \n\nLayer 2! \n\nJesus Christ",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjpihkm",
                            "author": "mladjenija",
                            "score": 2,
                            "created_utc": 1636311925.0,
                            "response": "And if you have 30dolars of erc-20 token in wallet on L1 mainnet? Basically it's hodl till end of time at this point",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjpm0hn",
                                    "author": "yogofubi",
                                    "score": 6,
                                    "created_utc": 1636313284.0,
                                    "response": "Ethereum isn't finished, people are trying to do too much too early. It will get there, but the demand is far far higher than the EVM has capacity for.\n\nIt's like buying a DVD player in 2005 and complaining that it can't stream Netflix.\n\nPatience, we are very very early in all of this",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjpnugd",
                                            "author": "mladjenija",
                                            "score": 6,
                                            "created_utc": 1636314009.0,
                                            "response": "Of course man, but I said that l2 is not solution for this kind of problem. It solves some problem, but not  all and we need to be aware of how big the problem is. Just that. And at this point L1 is not usable if you don't have a bag of eth, that is a big problem if you ask me.\n\nThere are people who are in crypto and aren't aware of the sidechains, l2, l1 and so on and eth aren't looking good for them, especially if they want to move small amount on wallet from cb or some other exchange that are not supporting l2 at this moment.\n\nWe need to understand this and how to educate them.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hjq3w1u",
                                    "author": "flickerkuu",
                                    "score": -4,
                                    "created_utc": 1636320294.0,
                                    "response": "If all you can afford is 30 dollars to \"invest\" then you are doing it wrong to begin with. You should be buying food or rent with that money. The time to invest is when you have extra money. You're just another person chasing a get rich quick scheme and mad your tiny investment hasn't mooned to 10000x.  Stop with that line of thinking and you will do better.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjq52z8",
                                            "author": "mladjenija",
                                            "score": 5,
                                            "created_utc": 1636320778.0,
                                            "response": "Wow, man this is so wrong from your side. Not everyone in crypto lives in rich countries and not for everyone 30 dolars are small amount. If you don't understand that, of course that you can not see the problem.\n\nSorry for your time.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hjo67mb",
                    "author": "Chazmer87",
                    "score": 292,
                    "created_utc": 1636291942.0,
                    "response": "The plan now isn't for the average consumer to use maint net.\n\nThe plan is for main net to be used by roll ups and zk proofs. So the average consumers uses L2.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjo8fte",
                            "author": "BillsDueEveryMonth",
                            "score": 148,
                            "created_utc": 1636293081.0,
                            "response": "This. The gas fees issue is already being addressed with projects such as Loopring (LRC)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjo9gvt",
                                    "author": "cryptoredfoxx",
                                    "score": 10,
                                    "created_utc": 1636293596.0,
                                    "response": "Loopring is pretty great",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hjoilvx",
                                    "author": "TangoWithTheRango_",
                                    "score": 5,
                                    "created_utc": 1636297689.0,
                                    "response": "Came to say this",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hjoffcw",
                                    "author": "ckh27",
                                    "score": 34,
                                    "created_utc": 1636296331.0,
                                    "response": "Polygon already handled this",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjoje8x",
                                            "author": "UnrulySasquatch1",
                                            "score": 88,
                                            "created_utc": 1636298029.0,
                                            "response": "Don't get me wrong, polygon is great. But they are a side chain. Layer 2s (rollups) are much preferred because they inherit security from the main chain",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hjomeyx",
                                                    "author": "MasterPineapple132",
                                                    "score": 37,
                                                    "created_utc": 1636299270.0,
                                                    "response": "I get that some people prefer absolute maximum security, but even L2s cost more than $1 for transactions atm.\n\nPolygon costs cents, and is not an insecure network.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hjoqolw",
                                                            "author": "gmidds",
                                                            "score": 22,
                                                            "created_utc": 1636300968.0,
                                                            "response": "This. \n\nDo we really think that the 85% cares this much about security? I mean by and large, this is the group most likely to use the same password for every platform. The 85% cares about convenience and cost. Thats it.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hjowmjh",
                                                                    "author": "Impossible_Ad_7818",
                                                                    "score": 26,
                                                                    "created_utc": 1636303337.0,
                                                                    "response": "They don't until they do",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hjq4e5g",
                                                                            "author": "Maswasnos",
                                                                            "score": 27,
                                                                            "created_utc": 1636320497.0,
                                                                            "response": "Ayup. It's all fun and games until the network gets 51% attacked or something similar, like how Solana just shut itself down a few weeks ago.\n\nIt bears repeating: Ethereum is building to be WWIII and nationstate resistant.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hjq51ev",
                                                                                    "author": "DNiceM",
                                                                                    "score": 2,
                                                                                    "created_utc": 1636320760.0,
                                                                                    "response": "When i see talk like this, it's the same talk BTC was doing with ETH around the corner, back when ETH was usable and great whilst BTC decided to go down the path of unusuabiltiy and claiming L2 will fix everything. Vitalik ironically argued vehemently against BTC's approach and so did most, but NGU got the better of people here. Good luck.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hjq5t3a",
                                                                                            "author": "Maswasnos",
                                                                                            "score": 12,
                                                                                            "created_utc": 1636321070.0,
                                                                                            "response": "I have no idea what you're talking about. BTC and ETH are not taking remotely similar approaches.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "hjqua0o",
                                                            "author": "SatoshiNosferatu",
                                                            "score": 0,
                                                            "created_utc": 1636331666.0,
                                                            "response": "And things like loopring are centralized. The magic of ethereum stuff like uniswap is it’s permissionless. Post any asset you want. Loopring doesn’t have that",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "hjrhcp5",
                                                            "author": "St0nkyk0n9",
                                                            "score": 1,
                                                            "created_utc": 1636342726.0,
                                                            "response": "lrc going to flip poly in less than 6 months. do a remind me and thank me with a few poly you are holding",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hjoudbn",
                                                    "author": "ckh27",
                                                    "score": 7,
                                                    "created_utc": 1636302445.0,
                                                    "response": "Agreed but after their acquisition of Hermès I’m curious to see what develops w their roll ups",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hjsc0fi",
                                                            "author": "frank__costello",
                                                            "score": 1,
                                                            "created_utc": 1636365033.0,
                                                            "response": "Hot take: Polygon acquired Hermes for marketing reasons, not technical reasons",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hjtusgs",
                                                                    "author": "ckh27",
                                                                    "score": 2,
                                                                    "created_utc": 1636393708.0,
                                                                    "response": "That would make sense from a social and Reddit perspective but doesn’t make sense from a business perspective. If you want to spend 250 million for marketing that was a weak way to do it. The marketing comes from the service being integrated and launched and used successfully and onboarding new users and the product being excellent, then touting and sharing that. For $250 mill you could have bought more marketing than cost per click could handle for a while lol",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hjp7pg6",
                                                    "author": "johniskewldude",
                                                    "score": -7,
                                                    "created_utc": 1636307743.0,
                                                    "response": "Polygon is an L2.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hjp87l9",
                                                            "author": "UnrulySasquatch1",
                                                            "score": 13,
                                                            "created_utc": 1636307947.0,
                                                            "response": "No. It's a side chain. It has its own validators and security. Here is a comment straight from Vitalik.\n\nhttps://np.reddit.com/r/ethereum/comments/it22g2/whats_the_difference_between_layer_2_and_sidechain/g5csv8n\n\nTo be fair, I had this mixed up until recently as well",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hjp8oau",
                                                                    "author": "johniskewldude",
                                                                    "score": 1,
                                                                    "created_utc": 1636308137.0,
                                                                    "response": "What about Polygon's checkpoints mechanism?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hjp9jag",
                                                                            "author": "UnrulySasquatch1",
                                                                            "score": 6,
                                                                            "created_utc": 1636308475.0,
                                                                            "response": "Here is a write-about this\n\nhttps://np.reddit.com/r/0xPolygon/comments/nvpp8b/how_does_checkpointing_work/h19spfw\n\nTLDR: it doesn't inherit security from layer 1, the checkpoints are all done by polygon validators.\n\nThat said the plan is to inherit security from layer 1 in the future. I look forward to when that happens",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hjpc2rc",
                                                                                    "author": "johniskewldude",
                                                                                    "score": 1,
                                                                                    "created_utc": 1636309449.0,
                                                                                    "response": "Okay I'm confused. I get why PoS might not be an L2, but I thought Plasma is an L2 chain. Now you're saying that it never was?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hjpd6jd",
                                                                                            "author": "UnrulySasquatch1",
                                                                                            "score": 3,
                                                                                            "created_utc": 1636309881.0,
                                                                                            "response": "As I understand plasma is a layer 2, but polygon is using a modified version of plasma.\n\nI am not an expert on polygon, though. So let me know if you find differently",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hjoji72",
                                            "author": "shim__",
                                            "score": 14,
                                            "created_utc": 1636298077.0,
                                            "response": "Polygon is a stopgap solution as it is only a sidechain and not as secure as mainnet",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hjoumvp",
                                                    "author": "ckh27",
                                                    "score": 4,
                                                    "created_utc": 1636302552.0,
                                                    "response": "I’m interested in polygon road map and their use of their recent roll up acquisitions. Ultimately l1 as settlement chain must work w l2 and while plasma is side chain they are working diligently to develop the next platform phase w roll ups",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hjqm2rd",
                                    "author": "riemsesy",
                                    "score": 1,
                                    "created_utc": 1636328007.0,
                                    "response": "The Celer network with multi-chain and cross-layer support combined State Channel and Layer-2 rollup.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hjobujq",
                            "author": "pa7x1",
                            "score": 48,
                            "created_utc": 1636294744.0,
                            "response": "I'm going to add to this with an explanation why this is the most economically sensible approach.\n\nBlockchains pay for their necessary security in 2 ways: issuance (newly minted coins paid to the validators) and fees (coins paid to the validators by those using the network).\n\n- Issuance is a zero-sum economic activity from the point of view of the network, there is no value created through issuance. All the token-holders are diluting themselves through issuance to give those coins to the validators to pay for their job.\n\n- Fees are not a zero-sum economic activity from the point of view of the network, on the contrary, they are a tax on the users of the network to pay for its security. There is valued accrued into the network via fees, as transactions that carry economic activity settled on the network are taxed by the network to pay for its security budget.\n\nWith this in mind it's obvious you want total fees paid to the network to be as high as possible. On the other hand, a ghost chain with insignificant total-fees paid by its users is wasteful and unnecessary. There is no economic activity settled by the network, all its security budget is coming through self-dilution but there is still some very real expenses to pay for securing the network.\n\nUp to here I hope to have made the case for why high total fees are a good sign of a healthy blockchain.\n\nNow you just need another piece of information. Blockchains have finite resources, the resource of a blockchain being its block-space or how many transactions you can fit per unit of time. In fact, blockchains are very resource-constrained as you cannot use the conventional vertical scalability (beefier machines) or horizontal scalability (more machines) techniques you can use in other kinds of systems without sacrificing decentralization or security, respectively. So we have a finite resource (blockspace) for which we want to maximize total value paid for it, this implies average value per transaction goes up.\n\nNow you should have all the pieces to understand why a healthy blockchain is likely to be expensive to use.\n\nAnd this is why Ethereum's scalability roadmap involves so prominently L2s. Because they are the only way that we can meet the conditions explained above of a healthy blockchain without pushing out of it the needs of low-value use cases that require small fees. With L2s we can bundle together many low-value fees into high-value fees that can pay to exist in L1.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjotfxn",
                                    "author": "Cryptolution",
                                    "score": 9,
                                    "created_utc": 1636302070.0,
                                    "response": "Thanks, great breakdown. OP reminds me of the BCH fanbois who don't understand the multidimensional complexity of these systems. There are incentives and trade-offs but all are pieces to a puzzle that without wouldn't exist or function.\n\nIt's actually really simple.\n\nNo fees = no security\nNo security no value.\nNo value no utility.\nNo utility no use.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hjpcph7",
                                    "author": "n0m_d",
                                    "score": 2,
                                    "created_utc": 1636309696.0,
                                    "response": "great explanation.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hjq277i",
                            "author": "Rumiii",
                            "score": 6,
                            "created_utc": 1636319616.0,
                            "response": "Average consumer has a hard enough time figuring out an L1. Betting on everyone’s ability to figure out ETH L2 complexity—which L2s are actually safe, which are the cheapest, and which can be used on the DApps they want to use— that’s the hardest part for me to wrap my head around. I own a few ETH and want to succeed, but given EVM portability and historical inability of core devs to execute in timely manner, the path that this ecosystem is on is troubling.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjqxhfl",
                                    "author": "AcapellaFreakout",
                                    "score": 5,
                                    "created_utc": 1636333172.0,
                                    "response": "Then make a consumer friendly app that does all that stuff for them anyway.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hjsc05q",
                                    "author": "anor_wondo",
                                    "score": 1,
                                    "created_utc": 1636365026.0,
                                    "response": "polygon, fantom, avalanche all seem to be doing fine. Given using an L2 is no different, what exactly do you mean here?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hjpt7bm",
                            "author": "CryptoHopeful",
                            "score": 5,
                            "created_utc": 1636316099.0,
                            "response": "You gotta be somewhat tech savvy to know how to use L2, etc. Average consumer won't bother learning all that",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjqoed2",
                                    "author": "dotfool",
                                    "score": 4,
                                    "created_utc": 1636329025.0,
                                    "response": "They won’t have to, but the services they use will",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hjrmqtn",
                                    "author": "msl2008",
                                    "score": 2,
                                    "created_utc": 1636345604.0,
                                    "response": "I don’t know how the internet works but I know how to use it. Same thing will happen with layer 2s and eth.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hjpzxb9",
                            "author": "otherwisemilk",
                            "score": -5,
                            "created_utc": 1636318709.0,
                            "response": "Lol that's fucked up. Fix the foundation before you build a house on it.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hjqcbt9",
                            "author": "MakeMuricaGreat",
                            "score": -4,
                            "created_utc": 1636323779.0,
                            "response": "Why aren't the L2 network part of the L1 network? L2 only leads to fragmentation and security risks (bugs in one network can degrade trust overall). L2 also transfers a lot of the network leadership...\n\nL2 is really just an ugly transfer of blame in my opinion. If L2 was a good solution it would be part of the L1. L2 will fail and degrade over time until they implement a real stake-proportional validation security. Nobody needs 50 validator for 2 cent transaction, just one will do and that's where other networks shine.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjr2e1z",
                                    "author": "robotfightandfitness",
                                    "score": 2,
                                    "created_utc": 1636335490.0,
                                    "response": "Username checks out",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hjq88v0",
                            "author": "Nogo10",
                            "score": -2,
                            "created_utc": 1636322069.0,
                            "response": "So you are saying Ethereum blockchain is under construction. Ok folks move along, nothing to see here",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hjrf6ox",
                            "author": "ShopDiesel",
                            "score": -1,
                            "created_utc": 1636341636.0,
                            "response": "So L2 can push L1 gas fees to consumers? Producers never pay taxes - consumers do.\n\nCome on people this is econ 101 ffs.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjrsbtj",
                                    "author": "samsedar",
                                    "score": 4,
                                    "created_utc": 1636349045.0,
                                    "response": "No L2 is crazy cheap and fast with full ETH security, try out Arbitum. \n\nLook into L2s ma man, you wont be so concerned anymore!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjruxsd",
                                            "author": "ShopDiesel",
                                            "score": 2,
                                            "created_utc": 1636350802.0,
                                            "response": "Thanks for the cheerful response.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hjop3t8",
                    "author": "arseven47",
                    "score": 52,
                    "created_utc": 1636300343.0,
                    "response": "Using Ethereum L1 mainnet as a consumer is like buying coffee using SWIFT transfer. To each type of customers, there are solutions catered for each special needs. Want fast confirmation, zero fee for small settlement? Paypal and Venmo. Want cheap fee for thousands dollar purchase? Credit card. How about home purchase of hundred of thousands dollar? Bank transfer. Multi millions dollars settlement between institutions? SWIFT or Wire transfers. \n\nEthereum offer everyone of us universal access to mainnet service, no matter how small or big whale we are. Eventually, only big whale can afford to use the mainnet while us small fishes will have to use specialised solution such as L2. This is just how everything works, not just in crypto or traditional finance.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjozsve",
                            "author": "mnmaste",
                            "score": 9,
                            "created_utc": 1636304588.0,
                            "response": "This is a great example, thanks.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hjpr1t6",
                            "author": "flux8",
                            "score": 1,
                            "created_utc": 1636315257.0,
                            "response": "Okay, but can L2 help people when they are trying to buy an ETH-wrapped token?  For example, I looked into buying some eXRD this morning. Then when I saw the gas fees on Uniswap - $128 - I said, nope.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjq556c",
                                    "author": "Maswasnos",
                                    "score": 8,
                                    "created_utc": 1636320803.0,
                                    "response": "Use Uniswap on an L2. A token swap on Arbitrum right now looks to be about $5. \n\nYou will need to wait for sufficient liquidity to migrate, but that's part of early adoption.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjr5oml",
                                            "author": "flux8",
                                            "score": -2,
                                            "created_utc": 1636337048.0,
                                            "response": "But to get my Ethereum onto L2 costs a lot in gas fees.  $200 last I checked a couple hours ago, to transfer a much smaller amount of ETH onto Optimistic Ethereum Network.  That kinds defeats the whole point.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hjrb58r",
                                                    "author": "Maswasnos",
                                                    "score": 5,
                                                    "created_utc": 1636339631.0,
                                                    "response": "Idk where you're checking but that doesn't sound remotely right. What bridge are you looking at? Hop protocol should be cheaper, or you can just use Crypto.com as a bridge for cheap.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hjrve4p",
                                                    "author": "CPAyyyy",
                                                    "score": 2,
                                                    "created_utc": 1636351129.0,
                                                    "response": "A lot of the L2s have only been live a couple months. This is like complaining about online banking not being feasible in 1994.\n\nEventually you will be able to move straight from your onramp to an L2. Optimistic rollups are still being throttled and ZK rollups will be vastly superior than those.\n\nWe're getting there and offices is happening at a blazing fast speed, but it's going to take more a little more time to get there.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hjr2p4s",
                                    "author": "robotfightandfitness",
                                    "score": 2,
                                    "created_utc": 1636335638.0,
                                    "response": "Yes, it can. \n\nThe thing throwing everyone off is they’re witnessing the birth, growth and adoption of a decentralized financial network and it is impressively secure and robust despite being incomplete and will always be incomplete in that development continues. The foundation needs to be able to be built on and programmable while not having security breaches",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjr5srm",
                                            "author": "flux8",
                                            "score": 0,
                                            "created_utc": 1636337100.0,
                                            "response": "Um, okaaaay.  That’s completely irrelevant to what I posted.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hjrpuz2",
                                                    "author": "PouItrygeist",
                                                    "score": 1,
                                                    "created_utc": 1636347455.0,
                                                    "response": "It has everything to do with your post.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hjrsxp4",
                                                            "author": "flux8",
                                                            "score": 1,
                                                            "created_utc": 1636349444.0,
                                                            "response": "It’s immensely unhelpful when I’m clearly asking for some instructions.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hjoxfj5",
                    "author": "-lightfoot",
                    "score": 9,
                    "created_utc": 1636303656.0,
                    "response": "You’re right, no one uses ethereum any more because it’s too crowded",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjoa5n3",
                    "author": "ItsAConspiracy",
                    "score": 15,
                    "created_utc": 1636293933.0,
                    "response": "Rollups are already lowering gas fees, if you bother to use them. Sharding will increase the capacity of rollups by 20X just for starters.\n\nMass adoption will happen with easy-to-use rollup clients, with exchanges transferring to the rollups directly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjotb3o",
                    "author": "jzia93",
                    "score": 5,
                    "created_utc": 1636302016.0,
                    "response": "I don't like gas fees, I'm not defending them. But these posts completely miss something.\n\nGas fees indicate people use the network, heavily. People write posts like this as if Eth is some big corporation and you can complain to the manager.\n\nYou can't, the sad fact is, the network doesn't care about you (or me) in this situation. DeFi protocols, trading funds, large DAOs and whales, are happy to pay main net transaction prices and the sad fact is that transactional utility of Eth is going to have to be L2s for the majority of people.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjp6yn1",
                    "author": "Blunaja",
                    "score": 5,
                    "created_utc": 1636307442.0,
                    "response": "L2",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjo9xi4",
                    "author": "frozengrandmatetris",
                    "score": 56,
                    "created_utc": 1636293824.0,
                    "response": "I have ERC-20 tokens that cost more to move to L2 than what they are worth. L2 doesn't solve my problem at all.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjogegc",
                            "author": "k3vlar104",
                            "score": 52,
                            "created_utc": 1636296744.0,
                            "response": "The fun of being an early adopter. Late adopters will buy, sell and transact on L2 solutions and never have to move them to L1.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjoz8tg",
                                    "author": "DarkestTimelineJeff",
                                    "score": 8,
                                    "created_utc": 1636304364.0,
                                    "response": "This. ExchNges will enable buying directly to L2 in the very near future.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjp6jpf",
                                            "author": "Kike328",
                                            "score": 11,
                                            "created_utc": 1636307271.0,
                                            "response": "I’m already using crypto.com with Arbitrum and Polygon",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hjpq26q",
                                                    "author": "DarkestTimelineJeff",
                                                    "score": 2,
                                                    "created_utc": 1636314883.0,
                                                    "response": "That’s amazing to hear. Still can’t use that site for location reasons. Changing my address brb.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hjoo0ps",
                            "author": "SendN00dles1",
                            "score": 10,
                            "created_utc": 1636299919.0,
                            "response": "Why don't you send your erc20 to binance, kucoin, crypto.com, or any other exchange that allows L2 withdrawals. The tx costs $20 or less. Convert to matic and withdraw to polygon network then rebuy your tokens. Total transaction will be less than $30 to move to L2.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjotcmt",
                                    "author": "imacomputertoo",
                                    "score": 3,
                                    "created_utc": 1636302034.0,
                                    "response": "Is converting erc20 to loopring, or any other L2, a taxable event?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjoyhnp",
                                            "author": "mnmaste",
                                            "score": 4,
                                            "created_utc": 1636304064.0,
                                            "response": "I wouldn’t think so, but crypto tax law is a moving target. I think moving your ETH to loopring, etc would be analogous to changing which brokerage you use to manage your stock portfolio.\n\nNow, once you exchange that ETH for something else or if you earn interest in it, etc, then that would be taxable I think",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hr0j3yl",
                                            "author": "bobbgingras",
                                            "score": 2,
                                            "created_utc": 1641173719.0,
                                            "response": "The conservative and safest view on the issue is that it is a taxable event. At least it is what [TokenTax](https://tokentax.co/guides/defi-crypto-tax/#taxes-on-multichain-bridging) states on their website.\n\n> Tl;dr: We don’t know for sure yet, but the safe route is to see these as crypto to crypto exchanges that realize capital gains. You may also elect to file these as non-taxable exchanges if you wish. We recommend that you consult a tax professional.\n\n> The IRS has not issued guidance about the tax treatment of multichain bridging. However, conceptually the action is similar to wrapping or minting a token. For example, Interlay allows users to mint bitcoin onto Polkadot as PolkaBTC.\n\n> Thus, like minting or wrapping tokens, bridging crypto could likely be interpreted as either a taxable or non-taxable event. We recommend you consult a tax professional about which treatment to choose.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hjoycwo",
                                            "author": "nishinoran",
                                            "score": 1,
                                            "created_utc": 1636304013.0,
                                            "response": "If you do what they described, converting to another token, yes, but if it's not converted then no.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hjoyhbc",
                                                    "author": "imacomputertoo",
                                                    "score": 2,
                                                    "created_utc": 1636304060.0,
                                                    "response": "How do you use layer 2 without converting?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hjp9k1p",
                                                            "author": "nishinoran",
                                                            "score": 1,
                                                            "created_utc": 1636308483.0,
                                                            "response": "Withdraw to a roll-up like Arbitrum or Optimism and I don't believe it would be a taxable event, however they probably don't support withdrawing all ERC-20s, not sure.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hjotpsf",
                                    "author": "Cryptolution",
                                    "score": 6,
                                    "created_utc": 1636302180.0,
                                    "response": ">Convert to matic and withdraw to polygon network then rebuy your tokens.\n\nThis puts you on a side chain. No thanks :) if this person is a long-term holder they can hold a little bit longer for roll ups and stay off side chains",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjp1tfv",
                                            "author": "SendN00dles1",
                                            "score": 4,
                                            "created_utc": 1636305389.0,
                                            "response": "My point was to show there are cheaper ways to get to L2. Once you're in L2 you can bridge from polygon to arbitrum or optimism rollups using cbridge or hop protocol for very cheap.\n\nI agree polygon doesn't inherit the eth network security since it's a sidechain. I still like using polygon for its low fees and understand the risks but it's worth it to me.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hjp3iqm",
                                                    "author": "Cryptolution",
                                                    "score": 1,
                                                    "created_utc": 1636306053.0,
                                                    "response": "Agreed cheers",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hjovkq9",
                                    "author": "frozengrandmatetris",
                                    "score": 2,
                                    "created_utc": 1636302929.0,
                                    "response": "> Total transaction will be less than $30 to move to L2.\n\nthis is where the problem is. all ERC-20 balances across the network that are worth less than $30 cannot be moved into L2. I got 5 DAI and less than 2 REP. unless the L1 network fees go down to less than that, it's gone. this is probably affecting millions of dollars worth of cryptocurrency. then what if I have $50 worth of an ERC-20 token? a $30 haircut.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjp281c",
                                            "author": "SendN00dles1",
                                            "score": 4,
                                            "created_utc": 1636305547.0,
                                            "response": "I get it, funds like that will most likely be stuck forever or wait until fees go down during the next bear. I hope they aren't significant amounts to you. It's part of the downsides to being early adopter.\n\nIn the future users will onboard directly to L2 and not be stuck.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hjqytrc",
                                    "author": "FaceDeer",
                                    "score": 1,
                                    "created_utc": 1636333812.0,
                                    "response": "> Why don't you send your erc20 to\n\nThat's the problem step, though. That first \"send\" has to be a L1 transaction, which is expensive. If the user has $20 worth of tokens in that wallet there's no point in trying to move it.\n\nUnfortunately there may be no solution to this problem, small balances on layer 1 may simply be \"lost\" at this point. All I can suggest is hanging on to your keys and waiting, perhaps there'll be a \"lull\" in L1 demand if a whole bunch of dapps switch over to L2 at once or something.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hjreq39",
                                    "author": "ubsr1024",
                                    "score": 1,
                                    "created_utc": 1636341407.0,
                                    "response": "Rebuy? Aren't these all taxable events... I guess you guys probably don't do this part of your taxes?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hjoy705",
                            "author": "FinancialRevltn",
                            "score": 0,
                            "created_utc": 1636303949.0,
                            "response": "I’m with you bro! This ETH fans trying to defend the undefendable. L2 does not solve the gas fees completely. Why wait Sharding when other techs  like Harmony $ONE have it- when is processing the double of transactions than ETH for a fraction of a penny. So many better options than ETH that can reach mainstream with a great value proposition",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hjoavrp",
                            "author": "ShopDiesel",
                            "score": -3,
                            "created_utc": 1636294283.0,
                            "response": "That was my initial thought too but didn't have anecdotal experience to back me up",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjod66y",
                                    "author": "frozengrandmatetris",
                                    "score": 3,
                                    "created_utc": 1636295355.0,
                                    "response": "how much does it cost to send any amount of an ERC-20 token anywhere and what does that mean for balances that are less than that amount?\n\nthis exact same thing happened to bitcoin. many UTXOs were less than the fee to spend a UTXO and maxipads were everywhere telling people to \"just use lightning bro\" when a lot of money couldn't even be moved into it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hjorobb",
                            "author": "morningtundra",
                            "score": 1,
                            "created_utc": 1636301366.0,
                            "response": "I’m in the same situation with ETH locked in Coinbase. Are these funds now essentially lost forever?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjpq6p1",
                                    "author": "Jedibeeftrix",
                                    "score": 3,
                                    "created_utc": 1636314932.0,
                                    "response": "Why would eth locked in coinbase be lost forever?\n\nForgive me if this is a silly question.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjpqq9i",
                                            "author": "morningtundra",
                                            "score": 0,
                                            "created_utc": 1636315138.0,
                                            "response": "Because gas fees exceed the balance.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hjr1hsd",
                                                    "author": "jcm2606",
                                                    "score": 2,
                                                    "created_utc": 1636335073.0,
                                                    "response": "Your coins are on a centralised exchange. More and more centralised exchanges are supporting direct withdrawals to L2s, without ever touching the L1. Wait until Coinbase supports direct withdrawals to Arbitrum or another L2, then move your ETH.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hjsahb9",
                                                    "author": "smokedetective",
                                                    "score": 0,
                                                    "created_utc": 1636363632.0,
                                                    "response": "Then sell? Or buy more? If gas fees exceed your balance then that's all on you.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hjq4w7g",
                                    "author": "Maswasnos",
                                    "score": 2,
                                    "created_utc": 1636320701.0,
                                    "response": "No? Coinbase is working on direct-to-L2 withdrawals. Alternatively you can just send it directly from CB to any other exchange offering L2 withdrawals.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hjpst6p",
                            "author": "Perleflamme",
                            "score": 1,
                            "created_utc": 1636315940.0,
                            "response": "More than $16, you mean? That's how much it costs from biggest CeFi platforms to go to some L2s.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hjrpl4o",
                            "author": "PouItrygeist",
                            "score": 0,
                            "created_utc": 1636347280.0,
                            "response": "That is not the chains fault but yours for using something you where not prepared for. There are NFTs already being bought and sold on L2s.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hjo7j9q",
                    "author": "VarenDerpsAround",
                    "score": 25,
                    "created_utc": 1636292627.0,
                    "response": "*Title*\n\nMe an intellectual: Uses layer2\n\nnext....",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjq4z34",
                            "author": "1solate",
                            "score": -6,
                            "created_utc": 1636320734.0,
                            "response": "Imagine calling yourself an intellectual with a straight face.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hjogjrd",
                    "author": "yeetsfeetsdeletes",
                    "score": 7,
                    "created_utc": 1636296805.0,
                    "response": "Sounds like you and a lot of people still don't understand Ethereum's roadmap. A massively decentralized Ethereum plus sharding and rollups will eliminate high gas fees and already is on arbitrum and optimism.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjqlbcr",
                            "author": "ShopDiesel",
                            "score": -2,
                            "created_utc": 1636327678.0,
                            "response": "If it's already live, then why are gas fees so high?\n\nWhile Ethereum Network takes its time, mainly other protocols are already there, working towards the next milestone.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjqzbsn",
                                    "author": "FaceDeer",
                                    "score": 3,
                                    "created_utc": 1636334051.0,
                                    "response": "People aren't using them enough yet. People and dapps have to actually switch over, it's not an automatic upgrade.\n\nPanicking now is like clicking \"buy\" on a website to purchase a plane ticket, and then immediately complaining \"why aren't I in the air yet!?\"",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hjr3ccb",
                                    "author": "jcm2606",
                                    "score": 1,
                                    "created_utc": 1636335941.0,
                                    "response": "> If it's already live, then why are gas fees so high?\n\nBecause you're using the L1 network, and block space on the L1 network is *very* valuable because it's limited. If you want cheap fees, move to an L2 network like Arbitrum or Optimism, which can more efficiently use that L1 block space to reduce fees charged within the L2. It'll cost one last full price L1 fee, but once you're in an L2, you'll never have to touch the L1 network ever again.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hjrjo71",
                                    "author": "yeetsfeetsdeletes",
                                    "score": 1,
                                    "created_utc": 1636343938.0,
                                    "response": "They aren't high. Arbitrum and optimism gas fees are pretty low already and they haven't even taken the \"training wheels\" off yet. You are thinking about layer 1 ethereum transactions. We're talking about layer 2 rollups that with sharding will beat other layer 1s in the long term in terms of security and throughput. \n\nAnd I'm curious what this next \"milestone\" is you are talking about for other projects. I'm not by any means a maximalist, I believe there are merits to other projects as well as some flaws to ethereum, but regardless of the layer 1, in the long term rollups will prevail.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hjojrgg",
                    "author": "Moonlapsed",
                    "score": 7,
                    "created_utc": 1636298187.0,
                    "response": "Stupid coredevs cant deliver a finished product day 1!!! Why cant they just solve the trilemma now?! Idiots.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjqzqjm",
                            "author": "henrygi",
                            "score": 2,
                            "created_utc": 1636334245.0,
                            "response": "Trilemma?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjr3ewi",
                                    "author": "jcm2606",
                                    "score": 3,
                                    "created_utc": 1636335976.0,
                                    "response": "https://academy.shrimpy.io/post/what-is-the-blockchain-trilemma",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjrn7mu",
                                            "author": "henrygi",
                                            "score": 1,
                                            "created_utc": 1636345870.0,
                                            "response": "Thanks",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hjr28q1",
                                    "author": "Moonlapsed",
                                    "score": 1,
                                    "created_utc": 1636335421.0,
                                    "response": "Google \"blockchain scalability trilemma\". Each L1 chain is trying to solve this in their own way. \n\nThe arguement is that ETH makes no sacrifices to decentralization, whereas others do. Hence the current gas prices. It is not an easy issue to solve but ETH has a roadmap. Other L1's just sacrifice decentralization.\n\n This is why I bet longterm ETH as the premiere L1 smartchain. Lots of people think ETH should have had the answers to start with, its laughable; it's literally cutting edge R&D.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hjomq60",
                    "author": "thesuperspy",
                    "score": 6,
                    "created_utc": 1636299395.0,
                    "response": "This is literally why everyone says to use layer 2. Even Vitalik says layer 2 and zkrollups are the future of Ethereum scaling.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjoy72e",
                    "author": "Anxious_Matter5020",
                    "score": 3,
                    "created_utc": 1636303950.0,
                    "response": "ZkRollups by Loopring (LRC) baby, this is the way",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjomlwi",
                    "author": "PrestigiousAd5646",
                    "score": 16,
                    "created_utc": 1636299347.0,
                    "response": "This sub needs to start doing something about these posts. People post this same content every day, and for some reason the community has to, once again, point out how uninformed OP is. \n\nAt this point, if you don’t understand how this problem is being solved, you’re too lazy to care.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjr6ajt",
                            "author": "Logan_Wright",
                            "score": 2,
                            "created_utc": 1636337330.0,
                            "response": "Maybe because these posts are calling out something very important.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjs6nhx",
                                    "author": "Kiwi_Global",
                                    "score": 5,
                                    "created_utc": 1636360078.0,
                                    "response": "and everyone knows its important and explains it over and over again",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hjo7vvc",
                    "author": "Icy_Rhubarb2857",
                    "score": 6,
                    "created_utc": 1636292805.0,
                    "response": "Loop ➰",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjopatk",
                    "author": "New_Firefighter_5416",
                    "score": 2,
                    "created_utc": 1636300420.0,
                    "response": "The gas fee problem is already being addressed by Cartesi with implementation of different optimistic rollups. \n\nIt runs heavy computations off-chain on Cartesi machines and since these support linux, developers can easily do away with solidity and the limitations of Ethereum virtual Machines to create smart contracts using mainstream software stacks.  \n\nThis is the first of its kind.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjp2961",
                    "author": "rmortz",
                    "score": 2,
                    "created_utc": 1636305559.0,
                    "response": "Have you done no research about roll ups, before posting this?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjp6nyt",
                    "author": "emareddit1996",
                    "score": 2,
                    "created_utc": 1636307321.0,
                    "response": "No it wont. If gas fees were a problem it wouldn’t never reach its current price. You cant expect pay $20 on gas for a Ferrari.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjqkvvz",
                            "author": "ShopDiesel",
                            "score": 2,
                            "created_utc": 1636327497.0,
                            "response": "You prove my point.\n\nAverage users don't drive a Ferrari",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjr3m3x",
                                    "author": "jcm2606",
                                    "score": 2,
                                    "created_utc": 1636336071.0,
                                    "response": "And yet literally every transaction on the L1 network is a Ferrari, because the L1 network is secure and people pay top dollar for that security. If you want to drive an average sedan, move to an L2.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hjpm7yy",
                    "author": "Not_A_Sholva",
                    "score": 2,
                    "created_utc": 1636313365.0,
                    "response": "I bet if you wrote a song about this you could win Eurovision",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjqjuhj",
                            "author": "ShopDiesel",
                            "score": 1,
                            "created_utc": 1636327051.0,
                            "response": "Nah, my voice is terrible",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hjqdiha",
                    "author": "manly_",
                    "score": 2,
                    "created_utc": 1636324290.0,
                    "response": "Hate to say it, but most people won’t use crypto wallets. They’ll use a custodial service like coinbase which basically eliminates fees.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjqi0zt",
                            "author": "ShopDiesel",
                            "score": 1,
                            "created_utc": 1636326240.0,
                            "response": "Yup. Because avg consumers don't care about decentralization. \n\nWe are not avg consumers.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hjqffya",
                    "author": "kindoflikesnowing",
                    "score": 2,
                    "created_utc": 1636325117.0,
                    "response": "I think you're totally missing a lot of important info.\n\nFor one ppl are using Ethereum because it is the most secure, highest security blockchain atm. Ppl who want the best security and secure high value demand Ethereum. Not because of some weird equalibrium. \n\nI would say you might get downvoted because you didnt mention scaling solutions which will ve a huge part of scaling TPS.\n\nIm the opposite, slighly more short term bearish (as scaling solutions have proved to not be so easy to simply roll out) but long term bullish. I think in the long term UI improves so much, atm new users have to wrap their heads about too much technically and all these diff networks.\n\nI think in the future users will use an Ethereum scaling solutions without even knowing so. Its like YouTube or other front end services. The average consumer doesn't need to know about which serves or technical specifics on how YouTube runs. This is the exact same for engaging with many early dApps.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjqhvk2",
                            "author": "ShopDiesel",
                            "score": 0,
                            "created_utc": 1636326174.0,
                            "response": "If the community values what you say, then that's baked into the demand side of the supply-demand curve. You should look into this as it's a foundational economic concept.\n\nIf fees are still high, back-end producers will eventually push costs to front-end consumers. This too is a foundational economic concept.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjqle3m",
                                    "author": "kindoflikesnowing",
                                    "score": 3,
                                    "created_utc": 1636327711.0,
                                    "response": "I understand economics, I have an economics degree. I think you're still missing the whole point. High fees are a result of network demand and limited block space available on the Ethereum L1. Users will use L2 not L1.\n\nOnce scaling solutions like Optimimism and Arbitrum no longer have their training wheels on (atm TX and throughput are capped as they're still really soft launching). Then there are ZK roll-ups which are seen as the end goal.\n\n>\"If fees are still high, back-end producers will eventually push costs to front-end consumers. This too is a foundational economic concept.\"\n\nYou're missing the point again. High fees will only be on Ethereum L1. Regular users or anyone will small amounts of crypto will not be using the base layer. They will be using L2 solutions as mentioned, which have much much much lower fees (especially once or if everything comes together).\n\nAgain, I take you back to my YouTube example. We are still in very primative UI state, to meet consumer needs and make it easy for ppl to transact alot of users will not even know they are using an Ethereum scaling solution. ATM there is not the infrastructure or UI focus to make this happen as there is a need to deliver the scaling solutions first, and then better UI will come later.\n\nYou seem to be stuck on the fact that regular users will be using Ethereum L1and scared of high gas. This is how it is atm, but long term regular users will NOT be using L1.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjqlwmv",
                                            "author": "ShopDiesel",
                                            "score": 1,
                                            "created_utc": 1636327933.0,
                                            "response": "If L2 protocols pay for L1 fees, L2 protocols won't consider the fees as sunk costs. They will push the fees to consumers much like how taxes are paid by consumers not producers.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hjqpd3x",
                                                    "author": "kindoflikesnowing",
                                                    "score": 4,
                                                    "created_utc": 1636329451.0,
                                                    "response": "&#x200B;\n\n>If L2 protocols pay for L1 fees, L2 protocols won't consider the fees as sunk costs.\n\nThis might be incorrect (please anyone correct me if I'm wrong) but Arbitrum don't pay for the fee, you do. When you withdraw your crypto from L2 to L1 it takes 7 days and they are batched so you're paying for the withdrawal.\n\nAs per the validating of transactions there is profit margins involved from what I understand. When you pay transaction fees on Arbitrum, a portion of it goes to Arbitrum, while the rest is put back into paid to Ethereum for security and data availability.\n\nThey are public goods essentially, but there is profit margins involved from what I understand. \n\nI know Optimism is set up as a Public Benefit Corporation, according to Optimisms  website \"Until the project is fully decentralized, we will be donating all profits from running a centralized sequencer towards scaling and sustaining public goods.\" So they are able to make some money via this it seems which can help ensure fees are low and pay for security.\n\nI'm not sure it is as clear cut as \"L2 protocols pay for L1 fees\" as the lower fees itself are a feature of it's security and product, which can be helped by the above mentioned profit margins.\n\nAgain,I encourage anyone to correct me if I'm wrong, just providing my understanding. This is complex and a lot of moving parts.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hjqrddo",
                                                            "author": "ShopDiesel",
                                                            "score": 2,
                                                            "created_utc": 1636330346.0,
                                                            "response": "I appreciate your response. I think its the best thus far.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hjqm49v",
                                            "author": "kindoflikesnowing",
                                            "score": 1,
                                            "created_utc": 1636328024.0,
                                            "response": "The end goal is to deliver the TPS to meet the huge demand for secure block space.   \n\n\nI don't think Ethereum will be the only Blockchain, and we are in a multi chain world. There will be many other blockchains to use that may deliver different needs that help to eat up all this demand for block space.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hjr9zfx",
                    "author": "FamiliarDisaster325",
                    "score": 2,
                    "created_utc": 1636339073.0,
                    "response": "valid concern, but we are still very early. Honestly a good thing that adoption is slow and steady to avoid issues like this",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjrowhf",
                    "author": "couple4hire",
                    "score": 2,
                    "created_utc": 1636346861.0,
                    "response": "and yet bitcoin fees are getting cheaper,  and binance showed how fees can be controlled\n\nso it just seem ETH developers really just don't care\n\nwhen it cost $20 just to move coin from one wallet to the other, you know thats garbage",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjrqgun",
                            "author": "ShopDiesel",
                            "score": 1,
                            "created_utc": 1636347839.0,
                            "response": "They dont care because they're relying on L2s.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjrsofg",
                                    "author": "couple4hire",
                                    "score": 1,
                                    "created_utc": 1636349276.0,
                                    "response": "thats what they been saying since when?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hjs8ejr",
                                    "author": "Kiwi_Global",
                                    "score": 1,
                                    "created_utc": 1636361672.0,
                                    "response": "what it wrong with relying on l2? so you entered this space like few days ago and now everyone has to caress you? the nerve. also like how people are jelly on some og ethereum users who can afford current fees but when the eth dropped -90% for few times in last years most of you were probably laughing about it",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjsc2rn",
                                            "author": "ShopDiesel",
                                            "score": 1,
                                            "created_utc": 1636365094.0,
                                            "response": "I don't know what to say brosef. But the saltiness in this thread is eye opening.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hjsd55i",
                                                    "author": "Kiwi_Global",
                                                    "score": 1,
                                                    "created_utc": 1636366059.0,
                                                    "response": "thanks for proving everyones point, again.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hjs86xl",
                            "author": "Kiwi_Global",
                            "score": 1,
                            "created_utc": 1636361472.0,
                            "response": "yes binance can control the fees, just like it can control to take your money when it whishes. you have no idea what you are talking about right? binance is a copy paste centralised ethereum. of course they can have cheaper fees, you could have them using a normal database",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hjq8zse",
                    "author": "busterrulezzz",
                    "score": 3,
                    "created_utc": 1636322382.0,
                    "response": "Those posts are getting really annoying. I will always listen to the bear case for ETH, but we need to stop paying attention to people who are apparently unable/unwilling to learn anything about L2s, sharding, etc.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjqipsj",
                            "author": "ShopDiesel",
                            "score": 0,
                            "created_utc": 1636326549.0,
                            "response": "Are sharding, ZK and Optimistic rollups operational?\n\nNo\n\n\"It's on our roadmap\"\n\nWell...okay... \n\nThis is while others are making big gains in the market. \n\nAt a certain point, we all should reflect if this protocol is still the future.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjqo640",
                                    "author": "busterrulezzz",
                                    "score": 4,
                                    "created_utc": 1636328925.0,
                                    "response": "Multiple ZK and optimistic rollups are already operational, so you clearly have no idea what you're talking about. If I need to explain to you what is Arbitrum or zkSync and how it's been live for a few months now, then you are not worth my time.\n\nAt a certain point, we all should reflect about why we tolerate such bad faith noobs in our community.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjqrpks",
                                            "author": "ShopDiesel",
                                            "score": -1,
                                            "created_utc": 1636330500.0,
                                            "response": "If this is the attitude of many Ethereum acolytes, then add this to the multiple reasons why this protocol could be the next Blockbuster or MySpace.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hjqvjvc",
                                                    "author": "busterrulezzz",
                                                    "score": 1,
                                                    "created_utc": 1636332251.0,
                                                    "response": "You told me no L2 roll-ups were operationnal, I proved you wrong. You should be thankful I took the time to make you learn something today.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hjr3pxq",
                                    "author": "jcm2606",
                                    "score": 1,
                                    "created_utc": 1636336122.0,
                                    "response": "https://l2beat.com/\n\nhttps://l2fees.info/",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hjo4abb",
                    "author": "knotglass",
                    "score": 5,
                    "created_utc": 1636290909.0,
                    "response": "Not to mention I don’t think people are considering how difficult it’s going to be to get someone to understand what they do on loopring or polygon is actually on ethereum, because sometimes it isn’t? A few too many people are going to buy some NFT or something and then get told it’s no where near as useful as they thought it was because this one isn’t on the main chain even though their buddy managed to do it. Oh, and no takebacks…\n\nThis stuff is so cool, and I think that the next 3 - 5 years this ecosystem is going to blow up, but if it ever truly makes it out of beta I’ll be surprised. Because you either get one primary L2, which sounds less decentralized; or several with a huge branding problem. And a deflationary currency, that is supposed to be decentralized, but has been mostly accumulated before most people have started using it feels like it’s going more down the path of the status quo than we might like the think.\n\nEdit: But actually I think that that - depending on the cost - people are willing to pay for things like security and privacy, as long as they are convinced it’s important and affordable. And I think the right blockchain has the possibility to make that so cheap that it is practically free, dunno which.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjr31o0",
                            "author": "jcm2606",
                            "score": 4,
                            "created_utc": 1636335802.0,
                            "response": "There are solutions to these problems in the works for ZK rollups, such as [shared liquidity between L2s through dAMMs deployed to the L1](https://medium.com/starkware/damm-decentralized-amm-59b329fb4cc3), and [L1 <-> L2 composability (being able to interact with contracts/wallets that are on the L1 chain from within an L2, and vice versa) through a middleman](https://medium.com/loopring-protocol/composability-between-ethereum-layer-1-and-2-10650b7411e5).\n\nThe entire space is just so incredibly young, that innovations are happening left and right, and the one innovation that will make this all seamless has yet to happen. It's like trying to pass judgement on the internet when it was mostly a series of sparse networks that were kind of globally interconnected, where you needed an IT degree to really use it to its full potential.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjr6m98",
                                    "author": "knotglass",
                                    "score": 1,
                                    "created_utc": 1636337475.0,
                                    "response": "Thanks for sharing those articles, I'm excited to read them! I don't mean to make it sound like a judgement, like I said, I'm definitely stoked on what people are going to come up with, and I think the next few years are going to be both exciting and disruptive. And I'm definitely not selling my Eth! But just because something is disruptive doesn't mean it has to be dominant in the long run, and I think it's important to be honest about it's pitfalls. Obviously people in the space are doing that and their capacity to innovate is nothing short of mindblowing to me. However as someone who is not a computer scientist, but who does build and develop things, I can tell you not everything can be fully functional simply because there are fundamental flaws in design that you couldn't possibly anticipate at the time you built it.\n\nDunno if that is the case here in a fatal way, but I spent a little while learning about IT things earlier this year, and while the user experience of the internet has changed a bit, there are quite a few layers happening behind the scenes; and most of those have been upgraded/changed dramatically since the internet was first created. I think the difference as I see it, is \"the internet\" is more comparable to blockchain technology, as opposed to Ethereum which is actually more of a protocol, but even now that I'm saying that I think that my understanding may be lacking.  I'm super excited to see one way or the other what happens in this ecosystem and everything else in this space, and I kind of expect there will not be a definitive answer for a long time, if ever!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hjoix60",
                            "author": "Rock_15_",
                            "score": 2,
                            "created_utc": 1636297825.0,
                            "response": "Sorry for this noob question; but don't you think people will just use other blockchains instead of eth for easier user experience? In the next 5 years, the competitors will be moving ahead with their respective roadmaps too. Please correct me if Im wrong.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjq5lqv",
                                    "author": "Maswasnos",
                                    "score": 6,
                                    "created_utc": 1636320987.0,
                                    "response": "1) Using an L2 is just as easy as using another monolithic L1\n\n2) The *only* way for blockchains to scale for global adoption is through ZK-based rollups. There is no alternative in existence at this point in time.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjr6h2u",
                                            "author": "Logan_Wright",
                                            "score": 1,
                                            "created_utc": 1636337411.0,
                                            "response": "Someone’s been listening to too much Bankless",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hjov9ca",
                                    "author": "ItsAConspiracy",
                                    "score": 4,
                                    "created_utc": 1636302803.0,
                                    "response": "There's no reason L2 has to be hard. It's just another client.\n\nIf the UI is easy, then using L2 will actually be easier than using another chain, because you could switch between L2s without going through an exchange.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hjota10",
                                    "author": "knotglass",
                                    "score": 1,
                                    "created_utc": 1636302004.0,
                                    "response": "Also new to the space over here! I do think that people will use other chains, but I think there are a few things that will keep Ethereum in focus. First, it’s volume and current utilization is so much bigger other projects aren’t really comparable right now, and while things may make sense in theory there are reasons why most new projects haven’t succeeded, and I’m sure that will continue to be true. \n\nSecond, we as users are getting a look at past development, given how the past year has been I’m sure there is an absurd amount of stuff that will be coming out in the next few years and much of it will be on Ethereum in no small part due to point one, so I think it’s only going to get more functional. This will also be happening on a wide variety of other projects, but the variety will hinder any of them from being dominant until one or more really prove themselves in terms of security and development in addition to functionality. Because it’s really about balance, which is my third reason. The more people that use it makes it more secure, which makes it more appealing to those who haven’t been brave enough to make the jump yet. \n\nAnd fourth, if you are someone who has been in the space for a few years at least (most of the power users) then your cost average is so low that while it might gall you to pay $100 worth of Eth to execute a smart contract but I doubt you actually paid $100 for that Eth, and that’s a huge difference. I’m sure that that’s what they are hoping to have happen for people as they keep using it, but fairness is a very inmate quality in all mammals, and I think that this will come a foul of that instinct at some point without becoming deeply hypocritical.\n\nSo basically I think that like a lot of first movers that are truly something new, getting from vision to execution is so difficult and complicated that you change the global perception but it’s hard to beat the fact that someone can almost certainly build a better mousetrap. And as you said, they definitely already are, at which point the need for functionality will overcome security because functionality will equal security.\n\nHow about you? Why do you think people are going to flock to other projects?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hjoye9b",
                                    "author": "imacomputertoo",
                                    "score": 1,
                                    "created_utc": 1636304027.0,
                                    "response": "Not op, but I think mad adoption is still years away. Other Blockchains could eclipse Eth, but Ethereum has such a huge community and first mover advantage. There was a time a few years ago ,(2017 I think) then everyone thought BTCs high fees were going to kill it. Then they increased the block size and added lightning (layer 2). And BTC is still the most valuable coin. So there are other factors that make a crypto asset valuable and push back against the fears of high fees.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hjq6efr",
                    "author": "manucule",
                    "score": 2,
                    "created_utc": 1636321313.0,
                    "response": "I agree. \nFunny how the message of ETH hodlers changes over time - some months ago - ETH is the future - today people are slowly realizing - ETH blows hard as is, without L2 it will collapse. \nI believe in a cross chain future and not one king will rule smart contracts - but a smart contract platform can’t depend on others to survive. It’s like being the first fishing boat in an area, growing to a point where it doesn’t make sense to fish anymore, depending on the big boats to fish for you, buying the fish in the supermarket, and still wasting my time (and money) to go out fishing every day.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjqjads",
                            "author": "ShopDiesel",
                            "score": 1,
                            "created_utc": 1636326804.0,
                            "response": "Good point. \n\nAnd Ethereum Network's main usecase is DeFi. (This is a topic for another post) DeFi is a huge target for the SEC. DeFi is built upon fictitious collateralization, the SEC (imho) feels the same way. 2022 could be a rough ride for DeFi.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hjoax7r",
                    "author": "BobisaMiner",
                    "score": 0,
                    "created_utc": 1636294302.0,
                    "response": "Your threads make you look like a spam-bot. \n\nhttps://prnt.sc/1ynadmd",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjobb9n",
                            "author": "ChunderHog",
                            "score": 5,
                            "created_utc": 1636294491.0,
                            "response": "Thanks for finding this",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hjob2i4",
                            "author": "ShopDiesel",
                            "score": -3,
                            "created_utc": 1636294373.0,
                            "response": "I ain't clicking your dirty looking link",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjoc5cm",
                                    "author": "BobisaMiner",
                                    "score": 8,
                                    "created_utc": 1636294882.0,
                                    "response": "It's a screenshot of you constantly posting threads about ethereum fees(SPAM-BOT). \n\nIt's for the rest of the world to see.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjocsf6",
                                            "author": "ShopDiesel",
                                            "score": -6,
                                            "created_utc": 1636295178.0,
                                            "response": "👍 cool bro",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hjo9cr9",
                    "author": "Expensive_Coyote6301",
                    "score": 1,
                    "created_utc": 1636293538.0,
                    "response": "I totally agree, the one thing preventing me from using etherium is the gas fees, I genuinely just can't afford it 🤷‍♂️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjoh8pv",
                    "author": "leandroeidi",
                    "score": 2,
                    "created_utc": 1636297103.0,
                    "response": "My portfolio is mainly ETH, but more and more I'm thinking about converting some (most?) of it to Ethereum's competitors, simply because I noticed I myself stopped using Ethereum because of the gas fees. And sending things to L2 is not only expensive, but it's also confusing, with all the different L2 and whatnot. And now there's talk of rollups, whatever that is and however it's used. Too complicated/expensive for the general public.\n\nMeanwhile, it looks like the competitors are cheaper, faster, and no need to deal with separate... things like L2 or rollups. I expected the Ethereum move to PoS would solve most of these problems, but the more I learn about it, the more I'm convinced it'll hardly make a difference.\n\nSo I'm intensely debating with myself if I keep my investment in ETH the way it is, or if I make the move (of at least part of it) to another project that doesn't have these problems Ethereum has, before these other projects see an even bigger price rise and I make the move too late.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjs7vy5",
                            "author": "Kiwi_Global",
                            "score": 3,
                            "created_utc": 1636361195.0,
                            "response": "there is nothing wrong with hedging. but before you do it for a substantial amount please inform yourself with the risks. there is a reason why some networks are cheaper right now. it can seem unfair but for most new users currently the best strategy is to ride out the bull on more secure chain without too much interaction with it. in the last bull market the fees were horrible also. and people started switching and interacting with other unproven chains(which do get high prices indeed) just to end up bag holding a worthless token in the end. or start planning to move on l2 if you really need to interact so much with the chain.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hjo6724",
                    "author": "Dry-Significance-948",
                    "score": 1,
                    "created_utc": 1636291934.0,
                    "response": "Bro u playing with fire. *grabs popcorn*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjo6wcs",
                            "author": "ShopDiesel",
                            "score": 15,
                            "created_utc": 1636292297.0,
                            "response": "This subreddit isn't like Bitcoin subreddit. They're more open-minded for criticism. \n\nLet's be clear, I want it to succeed. I want lower gas fees.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjofkmb",
                                    "author": "ckh27",
                                    "score": 1,
                                    "created_utc": 1636296394.0,
                                    "response": "Polygon",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hjoe1ue",
                    "author": "Crypto_Fi",
                    "score": 1,
                    "created_utc": 1636295744.0,
                    "response": "LRC + ETH 2.0 will be a definite solution",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjo7vs1",
                    "author": "ohweoh",
                    "score": -2,
                    "created_utc": 1636292804.0,
                    "response": "This guy gets it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjobg4o",
                    "author": "GreatFilter",
                    "score": 1,
                    "created_utc": 1636294555.0,
                    "response": "There’s a lot of practical solutions available today discussed in this thread on r/cc\nhttps://www.reddit.com/r/CryptoCurrency/comments/qo9p01/how_in_the_world_do_i_make_money_when_faced_with/\n\nThe user experience is far from where it should be but a lot of the technology already exists in fragments with better things in the pipeline.\n\nHigh gas fees is a sign of strength because it demonstrates high demand. The majority of gas fees goes is paid back to Ethereum “shareholders” anyway, courtesy of EIP-1559, so while it sucks to have to pay them, it’s really a sign of strength for Ethereum as a whole.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjocx3k",
                            "author": "ShopDiesel",
                            "score": -1,
                            "created_utc": 1636295238.0,
                            "response": "I get your point, but average consumers don't care.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjog2a7",
                                    "author": "GreatFilter",
                                    "score": 3,
                                    "created_utc": 1636296602.0,
                                    "response": "The average consumer will just have to wait for improved UX that leverages the underlying technology. It’ll be cheap and transparent to them.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjql0q7",
                                            "author": "ShopDiesel",
                                            "score": 1,
                                            "created_utc": 1636327553.0,
                                            "response": "Uh, average consumers don't wait, they adapt lmao",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hjoc0ps",
                    "author": "Christophorus",
                    "score": 1,
                    "created_utc": 1636294823.0,
                    "response": "Lol, yes average consumers should not be using layer 1 unless they wish to hodl. Please let them know.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjon9e1",
                    "author": "WekX",
                    "score": 1,
                    "created_utc": 1636299613.0,
                    "response": "Waterloo, couldn’t escape if I wanted to.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjosmql",
                            "author": "morningtundra",
                            "score": 1,
                            "created_utc": 1636301745.0,
                            "response": "What is the scale of this problem? How many small users are stuck with holdings valued less than the gas fees?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hjot8nx",
                    "author": "ahungrylilsandwhich",
                    "score": 1,
                    "created_utc": 1636301988.0,
                    "response": "Good thing loopring is fixing this and GameStop will bring the masses with them onto the platform.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjqlecl",
                    "author": "abrown191",
                    "score": 1,
                    "created_utc": 1636327714.0,
                    "response": "That’s why I also hold Polkadot and Solana plus ALGO as viable alternatives 🤷🏻‍♂️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjo7qq6",
                    "author": "QuentaMantodea",
                    "score": -2,
                    "created_utc": 1636292732.0,
                    "response": "Same too me. ETH is like AOL for me.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjoa3yr",
                    "author": "-Splash-",
                    "score": -2,
                    "created_utc": 1636293911.0,
                    "response": "I hate to say it, but you are very convincing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjop644",
                    "author": "MycoHost01",
                    "score": 0,
                    "created_utc": 1636300368.0,
                    "response": "The internet of money should not cost [five cents](https://youtu.be/unMnAVAGIp0) that was three years ago. And here we are.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjoeq8a",
                    "author": "Crucif1ed",
                    "score": 1,
                    "created_utc": 1636296032.0,
                    "response": "I quite noob in this space but sometimes I have felt this too.. Like initially when I started investing in Ethereum and some other ERC-20 tokens..there was no way I could transfer my assets to a hardware wallet and keep it safe, as transferring would reduce it's value to less than 50% just because of network fees... (enlighten me if there is a way to overcome this 😅)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjogv4d",
                    "author": "glibbertarian",
                    "score": 1,
                    "created_utc": 1636296940.0,
                    "response": "First figure out what you want Blockchain technology to do for you.  If the only answer you can think of is \"number go up (in USD terms) then you're just speculating.  If you have some other use cases, then use the chain best at that specific use-case, or a product built around that chain.  You find you will want that use-case protected by maximal amount of security/decentralization, and that's what L2s are doing already.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjp3j4r",
                    "author": "moonpumper",
                    "score": 1,
                    "created_utc": 1636306057.0,
                    "response": "With a layer 0 chain (I won't mention by name on an Ethereum sub) having its own version of shards coming online in mid December I see a lot of people either moving there outright or beginning to interact with their Ethereum assets through bridges and wrapping. Or roll up layer 2s. Shards will go a long way to help.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjp4qro",
                    "author": "Mythril_Bahaumut",
                    "score": 1,
                    "created_utc": 1636306543.0,
                    "response": "There's an alternative... Loopring.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjp90e8",
                    "author": "mmarkomarko",
                    "score": 1,
                    "created_utc": 1636308269.0,
                    "response": "If Eth gas fees were reasonable, avax, Solana, ada, etc would not stand a chance!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjpb1te",
                    "author": "Fair_Still6667",
                    "score": 1,
                    "created_utc": 1636309049.0,
                    "response": "Damn dude you don't even understand what is going yet you post this? 2.0 is coming very soon, and guess what it's called mainnet for a reason. L2 will be growing all along it and are now.  Just stop. You really need to delve deep into ETH and understand what is happening.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjqm1d2",
                            "author": "ShopDiesel",
                            "score": 2,
                            "created_utc": 1636327990.0,
                            "response": "I stopped reading at \"very soon\"",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hjpbft7",
                    "author": "wesmokebud",
                    "score": 1,
                    "created_utc": 1636309196.0,
                    "response": "ETH be for rich folk",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjpodsy",
                    "author": "okwhoqueefed",
                    "score": 1,
                    "created_utc": 1636314219.0,
                    "response": "Agreed, I might look to sell my ETH soon and just buy some crypto ETFs. Since I don’t use ETH there’s not need to hold the coins itself but I’d still like to invest in the trend.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjqjsbi",
                            "author": "ShopDiesel",
                            "score": 1,
                            "created_utc": 1636327024.0,
                            "response": "Just be sure it's a spot etf",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hjpov12",
                    "author": "Fashrod",
                    "score": 1,
                    "created_utc": 1636314410.0,
                    "response": "Why are you even selling? Just Hodl!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjq12z2",
                    "author": "rubioberry",
                    "score": 1,
                    "created_utc": 1636319167.0,
                    "response": "Bots though..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjq42y4",
                    "author": "Sw33tN0th1ng",
                    "score": 1,
                    "created_utc": 1636320371.0,
                    "response": "Nope. You're kinda way behind on this topic.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjq5nvw",
                    "author": "Just_Trying2Makeit",
                    "score": 1,
                    "created_utc": 1636321012.0,
                    "response": "I guess you haven't heard about eth 2.0 update plans?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjq8o2b",
                    "author": "SirGalahead54",
                    "score": 1,
                    "created_utc": 1636322246.0,
                    "response": "i yesterday literally paid 100 dollars fee for a shitty 10 dollar eth send -_-",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjqneas",
                    "author": "TheBigSleep87",
                    "score": 1,
                    "created_utc": 1636328585.0,
                    "response": "Gas fees are the only reason I don't access DeFi.\n\nI understand that the problem is being addressed, but until it's fixed, very many people who are like me will stick to trading or investing in CEXes instead.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjqs1mq",
                            "author": "ShopDiesel",
                            "score": 1,
                            "created_utc": 1636330649.0,
                            "response": "I'm going to point something out, but I'm not picking on you.\n\nMany people hear Ethereum Network and think \"DeFi\". \n\nEthereum Network can be much more than this. But some people continue to only see it as DeFi. This isn't your fault though. I blame the Ethereum Foundation.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hjqy3t3",
                    "author": "FaceDeer",
                    "score": 1,
                    "created_utc": 1636333470.0,
                    "response": "Is anyone actually reading /r/ethereum before posting these days? There's a steady stream of \"OMG high gas fees\" and \"Ha-ha, high gas fees\" posts like this one, and a corresponding steady stream of comments explaining why it's unwarranted.\n\nInsert the standard \"layer 2 solutions are being rolled out as we speak, the complexity will be hidden behind UIs, other chains have low fees because they have low demand and would cost as much as Ethereum if everyone abandoned Ethereum to go over there instead\" response here I guess.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjr4a76",
                    "author": "DaedalusTW",
                    "score": 1,
                    "created_utc": 1636336390.0,
                    "response": "I agree with the broader point that fees need to go down for Ethereum to thrive long term. But the internet is not free. In any way.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjr65br",
                    "author": "peznagua",
                    "score": 1,
                    "created_utc": 1636337262.0,
                    "response": "Loopring solves these issues.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjrd4ng",
                    "author": "Pioca_in_heaven",
                    "score": 1,
                    "created_utc": 1636340617.0,
                    "response": "2nd layer can solve that, am I wrong?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjrfw7w",
                    "author": "shaunoconory",
                    "score": 1,
                    "created_utc": 1636341985.0,
                    "response": "LOOPRING",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjrl7wt",
                    "author": "kaioken1986",
                    "score": 1,
                    "created_utc": 1636344759.0,
                    "response": "What is L2?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjrpdwt",
                    "author": "PouItrygeist",
                    "score": 1,
                    "created_utc": 1636347156.0,
                    "response": "I guess it is worth saying again even though it has been said many times before. The reason Fees are so high is because so many people are using the chain. If you can't afford to use the main chain there are L2s ready for you to use.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjrsffc",
                    "author": "----Mike---",
                    "score": 1,
                    "created_utc": 1636349110.0,
                    "response": "\"no one will use btc. They will use low fee bch instead\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjruwlg",
                            "author": "ShopDiesel",
                            "score": 0,
                            "created_utc": 1636350778.0,
                            "response": "Lets discuss ERC20 only on this sub please",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hjryc8p",
                    "author": "ReadBastiat",
                    "score": 1,
                    "created_utc": 1636353279.0,
                    "response": "You misunderstand how L2s will work.\n\nRecommend educating yourself.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjryq10",
                            "author": "ShopDiesel",
                            "score": 1,
                            "created_utc": 1636353562.0,
                            "response": "Mr. Read ReadBastiat, that's why I'm here.\n\nPlease educate me. If not, then carry on.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hjryx89",
                                    "author": "ReadBastiat",
                                    "score": 1,
                                    "created_utc": 1636353712.0,
                                    "response": "That’s not how it works.\n\nYou made a dumb post with poor assumptions that demonstrates how little you understand what you’re “long term bearish” on.\n\nYou obviously have done nothing to educate yourself; why would I waste my time doing that for you?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hjrzqkp",
                                            "author": "ShopDiesel",
                                            "score": 0,
                                            "created_utc": 1636354324.0,
                                            "response": "Yet you use your time destroying other people?\n\nLet's build eachother up instead of tearing others down.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hjs8oxh",
                                                    "author": "Kiwi_Global",
                                                    "score": 1,
                                                    "created_utc": 1636361949.0,
                                                    "response": "check your post title please. you entered this conversation with specific mind set. some people will try to help you but others are kinda fed up with same posts over and over again. that is not your fault ofc. but its worth pointing out why people behave like they do when this posts pop out",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hjsbekr",
                                                            "author": "ShopDiesel",
                                                            "score": 1,
                                                            "created_utc": 1636364485.0,
                                                            "response": "If you're tired of it, then don't peruse subreddit or convince mods to ban critics.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hjsd2jp",
                                                                    "author": "Kiwi_Global",
                                                                    "score": 1,
                                                                    "created_utc": 1636365991.0,
                                                                    "response": "now you are spinning my words, worthy critic you are",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hjs3z48",
                    "author": "mr_properton",
                    "score": 1,
                    "created_utc": 1636357735.0,
                    "response": "Loopring has entered at the time of our greatest need!!\n\nBut srsly layer 2s will save the day",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjs9vgg",
                    "author": "Filibuster69",
                    "score": 1,
                    "created_utc": 1636363073.0,
                    "response": "Yeah, like an increasing queue of restaurant's guests wanting to pay more and more for a reservation ruins restaurants.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjsfzem",
                    "author": "sjalq",
                    "score": 1,
                    "created_utc": 1636368518.0,
                    "response": "This is the most \"I just heard about crypto and here's why it's broken\" post I've read in a loooooong time.\n\nThe masses don't matter, the masses of capital matters. The capital needs a safe secure place to live, once that is established, the masses begin to matter.\n\nYour EOS de jure blockchain will undoubtedly moon and make some VCs island rich, but when the dust settles, those progressing towards real economically feasible systems will remain.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjsk6hb",
                    "author": "C3PO2GEN",
                    "score": 1,
                    "created_utc": 1636371780.0,
                    "response": "Gas fees make it so useless ..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjtf3rc",
                    "author": "caseyreed97",
                    "score": 1,
                    "created_utc": 1636387475.0,
                    "response": "Layer 2 and loopring will solve this",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hk1msga",
                            "author": "ShopDiesel",
                            "score": 1,
                            "created_utc": 1636531725.0,
                            "response": "LRC's price action is making me want to believe! Lol",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hjuwt8e",
                    "author": "FictionPlanet",
                    "score": 1,
                    "created_utc": 1636408991.0,
                    "response": "You are absolutely right. Something like Avalanche will probably replace Ethereum.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hrad2x0",
                    "author": "obosio6",
                    "score": 1,
                    "created_utc": 1641342934.0,
                    "response": "  And they say no #NFTs on $ETC.... there is no better platform to manage high value contracts than on a trust-minimized PoW #blockchai, one that runs without the possibility of third party interference by trusted third parties..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjon8td",
                    "author": "Zzzzeon",
                    "score": -2,
                    "created_utc": 1636299606.0,
                    "response": "I was thinking the same. What stops people from moving to using bsc or sol chain? I can’t think of any reasons.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjov8ha",
                            "author": "darkwave90",
                            "score": 5,
                            "created_utc": 1636302794.0,
                            "response": "Bsc and Sol are centralized, though, and the whole idea of DeFi is being decentralized.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hjogmzq",
                    "author": "chi-ngon",
                    "score": -11,
                    "created_utc": 1636296843.0,
                    "response": "No wayyyyyyyyy but shiterium maxis are wayyy wayyy to dumb to understand and they cope with the traditional stop being poor lol 😂 bet most of them have kidnap tokens cuz the fees lmao",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjogo1r",
                            "author": "ghost_of_dongerbot",
                            "score": 3,
                            "created_utc": 1636296855.0,
                            "response": "ヽ༼ ຈل͜ຈ༽ ﾉ Raise ur dongers!\n\n^^Dongers ^^Raised: ^^58695\n\n^^Check ^^Out ^^/r/AyyLmao2DongerBot ^^For ^^More ^^Info",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hjonc67",
                    "author": "NaabKing",
                    "score": -2,
                    "created_utc": 1636299644.0,
                    "response": "Don't worry, Lightning on Bitcoin is fast, instant, anonymous and (almost) free.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjoypp2",
                    "author": "Sardon70",
                    "score": 0,
                    "created_utc": 1636304152.0,
                    "response": "I totally agree but some people simply cannot think, they just follow “dogma”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjpeozc",
                    "author": "Raytheonx1",
                    "score": 0,
                    "created_utc": 1636310461.0,
                    "response": "I think devs are handwaving on main chain scaling a lot. We should increase block size more aggressively too. I mean it takes around 140000 dollars to become a staker. Im sure they can afford a bandwith and harddrive space big enough to give main layer 200+ tps. I wonder why they dont tap into this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjpuqun",
                    "author": "RoarkeC",
                    "score": 0,
                    "created_utc": 1636316699.0,
                    "response": "Eth fees do need to be fixed. But I don’t even think Eth 2.0 can fix them. Some argue that L2s are the answer but I think other L1s are. Yesterday Hedera implemented an upgrade to transfer and run Eth smart contracts on the hashgraph easily. This means that there is no conceivable reason any consumers will be paying high fees.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hjpv3gl",
                            "author": "RoarkeC",
                            "score": 1,
                            "created_utc": 1636316834.0,
                            "response": "Here is an explanation  \n\nhttps://youtu.be/23vRl5Leq1E",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hjs64v2",
                    "author": "Kiwi_Global",
                    "score": 0,
                    "created_utc": 1636359609.0,
                    "response": "\"Mainstream consumers are accustomed to a free internet experience\" and thats why they all go to cheap alternatives and loose money when it all collapses.  You wont get a free lunch in this space, this isnt facebook type of thing. you are dealing with your funds and if you wish for them to stay secure you use more secure network, nevermind if its currently expensive to transact.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "nc4sta",
            "title": "I hate ETH and all their high transaction fees for other blockchains built on it! When will they sort it out?",
            "url": "https://www.reddit.com/r/ethereum/comments/nc4sta/i_hate_eth_and_all_their_high_transaction_fees/",
            "author": "Double_Concept2718",
            "created_utc": 1620985709.0,
            "score": 0,
            "num_comments": 18,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "gy2zbnu",
                    "author": "MinimalGravitas",
                    "score": 14,
                    "created_utc": 1620986726.0,
                    "response": "It's a problem of it's own success unfortunately. Bitcoin and Ethereum are the only 2 projects with sufficient use to fill the blocks, this means more users are trying to write to the chain than there is space to record it all. Because not everyone can get in we effectively have to compete for space by offering increased fees to ensure the miners pick our transaction over the others available.\n\nThe obvious question is why not increase the blocksize? The problem is that this increases requirements for those running the network's nodes and would mean less people do it, meaning Ethereum would become more centralized. This is why the Binance Smart Chain is able to have lower fees, the whole network is validated by only 11 active nodes, rather than the thousands that run the Ethereum network. Decentralization has a price, but luckily it is pretty well embedded in the project's core values.\n\nOther L1s which boast of much lower fees are able to do so because their network isn't experiencing use at the volume that causes the blocks to be full, meaning there is no competition for space and so fees can be as low as they like.\n\nI mentioned bitcoin has the same full block issue, but the difference is in the complexity of the data people are wanting to add to the chain. All you will really be doing with Bitcoin is recording a transfer from one address to another, this requires very little information to be recorded and so even if block space is in high demand you don't need to use much of it. In comparison, interacting with a smart contract to swap one token type for another requires more data to be recorded and so will be more expensive. If you're doing something even more complex like creating a Uniswap V3 liquidity pool, where price ranges need to be recorded and you're effectively minting an NFT for your unique segment of the pool then the cost to do so is even higher.\n\nIn the future we'll see more and more of the ecosystem's transactions move to L2 solutions, whether sidechains like Polygon/Matic (which you can already use with dApps like AAVE and Curve) or rollups (which you can use now with dYdX). Ultimately we might get sharding of the L1, where validators only build a segment of the network each blocktime, but that won't be coming for a while. Before that, once the merge to PoS is completed it might be possible to increase the blocksize, as without the demands of PoW the larger space required for each block shouldn't have such an effect on decentralization.\n\nEthereum is the biggest project in the whole of crypto in terms of developers and development, it's been copied countless times and has an entire new economic world being built upon it. If you want a token that you can send quickly and cheaply then there are much better options available, XLM or NANO would be more appropriate for a lot of simple use cases. If you want a tech that's easy to understand and more reliably predictable then go with BTC.\n\nEthereum isn't the best coin for many, many users, but it is the most interesting project I've ever followed and I want the future that is being build upon it. If something else takes the place of leading the DeFi world, maybe Cardano, Cosmos, Polkadot or whatever than I'll happily move to that ecosystem, but for now Ethereum is it, and because of that we have to suck up high L1 fees.\n\nIn the short term, L2 solutions are going to be the answer, that and watching the gas-price like a hawk for the best times to make your moves.\n\nhttps://ethereumprice.org/gas/",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gy30v2a",
                            "author": "aaqy",
                            "score": 5,
                            "created_utc": 1620988043.0,
                            "response": "I admire your patience for an obvious troll.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gy34tm1",
                                    "author": "MinimalGravitas",
                                    "score": 2,
                                    "created_utc": 1620991066.0,
                                    "response": "*The most dangerous of the three great enemies of reason and knowledge is not malice, but ignorance, or, perhaps, indolence.*\n\nCan't remember where I read that but it's a cool quote.\n\n\n\nCheck the OP's history, they seem to me to be uninformed and maybe ESL, but nothing indicates they are a troll (I've got a little experience in such things moderating the Trollfare subreddit!). They are invested in a swathe of memecoins so I reckon helping them to understand real projects is is worth a post.\n\n\n[EDIT - found it: ERNST HAECKEL - The Riddle of the Universe at the close of\nthe nineteenth century. Available at https://www.gutenberg.org/files/42968/42968-h/42968-h.htm]",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gy312f2",
                            "author": "Double_Concept2718",
                            "score": -2,
                            "created_utc": 1620988211.0,
                            "response": "Thanks for the explanation! Are you talking about physical Nano Ledger device? And how do I access XLM?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gy33t3y",
                                    "author": "MinimalGravitas",
                                    "score": 2,
                                    "created_utc": 1620990336.0,
                                    "response": ">Are you talking about physical Nano Ledger device? And how do I access XLM?\n\nNANO and XLM are alternative blockchains:\nhttps://101blockchains.com/what-is-nano-blockchain/\nhttps://101blockchains.com/what-is-stellar-blockchain/\n\nBoth of them are much cheaper to use than Ethereum if all you want to do is transfer value (e.g. moving from one fiat exchange to another).",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gy3e05f",
                                            "author": "Double_Concept2718",
                                            "score": 0,
                                            "created_utc": 1620996615.0,
                                            "response": "But can you physically swap from ETH to Nano/XLM and then for an ERC20 token/coin?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gy3jf5h",
                                                    "author": "MinimalGravitas",
                                                    "score": 1,
                                                    "created_utc": 1620999347.0,
                                                    "response": "So ERC20 tokens exist on the Ethereum network, NANO and XLM are on their own chains so you could only swap them at a centralized exchange (like Coinbase).",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gy2ypvy",
                    "author": "Acadia-Any",
                    "score": 6,
                    "created_utc": 1620986180.0,
                    "response": "That's what eth2.0 is all about, upgrading to a better way to handle transactions. It is coming, if they can get it done right, this thing will hit 10k easy, but if another chain can grab the attention, like algo or ada or dot and steal customers to from the network before it's established, that could be problems for eth.\nHonestly, I think it will work, the long term hold on eth has the fundamentals to 🚀🌑\nBut only time will tell.\n[Not a financial advisor and not financial advice]\nI know I am 💎👐 because I have my eth holdings staked on coinbase for 6% until the 2.0 upgrade launches. But that doesn't mean I didnt go pick up algo or ada at all 😉",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gy2yhpl",
                    "author": "mamadmetal",
                    "score": 3,
                    "created_utc": 1620985970.0,
                    "response": "I hope ETH 2.0 is not far away!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gy2yxsq",
                    "author": "detached-alliance",
                    "score": 5,
                    "created_utc": 1620986380.0,
                    "response": "ETH 2.0 should fix most of the problem, but for now other networks such as matic might be worth your while to take a look at as they have already integrated most of what ETH 2.0 sets out to achieve.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gy3164b",
                            "author": "Double_Concept2718",
                            "score": 0,
                            "created_utc": 1620988298.0,
                            "response": "Can ETH be converted to MATIC?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gy31dab",
                                    "author": "detached-alliance",
                                    "score": 2,
                                    "created_utc": 1620988464.0,
                                    "response": "Yes, I believe you can swap the two tokens easily enough on quickswap",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gy34omb",
                    "author": "straw_man2",
                    "score": 2,
                    "created_utc": 1620990966.0,
                    "response": "They will sort it out when competition appears. At the moment theres only \"soon chain X will beat ethereum\". Yeah, soon.. Im a firm believer in ada but I think eth will get off its ass once ada starts to actually be a threat. Alternativly, theres also the option eth is already doing everything it can. Which would mean there will just be for example 3 or 4 blockchains with simulair market caps. That would be pretty cool tbh.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gy2ygax",
                    "author": "TheHolySaintOil",
                    "score": 3,
                    "created_utc": 1620985933.0,
                    "response": "Let me introduce you to the polygon/MATIC network ...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gy318ik",
                            "author": "Double_Concept2718",
                            "score": -1,
                            "created_utc": 1620988354.0,
                            "response": "How do you convert ETH to MATIC?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gy3edtr",
                    "author": "Double_Concept2718",
                    "score": 1,
                    "created_utc": 1620996815.0,
                    "response": "Will switching to MATIC/Polygon reduce the gas fees when buying ERC20 tokens ?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}