{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "use1p1",
            "title": "Vitalik Attacks Ethereum",
            "url": "https://www.youtube.com/watch?v=Zlz1DmmdlwI",
            "author": "ShotBot",
            "created_utc": 1652883645.0,
            "score": 0,
            "num_comments": 7,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i92s2lq",
                    "author": "Consequenceplz",
                    "score": 2,
                    "created_utc": 1652883963.0,
                    "response": "Dude is too young to be a WEF conscript. I hope he manages to get out of their sights",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92xzit",
                    "author": "Dnisa911",
                    "score": 2,
                    "created_utc": 1652886454.0,
                    "response": "This video could be comfortably played and listen on x1.5/1.75 speed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i940q6k",
                    "author": "Feisty-Kitchen2760",
                    "score": 2,
                    "created_utc": 1652902163.0,
                    "response": "dyor",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93008q",
                    "author": "RoBiK75",
                    "score": 3,
                    "created_utc": 1652887291.0,
                    "response": "Another day, another utterly stupid post by ShotBot.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94pd0d",
                    "author": "Perleflamme",
                    "score": 1,
                    "created_utc": 1652912445.0,
                    "response": "So, someone else is showing they don't understand what engineering means, I guess. Finding contradictions and having to choose about compromises very often happens in software development. That's what Vitalik shows: compromises.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94r2o2",
                            "author": "ShotBot",
                            "score": 1,
                            "created_utc": 1652913216.0,
                            "response": "Lmao he is a giant hypocrite and doesn't even know it.\n\nHe suggested that Terra should use 1.5 billion dollars (which they don't actually have) to bail out users of UST and follow the FDIC standards of bailing out small holders. Funny how Vitalik is all about regulations and protecting the small guy until it's his own project, where he issues unregistered securities offering, premined all the coins, and rolls backrolled back the blockchain because Vitalik lost the Foundation's funds in a smart contract hack\n\nHistory keeps repeating. Do Kwon is basically doing the same thing as Vitalik did in 2016. He's going to rollback the blockchain into a new fork and dumb people will likely forgive this conman next cycle. Justin Sun, Dan Larimer, the same scammers keep scamming every hype cycle and the same idiots form cults around them.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}