{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uq7ill",
            "title": "Seeking advice & informative resources to convince my father, a professional stock trader, to invest in ETH",
            "url": "/r/ethtrader/comments/uq7crn/seeking_advice_informative_resources_to_convince/",
            "author": "yvesclover",
            "created_utc": 1652625691.0,
            "score": 1,
            "num_comments": 4,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8pcgel",
                    "author": "AESTHTK",
                    "score": 5,
                    "created_utc": 1652627653.0,
                    "response": "Listen to the most recent Bankless episode with Hal Press:\n\nhttp://podcast.banklesshq.com/betting-the-fund-on-the-merge-hal-press-north-rock-digital\n\nNot only does he make an extremely compelling argument for Ethereum as an investment, he uses traditional stock valuation concepts to argue the case - it’s extremely relevant to your exact situation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qicap",
                    "author": "RugsbyShillingham",
                    "score": 2,
                    "created_utc": 1652646060.0,
                    "response": "I saw someone put it something like this.\n\"The smartest hands on keyboards in the world are working on Blockchain\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pfmhq",
                    "author": "Sorry_Attitude_",
                    "score": 1,
                    "created_utc": 1652629092.0,
                    "response": "You don't. \n\nYou do not trade the internet do you? You cannot trade the roads, not the skies\n\nEthereum is infrastructure  \nConvince him to trade whatever is running on that chain, you can tell him of Angelblocks, a fund raising platform based on Ethereum, with some nfts coming out.\n\nTell him about the dexes and their governance tokens, show him TVL and how it works\n\nShow him DAO's, BitDAO and whatever else there is, why they are good to use and trade on chain\n\nBasically don't show him Eth trading, show him how to use ETH to trade other things on the chain. Or arbitrage it. \n\nYou don't trade dollars only if you do forex, but you use dollars to trade other things.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8rz28l",
                    "author": "dopef123",
                    "score": 1,
                    "created_utc": 1652670688.0,
                    "response": "Better not to convince people to invest in crypto. If they aren't passionate about it naturally it won't end well",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqckp6",
            "title": "Layer 2 in 2022: Are You Ready for Rollups, Bridges, New Apps, Life With Ethereum 2.0, and Layer 3?",
            "url": "https://www.reddit.com/r/ethereum/comments/uqckp6/layer_2_in_2022_are_you_ready_for_rollups_bridges/",
            "author": "Theodora765",
            "created_utc": 1652640309.0,
            "score": 261,
            "num_comments": 54,
            "subreddit": "ethereum",
            "selftext": "We all recall this is a pivotal year for Ethereum layer 2 (L2) solutions so what happens over the coming months will be critical in making decentralized finance (DeFi) work better, faster, and more reliably for a far greater number of users.  \n\nLast year saw L2 solutions roll out with great promise, increasing the number of decentralized apps across verticals such as exchanges, marketplaces, wallets, bridges, and more. Yet the growing user base and total value locked on Ethereum L2 were eclipsed by alternative layer 1 blockchains emerging to fill the market gaps that persisted such as Ethereum’s scalability issues.\n\n   With multiple apps deployed across chains, we are now seeing increasing fragmentation that adds complexity for end-users and detracts from the ultimate goal of making DeFi accessible for all. We have seen chains like smartchain develop cheap, fast and highly efficient solutions which helps launching of projects like Cake, Minosis, Xvs etc even more accesible.  Ethereum creator Vitalik Buterin has claimed that (L2s or) “rollups are in the short and medium-term, and possibly in the long term, the only trustless scaling solution for Ethereum”. \n\n We have seen this start to play out, with the total value locked (TVL) in layer 2 protocols such as StarkNet, Arbitrum, and Boba Network growing from USD 50 million to a high of USD 7 billion.  I look forward to what follows, do you think the L2 will be a total success?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8qbubh",
                    "author": "1moreOz",
                    "score": 101,
                    "created_utc": 1652643183.0,
                    "response": "A post about L2 not mentioning loopring or matic, interesting",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rku51",
                            "author": "Treyzania",
                            "score": 11,
                            "created_utc": 1652663874.0,
                            "response": "The Matic sidechain is not an L2, it's a sidechain.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8rw2fo",
                                    "author": "frozengrandmatetris",
                                    "score": 1,
                                    "created_utc": 1652669114.0,
                                    "response": "matic is the currency required to pay for transactions on multiple rollups that are currently in development. it is not just for the polygon sidechain.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8qg3pe",
                            "author": "frank__costello",
                            "score": 38,
                            "created_utc": 1652645070.0,
                            "response": "Don't worry, the shills will take care of it in the comments",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qljd6",
                                    "author": "Farge43",
                                    "score": 20,
                                    "created_utc": 1652647455.0,
                                    "response": "I know those are the popular ones. But is the hate for them purely due to people shilling because they got in at good entries and won’t stop talking about it? Or is there legitimate reason to not agree with one or both of the projects? \n\nIf so why? And also if so (or regardless) which are you intrigued by?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8qnub7",
                                            "author": "domotheus",
                                            "score": 33,
                                            "created_utc": 1652648438.0,
                                            "response": "Well I can't speak for my boy Frank, but for me it's slightly less annoying since Loopring is still a part of the overall ethereum ecosystem, and pays L1 for its security etc. So at least Loopring is ethereum-aligned and doesn't pretend it's gonna kill it. \n\nWhat *is* annoying however is the usual hype from crypto bros who barely understand what they're shilling, they just want line to go up. They show up whenever rollups are being discussed, and it's usually irrelevant as Loopring is still an application-specific rollup which doesn't help the guy trying to do the fun DeFi stuff beyond just trading coins. This 100% would not happen if Loopring didn't have a token and used ETH for its fees, like Arbitrum and Optimism. \n\nI understand they're working on a zkEVM, but until they deliver, Loopring doesn't deserve to be brought up all the time. Partnerships and what not, sure, that's cool and good for Loopring, but that's very rarely what the discussion is actually about when someone brings up LRC. It's just vague claims of it being the future of everything when there's EVM-compatible solutions working today.\n\nBut yes, nothing against Loopring per se. If they do deliver on a zkEVM then that'll actually be super cool and *then* it'll be worth to bring it up when people complain about gas fees being too expensive to play around with dapps, and I'll most likely bring it up myself as well.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8rr1db",
                                                    "author": "Pooponclinton",
                                                    "score": 5,
                                                    "created_utc": 1652666706.0,
                                                    "response": "When line go up?",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8rs3f8",
                                                    "author": "lorenzomofo",
                                                    "score": 2,
                                                    "created_utc": 1652667191.0,
                                                    "response": "How did Loopring and ImmutableX get enough followers to change the Ethereum logo in r/place to  include the Loopring and ImmutubleX logo?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8sipe3",
                                                            "author": "Japappelflap",
                                                            "score": 4,
                                                            "created_utc": 1652683630.0,
                                                            "response": "Gamestop.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8sqqeb",
                                                                    "author": "lorenzomofo",
                                                                    "score": 0,
                                                                    "created_utc": 1652690605.0,
                                                                    "response": "But does that mean GameStop has more resources/followers than Ethereum? That sounds backwards, since the Loopring/ImmutableX protocol is built on top of Ethereum.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8svstr",
                                                                            "author": "jcm2606",
                                                                            "score": 2,
                                                                            "created_utc": 1652695223.0,
                                                                            "response": "Gamestop had a ton of mainstream attention from the GME fiasco, so all it took was a rumour of a potential Gamestop/Loopring/ImmutableX team up for the hype to build to crazy levels.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8sw9gk",
                                                                                    "author": "inbeforethelube",
                                                                                    "score": 3,
                                                                                    "created_utc": 1652695613.0,
                                                                                    "response": "It's not a rumor when they have released official notices of the partnerships",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8szrgp",
                                                                                            "author": "jcm2606",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652698440.0,
                                                                                            "response": "Except the hype was building long before it was confirmed.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8rs4r8",
                                                            "author": "sneakpeekbot",
                                                            "score": 0,
                                                            "created_utc": 1652667207.0,
                                                            "response": "Here's a sneak peek of /r/place using the [top posts](https://np.reddit.com/r/place/top/?sort=top&t=year) of the year!\n\n\\#1: [Full screenshot of r/place 2022](https://i.redd.it/lnmh7c4kelr81.png) | [12656 comments](https://np.reddit.com/r/place/comments/twft1q/full_screenshot_of_rplace_2022/)  \n\\#2: [Place has ended.](https://np.reddit.com/r/place/comments/twhfmh/place_has_ended/)  \n\\#3: [The Complete r/Place Timelapse](https://v.redd.it/q61jgirwoyr81) | [6605 comments](https://np.reddit.com/r/place/comments/txufad/the_complete_rplace_timelapse/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8qneoi",
                                            "author": "frank__costello",
                                            "score": 33,
                                            "created_utc": 1652648249.0,
                                            "response": "Mind you, I don't hate the projects, just the people who mindlessly shill them.\n\nThe hate comes from the fact that they're lower-tier projects. Loopring is an application-specific rollup, and while they've announced work on a general-purpose rollup, they've shown no significant progress. Polygon has acquired a number of companies building rollups, but again, no firm progress.\n\nMeanwhile:\n\n* Arbitrum has been running for almost a year and has tons of usage\n* Optimism has also been running for a while, and is chasing Arbitrum's lead\n* StarkNet has been in mainnet-beta for months, the bridge went live last week, and we'll start seeing usage soon\n* ZKSync has a testnet for their V2 running now, so mainnet should be soon\n* Aztec has been running in production for over a year, mind you not a general-purpose rollup, but a fully private rollup is pretty cool by itself and will compete with projects like Monero and ZCash\n\nThe one thing that none of those projects have (yet) is a token. So shills will keep pumping LRC and MATIC and ignoring the most promising projects",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8rfaao",
                                                    "author": "bad-john",
                                                    "score": 6,
                                                    "created_utc": 1652661294.0,
                                                    "response": "I thought optimism had a token? Has it not been airdropped yet?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8rzobj",
                                                            "author": "flatpak2021_08_2021",
                                                            "score": 3,
                                                            "created_utc": 1652671025.0,
                                                            "response": "not claim able yet",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8sdk4x",
                                                    "author": "Mefilius",
                                                    "score": 3,
                                                    "created_utc": 1652679690.0,
                                                    "response": "Don't forget Immutable, I believe they use StarkNet as some or part of their project. That team has an awful lot of experience with tokenized assets.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8ss0v9",
                                                    "author": "TheChosenHalfBlood",
                                                    "score": 3,
                                                    "created_utc": 1652691788.0,
                                                    "response": "Fwiw I think Loopring shouldnt really be considered a \"project\" anymore in that theyve already achieved the majority of what they set out to do from a technology standpoint (an application specific zk rollup focused on dex functionality and scalability). From my understanding they arent innovators in the ZK space like zksync/polygon etc. Instead, their primary innovation is their relayer and its optimizations. \n\nIts just not as exciting as other projects because I think people who understand the tech are more interested in rollups with generalized evm support since that opens up a lot of opportunities for average people to deploy all kinds of smart contracts.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8rt2jr",
                                                    "author": "nightswimsofficial",
                                                    "score": -2,
                                                    "created_utc": 1652667633.0,
                                                    "response": "Lol optimism is a mess.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8rv8nk",
                                                            "author": "domotheus",
                                                            "score": 3,
                                                            "created_utc": 1652668697.0,
                                                            "response": "How come?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8qecz0",
                            "author": "biain",
                            "score": -16,
                            "created_utc": 1652644300.0,
                            "response": "Jesus get a grip. There's more than one Layer 2 and not every mention of layer 2 has to be an opportunity to pump loopring.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qes6b",
                                    "author": "1moreOz",
                                    "score": 9,
                                    "created_utc": 1652644488.0,
                                    "response": "Are you, offended? Lol i didnt say it was good or bad, i said it was interesting…",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8qjcb3",
                    "author": "moneycashdane",
                    "score": 16,
                    "created_utc": 1652646502.0,
                    "response": "#L222",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qbo97",
                    "author": "frank__costello",
                    "score": 38,
                    "created_utc": 1652643108.0,
                    "response": "These posts are weird",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qh7m9",
                            "author": "notdsylexic",
                            "score": 18,
                            "created_utc": 1652645559.0,
                            "response": "It’s written like a blog post… not a discussion post.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qmukf",
                                    "author": "frank__costello",
                                    "score": 23,
                                    "created_utc": 1652648007.0,
                                    "response": "It's written like a bot",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8r1fk9",
                                            "author": "lostharbor",
                                            "score": 7,
                                            "created_utc": 1652654486.0,
                                            "response": "It is a bit. I’ve noticed this with the NFT sun. There are constant pushes for “new” “unique” projects and every single post and hype comments username ends in three numbers\n\nThe post history says it all. Someone did log on for a couple of comments but all the posts are regurgitated take downs.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8s9vf8",
                                    "author": "Nonocoiner",
                                    "score": 1,
                                    "created_utc": 1652677189.0,
                                    "response": "It's copied from this blog post:\n\nhttps://cryptonews.com/exclusives/2022-year-layer-2-takes-off.htm",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8se20w",
                            "author": "Nonocoiner",
                            "score": 3,
                            "created_utc": 1652680052.0,
                            "response": "I think there a spam/scam network behind these posts.\n\nThey farm karma by posting (parts of) random blog posts and news articles, in order to later use these reddit accounts to post spam and promote scams.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8sj27r",
                            "author": "Ingentin",
                            "score": 3,
                            "created_utc": 1652683913.0,
                            "response": "It's mostly copy pasted from here: https://cryptonews.com/exclusives/2022-year-layer-2-takes-off.htm",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8saj4w",
                    "author": "mpbh",
                    "score": 3,
                    "created_utc": 1652677605.0,
                    "response": ">With multiple apps deployed across chains, we are now seeing increasing fragmentation that adds complexity for end-users and detracts from the ultimate goal of making DeFi accessible for all.\n\nDing ding ding. The Eth community really needs to rally around a single, simple solution to the scalability problem. I've been an Eth holder since 2017 but even I have no idea where to start if I actually wanted to spend/deploy Eth. Imagine how a new user feels, and it doesn't help that shills plague any L2-related post.\n\nNot a Bitcoin maxi by any means but at least that community rallied around a single LOW solution.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8sw5oe",
                            "author": "frank__costello",
                            "score": 1,
                            "created_utc": 1652695523.0,
                            "response": "> The Eth community really needs to rally around a single, simple solution to the scalability problem\n\nI disagree, competition is exactly why the Ethereum scalability space is so strong\n\nBitcoin doubled-down on one single scalability solution (Lightning), and that hasn't gone very well for them\n\n> even I have no idea where to start if I actually wanted to spend/deploy Eth\n\nThat's fine, it's too early. When there's something useful for you on an L2, then you'll make the jump, it's pretty easy.\n\nPlus, it's not like you only need to pick one. Protocols like Hop make it trivial to move your funds between different L2s",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8rhbeq",
                    "author": "llolo96",
                    "score": 2,
                    "created_utc": 1652662256.0,
                    "response": "What are yall’s thoughts on Connext?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8slyyy",
                    "author": "RegsRevs",
                    "score": 2,
                    "created_utc": 1652686341.0,
                    "response": "Just give me lower gas fees, knock the miner payments down. Fuck em.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qzuoo",
                    "author": "hopeiumisdopium",
                    "score": 8,
                    "created_utc": 1652653744.0,
                    "response": "Loopring will have its day, be your own bank!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8rsgy3",
                    "author": "Any-Nefariousness773",
                    "score": 2,
                    "created_utc": 1652667358.0,
                    "response": "Just wait till shibarium this year.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8rudi5",
                    "author": "pihip2",
                    "score": -1,
                    "created_utc": 1652668266.0,
                    "response": "Very bullish on Polygon right now for one reason:  \nThey're the ZK leaders right now and ZK will in fact be the future in this market.\n\nThey're literally allocating $1 billion solely for ZK tech development.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8rob4e",
                    "author": "Intelligent_Steak",
                    "score": 1,
                    "created_utc": 1652665455.0,
                    "response": "The one things I'm worried about is that as dapps expand across many different side-chains and L1 chains, they become more vulnerable.  This is because you need some sort of bridging mechanism to facilitate cross-chain communication.  If you have a dapp with governance that has to span n chains, that all need to communicate each other, you're gonna need at least n bridges.  This increases the attack surface and number of things that can go wrong.  Even the side chains like Polygon that use Ethereum for security/finality, still rely on another set validators to operate a bridge for assets.  Some bridges are even completely centralized.  I'm hoping there's some better solution in the future (or maybe an existing solution I haven't heard of)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8s1tkw",
                    "author": "g_squidman",
                    "score": 1,
                    "created_utc": 1652672242.0,
                    "response": "that's what ya said last year",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8skzbf",
                    "author": "Furlz",
                    "score": 1,
                    "created_utc": 1652685500.0,
                    "response": "What's gonna happen to optimism and Arbitrum",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8syadp",
                    "author": "GuessWhat_InTheButt",
                    "score": 1,
                    "created_utc": 1652697295.0,
                    "response": "If there will ever be a need for a Layer 3, I'm going to stop interacting with anything Ethereum.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8u7id8",
                    "author": "DeliciousNectarine8",
                    "score": 1,
                    "created_utc": 1652719611.0,
                    "response": "Bullish asf on Zksync right now. They've been getting a lot of funding from multiple projects. BitDAO alone already granted them $200 million to develop ZkDAO.  \nI think they're pretty underrated right now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8r1729",
                    "author": "Frenchiie",
                    "score": -12,
                    "created_utc": 1652654374.0,
                    "response": "sorry but ethe and defi don't go together.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ru3f8",
                            "author": "domotheus",
                            "score": 4,
                            "created_utc": 1652668128.0,
                            "response": "How come?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8rceod",
                    "author": "daBiggaFigga",
                    "score": -3,
                    "created_utc": 1652659884.0,
                    "response": "So what’s the difference between a ETH side chain and a true ETH L2?\n\nIsn’t Polygon and Loopring considered more to be a side chain since they have their own native coin? A clear differentiator from something like Arbitrum or Optimism.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rfhtp",
                            "author": "Andre4a19",
                            "score": 15,
                            "created_utc": 1652661390.0,
                            "response": "Loopring is not a side chain, it runs directly on top of eth.   \n\npolygon is a side chain.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8timuh",
                    "author": "-Aporia",
                    "score": 0,
                    "created_utc": 1652709210.0,
                    "response": "No mention of loopring or matic? Looks like it's time to shill matic and remind everyone that they are dropping Polygon Nightfall next week. Now that what the shills are going to say is out of the way. I think the L2 movement is one of the main reasons why I think Ethereum will remain king.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}