{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usglug",
            "title": "Live event ran by microstrategy, don't miss it",
            "url": "http://x2-crypto.io",
            "author": "anermik",
            "created_utc": 1652890696.0,
            "score": 27,
            "num_comments": 0,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "usghqx",
            "title": "Promising crypto, DeFi, NFT and Gaming startups pitching right now to VCs. Live on Youtube.",
            "url": "https://www.youtube.com/watch?v=GvL66XgdrNg",
            "author": "Lucky-Rocket",
            "created_utc": 1652890386.0,
            "score": 0,
            "num_comments": 0,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "usgh8t",
            "title": "Ethereum's main testnet set for proof-of-stake merge in early June",
            "url": "https://www.theblockcrypto.com/post/147604/ethereums-main-testnet-set-for-proof-of-stake-merge-in-early-june",
            "author": "Michellerose6834",
            "created_utc": 1652890346.0,
            "score": 670,
            "num_comments": 124,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i93ador",
                    "author": "coinfeeds-bot",
                    "score": 81,
                    "created_utc": 1652891520.0,
                    "response": "tldr; Ethereum's main public testnet, Ropsten, is set to undergo \"the merge\" next month in one of the final preparations before the main Ethereum blockchain can switch to proof-of-stake consensus. Parithosh Jayanthi, who works in devops at the Ethereum Foundation, merged the pull request.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93bk9k",
                    "author": "PoorSapper",
                    "score": 59,
                    "created_utc": 1652891998.0,
                    "response": "When would main merge? Month or two after?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93cz5x",
                            "author": "thomas_m_k",
                            "score": 81,
                            "created_utc": 1652892553.0,
                            "response": "Yeah, the core devs seem cautiously optimistic that the merge will happen before the end of August. Assuming everything goes alright with the test nets.\n\nAfter Ropsten, there are two other testnets that will go through the merge: Sepolia and Goerli. And then it's main net.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93mbc6",
                                    "author": "px403",
                                    "score": 20,
                                    "created_utc": 1652896303.0,
                                    "response": "Are they all merging to different PoS validators, or will they be like, separate shards using the same validator set?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i93qe4e",
                                            "author": "nishinoran",
                                            "score": 24,
                                            "created_utc": 1652897936.0,
                                            "response": "Different sets of validators for each network, although good chance most are run by the same people.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i93sxzs",
                                                    "author": "px403",
                                                    "score": 2,
                                                    "created_utc": 1652898976.0,
                                                    "response": "Thanks for the information. Any idea if that would even make sense, to merge a bunch of testnets into a single multi sharded PoS testnet? I know there's not a ton of cross-shard functionality implemented at the moment but it would be a cool test.\n\nI have this weird vision of networks like xDai and Polygon some day directly connecting into the Ethereum PoS validators to enable cross-shard contract calls etc. It would be neat if existing networks could easily dock and un-dock as shards from the Ethereum Mainnet PoS validator set, thus reducing overhead for bridging etc.\n\nI've heard so many different visions for what Serenity could be that I'm sure my understanding of what they're even going for is completely flawed. I'm the kind of person that needs to see something in action to build a working mental model for it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i93xl4s",
                                                            "author": "lanatork",
                                                            "score": 12,
                                                            "created_utc": 1652900875.0,
                                                            "response": "There won’t be any network shards in Ethereum. That plan was dropped a couple of years ago. It was deemed too complex and the user experience too bad to go through with it.\n\nThe current plan is to do scaling with L2 rollups.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i946uy7",
                                                                    "author": "delaaxe",
                                                                    "score": 5,
                                                                    "created_utc": 1652904657.0,
                                                                    "response": "Execution sharding is what was dropped",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i945oiz",
                                                                    "author": "the_ocs",
                                                                    "score": 4,
                                                                    "created_utc": 1652904170.0,
                                                                    "response": "Not true, see for example https://eips.ethereum.org/EIPS/eip-4844\n\nL2 is in addition",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i946kvt",
                                                                            "author": "lanatork",
                                                                            "score": 17,
                                                                            "created_utc": 1652904542.0,
                                                                            "response": "I think I was not clear. What’s on the roadmap is data sharding, which is not the same as network (or full) sharding. Data sharding does not have the same disadvantages as full sharding and as you said will mainly be used by L2s. But it won’t bring any speed or gas improvements itself for L1.\n\nAnd while 4844 is not yet data sharding, it’s a first big step for implementing it.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i94c3ih",
                                                                                    "author": "Karyo_Ten",
                                                                                    "score": 10,
                                                                                    "created_utc": 1652906793.0,
                                                                                    "response": "Exactly,\n\nTo expand on that, full sharding meant EVM / Execution shards (possibly some not EVM based but dedicated to payment, Avalanche style or using more efficient VMs like eWASM).\n\nThe main issue with execution shards was cross-shard transactions, their finality and atomicity, as-in the hotel-and-train problem, if your hotel and train bookings are on different shards, how do you make sure that you book booth or neither and not just the train or just the hotel?\n\nSolving this would introduce a lot of complexity and no design was fully satisfactory in terms of latency (significant waiting time for cross-shard transactions) or UI (how do you deal with DEX liquidity across shards).\n\nFurthermore at the time, MEV wasn't on the radar but it would have thrown a big wrench in the design.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "i946p5c",
                                                                                    "author": "the_ocs",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652904591.0,
                                                                                    "response": "Got to start somewhere",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "i94rg6m",
                                                                                    "author": "extq00",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652913386.0,
                                                                                    "response": "Okay, so we won’t get any direct tps increase on L1?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i94wqbt",
                                                                                            "author": "AESTHTK",
                                                                                            "score": 4,
                                                                                            "created_utc": 1652915824.0,
                                                                                            "response": "Switch to Layer 2 as soon as you can.\n\nOptimism and Arbitrum are a great start.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "i964zjt",
                                                                                            "author": "lanatork",
                                                                                            "score": 2,
                                                                                            "created_utc": 1652938880.0,
                                                                                            "response": "No,  the tps will not change at all.  There will be a new type of transaction for data sharding, but this will mainly be used by L2s. As a normal user they won’t help you and you also won’t need them.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i94b6xt",
                                                    "author": "nvnehi",
                                                    "score": 1,
                                                    "created_utc": 1652906425.0,
                                                    "response": "Sounds like a bad idea if true. They should be run by different people to increase the odds of finding issues.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i95iaoy",
                                                            "author": "elliottmatt",
                                                            "score": 6,
                                                            "created_utc": 1652925925.0,
                                                            "response": "You are welcome to join them!",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i93nzj4",
                            "author": "Oddsnotinyourfavor",
                            "score": 12,
                            "created_utc": 1652896972.0,
                            "response": "We have Ropsten in June, then Goerli and Sepolia after. My estimation if everything goes smoothly is late august-mid September",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94yahc",
                                    "author": "cosmic-comedy",
                                    "score": 2,
                                    "created_utc": 1652916550.0,
                                    "response": "Can't be mid September, block times will likely be well over 20 seconds by then, unless they do another hard fork to extend the difficulty bmb",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i94zf5b",
                                            "author": "Oddsnotinyourfavor",
                                            "score": 1,
                                            "created_utc": 1652917082.0,
                                            "response": "Would the difficulty bomb push back time to test the merge on test nets? I’m computer illiterate, I just follow the devs and wenmerge.com",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i961l6d",
                                                    "author": "cosmic-comedy",
                                                    "score": 1,
                                                    "created_utc": 1652936513.0,
                                                    "response": "It's possible that if they run into any issues on the testnets, they may delay the mainnet merge which would likely require another hard fork to delay the difficulty",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i96jzbm",
                                            "author": "Loose_Screw_",
                                            "score": 1,
                                            "created_utc": 1652951607.0,
                                            "response": "Theoretically, what are the issues presented by 20 second block times? I didn't think anyone was running stuff on ethereum that was super latency sensitive but I only really see the consumer side.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i945wly",
                            "author": "hashzzz",
                            "score": 6,
                            "created_utc": 1652904262.0,
                            "response": "2 months after",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i94j64e",
                            "author": "Tenoke",
                            "score": 4,
                            "created_utc": 1652909787.0,
                            "response": "https://polymarket.com/market-group/ethereum-merge-pos\n\n3% by August 1st. 53% by Sept 1st. 74% by Oct 1st according to [polymarket](https://polymarket.com/market-group/ethereum-merge-pos)  (+/- 2%).",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i95tlv2",
                            "author": "lordytoo",
                            "score": 2,
                            "created_utc": 1652931631.0,
                            "response": "Main merge would probably start at the start of the next bullrun.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9649nn",
                            "author": "FreeFactoid",
                            "score": 1,
                            "created_utc": 1652938378.0,
                            "response": "Looks like July if all goes really well and August if things are only OK. Things look like they're going really well. \n\n>!If #4 goes as well as #3 we can hope that the bar has been lifted high enough for the team to agree that testing is ready to progress to Ropsten, leaving just Goerli and Sepolia before Mainnet.\n\n>! Given that the beacon chain nodes for Ropsten and Sepolia are now in issue that is looking very likely.\n\n>! Roll on Shadow Fork 4, expected to happen on 12th May.\n\n>! Coincidentally, the outcome of shadow fork 4 will be known just before the next ACD, on Friday 13th May where we hope Ropsten will be confirmed as the next public testnet to experience the Merge.\n\n... \n\n>! In recent upgrades there has been a one week delay between updating public testnets. We can look to the London Hard Fork that introduced EIP1559 as an example.\n\n>! Testing history of the London Hard Fork including EIP1559.\n\n>! 24 June 21 – Ropsten\n\n>! 30 June 21- Goerli\n\n>! 7 July 21 – Rinkeby\n\n>! 5 August 21 – Mainnet\n\n\n>! Once Ropsten is announced the community will have a very clear guide on the most frequently asked question. Wen Merge?\n\n>! Given these timeframes and based on the progress of existing testing we can expect the Merge is extremely likely to happen in the July/August window, perhaps favouring earlier rather than later unless any significant hurdles come up.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i96ety3",
                            "author": "Olmops",
                            "score": 1,
                            "created_utc": 1652946896.0,
                            "response": "What was discussed in the dev meeting was to have maybe 2 weeks between the forks on testnets. After Ropsten, they want the merge on Sepolia, then on Goerli (Goerli last, because many people use and need that). The merge date for Ropsten is set to June 8th, so that would mean that all three testnets could probably have transitioned to PoS by early July.\n\nAfter that, it's monitoring the situation, then setting a date for mainnet if everything is stable. Last week they agreed on the date for Ropsten rougly 4 weeks in the future, allowing client teams to publish another release and have some time for node operators to upgrade. So, if that process is similar for mainnet, a cautiously optimistic \"August\" target seems plausible now.\n\nTake it with a grain of salt, it's still software development and unexpected delays may happen, but that is my current estimate for the timeline.\n\n&#x200B;\n\nTo all Bitcoin fans and sh\\*tcoin haters:\n\nThe merge is a mythical event that is supposed to happen always 3 months in the future. Last August it was November, in February it was June and now it's August... like all other doomsday prophecies, it should just be ignored.  ;-)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93mf6b",
                    "author": "Maswasnos",
                    "score": 32,
                    "created_utc": 1652896345.0,
                    "response": "Is Ropsten really considered the main testnet? I thought that would be Goerli or maybe Rinkeby. Anyway, this is exciting! Finally having a date to look forward to is such a good feeling.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9434yd",
                            "author": "LinusThiccTips",
                            "score": 21,
                            "created_utc": 1652903142.0,
                            "response": "Ropsten is one of the oldest testnets which closely resembles the mainnet. It's deprecated and won't get further updates. Goerli and Sepolia will be the main ones, Sepolia is the newest and the preferred testnet now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93wogq",
                    "author": "safetaco",
                    "score": 9,
                    "created_utc": 1652900508.0,
                    "response": "When will we be able to unstake? And withdraw**",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94k40m",
                            "author": "Maswasnos",
                            "score": 5,
                            "created_utc": 1652910183.0,
                            "response": "You can unstake now and deactivate your validator, but you probably won't be able to withdraw deposited ETH for another year or so. Maybe a bit less than a year, it's hard to say at this point.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94k99w",
                                    "author": "safetaco",
                                    "score": 3,
                                    "created_utc": 1652910245.0,
                                    "response": "Another year. Ughhhhhh",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i944nwt",
                            "author": "cryptOwOcurrency",
                            "score": 11,
                            "created_utc": 1652903759.0,
                            "response": "Unstake at any time. *Withdrawing* your unstaked ETH becomes possible in the fork *after* the merge.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i940qic",
                            "author": "flygoing",
                            "score": 3,
                            "created_utc": 1652902167.0,
                            "response": "You can already unstake, you have ever since the beacon chain went live",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i944q1h",
                                    "author": "UnrulySasquatch1",
                                    "score": 1,
                                    "created_utc": 1652903782.0,
                                    "response": "That is not correct",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i94aw28",
                                            "author": "flygoing",
                                            "score": 6,
                                            "created_utc": 1652906301.0,
                                            "response": "It is absolutely correct. Maybe he meant why you can't transfer the ETH after you unstake it? But you have been able to unstake (no longer have your assets at stake) since day 1",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i95ah1j",
                    "author": "NotFunnyhah",
                    "score": 14,
                    "created_utc": 1652922302.0,
                    "response": "As a miner, I reject this timeline and request 1 more year as per usual. Thank you.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95zopu",
                            "author": "data4u",
                            "score": 2,
                            "created_utc": 1652935252.0,
                            "response": "YAS",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93nka5",
                    "author": "Normal_Cranberry_526",
                    "score": 13,
                    "created_utc": 1652896801.0,
                    "response": "What makes Ropsten the \"main\" testnet? Being (til now) PoW?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96dhpl",
                            "author": "Cazan",
                            "score": 1,
                            "created_utc": 1652945702.0,
                            "response": "It’s the oldest I think.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93racv",
                    "author": "Cloud_Hopper4",
                    "score": 13,
                    "created_utc": 1652898301.0,
                    "response": "Fucking send it guyz!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9451y8",
                    "author": "JuiceColdman",
                    "score": 5,
                    "created_utc": 1652903917.0,
                    "response": "What’s gonna happen to all the miners",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95seb1",
                            "author": "dhe_mauro",
                            "score": 6,
                            "created_utc": 1652930980.0,
                            "response": "miners gonna mine",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9464j9",
                            "author": "the_ocs",
                            "score": 12,
                            "created_utc": 1652904353.0,
                            "response": "Obsolete tech, some might be in a museum with other old computers and massive mobiles",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94atd1",
                                    "author": "Wonderful_Background",
                                    "score": 18,
                                    "created_utc": 1652906270.0,
                                    "response": "Finally poor people will be able to go see some RTX 3090s in a museum instead of their dreams.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96hgny",
                                            "author": "Dolphin_Dinomite",
                                            "score": 1,
                                            "created_utc": 1652949282.0,
                                            "response": "I’ve got two 3090s whirring away for a measly $5 a day. Anyone want them?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i93zyqt",
                    "author": "ZenoZh",
                    "score": 10,
                    "created_utc": 1652901852.0,
                    "response": "Will this free my eth from Coinbase?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9444kk",
                            "author": "cryptOwOcurrency",
                            "score": 24,
                            "created_utc": 1652903539.0,
                            "response": "Not until the fork *after* the merge.\n\nExpect another several months optimistically, year pessimistically.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i948sy8",
                                    "author": "ZenoZh",
                                    "score": 8,
                                    "created_utc": 1652905452.0,
                                    "response": "Oh okay thank you!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i958mfh",
                                            "author": "NotFunnyhah",
                                            "score": -7,
                                            "created_utc": 1652921436.0,
                                            "response": "AKA 5 more years. You didn't need that money anyway.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i95f9qb",
                                                    "author": "ZiltoidM56",
                                                    "score": 1,
                                                    "created_utc": 1652924530.0,
                                                    "response": "GFY",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i960rhr",
                                    "author": "Homewardment",
                                    "score": 2,
                                    "created_utc": 1652935959.0,
                                    "response": "Hard to rely on Coinbase, they did say they would make it tradeable end of last year",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i945lra",
                            "author": "Homewardment",
                            "score": 6,
                            "created_utc": 1652904140.0,
                            "response": "No",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i95zmzb",
                            "author": "data4u",
                            "score": 2,
                            "created_utc": 1652935223.0,
                            "response": "Same thing on my mind LOL. Such shit the interest rate is 3%",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95h89a",
                    "author": "OdoIcontradictmyself",
                    "score": 6,
                    "created_utc": 1652925430.0,
                    "response": "Does that mean I can finally convert my staked eth on Coinbase to BTC and be done with ethereum?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95vn52",
                            "author": "Electrical_Yam5077",
                            "score": 6,
                            "created_utc": 1652932783.0,
                            "response": "Not until the fork after the merge. Planned for roughly 6 months after merge. Hopefully by end of year or slightly after",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i960lre",
                                    "author": "OdoIcontradictmyself",
                                    "score": 3,
                                    "created_utc": 1652935853.0,
                                    "response": "🙏",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i93rywm",
                    "author": "nukejukem23",
                    "score": 2,
                    "created_utc": 1652898578.0,
                    "response": "What about Goerli?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i945v8a",
                            "author": "the_ocs",
                            "score": 3,
                            "created_utc": 1652904246.0,
                            "response": "wenmerge.com",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i94q2p0",
                    "author": "CriticoolHit",
                    "score": 4,
                    "created_utc": 1652912762.0,
                    "response": "I have 1 eth. \n\nI can't wait to be rich as fuuuuuuuuuuuck.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94v9o5",
                            "author": "symbally",
                            "score": 7,
                            "created_utc": 1652915138.0,
                            "response": "don't hold your breath too long",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95ygc1",
                    "author": "hyrootpharms",
                    "score": 3,
                    "created_utc": 1652934468.0,
                    "response": "Lol. Ropsten is not their main test net.  Beiko said last week its unstable and that they won't be using it after the merge.  It's all smoke and mirrors. \n\nThey still haven't addressed security either.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95johg",
                    "author": "wolvesand",
                    "score": 1,
                    "created_utc": 1652926590.0,
                    "response": "Why would you want to switch to a verification mechanism which makes your coin more vulnerable? Proof of work is the long term winner. Just ask Luna. Energy FUD is energy FUD.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96l6ke",
                            "author": "GrixM",
                            "score": 1,
                            "created_utc": 1652952708.0,
                            "response": "One of the reasons they switch is precisely to increase security. You can think that PoW is more secure but many researchers would disagree with you. At best it has pros and cons and the weights of these pros and cons are subjective.\n\nAnd energy waste is in fact extremely important, in this day and age with climate change PoW is arguably the definition of insanity if even a reasonably good alternative exists.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i95shx2",
                            "author": "dhe_mauro",
                            "score": 0,
                            "created_utc": 1652931035.0,
                            "response": "Ethereum foundation wants to become the Fed 2.0",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i943blj",
                    "author": "theh8ed",
                    "score": -7,
                    "created_utc": 1652903216.0,
                    "response": "Is it though? 🤔",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94uvyx",
                    "author": "symbally",
                    "score": -6,
                    "created_utc": 1652914961.0,
                    "response": "didn't I read exactly this same time last year? the usefulness of blockchain is like fusion, always next year. I hate it and it really has to stop before the world cooks itself mining shitcoins.\n\nI say this as someone who worked directly with blockchain tech as a hard-core techy (rolled out networks from genesis, built ecosystem on smart contracts, handled support services like faucet, tok3nbridge, 3xchange, I even built multinetwork wallet) for just over 3 years at a few companies",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95env0",
                            "author": "BuyETHorDAI",
                            "score": 2,
                            "created_utc": 1652924251.0,
                            "response": "As a dev, you should seriously look at the merge spec.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i94yln4",
                            "author": "cosmic-comedy",
                            "score": 1,
                            "created_utc": 1652916698.0,
                            "response": "nope. this will be a first on a public testnet. maybe you're talking about the devnets",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i96lboh",
                            "author": "GrixM",
                            "score": 1,
                            "created_utc": 1652952836.0,
                            "response": "> didn't I read exactly this same time last year?\n\nNo.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93hh5c",
                    "author": "EROSENTINEL",
                    "score": -36,
                    "created_utc": 1652894359.0,
                    "response": "Haha they just keep moving the goalpost, see ya'll in 8 months",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93mbob",
                            "author": "skramzy",
                            "score": 15,
                            "created_utc": 1652896307.0,
                            "response": "You don't understand software engineering processes, got it",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93qhxc",
                                    "author": "EROSENTINEL",
                                    "score": -17,
                                    "created_utc": 1652897979.0,
                                    "response": "I actually do, very well tbh",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i94u3yt",
                                            "author": "debbie_pinson",
                                            "score": 4,
                                            "created_utc": 1652914602.0,
                                            "response": "My product mgr says the same thing",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i93qmv5",
                                            "author": "skramzy",
                                            "score": 10,
                                            "created_utc": 1652898035.0,
                                            "response": "Sure you do pal",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i944ipj",
                                            "author": "cryptOwOcurrency",
                                            "score": 5,
                                            "created_utc": 1652903701.0,
                                            "response": "From the brevity of your comments, you don't really strike me as the kind of person who really understands the nuance of the merge software development process.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i947xvg",
                                                    "author": "EROSENTINEL",
                                                    "score": -3,
                                                    "created_utc": 1652905103.0,
                                                    "response": "Quite the opposite,  don't got a lot of time to argue with fanbois.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i948lz1",
                                                            "author": "cryptOwOcurrency",
                                                            "score": 6,
                                                            "created_utc": 1652905374.0,
                                                            "response": "Judging by the average comment length on your profile, it seems like you don't have a lot of time to argue much of an opinion on anything.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i94ieqz",
                                                                    "author": "EROSENTINEL",
                                                                    "score": 1,
                                                                    "created_utc": 1652909457.0,
                                                                    "response": "Exactly my point, original post wasn't an invitation to discuss your state of mind, talk to me in 8 months for the next flag post.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i94lqdp",
                                                                            "author": "cryptOwOcurrency",
                                                                            "score": 2,
                                                                            "created_utc": 1652910878.0,
                                                                            "response": "So you commented on this discussion forum without the intent to discuss anything? Why are you here at all, then?\n\nRemindMe! 8 months - Did Ethereum have its proof-of-stake merge yet?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i94lvnt",
                                                                                    "author": "RemindMeBot",
                                                                                    "score": 2,
                                                                                    "created_utc": 1652910940.0,
                                                                                    "response": "I will be messaging you in 8 months on [**2023-01-18 21:54:38 UTC**](http://www.wolframalpha.com/input/?i=2023-01-18%2021:54:38%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/ethereum/comments/usgh8t/ethereums_main_testnet_set_for_proofofstake_merge/i94lqdp/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fethereum%2Fcomments%2Fusgh8t%2Fethereums_main_testnet_set_for_proofofstake_merge%2Fi94lqdp%2F%5D%0A%0ARemindMe%21%202023-01-18%2021%3A54%3A38%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20usgh8t)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i93m6ch",
                            "author": "Maswasnos",
                            "score": 12,
                            "created_utc": 1652896248.0,
                            "response": "How is this moving the goalpost? This is actually the first time a goalpost has been firmly set...",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i93l6lr",
                            "author": "shaggy_shiba",
                            "score": 11,
                            "created_utc": 1652895856.0,
                            "response": "Moving the goal post = less bugs when it is applied to main net.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i93q84w",
                            "author": "Kike328",
                            "score": 5,
                            "created_utc": 1652897867.0,
                            "response": "I dare you to find just one date the devs have given. None, because all the goalpost you’re talking about are roughly estimates given by people who are not coding, like shitty news sites",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93oquz",
                    "author": "GhabageMan",
                    "score": -26,
                    "created_utc": 1652897272.0,
                    "response": "After Vitalik’s recent tweets… i dont know if the merger will happen this year. Its a double edged sword. A promise has been made to evolve Ethereum. If the devs fail to deliver this year, we might see a massive selloff of our once beloved blue chip. If they release it for the sake of making the time mark, they will undoubtedly see security breaches alongside god knows what. Its the age old argument of choosing to be shot or stabbed at this point. Hope for the best!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93rcyj",
                            "author": "Rooftrellin",
                            "score": 17,
                            "created_utc": 1652898331.0,
                            "response": "Vitaliks recent tweets weren’t about the merge though. They were just his thoughts on how he feels; to me it seemed more like a vent/open up/window into his feelings more than anything.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93spmu",
                                    "author": "majorpickle01",
                                    "score": 21,
                                    "created_utc": 1652898880.0,
                                    "response": "exactly. It's staggering how many people require a 100% certain autocrat figure to have faith in a project.  \n\n\nVitalik is purely reflecting on what could have been different, and how his views have changed over time. It's nice to see, in honesty",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i93sgs6",
                                    "author": "GhabageMan",
                                    "score": -10,
                                    "created_utc": 1652898778.0,
                                    "response": "Naw this is directly related to his protocol and the merger. Its his baby, his dreams, his aspirations all in one. And to be honest, he’s been pushed out and acts more like a philanthropist type founder. Ethereum has not turned out the way he had planned, and he’s venting his frustrations at the journey and the result.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i94cbit",
                                    "author": "nvnehi",
                                    "score": -2,
                                    "created_utc": 1652906885.0,
                                    "response": "True but, there was more than a hint of him understanding, and admitting the issues with the idea of PoS itself.\n\nThey all have their benefits but, it’s undeniable that PoS benefits the wealthy the most. The question is does everyone else benefit enough to make it worthwhile to make it much easier to “hoard” wealth. It’s a difficult question with no easy answer similar to the traveling salesman problem, there is simply too many outcomes to make the absolutely correct judgment.\n\nI’ve similarly been going through the same concerns over the past few years in my head. I see a bright future down one path, and I see a dystopian one down the other, and the issue is that a light breeze could push us down the wrong path if we aren’t careful. Each passing year looks like we are increasingly more likely to set ourselves down a road with much greater wealth disparity because too many crypto enthusiasts don’t seem to understand why we left the gold standard even in spite of the unprecedented growth we have had since, and that type of ideology is influencing decisions being made like a virus of the mind.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i94dvr3",
                                            "author": "Rooftrellin",
                                            "score": 5,
                                            "created_utc": 1652907533.0,
                                            "response": "Are we not talking about Vitalik’s contradictions chain of tweets? I feel like I’m missing something here because looking at his tweets over the last 4 days, no where does he suggest any of this.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i93sox1",
                                    "author": "GhabageMan",
                                    "score": -20,
                                    "created_utc": 1652898872.0,
                                    "response": "I will enjoy watching all you losers cry when it suffers an even bigger DAO hack. RIP worms.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i94jgay",
                            "author": "turntable_server",
                            "score": 1,
                            "created_utc": 1652909907.0,
                            "response": "Eth will lose credibility if the long awaited switch to PoS does not happen this year. edit: I ought to have read the entire message before reacting to a troll",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95fkrg",
                    "author": "Crypto_Economist42",
                    "score": 1,
                    "created_utc": 1652924671.0,
                    "response": "This is great news !",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95zjus",
                    "author": "data4u",
                    "score": 1,
                    "created_utc": 1652935168.0,
                    "response": "Will they be doing the difficulty bomb any way in June or wait until the merge is closer?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96bwe8",
                    "author": "xPurrpX",
                    "score": 1,
                    "created_utc": 1652944325.0,
                    "response": "Alright it's happening\n\nGuess I'll have to turn off my mining very soon",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96feay",
                    "author": "yasniy97",
                    "score": 1,
                    "created_utc": 1652947405.0,
                    "response": "good news.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96jfl6",
                    "author": "Tommannerr",
                    "score": 1,
                    "created_utc": 1652951099.0,
                    "response": "God dam have to DCA harder before that",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95c7bg",
                    "author": "meme_dika",
                    "score": -3,
                    "created_utc": 1652923122.0,
                    "response": "Let's goooo.... Cheap GPU here we go....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93vm39",
                    "author": "CSharpSauce",
                    "score": -28,
                    "created_utc": 1652900075.0,
                    "response": "As soon as mainnet is merged, and my staked ETH is unlocked.... i'm probably going to sell and buy some more AVAX :\\",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9557nr",
                            "author": "Westbrook_Level",
                            "score": 2,
                            "created_utc": 1652919833.0,
                            "response": "It will probably be really cheap by then lol.  Look at some EOS and NEO charts.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95mhvr",
                    "author": "pat90000",
                    "score": -5,
                    "created_utc": 1652927964.0,
                    "response": "Centralization incoming. Already proving it by locking up folks Ethereum. Not your keys, not your crypto…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i960nbh",
                    "author": "wen_mars",
                    "score": 0,
                    "created_utc": 1652935882.0,
                    "response": "Yay! Gaming gpus for gamers, finally!",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "usgbv1",
            "title": "Ethereum’s Vitalik Buterin Explains How to Prevent Whales from Dominating ETH2 Staking",
            "url": "https://timestabloid.com/ethereum-vitalik-buterin-explains-how-to-prevent-whales-from-dominating-eth2-staking/",
            "author": "Solodeji",
            "created_utc": 1652889941.0,
            "score": 107,
            "num_comments": 72,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i93ae14",
                    "author": "coinfeeds-bot",
                    "score": 21,
                    "created_utc": 1652891524.0,
                    "response": "tldr; Ethereum co-founder Vitalik Buterin has suggested that staking pools that control over 15% of the network should increase their fees until the share of the affected pool is back below 15%. He said it’s reasonable to increase fees for the participants of staking pool that are controlling over 15%. This is expected to cut the profits of the pioneers, but it would greatly boost the security of the Ethereum network.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96ayk2",
                            "author": "EddmondProch1",
                            "score": 2,
                            "created_utc": 1652943549.0,
                            "response": "God bot",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93p6k7",
                    "author": "Percyheckendorf",
                    "score": 47,
                    "created_utc": 1652897451.0,
                    "response": "This would force the largest stakers to spread into multiple wallets but nothing else would change. It isn’t a solution to the issue.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i945ewm",
                            "author": "-johoe",
                            "score": 21,
                            "created_utc": 1652904063.0,
                            "response": "As I understand it, he proposes that big staking pool providers should take more profit for themselves and thus incentivize people to switch to a different pool.\n\nSo he basically tells the big staking providers to please take more profits if your pool gets too big.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i951gwk",
                            "author": "Perleflamme",
                            "score": 15,
                            "created_utc": 1652918060.0,
                            "response": "That's because the title of the article is wrong: that's not what he explains. He explains how to ensure there's redundancy. It has nothing to do with whales. \n\nIt's just a journalist misunderstanding everything and applying wishful thinking.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96l3g9",
                                    "author": "ayawaskero",
                                    "score": 0,
                                    "created_utc": 1652952632.0,
                                    "response": "Have u even read his latest tweets? He is in bed with the whales man … he is accepting that he now aligns more with private centralized companies and even the whole ethos of the Ethereum network is decentralization at all cost is just a fucking lie bc we need a centralized authority to have a control on the network so it doesn’t corrupt!! What a joke!!!!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i95hfil",
                            "author": "Darius510",
                            "score": 3,
                            "created_utc": 1652925525.0,
                            "response": "He's not suggesting the protocol do anything. He's suggesting that businesses that run staking pools start jacking up their fees on their users when they are over 15% share in order to bring their share down, and everyone should cheer them on for it instead of chastising them for price gouging.\n\nIt's an interesting suggestion, but unenforceable and I highly doubt any pool is going to go along with it. Also, without withdrawals its basically a non-starter.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96fjti",
                                    "author": "Exoclyps",
                                    "score": 1,
                                    "created_utc": 1652947542.0,
                                    "response": "Yeah, he is asking them to try chase away their biggest earners. Ain't happening.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i96kdxf",
                                    "author": "Ok-Nefariousness1340",
                                    "score": 1,
                                    "created_utc": 1652951980.0,
                                    "response": "Since their customers are by definition holding Eth, it's in their interest to appear like they are not doing things that could negatively impact it. Though whether that's enough is hard to say.\n\nThere was some controversy with a Monero mining pool recently almost getting enough of a share to attack the network, and they voluntarily increased fees in response to community pressure. Not exactly the same but it isn't unheard of for this to happen.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i93sd4v",
                            "author": "Dry-Hurry-7598",
                            "score": 2,
                            "created_utc": 1652898737.0,
                            "response": "Exactly 😂 what if a fund manager stakes all their treasury for their dao ?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93wcp2",
                                    "author": "Percyheckendorf",
                                    "score": 1,
                                    "created_utc": 1652900376.0,
                                    "response": "No need, just code the wallets to consolidate the overflow once it equals 32",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9440ry",
                            "author": "j1mmie",
                            "score": 0,
                            "created_utc": 1652903496.0,
                            "response": "It’s a little late to be addressing concerns like this, I would’ve thought this was baked into the PoS protocol already. And Vitalik is one of the smartest people around, so clearly he wouldn’t suggest such an obviously flawed solution. I feel like I’m missing something",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i95ro60",
                            "author": "Aos77s",
                            "score": 1,
                            "created_utc": 1652930594.0,
                            "response": "Bingo. Eth is lost to big corpo.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i96rl3s",
                            "author": "Sharkytrs",
                            "score": 1,
                            "created_utc": 1652957934.0,
                            "response": "it would reduce though, you can only practically split wallets so far before any gains from doing so are eaten by Transaction fees.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95jzag",
                    "author": "MysticLimak",
                    "score": 3,
                    "created_utc": 1652926736.0,
                    "response": "Rocketpool",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93ms9s",
                    "author": "handmadeby",
                    "score": 6,
                    "created_utc": 1652896489.0,
                    "response": "Nice idea, I wonder how that altruism will work out of profit is on the line for the pool operators.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95i1ad",
                            "author": "songbolt",
                            "score": 3,
                            "created_utc": 1652925807.0,
                            "response": "the coinfeeds-bot is saying he's saying to raise fees on stakers of their large pool, i.e. to take the profit that's there for the taking ... no?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95ebpo",
                    "author": "strukout",
                    "score": 2,
                    "created_utc": 1652924095.0,
                    "response": "Lol, for small players to stake you have turn over your property rights to an exchange…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9651os",
                    "author": "NoPie8947",
                    "score": 2,
                    "created_utc": 1652938922.0,
                    "response": "Ethereum is controlled by the big guys, not for us anon... Some platform like Angel block create the link between small investors to new crypto projects, that should be the way. VCs are controlling the space too much it's not what decentralization should be.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93bqaf",
                    "author": "6loud9",
                    "score": 4,
                    "created_utc": 1652892062.0,
                    "response": "I mean, this is one thing that Cardano does extremely well. \n\nInstead of raising fees, it lowers rewards for highly saturated pools. This naturally incentivizes stakers to switch to a pool getting max rewards.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94w8av",
                            "author": "37Schmeckles",
                            "score": -2,
                            "created_utc": 1652915590.0,
                            "response": "This is a really simple, really elegant solution that incentivises decentealisation AND engagement with the staking (id be checking my pools every month).\n\nWhy did eth not copy this?  Almost negligently dumb.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i955h2w",
                                    "author": "cryptOwOcurrency",
                                    "score": 13,
                                    "created_utc": 1652919958.0,
                                    "response": "> incentivises decentealisation\n\nIt incentivizes big pools to register themselves as multiple pools, accomplishing nothing.\n\nThat design is negligently dumb, eth is being smart by not copying it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i957179",
                                            "author": "No-Courage-1202",
                                            "score": 1,
                                            "created_utc": 1652920692.0,
                                            "response": "How does ethereum address this problem in a better way?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9592q2",
                                                    "author": "cryptOwOcurrency",
                                                    "score": 4,
                                                    "created_utc": 1652921652.0,
                                                    "response": "One way that Ethereum better addresses the problem is by using BLS signature tech to lower the minimum capital required to be a block producer to 32 ETH, currently about $64k. In contrast, I believe Cardano requires several hundreds of thousands of dollars (or millions?) worth of ADA to join as a block producer.\n\nAnother way that Ethereum addresses this problem is to focus on limiting the amount of damage a rogue block producer can do. Whereas a 66%+ staker in Cardano effectively controls the network consensus, a 66%+ staker in Ethereum still cannot violate the finality imposed by the fork choice without their entire stake being slashed.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i95oscm",
                                                            "author": "PlayActingAnarchist",
                                                            "score": 3,
                                                            "created_utc": 1652929114.0,
                                                            "response": "As a cryptographer who knows exactly what BLS signatures are -- hell, I even know B, L, and S -- I am supremely curious what on dog's green earth *this* is supposed to mean:\n\n> One way that Ethereum better addresses the problem is by using BLS signature tech to lower the minimum capital required to be a block producer to 32 ETH, currently about $64k.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i95vws6",
                                                                    "author": "cryptOwOcurrency",
                                                                    "score": 7,
                                                                    "created_utc": 1652932930.0,
                                                                    "response": "Neat! A real cryptographer in the wild! :)\n\nYes, you read me right. The Ethereum protocol's use of BLS signatures results in a lower capital requirement to be a block producer than just about any other public blockchain out there.\n\nOn the Wikipedia page for BLS digital signatures, you can see the Ethereum blockchain listed as one of the notable applications of them, but I'll do my best to explain exactly why they move the needle and what they have to do with the minimum capital required to become an Ethereum block producer.\n\nAs you probably know better than I do, the BLS signature scheme has a unique property that signatures from multiple private keys can be aggregated into a single signature without the size or verification complexity of the final aggregated signature ballooning too quickly. As you know, not all digital signature schemes are like this.\n\nEthereum currently has 382,562 active block producers (validators) in its beacon chain proof of stake system, and for the chain's security, every validator \"signs off\" or \"attests\" to every block that's produced there, multiple times every minute. (When a validator misses a block attestation, they are penalized a small amount of ETH as an \"inactivity fee\" instead of earning ETH, so every validator tries their best to sign off on every block.) What this design means is that Ethereum needs a signature scheme that can efficiently aggregate those hundreds of thousands of signatures so that they don't take up too much bandwidth being sent across the gossip network and stored on disk, and BLS fit that bill.\n\nContrast Ethereum's 382,562 block producers (validators), each with unique private keys, with Cardano's 3201 block producers (staking pool operators). The big difference is in the signature aggregation technology. I'm looking at Cardano's Ouroboros paper right now, and it appears that they use ECDSA signatures for signing blocks. If the Cardano protocol allowed 300k block producers to join it like Ethereum allows, my understanding is that every block (20 seconds) would contain nearly 200MB just of signatures, that's a sustained data rate of over 80Mbps, just in signatures! But since you're the cryptographer here, maybe you could be the one to clarify that for me!\n\nIn summary, due to an aggregation-friendly signature scheme, Ethereum PoS supports a large amount of validators signing every block. This is a property that other chains that do not use aggregation-friendly signature schemes, such as Cardano, lack.\n\nNow, we've got these two chains. Ethereum, which supports a large amount of block producers, and Cardano, which supports a relatively small amount of block producers. Imagine for the sake of argument that each network has the exact same amount of staking demand in dollar terms. That is, people want to stake $100B worth of ADA on Cardano, and people want to stake $100B worth of ETH on Ethereum. In Ethereum, that amount can be staked over 382,562 block producers, so that each block producer controls $261,000 worth of ETH. In Cardano, that amount must be staked over 3201 block producers, so each block producer controls $31 Million worth of ADA. That means that the capital requirement to join the block producer set in Cardano is over 100x higher than in Ethereum!\n\nNow, the real numbers aren't quite that clean because in practice the total value of staked ADA is different from the value of staked ETH, and the ADA staking requirement is floating compared to the ETH staking requirement which is fixed by the protocol. But hopefully this illustrates why Ethereum's use of BLS signatures leads to a higher supported block producer count, which leads to lower capital requirements to participate in the network as a block producer, which has a decentralizing effect on the network.\n\nIf you want to dive in and learn more about the Ethereum protocol from some of the smartest people I know, join us in the /r/ethfinance daily discussion thread. We could sure benefit from having another friendly cryptographer around!",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i95ze0w",
                                                                    "author": "cryptOwOcurrency",
                                                                    "score": 6,
                                                                    "created_utc": 1652935063.0,
                                                                    "response": "Yes, you read me right. The Ethereum protocol's use of BLS signatures results in a lower capital requirement to be a block producer than just about any other public blockchain out there.\n\nI typed out a 664-word, eight paragraph explanation of why, which I tried to post as a comment reply here, but automoderator is being temperamental about it for whatever reason and keeps removing it.\n\nSince I can't post my response in this thread, please read my response here:\n\nhttps://www.reddit.com/r/ethfinance/comments/usvce5/explained_how_bls_signatures_give_ethereum_a/\n\nI'd be interested in continuing this discussion in that thread if you're up for it - it's not very often I get to chat with a cryptographer!\n\n**Edit:** Looks like a kind mod just fished my original 8-paragraph comment out of the automod rubbish heap, so it should be visible in this thread now.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i96m0yo",
                                                            "author": "No-Courage-1202",
                                                            "score": 1,
                                                            "created_utc": 1652953451.0,
                                                            "response": "Thanks for explaining",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9572r4",
                                            "author": "37Schmeckles",
                                            "score": 0,
                                            "created_utc": 1652920712.0,
                                            "response": "Theres a significant economic overhead to doing that which naturally disincentivises it.  Yes, three large pools is hardly more expensive.  But a hundred pools is a lot kore expensive.\n\nIn saying that; i dont know the exact economics.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i957hin",
                                                    "author": "cryptOwOcurrency",
                                                    "score": 2,
                                                    "created_utc": 1652920905.0,
                                                    "response": "There's no overhead that I'm aware of. What's the economic overhead?\n\nAs far as I know, running a hundred pools is no more expensive than running one pool",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i957t6p",
                                                            "author": "37Schmeckles",
                                                            "score": 1,
                                                            "created_utc": 1652921058.0,
                                                            "response": "Hardware and software infrastructure and maintenance.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i959p67",
                                                                    "author": "cryptOwOcurrency",
                                                                    "score": 1,
                                                                    "created_utc": 1652921945.0,
                                                                    "response": "Don't you just run multiple copies of the pool software? I wouldn't consider that significant overhead.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i95a3ad",
                                                                            "author": "37Schmeckles",
                                                                            "score": 2,
                                                                            "created_utc": 1652922126.0,
                                                                            "response": "Actually honestly; I dont really know.  I dont know itlf its easy to clone and just run multiple vm’s on a single server.\n\nI actually have no idea.\n\nI guess Im taking out of my ass and just assumed.\n\nDoubt anyone here has any idea either heh.  Subs for moonbois not learning now…i guess me chipping in uninformed guesses doesnt help.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i964vl6",
                                                                                    "author": "cryptOwOcurrency",
                                                                                    "score": 4,
                                                                                    "created_utc": 1652938806.0,
                                                                                    "response": "Kudos for being honest!",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i94if74",
                    "author": "HeatSeekingPanther",
                    "score": 1,
                    "created_utc": 1652909462.0,
                    "response": "Satoshi rolling over in his grave right now",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95p1v0",
                            "author": "PlayActingAnarchist",
                            "score": 1,
                            "created_utc": 1652929245.0,
                            "response": "Because of the centralization? Or because of the attempts to reduce centralization?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i94kgtc",
                            "author": "BitcoinSatosh",
                            "score": -5,
                            "created_utc": 1652910335.0,
                            "response": "Vitalik needs to join the missing person's club",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9574l6",
                                    "author": "Accomplished_Way_",
                                    "score": -2,
                                    "created_utc": 1652920738.0,
                                    "response": "Criminals like Buterin should just be imprisoned.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i94j5ak",
                    "author": "daxtaslapp",
                    "score": 1,
                    "created_utc": 1652909777.0,
                    "response": "So its an inheerent concern that is definitely already being seen by the early pos adopters",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9526cv",
                            "author": "Perleflamme",
                            "score": 5,
                            "created_utc": 1652918399.0,
                            "response": "No, it's not. It's just a journalist misunderstanding what's said. Vitalik talks about ensuring redundancy, not about whales. \n\nNotably, whales can still stake in several pools. And that journalist is writing about something he clearly doesn't understand.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i954hnr",
                                    "author": "daxtaslapp",
                                    "score": 1,
                                    "created_utc": 1652919490.0,
                                    "response": "Thank you, it confused me for a sec",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i955ikc",
                                            "author": "Perleflamme",
                                            "score": 1,
                                            "created_utc": 1652919977.0,
                                            "response": "No worries. It's hard to follow, with this kind of journalists.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i96atj3",
                    "author": "-spooky_ghost",
                    "score": 1,
                    "created_utc": 1652943434.0,
                    "response": "So reading between the lines, ethereum hasn't even moved to PoS yet and there is already a big problem / worry of centralisation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96brlj",
                    "author": "rubioberry",
                    "score": 1,
                    "created_utc": 1652944211.0,
                    "response": "Jp Morgan though...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96kp0u",
                    "author": "ayawaskero",
                    "score": 1,
                    "created_utc": 1652952264.0,
                    "response": "What a fucking joke… the truth is that Ethereum is a “decentralized” organization helping centralized enterprise to have a bigger chunk on the profits made by selling the idea to the normal investors that ETH is a decentralized blockchain where the whales earn a bigger chunk of the profits to take care of you!!!! What a fucking joke of a network honestly starting to regret all the support I had been giving them since 2017 … just to come to the conclusion that we need to allow and help centralized organizations to earn more so that way we protect our investment? Fuck you Vitalik what a scumbag move … seem to me that u are in bed with the whales 🐋",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96l801",
                    "author": "Marshall_Matherz",
                    "score": 1,
                    "created_utc": 1652952743.0,
                    "response": "Harmony protocol has a better approach to this issue. Vitalik should take cues from them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94u6mf",
                    "author": "MoistConcert420",
                    "score": -11,
                    "created_utc": 1652914635.0,
                    "response": "Says the person that couldn't let the consensus choose to decline PoS. Had to literally put in 10% of the required amount to even meet the deadline. Hahahahahahaha \n\nWhat a snake oils salesman. \n\nYour bags must be awfully heavy to idealize this con artist.\n\nDon't worry bagholders I'll be minting and dumping ETH for you daily up to the merge. Thanks for the $$$$$ suckas.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95ba88",
                            "author": "NotFunnyhah",
                            "score": 1,
                            "created_utc": 1652922685.0,
                            "response": "Mining & selling FTW. Gotta sell before all the stakers are let loose!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i969848",
                            "author": "ellster67",
                            "score": 1,
                            "created_utc": 1652942136.0,
                            "response": "seething",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i96160s",
                    "author": "mosquitoes4",
                    "score": -5,
                    "created_utc": 1652936232.0,
                    "response": "Ethereum has so many problems at this point. I would be fine if the biggest fattest whales were the only validators on the network if it meant not paying a monthly car bill for a simple transaction.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96bvfo",
                    "author": "rubioberry",
                    "score": 0,
                    "created_utc": 1652944302.0,
                    "response": "Jp Morgan now own infura though..",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96ozg2",
                            "author": "_ArtosisCurse_",
                            "score": 1,
                            "created_utc": 1652955963.0,
                            "response": "So? There are tons of different notes Not just infura what is your Point here?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96teq4",
                                    "author": "rubioberry",
                                    "score": 1,
                                    "created_utc": 1652959198.0,
                                    "response": "Majority of L1 nodes are now controlled by JPMorgan",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}