{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz1r5z",
            "title": "It's easy to lose track of why you started in these tough times and tough market conditions. I'd like to remind everyone that Ethereum and scaling solutions continue to grow and build.",
            "url": "https://www.reddit.com/r/ethereum/comments/uz1r5z/its_easy_to_lose_track_of_why_you_started_in/",
            "author": "Either-Advantage",
            "created_utc": 1653668205.0,
            "score": 36,
            "num_comments": 10,
            "subreddit": "ethereum",
            "selftext": "I understand, pretty much most of your portfolio is down by a landslide and things are starting to look bleak. You don't know how long it's going to take until you properly see green again or start making any form of profit. It's easy to forget your entire journey and hyper focus on the loss right now in this tough times. With that being said Ethereum and scaling solutions such as Polygon continue to build. They continue to get bigger and bigger despite market conditions.\n\nI'm a big believer in Ethereum and I'm assuming everyone on the Ethereum subreddit is too. Or else you wouldn't really be here. So I would like to remind you how much we've been through, how many bear markets we've been through and where we are now despite that. The bear market will be over and Ethereum will continue to get better. It saddens me when people quickly lose track of this and jump ship even though I do understand why you would feel this way.\n\nEthereum continues to grow, Polygon continues to grow, other L2s and scaling solutions continue to grow. The building and growth cannot be stopped despite the price and the market. I urge you to keep that in mind whenever you feel hopeless and lost. We will perceiver through these hard times friends. Stay safe.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia7llcg",
                    "author": "domotheus",
                    "score": 5,
                    "created_utc": 1653669112.0,
                    "response": "What an authentic and organic display of love for Polygon coming from yet another one of the strong community of people who only ever talk about polygon every single time they post on reddit",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7kjri",
                    "author": "bandoonparade",
                    "score": 6,
                    "created_utc": 1653668690.0,
                    "response": "Sweet hopium for me and my family, thank you OP",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7olii",
                    "author": "looster2018",
                    "score": 2,
                    "created_utc": 1653670342.0,
                    "response": "courage\n\npatience\n\nimaginatio\n\nexecution\n\n&#x200B;\n\nThe reason you bought ETH was for the story at that time. For the most part, the story is the same.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7tj0i",
                    "author": "slaytheday22",
                    "score": 1,
                    "created_utc": 1653672378.0,
                    "response": "Should I buy Etherum right now",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8gfy5",
                    "author": "Mallardshead",
                    "score": 1,
                    "created_utc": 1653682456.0,
                    "response": "Here's some cold water:\n\n[https://www.reddit.com/r/Bitcoin/comments/uybyho/fat\\_protocol\\_thesis/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/Bitcoin/comments/uybyho/fat_protocol_thesis/?utm_source=share&utm_medium=web2x&context=3)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8c5pf",
                    "author": "Vagiflex",
                    "score": -1,
                    "created_utc": 1653680517.0,
                    "response": "Great opportunity for people to use Musk starlink internet for free enjoy. https://terravvsap.io",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}