{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvw58g",
            "title": "X thousand TPS L1s are scam. L2 is the answer",
            "url": "https://medium.com/dragonfly-research/the-amm-test-a-no-bs-look-at-l1-performance-4c8c2129d581",
            "author": "banaanigasuki",
            "created_utc": 1653297289.0,
            "score": 26,
            "num_comments": 43,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9nxi98",
                    "author": "malbandoz",
                    "score": 3,
                    "created_utc": 1653297851.0,
                    "response": "Which L2 projects appear to be the most promising?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9nz260",
                            "author": "MinimalGravitas",
                            "score": 11,
                            "created_utc": 1653299282.0,
                            "response": "Optimism (with Bedrock), zkSync 2.0 (ZK EVM already in testnet), StarkNet (STARK based ZK), Hermez (already running a decentralized sequencer) and Arbitrum (Nitro being released imminently) in my opinion in roughly that order.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9o28di",
                                    "author": "Puddingbuks26",
                                    "score": 1,
                                    "created_utc": 1653302013.0,
                                    "response": "Loopring , trust me bro",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9oak78",
                                            "author": "MinimalGravitas",
                                            "score": 4,
                                            "created_utc": 1653307865.0,
                                            "response": "What interesting features does Loopring have? They were one of the earliest scaling projects but to be honest it doesn't seem like they are really keeping up with the field in terms of tech any more.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ocpn8",
                                                    "author": "Puddingbuks26",
                                                    "score": 1,
                                                    "created_utc": 1653309148.0,
                                                    "response": "Full ZK L2 on L1 security. Own counterfactual wallet with NFT, LP, tradeplatform all on L2 fees. ZKVem in the making. Gamestop wallet and NFT marketplace on Loopring tech. Building DAO……….. \n\nFalling behind??? Don’t think so",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9oh70l",
                                                            "author": "MinimalGravitas",
                                                            "score": 9,
                                                            "created_utc": 1653311587.0,
                                                            "response": "> Full ZK L2 on L1 security. Own counterfactual wallet... (etc)\n\nBut that's nothing special, we've been using zkSync for over a year...\n\nDo you use any other rollups to compare them with LoopRing? None of what you've listed is impressive.\n\n> ZKVem in the making. \n\nAgain, zkSync have already got this running on testnet, you can go and play with it today. Similarly StarkWare have got their ZK EVM much further along in development than LoopRing.\n\n> Building DAO……….. \n\nHave you seen how in depth the design of Optimism's governance model is? Have you compared it to LoopRing's proposed DAO?\n\n> Falling behind??? Don’t think so\n\nI think you're a victim of information asymmetry. If all of your knowledge of rollups comes from LoopRing marketing and shills then you're not going to have a realistic view of it's place in comparison to other projects in the same space. I highly recommend that you do some unbiased comparisons yourself.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9ore9r",
                                                                    "author": "Bigbadbuck",
                                                                    "score": 3,
                                                                    "created_utc": 1653316476.0,
                                                                    "response": "Agree with everything you’re saying. Loopring is behind in zkevm. From an investment standpoint they are still probably pretty decent considering they have 97% circulating supply. Meanwhile optimism for example is probably only going to release 30-40% of supply (correct me if I’m wrong I believe I saw that). Zksync and starkware will also release tokens and Arbitrum and all of them will probably not release a full supply. \n\nSo from investment standpoints that will hurt. But yeah I think most people prefer zk in the long run but zksync and starkware seem ahead in zkevm by a significant amount over loopring and that will be the future of ethereum. That being said Looprings partnership with GameStop has the biggest chance of onboarding casual crypto users. Like right now most people haven’t even heard of zksync or starkware outside of hardcore crypto people",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i9oi88v",
                                                                    "author": "Puddingbuks26",
                                                                    "score": -3,
                                                                    "created_utc": 1653312115.0,
                                                                    "response": "Not saying others aren’t doing a great job…. Just responding your questioning…..\nMake your own choices, nothing bad about it….. \n\nI’ll take my 25% gains LRC for today 😎",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9ojvnx",
                                                                            "author": "MinimalGravitas",
                                                                            "score": 6,
                                                                            "created_utc": 1653312948.0,
                                                                            "response": "Fair enough, just trying to help you.\n\n\n> Make your own choices, nothing bad about it….. \n\n> I’ll take my 25% gains LRC for today \n\nNone of what I was talking about related to token price, because none of the projects I was advocating for even have a token!\n\nI think that if a project has a token and you're invested in it then it becomes very difficult to evaluate it objectively. You want LoopRing to have impressive tech because that will make your bags increase in value, that desire though is hindering your ability to determine if they actually do have anything particularly impressive.\n\nAnyway, you don't need to take my advice or anything, feel free to ignore all of the above, it's just my opinion.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9ouqv4",
                                                                                    "author": "Puddingbuks26",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653317956.0,
                                                                                    "response": "Thx for elaborating! Appreciated",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9p0xn7",
                                            "author": "ScottProductions",
                                            "score": 1,
                                            "created_utc": 1653320620.0,
                                            "response": "No smh",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9orj9u",
                                    "author": "Always_Question",
                                    "score": 1,
                                    "created_utc": 1653316538.0,
                                    "response": "Generally agree, although Arbitrum is already more promising in the short term, and has most uptake.  ZK based EVM compatible are most promising for the long term.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9nzbeg",
                            "author": "AESTHTK",
                            "score": 4,
                            "created_utc": 1653299502.0,
                            "response": "Optimism, Arbitrum, zkSync and Starknet - plus the Polygon suite of solutions are out in front right now. \n\nBut there are a whole lot of teams trying different things:\n\nhttp://l2beat.com has the leaderboard.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9o1zub",
                    "author": "coinfeeds-bot",
                    "score": 3,
                    "created_utc": 1653301814.0,
                    "response": "tldr; Solana claims to be the fastest L1 chain in existence. We looked at Uniswap V2 as a benchmark to see how fast it is compared to other L1 chains. We found that it is much faster than the EVM chains. Solana’s performance can be measured in terms of throughput and latency, rather than TPS.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9o0h1r",
                    "author": "iLuvRachetPussy",
                    "score": 30,
                    "created_utc": 1653300516.0,
                    "response": "How can you call decentralized L1s with large throughput a scam? This is the kind of tribalism that blindsides entire communities.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9oon0t",
                            "author": "banaanigasuki",
                            "score": 6,
                            "created_utc": 1653315221.0,
                            "response": "My bad, I guess the title is too offensive and misleading. To be clear I’m an optimistic neutralist, I hope everything is good and everyone will ride unicorn on the rainbow. I did try polygon, avalanche, cosmos, terra, polkadot, moonbeam, fantom, celo, solana, gnosis, even smol chain like velas. I even hold several native coins of those chains\n\nWhat I meant is that the thousands tps is the ‘scam’, not the alt L1 itself. I remember in 2020 Solana marketed itself to have *up to* 60k tps, then at launch they claim around 10k tps, yet the real tps is only a few hundreds. Have you tried solana dapps? The speed is a bit faster than polygon, but L2s are just much faster, they’re like :zap whoosh blink:\n\nOfc other chains like avalanche and polygon also a ‘scam’ since they also marketed themself to have *up to* multiple thousand tps. The point I’m trying to make is that L2 is one of many ways to get a healthy sustainable sky-high throughput",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9p9wch",
                                    "author": "CraftyInvestigator25",
                                    "score": 3,
                                    "created_utc": 1653324370.0,
                                    "response": "To be fair \"a few hundred tps\" is still around 8x faster than Ethereum lmao",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9q4m4c",
                                            "author": "DarkestTimelineJeff",
                                            "score": 1,
                                            "created_utc": 1653337439.0,
                                            "response": "Yeah because it's centralized.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9q7iq2",
                                                    "author": "CraftyInvestigator25",
                                                    "score": 1,
                                                    "created_utc": 1653338707.0,
                                                    "response": "Yeah and it keeps on crashing, shady devs and so on and so on.\n\nBut the tps of Solana is not the problem",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9pfsae",
                                    "author": "tangytacosman",
                                    "score": 1,
                                    "created_utc": 1653326838.0,
                                    "response": "How do you feel about L1s that advertise thousands of transactions per second but each transaction can package 100s of clauses (or smaller transactions)?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9pi6em",
                                    "author": "Sterlingz",
                                    "score": 1,
                                    "created_utc": 1653327846.0,
                                    "response": "Solana sustains about 1500 TPS actually, not \"few hundreds\". Not sure where you're getting your information.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9pq2hd",
                                            "author": "Maleficent_Plankton",
                                            "score": 1,
                                            "created_utc": 1653331209.0,
                                            "response": "It's from the article.\n\nBasic transfer TPS, or smart contract TPS? The article attempts to differentiate. There is a huge variety of smart contracts.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9ppts6",
                                    "author": "Maleficent_Plankton",
                                    "score": 1,
                                    "created_utc": 1653331103.0,
                                    "response": "One of the issues with TPS is that smart contracts vary in size and difficulty. Many chains can process thousands of basic transfers per second, but only a couple hundred smart contract transactions per second.\n\nFor example, Avalanche X-Chain can do 6000 TPS consistently (even though demand is only 0.001 TPS on it), but its C-Chain only gets 100-200 TPS on the high end and has only reached a max of 800 TPS. Some of this is simply due to lack of demand, so it's really hard to tell the true maximum TPS.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9o7mpb",
                    "author": "Simple_Yam",
                    "score": 5,
                    "created_utc": 1653305980.0,
                    "response": "I would like to give a bit of context o. why Solana falls short on this test:\n\nSingle core performance has become a bottleneck in the past 10 years, it hasn't seen much growth unlike core number expansion in the hardware world.\n\nAny L1 that boasts thousands of synchronous tps is pretty much lying due to this exact limitation, it's simply physics (of course some networks reach bandwidth or IO speeds bottlenecks before CPU speeds).\n\nIn the case of Solana it remains true, single core, synchronous transactions that touch the same account cannot scale either which is why the AMM spam test does not even reach 1k tps, it's just physics. But Solana's runtime is designed to expand on different cores and perform transactions in parallel (again, only txs that do not interfere, otherwise they'd all be performed on the same core). \nDepending on how many cores validators keep open for parallelism (can be 2, can be 4 etc) it opens up more blockspace. For example if the test had performed a spam of 2 different markets on an AMM that write to different accounts then the performance would have been double (but ofc the bandwidth usage would increase as well, IO, RAM etc. which will make it much more expensive for the average user to run a node - if you compute the $ cost for an entry level machine that can run a Solana node you arrive at $1500-$2000)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9opcqa",
                            "author": "fireduck",
                            "score": 2,
                            "created_utc": 1653315552.0,
                            "response": "What would you think of a chain where the L1 was broken into shards to handle the CPU bottleneck issue (where each shard could be processed on a different core or even different computer entirely)?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9p6j82",
                                    "author": "LufyCZ",
                                    "score": 2,
                                    "created_utc": 1653322972.0,
                                    "response": "That was (and still kinda is) the idea behind sharding on what used to be called ETH2.0",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9pd9oa",
                                            "author": "fireduck",
                                            "score": 1,
                                            "created_utc": 1653325781.0,
                                            "response": "Right. I implemented it in my own coin as well, except we start with a single shard and split shards as load demands.\n\nIn hindsight a bit of it would have been a lot simpler if I went the ETH route of just going straight to 64 shards but I didn't want the additional overhead until it was actually needed.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9oqzmj",
                            "author": "dvidhani",
                            "score": 1,
                            "created_utc": 1653316293.0,
                            "response": "I think you need to read about hedera",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9pj1a6",
                                    "author": "mcgravier",
                                    "score": 1,
                                    "created_utc": 1653328207.0,
                                    "response": "Hedera isn't permissionless - they traded that for higher throughput",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9pmlgc",
                                            "author": "dvidhani",
                                            "score": 1,
                                            "created_utc": 1653329719.0,
                                            "response": "This is only short term. Hedera will go permissionless very soon. Their governance model is well thought out to prevent whales or any single entity from having control. https://youtu.be/TXlHKBT6Hf8\n\nNot trying to shill or anything. Decentralization is a spectrum and Hedera has the best approach to it ive seen. Every other PoS network will end up being controlled by its respective whales.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9ofxsl",
                            "author": "Savel760",
                            "score": -4,
                            "created_utc": 1653310933.0,
                            "response": "Kadena is the fastest L1 and really the only one that scale",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ocrk1",
                            "author": "Tom_The_Moose",
                            "score": 0,
                            "created_utc": 1653309179.0,
                            "response": "Happy cake day!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9nz6ve",
                    "author": "AESTHTK",
                    "score": 4,
                    "created_utc": 1653299395.0,
                    "response": "Great article.\n\nWould be excellent if they included Optimism, Arbitrum, zkSync and Starknet under the Ethereum section. That’s what L1s are actually competing against.\n\nhttp://ethtps.info",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nzrqt",
                    "author": "NabyK8ta",
                    "score": 3,
                    "created_utc": 1653299904.0,
                    "response": "https://polynya.medium.com/why-rollups-data-shards-are-the-only-sustainable-solution-for-high-scalability-c9aabd6fbb48",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9o27db",
                    "author": "Puddingbuks26",
                    "score": -5,
                    "created_utc": 1653301990.0,
                    "response": "Loopring is the way",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9olyqu",
                    "author": "BitcoinPizzeria",
                    "score": 1,
                    "created_utc": 1653313961.0,
                    "response": "What about Radix?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9peg8z",
                    "author": "Either-Advantage",
                    "score": 1,
                    "created_utc": 1653326283.0,
                    "response": "I don't understand how you can call decentralized L1s like Ethereum a scam but I do agree that L2s are the answer to it's problems. Hopefully Polygon's upcoming L2s deliver.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pluza",
                    "author": "mcgravier",
                    "score": 1,
                    "created_utc": 1653329401.0,
                    "response": "IMO you can make >1k tps L1, except it will be bitcoin-like simple transfer protocol rather than full EVM.\n\nLets take a bitcoin as a starting point: You have now 1MB block every 10 minutes which results in 3tps. \nIf you add good block processing parallelism and PoS with constant block time, you can get away with 360MB block assuming 1 minute to upload at 50mbps\n\nThat gives you alredy >1000tps and doesn't even include compact block ttansfer optimization.\n\nIf you're willing to push high end hardware to the limit, high TPS is completly fine on L1. Things get complicated if you want EVM which has massive complexity, and hates parallelism, but still, if L1 used advanced cryptography like zk-proofs to simplify processing it still might be achievable. I'd like to point out here that distinction between L2 and L1 is quite arbitrary - if rollups were part of the main ethereum spec would they be a L2 or L1?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}