{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uq9nbn",
            "title": "Would incoming Ethereum 2.0 chase home Solana, Zetrix, BSC and other blockchain networks?",
            "url": "https://www.reddit.com/r/ethereum/comments/uq9nbn/would_incoming_ethereum_20_chase_home_solana/",
            "author": "Eileen755",
            "created_utc": 1652631952.0,
            "score": 4,
            "num_comments": 10,
            "subreddit": "ethereum",
            "selftext": "Yeah, we all know the many constraints which currently besieges our dear Ethereum network.\n\nMajor constraints such as extremely high gas fees for even simple transactions, a transaction per second (TPS) figure of about 15, which makes the network pretty slow when it comes to processing transactions and a couple other limitations such as the current consensus model in use and the technicality of its programming language even for developers.\n\nWith these many loopholes on the Ethereum network layer, the blockchain space has witnessed the rise of brilliant networks such as Solana, Polygon, zetrix, BSC and many others… all wading the blockchain tide to own the largest slice of the market.\n\nBut we all know Ethereum also isn't sleeping on its weaknesses with Its plans for Ethereum 2.0\n\nNow, looking into the crystal ball, what do you make out of the many currently available blockchain networks when the much anticipated Ethereum 2.0 finally comes in full force out of the pipeline?\n\nWith Ethereum 2.0 touted to run on a Proof-of-stake consensus model, with Sharding put in place on the network, and with a promised TPS of around 150,000… do you think there would still be a seat for all of these other networks?\n\nWhat does your crystal ball hint about Solana, Polygon, BSC, zetrix, avalanche and others when Eth 2.0 fully launches?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8pu8ox",
                    "author": "PandemoniumX101",
                    "score": 15,
                    "created_utc": 1652635423.0,
                    "response": "Bad bot",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pua5a",
                            "author": "B0tRank",
                            "score": 4,
                            "created_utc": 1652635440.0,
                            "response": "Thank you, PandemoniumX101, for voting on Eileen755.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8q0e3w",
                    "author": "KaiSosceles",
                    "score": 6,
                    "created_utc": 1652638092.0,
                    "response": "Zetrix? lolwut. How does that name even show up in this post?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8prz8b",
                    "author": "DavidKens",
                    "score": 4,
                    "created_utc": 1652634440.0,
                    "response": "I think you should checkout the actual roadmap for Ethereum upgrades, they’ve changed a lot in the last year. There are currently no plans to support the kind of transaction volume you’re picturing on the mainnet, and the label Eth2 is gone. \n\nThere will be plenty of room for other chains to keep trying to do things differently. I think the most of the chains you mentioned happen to not compete with Ethereum mainnet, because they make different tradeoffs deliberately.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}