{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ur0djw",
            "title": "🥧PYE is the Future of Tokenomics! | Presale On ETH 5/17! | No More Contract Selling🥧",
            "url": "https://www.reddit.com/r/ethereum/comments/ur0djw/pye_is_the_future_of_tokenomics_presale_on_eth/",
            "author": "soughtaftermost",
            "created_utc": 1652719787.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "ethereum",
            "selftext": "✔️PYE is a multi-faceted token project directed at changing the way you use cryptocurrency. Each project within PYE’s ecosystem lends ground-breaking utility aimed at providing advantages to both the holders and projects who interact with the ecosystem.\n\n✔️PYESWAP is the first swap to utilize BNB, and now ETH, to power the BuyBack mechanism. With this revolutionary tech, projects will no longer need to sell tokens on the market as the taxes are taken from the BNB BEFORE it buys the tokens.\n\n✔️NO MORE CONTRACTS SELLING TOKENS! Thus allowing tokenomics without red candles interrupting the long-term health of the project. \n\n✔️This is just a small piece of the PYE… of which holders earn 40% of net profits on PYESWAP through the Innovative Staking Reward System, the Circle of PYE. As well as from projects launching via MoonForce, the only Gateway Launchpad into Swap 2.0 Tech. \n\n✔️PYE’s innovative technologies and frictionless utility are making waves in the crypto-sphere. The goal is to lower the barrier of entry, paving the way for cryptocurrencies mass adoption. PYECharts, PYESwap, and PYE’s NFT marketplace will seamlessly integrate with other platforms. A portion of the fees will then be redistributed back to PYE holders.\n\n🥧The flood gates are opening; join the community today to learn about PYE on ETH!🥧  \n\n\n[https://discord.gg/YdaAjnTR](https://discord.gg/YdaAjnTR)",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ur0ae2",
            "title": "Secured #4: EF Bug Bounty Rewards now up to $250,000 USD",
            "url": "https://blog.ethereum.org/2022/05/16/secured-no-4/",
            "author": "JBSchweitzer",
            "created_utc": 1652719558.0,
            "score": 13,
            "num_comments": 6,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8v2lbj",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1652732115.0,
                    "response": "tldr; The Ethereum Foundation Bug Bounty Program has been merged into one. The max reward of the Bounty Program is now $250,000 (paid out in ETH or DAI) for vulnerabilities in scope. Upgrades live on public testnets and targeted for a Mainnet release are also scope, and rewards are doubled during this time.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ur0bgf",
            "title": "Slashing",
            "url": "https://www.reddit.com/r/ethereum/comments/ur0bgf/slashing/",
            "author": "Maticus",
            "created_utc": 1652719639.0,
            "score": 1,
            "num_comments": 8,
            "subreddit": "ethereum",
            "selftext": "What activity will result in a validator having its stake slashed? Would censoring transactions suffice? Who gets to determine when a validator has been acting \"bad\" and is going to have its stake slashed? Is there any mechanism to prevent bad faith slashing?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8veqm3",
                    "author": "Perleflamme",
                    "score": 1,
                    "created_utc": 1652737157.0,
                    "response": "Censoring is harder to detect when it's the proposer censoring, but also way harder to enforce, as you're not continuously the block porposer: censoring all transactions from one or more specific wallet(s) is easy when it's on the L1 and there are plenty other valid transactions. But when there aren't other valid transactions, it is easy to spot the block isn't as full as it should. And when the transactions actually are on an L2, you're beginning to censor an L2, which becomes way easier to spot too. \n\nBut if it's many validators colluding to censor at the same time the same wallet(s), it becomes easier to spot even on the L1 and when there are many other transactions, as it is proven by time itself. This is solved through L0 consensus and a fork away from bad actors.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vopwt",
                    "author": "edmundedgar",
                    "score": 1,
                    "created_utc": 1652741631.0,
                    "response": "Currently the only thing that gets you slashed is if you make contradictory votes. If you only run your validator on one computer this shouldn't happen by accident, absent a serious bug. There are some tools to help you avoid getting slashed if you migrate validators from one computer to another.\n\nIIUC there's currently no protocol rule against censoring transactions, but you couldn't do it unless you had a huge share of staking power. As of the current design it would probably be an extra-protocol thing, ie we'd see that over half the stakers were censoring and do a hard fork to delete their stake. There's a plan to do something called crLists to allow censorship to prevented in-protocol; I'm not sure if it slashes people who refuse to put transactions in blocks, or if it just considers the censoring blocks invalid. Details here:  https://notes.ethereum.org/@fradamt/H1ZqdtrBF",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}