{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v1mno7",
            "title": "I feel like Ethereum’s scalability issue is becoming less and less relevant with the fast development of L2s",
            "url": "https://www.reddit.com/r/ethereum/comments/v1mno7/i_feel_like_ethereums_scalability_issue_is/",
            "author": "pihip2",
            "created_utc": 1653990791.0,
            "score": 19,
            "num_comments": 14,
            "subreddit": "ethereum",
            "selftext": "I might be biased cause I’ve been part of the Ethereum community since 2018, but I genuinely think that Ethereum is the best chain out there right now. However, the only issue with it has always been traffic and gas fees.\n\nEthereum has always been plagued with this issue but I’m starting to feel like it's slowly but surely becoming less and less of a problem with how fast L2s have been developing their tech.\n\nEthereum is taking a rollup-centric roadmap right now (specifically ZK rollups) and it will eventually integrate L2s into the blockchain in a way that makes them nearly inseparable from Ethereum. Vitalik talked a lot about it and he basically dreams of an Etherum where L2s aren't considered as an add-on anymore but more of a part of Ethereum that will end up being taken for granted with no second thought about them.  \nWe’re already seeing a tom of exciting Zk development from projects like Zksync and Loopring recently.  \nEven Polygon takes the cake with ZK scaling solutions ready for use and $1 billion allocated for ZK tech development.\n\nAll of this effort and funds combined will end up making Ethereum problem less and less relevant, especially after the introduction of sharding which will basically put L2s on steroids.",
            "stickied": false,
            "comments": [
                {
                    "id": "ianbanv",
                    "author": "PinkPuppyBall",
                    "score": 2,
                    "created_utc": 1653993099.0,
                    "response": "Good resources for on boarding : http://Ethl2s.com\n\nNews : https://L2.news",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iana9cz",
                    "author": "ElephantBaba",
                    "score": 4,
                    "created_utc": 1653992243.0,
                    "response": "It’s not a feeling it’s a fact",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ianhnml",
                            "author": "1Types",
                            "score": 1,
                            "created_utc": 1653997671.0,
                            "response": "Thank me later 🙏💟 https://youtu.be/WHGEa-hImUY",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ianc3i3",
                    "author": "Casino_Insider",
                    "score": 2,
                    "created_utc": 1653993727.0,
                    "response": "Doesn't it just means that the chain is flawed and solving its issues just makes things more complicated for regular users? \n\nIf crypto is trying to fix traditional finance  and to make it more versatile and trying to replace it, shouldn't we apply the same logic to crypto and move away from coins that are flawed in favour of projects that accomplish everything by themselves instead of relying on L2?\n\nI'm pretty sure the scalability issues are fixing themselves by just being in a bear market.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iancu2v",
                            "author": "yogofubi",
                            "score": 2,
                            "created_utc": 1653994296.0,
                            "response": "Ethereum is nowhere near finished. \n\nCan you name a project that accomplishes everything by itself?\n\nMaybe there's a reason Ethereum is built the way it is",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iandyr7",
                                    "author": "Casino_Insider",
                                    "score": 0,
                                    "created_utc": 1653995132.0,
                                    "response": ">Maybe there's a reason Ethereum is built the way it is\n\nBecause it's a second generation coin and it was a first try at doing what it does?\n\nI'm not going to name other coins, it got me banned on another sub for \"promoting scams\".",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ianhj3w",
                                            "author": "Always_Question",
                                            "score": 1,
                                            "created_utc": 1653997589.0,
                                            "response": "Short cuts don’t make a “third generation” coin",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iandpk8",
                            "author": "frank__costello",
                            "score": 1,
                            "created_utc": 1653994946.0,
                            "response": "> Doesn't it just means that the chain is flawed\n\nWhat specifically is the flaw?\n\n> solving its issues just makes things more complicated for regular users\n\nI don't see how using Arbitrum is any more complicated than using BSC or Avalanche\n\n> move away from coins that are flawed in favour of projects that accomplish everything by themselves\n\nWhich projects solve \"everything by themselves\"?\n\nPersonally, the only ones that fit this category are Ethereum, Tezos and Cosmos/Celestia. And out of those, Ethereum is clearly the most advanced.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ianak38",
                    "author": "Puddingbuks26",
                    "score": 1,
                    "created_utc": 1653992490.0,
                    "response": "With the loads and loads of traffic onboarding, every bit helps. And even then we need secure L1 to  grow with the total of ‘bandwith’ needed",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iands13",
                    "author": "Buggy3D",
                    "score": 1,
                    "created_utc": 1653994997.0,
                    "response": "The issue I have with L2s is that they each work as their own individual side chain with their own native tokens and mostly centralized protocols in order to achieve higher speed and efficiency.\n\nThis means that a big bulk of the transactions that happen on them will essentially render Eth as just a base layer network that combines the dozens of different L2 chains that each run on their own individual token. \n\nAs these become more efficient, their reporting on L1 will become less and less frequent per number of transactions, and eventually may lead to Eth becoming obsolete altogether if a single one or two rise to prominence to a degree that the base layer becomes merely symbolic.\n\nThis would render such a network about on par as what BSC is today, where the notion of a true Decentralized network is nothing but a dream notion.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ianezci",
                    "author": "mcsnoogins",
                    "score": 1,
                    "created_utc": 1653995870.0,
                    "response": "Is the drop in fees due to a drop in use of Ethereum or an increase in L2 usage?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ianhjax",
                    "author": "AllfatherAngron",
                    "score": 1,
                    "created_utc": 1653997592.0,
                    "response": "With Bitcoin lightning network and L2 solutions on Ethereum, what will be the purpose of the rest of the cryptocurrencies?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ianibi9",
                    "author": "HotHamWaterBath",
                    "score": 1,
                    "created_utc": 1653998095.0,
                    "response": "It’s been a hot minute since I’ve played with crypto. Is there a way to avoid the eth network to buy directly on polygon or any of the other l2s?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}