{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0yqmk",
            "title": "Will the impermanent loss of a multi-token pool really be lower?",
            "url": "https://www.reddit.com/r/ethereum/comments/v0yqmk/will_the_impermanent_loss_of_a_multitoken_pool/",
            "author": "x3finance",
            "created_utc": 1653912342.0,
            "score": 0,
            "num_comments": 2,
            "subreddit": "ethereum",
            "selftext": " The automatic market maker is one of the great innovations of defi, but impermanent loss is also one of the stumbling blocks that hinder its continued development. The solution of impermanent loss will be one of the important directions of defi 2.0. Recently, the author saw a view that multi-token in one pool can reduce the risk of impermanent loss. Is it true? I have a negative attitude towards this. On the contrary, I think that multi-tokens in one pool not only increase the risk of impermanent losses but also increase the risk of price exposure. For example, 16 tokens constitute one pool such as balancer, and 2 tokens pairs form 8 liquidity pools such as uniswap. Assuming that the 16 tokens include a shit coin such as luna or UST. As for the first protocal, 15 tokens in the one liquidity pool will be sold by the AMM protocol. In the end, all liquidity providers’ assets will be reset to zero. But as for the second protocol, 16 tokens scattered in 8 different liquidity pools, only one liquidity pool including luna will suffer losses, while the other 7 pools will not be affected. Based on the above point of view, the multi-token liquidity pool model greatly aggravates the market risk, while the dual-token pool separates the market risk very well. Of course, the one with the lowest risk is the single-sided staking model, which is also one of the directions of our efforts in the future. \n\n&#x200B;\n\nhttps://preview.redd.it/vwxpw1xysl291.png?width=521&format=png&auto=webp&s=f395b3fb9d7765498bf6c4096587ebd2e5da7fbd\n\n [https://x3finance.medium.com/will-the-impermanent-loss-of-a-multi-token-pool-really-be-lower-768381508f8a](https://x3finance.medium.com/will-the-impermanent-loss-of-a-multi-token-pool-really-be-lower-768381508f8a)",
            "stickied": false,
            "comments": []
        }
    ]
}