{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uq3e4s",
            "title": "Simultaneous attacks breached CoinGecko, Etherscan, Quickswap and other sites",
            "url": "https://www.reddit.com/r/ethereum/comments/uq3e4s/simultaneous_attacks_breached_coingecko_etherscan/",
            "author": "Alianna7656",
            "created_utc": 1652611116.0,
            "score": 10,
            "num_comments": 17,
            "subreddit": "ethereum",
            "selftext": "Around 10 PM (UTC) this Friday, it became known that several platforms related to cryptocurrencies suffered attacks of different types that could jeopardize the security of their users' information, and then perhaps their funds. The situation affected the pricing and statistics site CoinGecko, the Ethereum block explorer Etherscan and the decentralized exchange (DEX) QuickSwap. \n\nApparently, no attacks or vulnerabilities have yet been reported in other recent blockchains such as Solana, in some of the wallets such as Phantom or even in some blockchain bridges such as Zetrix.\n\nIn the case of CoinGecko and Etherscan, a phishing attack occurred through a pop-up notification when entering these portals. In the message, it asked to connect the MetaMask wallet to nftapes.win, a type of advertisement that is not normally displayed on these sites. \n\nBoth platforms reported that the original problem was related to Coinzilla, an advertising service used by these sites. In a post on its Twitter account, Coinzilla reported that the problem was caused by malicious code in an ad campaign that got through the site's automated security controls. \n\nAlthough the affected platforms issued statements with further details on Twitter, neither admitted or denied that users lost funds as a result of the attack.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ok4p0",
                    "author": "KlopKlop10293",
                    "score": 40,
                    "created_utc": 1652611484.0,
                    "response": "> Apparently, no attacks or vulnerabilities have yet been reported in other recent blockchains such as Solana,\n\nWhy are you comparing a block explorer/websites to a blockchain?\n\nEth itself didn’t got attacked nor has any vulnerabilities",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8oyf9c",
                    "author": "bandoonparade",
                    "score": 9,
                    "created_utc": 1652620898.0,
                    "response": ">that could jeopardize the security of their users' information, and then perhaps their funds.\n\nEtherscan users' funds?? GTFOH with this",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}