{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqqmi1",
            "title": "Ethereum post merge",
            "url": "https://www.reddit.com/r/ethereum/comments/uqqmi1/ethereum_post_merge/",
            "author": "Tangang97",
            "created_utc": 1652687663.0,
            "score": 11,
            "num_comments": 16,
            "subreddit": "ethereum",
            "selftext": " Right now Proof of Stake and PoW Participates get rewards, will the awards of the previous PoW shift automatically to PoS and the Staking Reward will increase post merge?   \n\n\nIn this way it might be a good way to stake right due to the sudden increase of rewards?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8thgeg",
                    "author": "domotheus",
                    "score": 6,
                    "created_utc": 1652708657.0,
                    "response": "**Today:**\n\nMiner rewards = 2 ETH/block + priority fees\n\nStaker reward = Issuance\n\n**After the merge:**\n\nMiner rewards = 0, miners don't exist no more\n\nStaker reward = Issance + priority fees",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8so1dt",
                    "author": "MinimalGravitas",
                    "score": 12,
                    "created_utc": 1652688153.0,
                    "response": "At the moment both miners and Beacon chain stakers are getting block rewards (including all the bits that this comprises of in PoS), with the former getting around 10x the latter. The tip portion of transaction fees (the bit that isn't burnt) is going to miners and they are also able to get any MEV.\n\nWhen the Merge occurs the miners disappear from the system, the block rewards for stakers are unchanged, but they will begin to get the tips and have access to the MEV. In the short run this will probably cause a spike in rewards, though lots of people will probably then decide to start staking so in the long term a lower equilibrium may be reached.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8st2p0",
                    "author": "wood8",
                    "score": 8,
                    "created_utc": 1652692755.0,
                    "response": "The previous PoW reward will simply disappear, PoS reward remain the same. That's why it called triple halving, it will be 8 times lower, and burning gas fee will greatly surpass reward, make ETH deflationary.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8sv59m",
                            "author": "Tangang97",
                            "score": 0,
                            "created_utc": 1652694642.0,
                            "response": "So the rewards will stay the same? So it will be deflationary, because the burning rate stays the same, but the general Inflation Rate drops from 4% to \\~ 0,32% =5%/8   \nminus burned ETH through Transactions",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8sw1tx",
                    "author": "marilketh",
                    "score": -4,
                    "created_utc": 1652695433.0,
                    "response": "There are incredible sites dedicated to teaching this.  Asking on reddit is very lazy, as you are expecting the answer to be some simple comment.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ssfmi",
                    "author": "thomas_m_k",
                    "score": 1,
                    "created_utc": 1652692161.0,
                    "response": "Yes and yes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8unnmq",
                    "author": "AbbreviationsLevel73",
                    "score": -4,
                    "created_utc": 1652726013.0,
                    "response": "stop saying eth is delflationary and read up on economics, no pos is deflationary, it can reach a balance but can never be deflationary, when deflation happens to a monetary supply economic contraction happens / recession because the velocity of money slows down to a halt, if the dollar becomes stronger for example you then have recession, because the cost of capital becomes greater\n\nin simple english people dont want to part with their monies because its worth too much, \n\nso there is like a tight rope act of balance between inflation and deflation, truly any pos chain that wants to grow from an economic standpoint has to have inflation\n\nthis whole deflation burning scarcity is total nonsense and a pr gimmick, bare in mind i am not talking about rampant inflation like those rebasing daos but a normal 5-10% inflation",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v2idj",
                            "author": "Intelligent_Steak",
                            "score": 6,
                            "created_utc": 1652732080.0,
                            "response": "ETH *can* be deflationary if burning > issuance, which will likely be true in the future.  It's not just a gimmick. There's never really been a deflationary currency widely used before, so who's to say the traditional deflation=recession theory will hold true.  There's nothing inherit about deflation that means a currency will be a failure.  Its just in the past there's always been inflation from central bank issuance.\n\nAlso, 5-10% inflation is normal?! That would be cause for great concern, like what's happing now with USD.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8v3jrg",
                                    "author": "AbbreviationsLevel73",
                                    "score": -5,
                                    "created_utc": 1652732504.0,
                                    "response": "yea forget it, come back when you have at least an inkling of basic economics,",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8v6fxd",
                                            "author": "Intelligent_Steak",
                                            "score": 1,
                                            "created_utc": 1652733695.0,
                                            "response": "I studied economics in university.  Deflationary shocks or spirals are cause for concern when a currency is supposed to be inflationary (because of long-term issuance).  But, there has never been long-term expected deflation.  Can you explain how expected deflation necessarily leads to higher costs of capital and decreased economic activity?  There's nothing inherit that means one leads to the other.\n\nOutside of this, my post was mainly meant to say ETH being deflationary is not a gimmick or untrue in any way.  Just by the definition of deflation, ETH could and probably will become deflationary in the future.  Whether you think that's a good thing is separate",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8v7fyj",
                                                    "author": "AbbreviationsLevel73",
                                                    "score": -3,
                                                    "created_utc": 1652734099.0,
                                                    "response": "no form of currency is deflationary my man, if the ecosystem keeps growing the currency needs to be inflationary, when you are in a deflationary state the velocity of money slows down as the currency strenghtens that is because nobody wants to part with their money in simple english, therefore businesses cannot get capital (as capital is expensive) therefore cannot grow etc, \n\nthat is why it is the job of the central bank to do this ballancing act of controlling inflation, too much inflation and the economy suffers because  the people lose purchasing power so the stored energy in capital is worthless to little inflation and the economy contracts because the cost of capital is so great that businesses halt. \n\ni mean if you studied economics you should already know this,\n\neth will always be inflationary or at best stagflationary but never deflationary",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}