{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxe7ee",
            "title": "'Pay more attention' Ethereum co-founder says of crypto crash | Reuters",
            "url": "https://www.reuters.com/markets/us/pay-more-attention-ethereum-co-founder-says-crypto-crash-2022-05-25/",
            "author": "sandygws",
            "created_utc": 1653473830.0,
            "score": 7,
            "num_comments": 8,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9xy2nx",
                    "author": "tea_ego",
                    "score": 4,
                    "created_utc": 1653490833.0,
                    "response": "Plenty of useless shitcoins out there, sadly",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9x6sri",
                    "author": "coinfeeds-bot",
                    "score": 3,
                    "created_utc": 1653477319.0,
                    "response": "tldr; Ethereum's co-founder Gavin Wood has said that cryptocurrency investors need to be more aware of what is backing their holdings after a market rout which wiped more than $800 billion off their value. \"I would hope that people pay more attention to what is belying the currency name when they get involved in a community, ecosystem, economy,\" he added.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zfmtb",
                    "author": "No_Detective_1523",
                    "score": 1,
                    "created_utc": 1653512076.0,
                    "response": "pay attention to ethereum losing its value. cheers for that dickhead.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia19l5g",
                    "author": "Dankmanchilliwilli",
                    "score": 1,
                    "created_utc": 1653545518.0,
                    "response": "Bitcoin, Ethereum, Litecoin, Etheruem Classic, Chainlink, ZCash are my long long term holds.  Proof of Work vs Proof of Stake consensus is so important, I think for true decentralization, Proof of Work is the way to go. Proof of Stake just comes off as a globalist way to rig crypto. Who ever has the biggest bag will make enough staking rewards to never need to work or worry about money again, where as Proof of Work relies more on the technology and economic factors. All the other altcoins make me nervous. No dog coins, no monkey coins, no kitty coins for me.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}