{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwsjvf",
            "title": "“I expect ZK-SNARKs to be a significant revolution as they permeate the mainstream world over the next 10-20 years” - Vitalik back in 2021",
            "url": "https://www.reddit.com/r/ethereum/comments/uwsjvf/i_expect_zksnarks_to_be_a_significant_revolution/",
            "author": "InternalFact1",
            "created_utc": 1653403725.0,
            "score": 9,
            "num_comments": 2,
            "subreddit": "ethereum",
            "selftext": "And I fully agree, cause while I think most scaling tech right now is doing its job perfectly, I also believe that ZK will end up being the most widely adopted for multiple reasons.\n\nI like Optimistic tech but ZK is still faster and more importantly, a lot more secure since validators have no access to crucial private information. With ZK, validators have the bare minimum information needed to validate the transaction. The only draw back is that ZK requires more computational power however this will become less and less of an issue the more development efforts and funds are put into the system.\n\nIf anything, w’re starting to see a shift from L2s and commit chains towards ZK technology. A ton of development is being implemented towards this right now with the most prominent of projects in my opinion being Polygon with four ZK based scaling solutions (Miden, Zero, Hermez, Nightfall) two of which are SNARKS.\n\nOthers like Zksync (as the name implies) and Loopring are also focusing on ZK technology as well know.\n\nI think that Optimistic tech won’t disappear and we will still need it for certain types of transactions however as time passes, I do believe that its usage will slowly start decreasing in favor of ZK.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9tneys",
                    "author": "espresso_chain",
                    "score": 1,
                    "created_utc": 1653409403.0,
                    "response": "> a shift from L2s \n\nzkSync, starknet, both L2s employing ZK tech. that's the direction we are going in. \n\nwe're not moving away from L2s, we're making them better.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}