{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwjr8z",
            "title": "What’s giving eth value?",
            "url": "https://www.reddit.com/r/ethereum/comments/uwjr8z/whats_giving_eth_value/",
            "author": "Fuzzy_Ad4484",
            "created_utc": 1653370964.0,
            "score": 36,
            "num_comments": 75,
            "subreddit": "ethereum",
            "selftext": "I have heard a lot of people say that crypto like ether has value because of things like smart contracts and proof of stake. But why does that mean you should invest in it? Why can’t a company that wants to use these features just fork ether and do everything in house? \n\nHope this question makes sense…\n\nEdit: My point is what’s stoping a bank from using blockchain tech in-house that lets you make payments faster and more efficient. Would they need to go through ether or another crypto or couldn’t they just develop their own. I know it wouldn’t be decentralized but let’s be honest the average person doesn’t care about decentralization they want to be able to make payments fast and secure and banks want to be able to process them efficiently.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9rzx3w",
                    "author": "Nonocoiner",
                    "score": 38,
                    "created_utc": 1653372375.0,
                    "response": "It's easy to copy or fork the code, but you can't copy the Ethereum devs, the community, liquidity, and the security and decentralization of the network. And without those there's not much value.\n\nThat said, an enterprise fork of Ethereum is being utilized, by jp Morgan I think. Probably using some proof of authority variation.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s0scy",
                            "author": "bon3s",
                            "score": -18,
                            "created_utc": 1653373084.0,
                            "response": "Richard Heart is going to do it.  Watch",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9s12bw",
                                    "author": "edmundedgar",
                                    "score": 24,
                                    "created_utc": 1653373296.0,
                                    "response": "Richard Heart is going to do what he always does: Sucker a bunch of low-information retail investors out of their money and then move on to the next thing.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9s1k2c",
                                    "author": "keepontruckinbag",
                                    "score": 6,
                                    "created_utc": 1653373696.0,
                                    "response": "PulseChain will be a great example of why you can't just clone ERC20's on a different chain and have that be enough to give them value.\n\nHow will something like pLINK (Chainlink on PulseChain) have value if no one is managing the keys or making oracle updates? Every DeFi application will become out of whack, every AMM pair unbalanced, ~99.99% of dapps will collapse, break or freeze. Watch",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9s5567",
                                    "author": "Jake10873",
                                    "score": 6,
                                    "created_utc": 1653376728.0,
                                    "response": "They can barely build a good website lol...\n\nAlso have you seen the hex staking dapp?\n\nIt is truly horrendous.\n\nEven the organization for the community is a complete shitshow, everything is literally primarily on telegram!\n\nWith all of this how can you really think that RH would even come close to getting a fleshed out community of devs similar to ETH on pulse\n\nThere is literally 0 incentive for any devs to move from eth protocols to mirrored protocols on pulse\n\n99.9% of these mirrored protocols on pulse will fail.\n\nAnyone who \"sacrificed\" their ETH version of tokens basically just gave them away for nothing!\n\nPulse will be in free fall mode with similar basically non-existent liquidity as hex (why do you think they are urging people to lock their pulse)",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9sbfqq",
                                    "author": "Perleflamme",
                                    "score": 4,
                                    "created_utc": 1653382539.0,
                                    "response": "Good luck.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9sks4a",
                                    "author": "aberlour7",
                                    "score": 3,
                                    "created_utc": 1653390508.0,
                                    "response": "That’s fucking hilarious. How can anyone think highly of Heart… seriously - what about him or his projects give you any hope?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9so1a6",
                                    "author": "robberbaronBaby",
                                    "score": 3,
                                    "created_utc": 1653392713.0,
                                    "response": "Whatever you have sacrificed for pulse is a sunk cost, move on.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9s63o0",
                    "author": "omgcoin",
                    "score": 26,
                    "created_utc": 1653377582.0,
                    "response": "Ethereum gets its value from **self-reinforcing network effect**.\n\nTo put it simply: It's relatively easy to make copy-cat of Twitter but that's not how it works. You want to be in Twitter because other people on Twitter.\n\nNetwork effects are one of the most important concepts in economics. It's very hard to bootstrap network effect but once you achieve it, it becomes self-reinforcing.\n\nNetwork effect is especially important in case of Ethereum because smart contracts has value because they are unstoppable. They are unstoppable because Ethereum network is decentralized (many nodes).\n\nETH is central part in this ecosystem. You need to pay for smart contract execution. So the more dapps are used in Ethereum network, the more valuable ETH. Reverse is also true, because ETH is very liquid, it often used in many dapps (as loan or collateral etc).\n\nThere are potentially more technically advanced networks than Ethereum but they are lacking network effect, and as a result they are lacking decentralisation.\n\nThat's why my portfolio is focused around Ethereum. As one guy on Bankless podcast puts it: Ethereum is like Manhattan, it's crowdy and expensive but everyone wants to be there.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s0uwr",
                    "author": "wood8",
                    "score": 7,
                    "created_utc": 1653373138.0,
                    "response": "Smart contracts is not a feature, it is to implement an existing feature in a decentralized way. If it's inhouse, it won't be decentralized so there will be no point to use it. I made a [video](https://youtu.be/-vpUcRgS6Ds) to explain what smart contract really is from computer's perspective rather than finance.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sgh5c",
                    "author": "EmilyLovs",
                    "score": 5,
                    "created_utc": 1653387137.0,
                    "response": "Network effect.\n\nThe value isn't in the code... it's in the network.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ryxco",
                    "author": "pwrusr-com",
                    "score": 47,
                    "created_utc": 1653371611.0,
                    "response": "Ethereum price is determined by the free market laws of supply and demand, internal & external factors.\n\nEthereum doesn't mean you should invest in it - anyone is free to invest or not based on their individual knowledge or inclination and-or own financial planner's advice.\n\nNew Ethereum forks require significant technical knowledge & man-power to maintain, grow & expand so achieving the size and scale of the Ethereum ecosystem is quite a significant undertaking that no other blockchain has been able to match at this point.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t2404",
                            "author": "PrestigiousAd5646",
                            "score": 6,
                            "created_utc": 1653400323.0,
                            "response": "I’m not sure how this is the most upvoted comment here… it’s pretty generic.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9t53jl",
                                    "author": "DiamondDallasHands",
                                    "score": 9,
                                    "created_utc": 1653401698.0,
                                    "response": "I mean what else were you looking for?  Things cost what others are willing to pay for it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9u57od",
                                            "author": "DavidKens",
                                            "score": 1,
                                            "created_utc": 1653416718.0,
                                            "response": "The network effect?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9t3hqu",
                                    "author": "pwrusr-com",
                                    "score": 4,
                                    "created_utc": 1653400963.0,
                                    "response": "Yes, at the beginning it is a generic response to a generic enquiry  and it becomes more insightful as you dig in",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9sotbq",
                            "author": "shostakofiev",
                            "score": -7,
                            "created_utc": 1653393202.0,
                            "response": "This is not a good answer.  The first two paragraphs aren't answers at all, and skirt the question.  The last paragraph touches on the network effect but doesn't mention the security that is brought by decentralization.\n\nEthereum is a powerful platform because it's security and decentralization are valued by devs and users alike.\n\nEther has value because you need it to interact with the Blockchain, or with any smart contracts deployed on Ethereum.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9susme",
                                    "author": "pwrusr-com",
                                    "score": 1,
                                    "created_utc": 1653396679.0,
                                    "response": "This is not a good interpretation of OP's enquiry.\n\nIMHO, Fuzzy's question is more about understanding what determines Ethereum price and less about Ethereum's value.\n\nMy assumption about the price is inferred from the question:\"why does that mean someone should invest in it?\".\n\nThe \"network effect\" and the \"security brought by decentralization\" have been purposefully omitted in order to not overcomplicate a simple answer to a simple question and therefore not burden and frustrate Fuzzy with complexities that might've required further research on his part.\n\nIn my 2nd paragraph, I have emphasized that I'm unable to offer any financial advice by specifying that anyone can invest on Ethereum & he should either DYOR or consult his financial planner.\n\nIn my third paragraph, I aimed at satisfying Fuzzy's genuine curiosity by providing affirmative insights that could stimulate his discovery of the wonders offered by the Ethereum ecosystem.\n\nI still thank you for bringing the \"network effects\" and \"security brought by decentralization\" topics to my answer, and I welcome you to further elucidate these for Fuzzy if he's interested in additional clarifications 🙂",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9swq5x",
                                            "author": "shostakofiev",
                                            "score": 3,
                                            "created_utc": 1653397692.0,
                                            "response": "\"law of supply and demand\" and do your own research are generic responses that apply to all assets and don't do anything to help OP.  It's like my dad asking me if I knew why, when birds fly in a V-shape, one side is always longer than the other.  \"Because it's got more birds on that side,\" he would teach me.\n\nA lot of people think crypto is only worth something only because other people think it's worth something, aka the greater fool theory.  Your answer only perpetuates that.\n\nIf I'm new to crypto and asked that question, and saw that yours was the highest voted response, I'd walk away think, \"yup, it's all a scam, just as I thought.\"",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9t2e7s",
                                                    "author": "pwrusr-com",
                                                    "score": 1,
                                                    "created_utc": 1653400457.0,
                                                    "response": "Everyone can understand \"law of supply and demand\", where price is determined by scarcity (or not) of an asset and this is still true for crypto.\n\nIf I *only* said supply & demand then you would have had a point. Since I also said \"internal & external factors\" (without entering into too much detail), you don't have a point.\n\nDYOR is \"the\" most important factor when you'd like to determine whether to invest in a crypto asset or not.\nGiven I'm not a financial advisor, there's no way I could've told OP whether to invest in it or not.\n\nThanks to you, he might now wish to know more about network effect, security & decentralisation so it's all good because you came in and saved the day for the world of crypto 😀\n\nI ultimately think this might still be the best answer because it starts simple and it turns advanced (if you subtract the egos in play) so thank you for your contribution and feedback!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9tm41e",
                                                            "author": "shostakofiev",
                                                            "score": 1,
                                                            "created_utc": 1653408874.0,
                                                            "response": "\"internal and external factors\" is also true for everything.\n\n\"The price of ___ is determined by supply and demand as well as internal and external factors.\"\n\nThis is true for literally everything that can be bought and sold. It looks like an answer but answers nothing.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9rzc4q",
                            "author": "Fuzzy_Ad4484",
                            "score": -6,
                            "created_utc": 1653371932.0,
                            "response": "They don’t have to build a network to the extent of ether  just simply fork the protocols they need.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9s7eg5",
                                    "author": "ianazch",
                                    "score": 10,
                                    "created_utc": 1653378756.0,
                                    "response": "and get same amount of validators to build up the same security + gain trust and adoption of millions of people",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9sd52u",
                                    "author": "yogofubi",
                                    "score": 8,
                                    "created_utc": 1653384129.0,
                                    "response": "They can make a copy, anybody can make a copy. And if a company, for whatever reason wanted their own version of everything, they can fork it and run it themselves like you say, but permissioned, like an intranet.\n\nBut by running it themselves they forego all the security that comes with decentralisation. And if that's not important to a company, they may as well just run a regular database, no need for Blockchain.\n\nWhat makes Ethereum special is that it is fully decentralised and secure, permissionless.\n\nWhat gives it value is supply and demand dynamics, its value is based on how much benefit it brings people who own and use Ether.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9t6wiy",
                                            "author": "Daikataro",
                                            "score": 1,
                                            "created_utc": 1653402485.0,
                                            "response": ">They can make a copy, anybody can make a copy.\n\nA couple hundred shitcoins do it every day...",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9t86w7",
                                                    "author": "yogofubi",
                                                    "score": 2,
                                                    "created_utc": 1653403045.0,
                                                    "response": "Hahaha very true",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9s05wt",
                                    "author": "pwrusr-com",
                                    "score": 13,
                                    "created_utc": 1653372570.0,
                                    "response": "Sure - anyone can do that provided the knowledge - There are even companies that offer you a pre-made \"white label\" Ethereum blockchain fork which you can buy for a couple of grands, slap your own label into it and market it however you please.\n\nIf all you need is your own Ethereum blockchain fork to do however you please, you're welcome to do it.\n\nWhat is difficult or different between your own fork and Ethereum is:\n\n1. The ecosystem (thousands of validators, thounsand of dApps, thousands of miners, etc.).\n\n2. \"how much\" the free market values the Ethereum token.\n\nThis is not to discourage you to make your own fork - if you are interested, you can do it👍",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9sdhne",
                                    "author": "calebb19",
                                    "score": 2,
                                    "created_utc": 1653384452.0,
                                    "response": "your thesis literally just played out this last cycle we had 10 plus EVM alt L1s pop up all with the same forked Defi protocols from ETH. ETH still king",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9sybfl",
                                    "author": "iiJokerzace",
                                    "score": 1,
                                    "created_utc": 1653398494.0,
                                    "response": "You can just copy/paste open source, that is true.\n\nWhen you understand how these networks work, you will see that for the security of any of these networks to be strong, you need a lot of unique participation from different users helping protect the network.\n\nIf a company makes a clone of a network and run it themselves, they most likely will have full control over the network and much less secure network in comparison to Ethereum. \n\nCentralized networks have also been here years before Bitcoin was born.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9t9hmw",
                                    "author": "Sterlingz",
                                    "score": 1,
                                    "created_utc": 1653403604.0,
                                    "response": "This argument has been made for Bitcoin as well. \n\nNo need to theorize - it's been tried about 100,000 times, without no success at all, aside from things like Dogecoin and Monero.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9ueaji",
                                    "author": "Perleflamme",
                                    "score": 1,
                                    "created_utc": 1653420544.0,
                                    "response": "A fork would need to provide the funds to secure the consensus, though. \n\nI hope it happens well and that they ensure it stays decentralized. Competition would do good to the ecosystem.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9s0ug8",
                    "author": "edmundedgar",
                    "score": 8,
                    "created_utc": 1653373129.0,
                    "response": "ETH are valuable because they give you part of the revenue stream from fees paid by people who want to use the Ethereum blockchain to register domains, trade pictures of monkeys, transfer money or whatever they want to do.\n\nThis revenue will be split between ETH holders who stake and ETH holders who don't, with ETH holders who stake getting a bigger share.\n\nPeople want to use the existing public chain for these things rather than a clone because the goal is to interact with other users, and other users are also using the existing chain. In the same way, it would be easy to make a copy of Facebook with the same features, but that wouldn't be as valuable as Facebook because it wouldn't have the users.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9swqrp",
                            "author": "BSchoolThrowaway192",
                            "score": 3,
                            "created_utc": 1653397700.0,
                            "response": "This is the only real answer in this entire thread.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9saue9",
                    "author": "epiGR",
                    "score": 3,
                    "created_utc": 1653381978.0,
                    "response": "My salary.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s7tdp",
                    "author": "omniumoptimus",
                    "score": 6,
                    "created_utc": 1653379141.0,
                    "response": "Blockchains are part technology, part economics, and part community. Together, these form an ecosystem. \n\nI’m a developer who builds on the ethereum network. I need eth to upload the programs I build, and users need eth to run my programs. That’s the fundamental reason why eth has some kind of value. \n\nUsers using my programs need to have their transactions validated. The people who validate these transactions are paid using eth and nothing else. That’s an additional layer of value on top of the fundamental value. \n\nWhy can’t you just fork ethereum and make ether lose all its value? Many reasons. Firstly, all the smart people in blockchain are developing on ethereum and polygon. All of them. Secondly, ethereum is constantly being upgraded, so if you forked it, you’d have the problem of upgrading your fork with equally good upgrades. Thirdly, good engineering involves a lot of innovation, and good engineers hate having their stuff stolen, especially without credit. So if you forked ethereum and copied every upgrade, you’d get a lot of good engineers so pissed at you that your community would disband and your ecosystem would collapse.\n\nHope that helps explain things.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sdceb",
                    "author": "calebb19",
                    "score": 2,
                    "created_utc": 1653384317.0,
                    "response": "It’s like being an expert in anything. Most alt L1s were founded by old ETH devs. Most alt L1s are EVM and they usually completely rely on Eth foundation for upgrades/guidance. ETH foundation are the experts in smart contracts space no way around it. Solana is one of few that has had a somewhat successful non EVM chain. It’s hard to get the distribution BTC and ETH have now and a truly decentralized state machine that can handle the worlds data requirements is extremely hard. Most likely 10 years away still at this point. Ppl still coming to realization that not everything needs to be on chain. But people also underestimate how valuable a creditably neutral network is worth. So you are asking the right question. Much of the “usecases” you see for crypto are just marketing fluff using blockchain as a buzzword. Doesn’t change ETHs value",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sjgy3",
                    "author": "optionburns",
                    "score": 2,
                    "created_utc": 1653389543.0,
                    "response": "Look at it this way.\n\nPaper currency is just fancy paper with numbers, you can fork that too by making up your own currency. But will the financial ecosystem support your currency? Will banks hold your notes? Use them to exchange with other entities? That’s the same reason why ETH has value while your own fork might struggle to have any.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9szu1n",
                    "author": "AllwaysBuyCheap",
                    "score": 2,
                    "created_utc": 1653399234.0,
                    "response": "Three things:\n   \n- Is the asset that secures the network (when the        merge happens)\n- It is the asset that has to be used when paying fees.\n- It is the native asset on the smart contract, so when sending a transaction the msg.value is eth. This might change in the rollups like zksync.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s7or6",
                    "author": "iwakan",
                    "score": 1,
                    "created_utc": 1653379021.0,
                    "response": ">Why can’t a company that wants to use these features just fork ether and do everything in house? \n\nThe value of a blockchain comes precisely from the fact that it is public and well-connected. If they fork it into a chain that only they use, they make it worthless because there would be no benefits compared to a normal database.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tnba1",
                            "author": "Fuzzy_Ad4484",
                            "score": 1,
                            "created_utc": 1653409361.0,
                            "response": "So your saying the entire point of blockchain is to be able to share information to the masses? I thought it was a more efficient way of sharing information and can be applied anywhere.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9u5g65",
                                    "author": "iwakan",
                                    "score": 1,
                                    "created_utc": 1653416817.0,
                                    "response": "The point is being able to exchange information in a secure but trustless and decentralized way. The more people use the blockchain, the more people you are able to exchange information with, hence the more useful it is. And if only one company essentially controls the blockchain then it isn't even decentralized or trustless to begin with so it would be pointless no matter how many people use it.\n\nIt doesn't make sense to apply it everywhere because it is certainly not particularly efficient. You pay with inefficiency for the trustlessness.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9s8g0s",
                    "author": "nutboltUK1",
                    "score": 1,
                    "created_utc": 1653379710.0,
                    "response": "Because Eth is the power socket that everything else plugs into. Just like your power co charges for your electric, so does Eth. Too big to fail?  We shall see very soon if it holds value.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s8um8",
                    "author": "xGsGt",
                    "score": 1,
                    "created_utc": 1653380093.0,
                    "response": "ether is needed to pay for gas for any computational power, if you decide to fork it then the next thing comes to mind, descentralization, if you dont need descentralization then just grab a postgresql or a mssql database and be on your way.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9schlt",
                    "author": "monkeyhold99",
                    "score": 1,
                    "created_utc": 1653383522.0,
                    "response": "Utility of DeFi",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9skigv",
                    "author": "LiabilityFree",
                    "score": 1,
                    "created_utc": 1653390311.0,
                    "response": "Think of ETH like oil, or gas but for the internet. It trades like any commodity, based off supply and demand.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tni3f",
                            "author": "Fuzzy_Ad4484",
                            "score": 1,
                            "created_utc": 1653409438.0,
                            "response": "So ytd demand for eth is down?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9spxqo",
                    "author": "PinkPuppyBall",
                    "score": 1,
                    "created_utc": 1653393894.0,
                    "response": "Ethereum the network is the value.\n\nThe code and the dapps are not valuable without the network. Ethereum is a source of truth. A big database where nobody can cheat basically.\n\nIt cannot be forked, because if you fork it you remove the the truth that comes with the network, you make it possible to cheat again. \n\nEther is valuable because it poweres the network.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9stii7",
                    "author": "dynamicallysteadfast",
                    "score": 1,
                    "created_utc": 1653395981.0,
                    "response": "Security.\n\nDecentralisation.\n\nNetwork effect.\n\nPermanence (often referred to as immutability or irreversibility).\n\nEffort. (Why spend so much time and money making a poor replica of what already exists)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sv7du",
                    "author": "Reddit5678912",
                    "score": 1,
                    "created_utc": 1653396900.0,
                    "response": "There is no use case in any cryoto other then obscure niche use cases like money transfers. Pretty much no common people use it regularly. Crypto gets its main value via Ponzi scheme. You buy it to sell. It relies on more people than the last to get any value out of it. Eventually there’s a tip and things crash. Hence the ridiculous volatility in crypto. Hence again the market crash 69k -> 29k of btc. It’s a valuable pyramid scheme because no one owns it and it’s tech is immutable. It’s the ultimate Ponzi",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sxzph",
                    "author": "TomOkihara",
                    "score": 1,
                    "created_utc": 1653398337.0,
                    "response": "If a hypothetical company would be forking ethereum to even do anything that shows the inherent value of ETH.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9szc7p",
                    "author": "mongoloided_mango",
                    "score": 1,
                    "created_utc": 1653398990.0,
                    "response": "failed projects and projects give eth value.  also trading crypto kitten and the NFTs",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t2fm2",
                    "author": "PrestigiousAd5646",
                    "score": 1,
                    "created_utc": 1653400475.0,
                    "response": "Important to note the amount of money (and subsequent fees) the network hosts. That’s a huge piece of what is going to give it value to mainstream investors.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t5dio",
                    "author": "5boros",
                    "score": 1,
                    "created_utc": 1653401821.0,
                    "response": "The only factual response to this question is that all value is subjective. There are some that think there is no value, there are some that may list dozens of reasons. There could be approx. 8 billion different responses to this question, all of them correct.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t6dx1",
                    "author": "datawarrior123",
                    "score": 1,
                    "created_utc": 1653402260.0,
                    "response": "Its an extremely expensive system to perform transactions, it has some nice use-cases but overall valuation is because of speculation, otherwise it would not have tied to bitcoin, anybody can fork it but the forked token might not be as valuable as ethereum, because speculation needs some hopium to inflate the price, e.g dogecoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t7c0e",
                    "author": "Sorry_Attitude_",
                    "score": 1,
                    "created_utc": 1653402670.0,
                    "response": "Ethereum is a mix of reasons, first there is a lot of demand since you need to use it to get anything on the chain, want to mint an nft? Gotta use Ethereum, wanna transfer something? Ethereum\n\nSecond, supply is slowly increasing, slower than demand so price will still go up, they wanna make it deflationary but that is not the best thing in my opinion\n\nThird, people wanna build on Ethereum, even if it is more expensive and wanna use it's \"global computing\" power, they wanna make dApps, apps, games using it to keep it in line with a standard\n\nAnd the last one honestly at this point a lot of people use Ethereum to fund shit, Like ICO, IDO's, and fundraising platforms example Angelblock which is launching their nft collection to fund themselves, through, guess what, Ethereum\n\nSo it is basically Supply and Demand then branching",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t7zlh",
                    "author": "degrudv",
                    "score": 1,
                    "created_utc": 1653402957.0,
                    "response": "Look up Metcalfe's law of network effects. That's how Facebook, Instagram, etc. are valued.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tfpkt",
                    "author": "olihowells",
                    "score": 1,
                    "created_utc": 1653406226.0,
                    "response": "When ETH moves to POS the value will come from the gas fees you’ll receive for staking your ETH. A bit like the dividends you receive for holding a stock. \nThere are some other reason ETH have value right now, but until we move to POS, I’m not sure these other reasons can justify a $200 billion valuation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tfrp8",
                    "author": "wind_dude",
                    "score": 1,
                    "created_utc": 1653406250.0,
                    "response": "Well if you fork ether, you still have to build up a network to secure it. If it's centralised around 1 party, you just have a really inefficient database, all of the downside, none of the upside of a distributed, immutable ledger.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9txxy8",
                    "author": "ajnsd619",
                    "score": 1,
                    "created_utc": 1653413700.0,
                    "response": "Composability distinguishes Ethereum from Bitcoin. In simple terms, Ethereum is a combined:\n\n➥Network\n\n➥Platform\n\n➥Marketplace\n\nFor builders & creators. And that's not limited to artists & tech engineers. ENS is developing into a Web 3 portal and will platform small business. \n\nEthereum is user agnostic and maintains a strong focus on utility. Building a widely-used ecosystem of decentalized dapps, & smart contracts, and other digital utilities raises demand for space on the Ethereum blockchain. And no other chain compares in this regard. Ethereum holds an 87% share of all blockchain revenue. \n\nBy necessity, this makes Ether, its native currency, increasingly valuable over time. \n\nEthereum is crypto's most successful project because it focuses on building digital products and service. Over time, users will migrate to chains that do more. Popular adoption can't be sustained without utility. \n\nLong term, projects that don't offer extensive utility & modular design, cannot survive in an environment crowded with projects that do. \n\nThe future belongs to abundance-based currency models. And Ethereum is the standard bearer.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u9prh",
                    "author": "dracolnyte",
                    "score": 1,
                    "created_utc": 1653418617.0,
                    "response": "blockchain is a ledger. Banks have their own, more efficient ledgers in-house that are easier and cheaper to maintain while making payments fast and secure. no need for slow and inefficient decentralized ledgers, plus where is the privacy in that?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9up9aj",
                    "author": "RylNightGuard",
                    "score": 1,
                    "created_utc": 1653425164.0,
                    "response": ">I have heard a lot of people say that crypto like ether has value because of things like smart contracts and proof of stake\n\nether has value because people want it. People want ether for basically two reasons:\n\n1. they want to use it to interact with ethereum smart contracts, either now or in the future\n2. they want to speculate on it\n\n>what’s stoping a bank from using blockchain tech in-house that lets you make payments faster and more efficient ... I know it wouldn’t be decentralized but let’s be honest the average person doesn’t care about decentralization they want to be able to make payments fast and secure and banks want to be able to process them efficiently\n\nyou are misunderstanding something. The features that come with the decentralization such as censorship resistance, trustlessness, and pseudoanonymity are the ONLY benefit of blockchain technology. Blockchain by nature is actually extremely slow, inefficient, and difficult to develop compared to centralized commercial software\n\nmost people do not care at all about decentralization, but many do. And even more care about expensive and outdated service from the financial sector monopolies, and about reckless financial policies and inflation in fiat currency",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uz34i",
                    "author": "Friendly-Map-4707",
                    "score": 1,
                    "created_utc": 1653429423.0,
                    "response": "What is giving any currency value? (No currency is tied to a commodity anymore ex. Gold, silver...)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uzmnh",
                            "author": "Fuzzy_Ad4484",
                            "score": 1,
                            "created_utc": 1653429657.0,
                            "response": "Gold has no value… so eve if the dollar was still on the gold standard that would be meaningless.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9uzs3u",
                            "author": "Fuzzy_Ad4484",
                            "score": 1,
                            "created_utc": 1653429721.0,
                            "response": "Also I don’t invest in currency’s, I want to understand if ether is more then just a hyped currency and has actual enterprise value.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9sjhln",
                    "author": "BradleyX",
                    "score": -3,
                    "created_utc": 1653389558.0,
                    "response": "The answer is NOTHING. It’s just a market driven by the buyer hoping the next person will pay more. THAT’S IT.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s88uf",
                    "author": "nottoowhacky",
                    "score": -1,
                    "created_utc": 1653379524.0,
                    "response": "No intrinsic value",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s8h0w",
                    "author": "VRoid",
                    "score": -1,
                    "created_utc": 1653379735.0,
                    "response": "Surely to make issuers  and validators of  ether richer with gas fee.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9spnhg",
                    "author": "Mallardshead",
                    "score": -1,
                    "created_utc": 1653393722.0,
                    "response": "ETH is a scam. It's an orgy of swaps, wraps, burns, mints, and stakes run by dapps that do nothing but optimize token interactions to keep the orgy going. Nothing in the protocol has established itself as money, except for stablecoins, and this is why 85% of the network's volume is from stablecoins. This is an example of *Gresham's Law* at work. ETH is simply an overpriced gas token used to ferry this money and other centralized junk around. \n\nThere is bitcoin, then there is crypto. If you have any deeper concerns about crypto, PM me. Glad to answer any questions. If you're a newb (regardless of age) or live in a place where BTC has big value versus your fiat, I'll gladly send you $5 in BTC. \n\nWalk away from crypto before regulation and the s-curve adoption shakeout.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tw0dg",
                            "author": "manxkarst",
                            "score": 2,
                            "created_utc": 1653412905.0,
                            "response": "How do you know? You know nothing. There wasn’t anything I read from your comment that explains the computational complexity of ETH",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9txhm8",
                                    "author": "Mallardshead",
                                    "score": 0,
                                    "created_utc": 1653413513.0,
                                    "response": "Why would you want complexity? *Simplicity is a fundamental security practice*. Every developer worth a damn knows this and knows when something gets too complex, it's built wrong. Bitcoin is like fire, the wheel, compass, or pasteurization. Stupidly simple, infinitely important. ETH is a shit sandwich that's so complex even hard wallets get confused with the bridges, layers, side-chains...\n\nStop shitcoining. Stop thinking you're smarter than you are. Dunning-Kruger. Learn.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9svu1b",
                    "author": "BlankEris",
                    "score": -1,
                    "created_utc": 1653397232.0,
                    "response": "Hopium that there will be a use case some day",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwjxok",
            "title": "Multisig overview for sidechains",
            "url": "https://www.reddit.com/r/ethereum/comments/uwjxok/multisig_overview_for_sidechains/",
            "author": "aemmeroli",
            "created_utc": 1653371596.0,
            "score": 4,
            "num_comments": 6,
            "subreddit": "ethereum",
            "selftext": "I just now learned that sidechains like polygon have multisig accounts to change the smart contracts. I had no idea this was a thing and am honestly a little insecure to have my funds on polygon now. They write that there are plans to move trust to a DAO if the contract is \"battle tested\" but who knows what that could mean.\n\n**What is the easiest way to find out if a project has multisig accounts that can alter the smart contract?** I'd like to know if other solutions like arbitrum have a similar current architecture or if there are solutions where no small group of people has that much power.\n\nI'm aware that this is for security reasons in case there is a bug. To me the fact that only 5 people have that much power is the bigger security risk though.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9sigaj",
                    "author": "edmundedgar",
                    "score": 2,
                    "created_utc": 1653388751.0,
                    "response": "For L2 systems like Arbitrum the best place to look is l2beat, they have an excellent \"risks\" section. \nhttps://l2beat.com/projects/arbitrum/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sdbjf",
                    "author": "banaanigasuki",
                    "score": 1,
                    "created_utc": 1653384296.0,
                    "response": "It should be available on the docshttps://docs.polygon.technology/docs/faq/commit-chain-multisigs/",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9shim2",
                            "author": "aemmeroli",
                            "score": 1,
                            "created_utc": 1653387992.0,
                            "response": ">\t*To be moved to governance. Exploring Aave's governance contracts and Compound’s time lock contracts\n\nThey make it sound like it's not a pressing issue",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}