{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqh2np",
            "title": "How much ETH in gas fees to move USDC?",
            "url": "https://www.reddit.com/r/ethereum/comments/uqh2np/how_much_eth_in_gas_fees_to_move_usdc/",
            "author": "zanoo911",
            "created_utc": 1652653197.0,
            "score": 24,
            "num_comments": 50,
            "subreddit": "ethereum",
            "selftext": "\nIf I have $1000, $10,000 or $50,000 in USDC in an offline wallet, how much ETH do I need to move any of these amount to an exchange? And then how much extra ETH do I need to convert USDC into fiat? I am looking to see what the total cost will be along the entire journey from offline wallet -> exchange -> bank acccount.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8r2mx9",
                    "author": "mooremo",
                    "score": 18,
                    "created_utc": 1652655067.0,
                    "response": "Right at this moment it would cost you about $3, but that will fluctuate with network activity. Check as Gas Tracker for an estimate: [https://etherscan.io/gastracker](https://etherscan.io/gastracker)  \n\n\nThe amount of USDC that you transfer doesn't matter. Same cost to move 1 USDC  as 1,000,000 USDC.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8r5ehw",
                            "author": "zanoo911",
                            "score": -4,
                            "created_utc": 1652656414.0,
                            "response": "Thanks, right now I see the figures $0.80 and $0.85 depending whether it's low or high, I don't see the $3? I also don't see the option to pick USDC, I only see the  ERC20: Transfer section and it says $2.49\t$2.49\t$2.63 for low avg or high is that where you got the $3 from? It is so low at $3, does it become $30 some other times. Now is the weekend, so is that why it's low?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8r6ax5",
                                    "author": "mooremo",
                                    "score": 5,
                                    "created_utc": 1652656853.0,
                                    "response": "USDC is an ERC-20 token so it'll be about that amount. Same for any other ERC -20 token.\n\nIt's low because network demand is low. If lots of people are trying to use it at the same time, price goes up. Fewer people, price goes down.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8r7ise",
                                            "author": "zanoo911",
                                            "score": 1,
                                            "created_utc": 1652657450.0,
                                            "response": "So now would be a low time? Because it's the weekend? Is it based on timezone or how do I know the absolute cheapest time to send the transaction for the lowest gas prices? Right now seems good, will it be this low throughout the week, or in the middle of the night? Does it go by the local time zone?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8rb48t",
                                                    "author": "mooremo",
                                                    "score": 5,
                                                    "created_utc": 1652659241.0,
                                                    "response": "It's global. Demand is low, when demand is low. It's typically lower at night US time, but that's not a given.\n\nIt is really really low right now. You're unlikely to do much better than this.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8r834m",
                                                    "author": "IamAFlaw",
                                                    "score": 9,
                                                    "created_utc": 1652657730.0,
                                                    "response": "Just look at the gas fees dude. You will know if the network is busy and how much it costs. It is random. Some weekends its busy others its slow. Just look up the gas fees!",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8suaig",
                                                    "author": "Loose_Screw_",
                                                    "score": 2,
                                                    "created_utc": 1652693873.0,
                                                    "response": "This is what you're looking for https://ethereumprice.org/gas/",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8svitc",
                                    "author": "go4gonzo",
                                    "score": 5,
                                    "created_utc": 1652694981.0,
                                    "response": "This person is trying to help you out and you're nitpicking $3?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8r608i",
                    "author": "MirageInc",
                    "score": 15,
                    "created_utc": 1652656713.0,
                    "response": "These posts are killing my brain cells 🤦‍♂️",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rcc76",
                            "author": "Brawlstar-Terminator",
                            "score": 10,
                            "created_utc": 1652659850.0,
                            "response": "I swear to God people have thousands of dollars in Eth and absolutely zero clue how the network works. I’m appalled at how people throw money at something they have zero understanding of. Basically explains why NFT’s are popping off",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8t1zdt",
                                    "author": "stu17",
                                    "score": 5,
                                    "created_utc": 1652700007.0,
                                    "response": "At least us NFT people use the network regularly. A vast majority of crypto “investors” never even move their assets off an exchange.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8ta6al",
                                    "author": "anonOmattie",
                                    "score": 1,
                                    "created_utc": 1652704987.0,
                                    "response": "thats one of the flaws about blockchain in general IMO. as long as people are posting these questions crypto isn't ready for mass adoption yet...",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8qzm8d",
                    "author": "th3band1t",
                    "score": 4,
                    "created_utc": 1652653635.0,
                    "response": "Look at current gas fees.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qzozf",
                    "author": "Mr-Wedge01",
                    "score": 10,
                    "created_utc": 1652653670.0,
                    "response": "It will depends on the netwrok gas. If the network is congested, more gas (more higher fees will be) u will pay. In the etherscan website, you have a tracker, so u can check more/less how much u will pay on fees. https://etherscan.io/gastracker",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8r0z2d",
                            "author": "zanoo911",
                            "score": -2,
                            "created_utc": 1652654268.0,
                            "response": "Thank you but how do I use that site to figure out the total gas for a $50,000 USDC transaction, for example?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8r5ykp",
                                    "author": "-spooky_ghost",
                                    "score": 24,
                                    "created_utc": 1652656691.0,
                                    "response": "Go on ether scan, look at the gas section and look at how much it costs to send an erc20 transaction and that's how much it'll cost. The amount you sending doesn't matter it will cost you the same to send $0.2 as it will to send $1,000,000",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8r6f5p",
                                            "author": "zanoo911",
                                            "score": 1,
                                            "created_utc": 1652656909.0,
                                            "response": "thanks",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8r142q",
                                    "author": "Mr-Wedge01",
                                    "score": 2,
                                    "created_utc": 1652654334.0,
                                    "response": "When u are doing the transaction, eg, in the metamask, you can see more/less you will pay.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8rejfi",
                                    "author": "Chyeadeed",
                                    "score": 1,
                                    "created_utc": 1652660938.0,
                                    "response": "It's like single digits",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8rpgj4",
                                    "author": "AppleBus",
                                    "score": 1,
                                    "created_utc": 1652665979.0,
                                    "response": "1$ or 50,000$ is the same gas fee",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8sz6h3",
                                    "author": "sdmikecfc",
                                    "score": 1,
                                    "created_utc": 1652697993.0,
                                    "response": "Some education for you.\n\nTokens actually don't move to your wallet or exchange, they are always on the blockchain. When you move tokens it sends a transaction to the blockchain to change the ownership of the tokens from the initial wallet to the new wallet.\n\nAs this is just a transaction to change the owner, it doesn't matter how much you move. 1USDC or a billion USDC would be the same price.\n\nWhen you send ETH, it sends the tx straight to the blockchain, when you send a token (like USDC) you are sending a tx to the smart contract which then goes to the chain. The extra step of a smart contract makes the tx more expensive.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8r0m37",
                    "author": "fenixxishot",
                    "score": 3,
                    "created_utc": 1652654099.0,
                    "response": "The amount of USDC you have doesn’t impact gas prices. Usually it’s <$50 worth of eth to just do wallet to exchange transfers. It’s also cheaper to do it on the weekends (usually).",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8r4pa4",
                            "author": "zanoo911",
                            "score": 1,
                            "created_utc": 1652656069.0,
                            "response": "I see so it will cost roughly $30-50 in ETH to move ANY amount of USDC to the exchange so it's best to do a large amount rather than a few smaller amounts back to back?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8rcigl",
                                    "author": "LKDC",
                                    "score": 3,
                                    "created_utc": 1652659934.0,
                                    "response": "Yes, because costs do not depend on quantity one big transaction will save you significant amounts over smaller transactions.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8renrq",
                                    "author": "Heatho14",
                                    "score": 1,
                                    "created_utc": 1652660998.0,
                                    "response": "Your best bet for spending the least in gas is sending one large transaction from your wallet to the exchange.  From there the exchange if it's a cex will usually charge small fees for swapping or selling but won't charge gas.  If it's a dex I don't think you'll be able to change to fiat.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8vkvmy",
                                    "author": "Terror3y3z",
                                    "score": 1,
                                    "created_utc": 1652739860.0,
                                    "response": "Yes, but the other big thing to remember is when moving large amounts and the complexity of keys. Send a small test transaction. If you are talking about moving tens of thousands or more and you send it to the wrong address. Say byebye to that money.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8rtq1v",
                    "author": "Maleficent_Essay_744",
                    "score": -1,
                    "created_utc": 1652667947.0,
                    "response": "I just moved a few thousand from gemini to coinbase pro and i believe the fees are minimal to exchange to usd",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8s7rg8",
                    "author": "gabrielash1",
                    "score": 1,
                    "created_utc": 1652675852.0,
                    "response": "Check to see how much gas the transaction requires (but don’t sign it), by clicking a button that initiates the transfer transaction. Usually metamask, or the wallet you use will showcase some sort of gas data that needs to be signed. Once you know how many gas units the transaction has, just multiply that times the gas cost on those ETH gas monitoring sites and you’ll know how much ETH you need for the transactions. Then just multiply that times the ETH value in dollar to see the total amount. USDC into fiat is a liquidity pair offered by many crypto exchanges, so you can look for it on trading view by typing USDC/USD.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sa3sd",
                    "author": "Noob313373",
                    "score": 1,
                    "created_utc": 1652677329.0,
                    "response": "\"Eth gas fee scanner\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tjvfo",
                    "author": "-Aporia",
                    "score": 1,
                    "created_utc": 1652709782.0,
                    "response": "You're going to be paying an arm and a leg in gas fees if you're trying to do that. I HIGHLY recommend you use Polygon to bridge (or any other scaling solution for that matter). Unless you can afford to pay Ethereum gas fees then all the power to you I suppose.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8r11kw",
                    "author": "lofigamer2",
                    "score": -10,
                    "created_utc": 1652654301.0,
                    "response": "can be like 250 usd worth of eth for 1 tx",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rd5hj",
                            "author": "domotheus",
                            "score": 5,
                            "created_utc": 1652660255.0,
                            "response": "or more like $2-$3 at current prices",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8rycqx",
                    "author": "dopef123",
                    "score": 0,
                    "created_utc": 1652670304.0,
                    "response": "Well it can vary dramatically. I just finally moved some tokens for $3 which was the cheapest I've seen gas in a significant amount of time.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}