{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxdxu1",
            "title": "Share some Policy and law in different regions from f2pool 🐟 weekly report",
            "url": "https://www.reddit.com/r/ethereum/comments/uxdxu1/share_some_policy_and_law_in_different_regions/",
            "author": "Xinqiu-",
            "created_utc": 1653472700.0,
            "score": 2,
            "num_comments": 2,
            "subreddit": "ethereum",
            "selftext": "Hi, just read the weekly [report](https://twitter.com/f2pool_official/status/1529011114625105927/photo/1) from f2pool, want to share some informations here. BTW I am newbie here also! 🙌🏻\n\n>**In US**  \n**NY Bitcoin miners start to give up on state amid regulatory uncertainty**\n\nNew York’s Bitcoin mining companies are increasingly considering **abandoning** their aspirations in what was once a promised land as the **state’s legislature considers a bill to ban new mining projects that use carbon-based energy sources pending** a review of the industry's **environmental impact**.\n\nThe New York state Senate is looking at a bill calling for **a two-year moratorium** on new crypto mining projects that use gas, coal or other nonrenewable energy sources, after the Assembly version of the bill passed the state’s lower house last month.\n\nThe bill, which passed to the state Senate in late April, calls for a moratorium on proof-of-work mining powered by nonrenewable sources, the type used in the Bitcoin network, in the state while its environmental impact is assessed.\n\nMost crypto mining companies are staying away from the state because of authorities’ seemingly negative stance toward the industry.\n\n&#x200B;\n\n>**In Europe**  \n**Portugal considering capital gains tax for cryptocurrency**\n\nThe minister of finance, Fernando Medina, confirmed during a working session that **crypto assets will be subject to taxation in the near future.** The Portuguese tax authorities are currently looking at cases in other countries to inform recommendations for regulation.\n\n**At present, Portugal doesn’t view cryptocurrencies as an asset and they are instead treated as a currency**, meaning that while **businesses that provide cryptocurrency services are taxed, individuals investing in them are not**.\n\nFollowing Medina’s comments, the secretary of state for fiscal issues Mendonça Mendes also floated the idea of **subjecting cryptocurrencies to VAT and Stamp Tax**.\n\nThe government has not yet announced any specific dates for the introduction of new regulations.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9x0t9f",
                    "author": "Xinqiu-",
                    "score": 1,
                    "created_utc": 1653472742.0,
                    "response": "full report from them is [here](https://twitter.com/f2pool_official/status/1529011114625105927/photo/1) 🤖",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}