{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us6kub",
            "title": "Marijuana and the Metaverse: How LA Cannabis Startups Are Lighting Up the Virtual Realm. I wonder if LSD and other drugs will be available for purchase in the metaverse too? LOL.",
            "url": "https://dot.la/marijuana-and-the-metaverse-2657333464.html?utm_campaign=post-teaser&utm_content=k6vwzxoj",
            "author": "EleonorTrimpe",
            "created_utc": 1652855470.0,
            "score": 35,
            "num_comments": 12,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i92k6ee",
                    "author": "rorykoehler",
                    "score": 8,
                    "created_utc": 1652880345.0,
                    "response": "This timeline is so stupid",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i954f7s",
                    "author": "Perleflamme",
                    "score": 3,
                    "created_utc": 1652919459.0,
                    "response": "You'd first need a way to purchase decentralized physical delivery. We're clearly not there, yet. \n\nAnd then, you'd also need to purchase decentralized product expertise. For you don't want to use what's not what you think it is. Some people end up in the hospital due to this.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95hm30",
                            "author": "Dry-Hurry-7598",
                            "score": 1,
                            "created_utc": 1652925610.0,
                            "response": "This shit is so dumb, you can do decentralised delivery it’s just self employed gig workers, but decentralised kyc is basically impossible cause you don’t want some weird people knowing sensitive information like peoples houses, and yes how do you quality check drugs without centralisation 😂\n\nI swear we don’t need everything decentralised you need some parts centralised, unless they’re just using some type of crypto for payments in a unity metaverse of some shit",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95iz12",
                                    "author": "Perleflamme",
                                    "score": 1,
                                    "created_utc": 1652926248.0,
                                    "response": "Decentralized delivery is a bit tricky, actually, but yes, indeed. For instance, you'd need some decentralized court to handle conflicts (already existing, but implementing ways to connect it all would be a big project in itself). And then, you'd need to be able to compute and provide proofs of several activities, like some proof of travel and such, most probably with GPS, but you'd need some back up in case GPS is out).\n\nAnd with conflicts, you'd need decentralized identities so that people can review each others with undefined criteria (like the app proposes a few keywords but you can add some others and such, so that you can review what you consider relevant).",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i95j7r9",
                                            "author": "Dry-Hurry-7598",
                                            "score": 1,
                                            "created_utc": 1652926367.0,
                                            "response": "Honestly seems like it would be a headache for all users",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i95jkpm",
                                                    "author": "Perleflamme",
                                                    "score": 1,
                                                    "created_utc": 1652926540.0,
                                                    "response": "It's mostly a headache of technicalities for people who build it. There's no reason it'd be different in UX for users.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "us6gc4",
            "title": "Assessing solid projects for a better ecosystem and lesser pain",
            "url": "https://www.reddit.com/r/ethereum/comments/us6gc4/assessing_solid_projects_for_a_better_ecosystem/",
            "author": "Perleflamme",
            "created_utc": 1652854949.0,
            "score": 5,
            "num_comments": 11,
            "subreddit": "ethereum",
            "selftext": "\nThis is more generic than Ethereum (I guess it would get censored in cc, anyway), but it's relevant to many frustration points I regularly see in here, notably recently, and that are experienced in the Ethereum ecosystem from time to time. Most of all, it's frustration regarding speculative assets, \"failed\" market decisions, centralized projects, scams and many Ethereum-based projects that are funded through dubious tokenomics or community hype donations and such. \n\nAs a community, most of us aren't professionals, either regarding the tech or regarding project funding in general. As such, it's hard to know whether a project is serious or not, worthy or not, promising or not, part of the infrastructure or a whim that will pass. \n\nAs a community, it's important that we're able to grow as much as possible to prevent ourselves from repeating the same mistakes over and over. And even better, learning without having to experience first hand these mistakes, to avoid winters, to prevent shut downs, to alleviate risks and pains. \n\nWithout that, building infrastructure will cost a lot more to all individuals than it's actually needed if we had better overall knowledge, a big cost be it in funds or in time. \n\nBut there is fortunaly well documented academic research about the different bias and risks that are most commonly forgotten or ill-assessed by market actors, due to lack of knowkedge. It's generic to investments, but a part of it can be specifically applied to project assessment and how realistic it is for a project to matter. \n\nHere they are in this paper, Taming the bias zoo, table 1 page 40 (I'm not copying the table as it's a pain to format in Reddit). \n\nSource (pay walled) : \nhttps://www.sciencedirect.com/science/article/pii/S0304405X21002567\n\nDirect PDF link from faculty: \nhttps://www.lse.ac.uk/finance/assets/documents/faculty-papers/Peng-BiasZoo-2021.pdf\n\nSo, yeah, several risks are matching very well what happens in crypto (I'll skip all the parts that are specific to investment, as it's not the topic; we're here to know whether a project is successful or not, not to know whether investing in it is profitable): \n\n* social and advisor influences; aka the argument of authority; be it professional influencers on YouTube or Twitter or billionaires or even politicians making claims and official announcements, there are many such influences that are always given way too much credit, to the point it's possible for them to perform pump & dump and possibly sink a project before it even started to get any serious business; that said, we're the ones providing the pump & dump, they're just giving the signal; so, let's give projects a chance and really invest if we're confident about it, not just because they might temporarily become hype-filled; \n\n* information; cognitive bias is ruthless as it impacts everyone and is very hard to detect, even for people who are aware of it; at best, you can alleviate the bias by knowing it and trying to actively avoid it; be skeptical, distinguish arguments from claims, in every opinions including your own, not much else can be done, here, sadly (at least at the best of my knowledge); \n\n* sensation seeking; now, that is a very easy trend to observe, as many people are attracted to tokens that have nearly no value, regardless of the credibility of their promises, sometimes even regardless of their promises themselves. \n\nThat last point may need more details (or rather, it's the one I find the most interesting). Beyond the obvious get-rich-quick scheme attractiveness, I sense some kind of desire to be, from the very start of a project, part of something that grows from nearly nothing to something really big. \n\nMaybe there's a hidden regret of having missed the beginnings of crypto and a desire to seek a similar feeling, the possibility to be part of a huge story, of history, even.\n\nBut there probably are many other reasons for people to be more attracted than economically reasonable to this sensation seeking in crypto.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9jwy3m",
                    "author": "HEX_helper",
                    "score": 2,
                    "created_utc": 1653219513.0,
                    "response": "You might like [Charlie Mungers talk on this](https://youtu.be/Jv7sLrON7QY)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}