{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ukt72u",
            "title": "Tried out the Arbitrum Layer 2 tonight.",
            "url": "https://www.reddit.com/r/ethereum/comments/ukt72u/tried_out_the_arbitrum_layer_2_tonight/",
            "author": "hardcoregamer84",
            "created_utc": 1651980683.0,
            "score": 121,
            "num_comments": 51,
            "subreddit": "ethereum",
            "selftext": "I basically only stake ETH using Lido built into Ledger Live.  During low gas times (around 20gwei) you can stake with Lido using Ledger live for about $6 - $8 in gas fees.\n\nThe research I have been doing says I need to move to an L2 as most of retail will only use those in the future.\n\nI decided to give it a try tonight.\n\nI transferred $100 to my Ledger Nano S+ and connected it to MetaMask.  I then went to Arbitrums site and deposited the $100 of ETH into the L2 using the bridge.  Gas was around $7 (22 Gwei) at the time.  So I ended up with $93.  \n\nThat was successful and I now show $93 of ETH on the Arbitrum network on my Ledger connected to MetaMask.\n\nI then went to Uniswap, connected my wallet to the Arbitrum network and swapped ETH for rETH.  The fee was only $0.65.  It would have been $24 if I had done it on the mainnet.  So 36x cheaper than the Ethereum mainnet.\n\nSo this may not have been the best test as I could have staked with Lido for roughly the same gas fees and it’s much easier using the ledger live interface, but I wanted to learn how to move to an layer 2.\n\nIt does get me very excited for the potential of the ethereum ecosystem when Layer 2s are the go to for retail investors and we don’t have to interact with the layer 1 directly anymore.\n\nIt’s obviously still early days and it’s needs to be a little easier before mass adoption happens, but I know that will come in time.\n\nI really like that I can still do it all using my Ledger and not have to give up on using a hardware wallet.\n\nThat’s my story for my fun filled Saturday night!",
            "stickied": false,
            "comments": [
                {
                    "id": "i7rglxg",
                    "author": "AESTHTK",
                    "score": 38,
                    "created_utc": 1651984908.0,
                    "response": "If you find an exchange that sends ETH directly to Optimism or Arbitrum you can avoid Layer 1 fees altogether.\n\nEdit: or http://layerswap.io",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7rj1lz",
                            "author": "hardcoregamer84",
                            "score": 8,
                            "created_utc": 1651986385.0,
                            "response": "Thanks!  I’ll have to see if one is available.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7rrvug",
                                    "author": "patharmangsho",
                                    "score": 7,
                                    "created_utc": 1651992894.0,
                                    "response": "FTX, Binance, Crypto.com, Kucoin etc.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7sebv3",
                                    "author": "FaithEmmanuel",
                                    "score": 4,
                                    "created_utc": 1652011646.0,
                                    "response": "Most of the bigger exchanges like Binance/FTX etc have this option already :)",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7rk5r0",
                                    "author": "Sir_Lagz_Alot",
                                    "score": 10,
                                    "created_utc": 1651987106.0,
                                    "response": "Controversial platform right now I know, but Crypto.com allows you to withdraw to Arbitrium, Avax C, polygon, and more. \n\nThey’ve got a decent spread compared to other exchanges, but it’s at least easy to withdraw. \n\nAvoid their other products though. They recently had some controversial changes to those, out of the blue.\n\nUse the exchange instead of the app if you live outside the States",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7rvmgp",
                                            "author": "Overload_Overlord",
                                            "score": 5,
                                            "created_utc": 1651995969.0,
                                            "response": "Transfer usdc there on eth, withdraw to L2. Cheap bridge",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i7rythj",
                                    "author": "frank__costello",
                                    "score": 3,
                                    "created_utc": 1651998745.0,
                                    "response": "Binance, FTX and Crypto.com are the big western exchanges that support it",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7rkejh",
                                    "author": "jimmycryptso",
                                    "score": 6,
                                    "created_utc": 1651987268.0,
                                    "response": "FTX",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7rb4da",
                    "author": "Xxapexx",
                    "score": 12,
                    "created_utc": 1651981790.0,
                    "response": "Cool story man! Glad you got to see the power of L2, one way to look at it is that you’ll never have to pay high fees to the degree they can be on eth l1, you won’t need to wait for cheap gas to interact with the network. Dope stuff",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7rbmrd",
                            "author": "hardcoregamer84",
                            "score": 7,
                            "created_utc": 1651982081.0,
                            "response": "Thanks!  Yeah it was cool to see the process and learn a bit along the way.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7rklrf",
                    "author": "roxxed",
                    "score": 9,
                    "created_utc": 1651987401.0,
                    "response": "To add on top of the cheaper fees(when I tested) I noticed the transaction times were quite a lot faster, almost instant.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7rl16k",
                            "author": "hardcoregamer84",
                            "score": 4,
                            "created_utc": 1651987693.0,
                            "response": "Great point!  I forgot to mention that, as mine was also instant!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7rv4wr",
                    "author": "Hanzburger",
                    "score": 8,
                    "created_utc": 1651995569.0,
                    "response": "Nice, the next step to level up would be to use rETH instead of stETH",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7rv5fb",
                            "author": "haikusbot",
                            "score": 3,
                            "created_utc": 1651995581.0,
                            "response": "*Nice, the next step to*\n\n*Level up would be to use*\n\n*RETH instead of stETH*\n\n\\- Hanzburger\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7s7n5i",
                    "author": "Puddingbuks26",
                    "score": 5,
                    "created_utc": 1652006565.0,
                    "response": "Loopring with Layerswap. Staking coming soon on Loopring",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7rziki",
                    "author": "BitSoMi",
                    "score": 3,
                    "created_utc": 1651999355.0,
                    "response": ">The fee was only $0.65\n\nstill seems high to me for a layer 2",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7s7kbh",
                            "author": "jcm2606",
                            "score": 7,
                            "created_utc": 1652006497.0,
                            "response": "It'll go down as more people use L2s, and as L1 gets cheaper for L2s to settle on. Plus, L2s are always finding ways to optimise their settlement costs, so it'll go down over time as L2s are optimised more and more.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "ukuehp",
            "title": "Project Recommendations",
            "url": "https://www.reddit.com/r/ethereum/comments/ukuehp/project_recommendations/",
            "author": "pheonix10yson",
            "created_utc": 1651985468.0,
            "score": 6,
            "num_comments": 14,
            "subreddit": "ethereum",
            "selftext": "Hi,\n\nI am thinking of starting a project to learn some skills of the web3 world. Completely new to this world, I have gone through most of the cryptozombies lesson on solidity while also trying to understand the overall concepts of Blockchain/Web3, what major projects are doing etc etc...\n\nThe project will basically be a way to truly enable digitally signing and reliably storing important documents. As of now I see this being used by corporates/ governments etc (Yeah I overstretched by adding govt). Docs like contracts, agreements, bills etc\n\nThinking of using Ethereum + Filecoin, since I am targeting security over other features. It might be better to go with something like Hyperledger, but I am thinking this should be compatible with multiple chains anyway to provide different options for users based on the need of security, performance, gas fees etc. So I will be starting off with Ethereum.\n\nPlease let me know if you see any implications and problems ahead. My major objective of posting this is to have a brainstorm of potential issues I might face in future. Also get some help in moving forward with the project. What I should learn? What I should know before starting of etc etc?  \nAlso are there other subReddits which are more apt for these kind of questions?  \nAny comment is appreciated.\n\nThanks",
            "stickied": false,
            "comments": [
                {
                    "id": "i7rl78u",
                    "author": "hanniabu",
                    "score": 3,
                    "created_utc": 1651987813.0,
                    "response": "There's another product that's similar, I believe they'll be launching in the next week or so  \nhttps://app.sliksafe.com/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7rn2lt",
                    "author": "Yeopaa",
                    "score": 3,
                    "created_utc": 1651989147.0,
                    "response": "I always recommend this to people, it's one of the most thorough video guides on Solidity out there imo.\n\nhttps://youtu.be/M576WGiDBdQ",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ukxit4",
            "title": "A Closer Look At How Oracles Can Help Blockchain Achieve True Decentralization",
            "url": "https://coingapes.com/a-closer-look-at-how-oracles-can-help-blockchain",
            "author": "era207",
            "created_utc": 1651999409.0,
            "score": 69,
            "num_comments": 9,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7s0bty",
                    "author": "totonilop",
                    "score": 6,
                    "created_utc": 1652000061.0,
                    "response": "\"According to CoinGecko, the DeFi market cap is around $110 billion despite the effects of the bearish period. The blockchain sector has grown into a global network that is gaining mainstream adoption every day, with DeFi at the forefront\"\n\nWell, there is no doubt it is not perfect yet, but the market keeps evolving constantly, and a real alternative for the banks and \"centralized\" money, is emerging",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7s1pwa",
                    "author": "coinfeeds-bot",
                    "score": 6,
                    "created_utc": 1652001304.0,
                    "response": "tldr; Decentralized oracles are the missing piece needed to push the blockchain industry, particularly the decentralized finance (DeFi) ecosystem, to the next level. Oracles are blockchain technologies that enable smart contracts to communicate with external data. Decentralised oracles have been shown to be effective option for securing smart contracts, facilitating interoperability and offering seamless off-chain data verification.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ul1fm5",
            "title": "Trust Wallet Restored But Empty Wallet",
            "url": "https://www.reddit.com/r/ethereum/comments/ul1fm5/trust_wallet_restored_but_empty_wallet/",
            "author": "rudalsxv",
            "created_utc": 1652015560.0,
            "score": 27,
            "num_comments": 22,
            "subreddit": "ethereum",
            "selftext": "My iPhone recently died (touch screen issues) and had to bring the phone to Apple Store.\n\nAfter waiting for couple of hours they told me it couldn’t be fixed and ended up giving me a new one.\n\nI restored the Trust Wallet backup using my 12 seed phrase but the Wallet is empty. I had 3 Ethereums.\n\nDo I need to a further step to restore this? Could it have been stolen by the person who had the original and thus had access to the Wallet on the phone?\n\nNot going to lie, I’m panicking here. Help.\n\nEdit: I got it back, while checking the address it popped up I guess it was a syncing issue!\n\nThe relief…I think I’ve just aged a few years.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7slkt2",
                    "author": "Ornery-Plan-6632",
                    "score": 16,
                    "created_utc": 1652016006.0,
                    "response": "Be careful and don’t trust anyone who DMs you here on Reddit!! Scammers will reach out trying to get you to verify your wallet. \nDo you have your wallet address? As mentioned above. Check transactions on etherscan. See if it was moved out of your wallet. Pretty simple.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7sn2q7",
                            "author": "rudalsxv",
                            "score": 22,
                            "created_utc": 1652016789.0,
                            "response": "Someone in fact did ask me to use sync-mainnet.org which asked me to put my seed phrase. I didn’t because that’s a big no no.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7sn8p3",
                                    "author": "Ornery-Plan-6632",
                                    "score": 6,
                                    "created_utc": 1652016874.0,
                                    "response": "Good. What about the rest of the comment. Wallet address and checking on etherscan. Did you look?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7u6yww",
                                    "author": "Trixteri",
                                    "score": 4,
                                    "created_utc": 1652041806.0,
                                    "response": "holy hell, someone that recognizes a scam..",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7sl3ou",
                    "author": "JalapenoPepper-X",
                    "score": 5,
                    "created_utc": 1652015746.0,
                    "response": "Check the wallet transactions here:\nhttps://etherscan.io/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7slkye",
                    "author": "Deminero30",
                    "score": 5,
                    "created_utc": 1652016008.0,
                    "response": "Was there an outgoing transaction? If not, you most likely used the wrong phrase to restore.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7sn7sg",
                            "author": "rudalsxv",
                            "score": 6,
                            "created_utc": 1652016860.0,
                            "response": "Phrase is correct, I’ve triple checked it when I wrote it down. I got them back now, good god the relief…thanks to a kind poster here who helped.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7sl4dc",
                    "author": "Jane1_1",
                    "score": 4,
                    "created_utc": 1652015757.0,
                    "response": "Go to etherscan and look for your wallet’s history",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7sn5xs",
                    "author": "Nonocoiner",
                    "score": 3,
                    "created_utc": 1652016835.0,
                    "response": "As others suggested check your address on etherscan. If you're comfortable with it, maybe post it here. Of course everyone will be able to see all your transactions.\n\nAlso, are you sure you were holding ETH? If you bought on Binance maybe you were holding the Binance peg-ETH token instead for example, and you might be looking on the wrong chain.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7snhsn",
                            "author": "rudalsxv",
                            "score": 5,
                            "created_utc": 1652017004.0,
                            "response": "I got it back, they’re back on my wallet now it popped up while I was checking the address.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7sqhmv",
                    "author": "hinzinho",
                    "score": 3,
                    "created_utc": 1652018519.0,
                    "response": "I know you got it back but what do you mean by “the person who had the original”? Someone got a copy of your seed?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7srv36",
                            "author": "rudalsxv",
                            "score": 3,
                            "created_utc": 1652019203.0,
                            "response": "My original iPhone that got replaced by Apple.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7sqs4n",
                    "author": "FucktheCaball",
                    "score": 3,
                    "created_utc": 1652018663.0,
                    "response": "Phew .. I was nervous for you.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ul5t12",
            "title": "Can't find staking waitlist on Coinbase? Is it still available?",
            "url": "https://www.reddit.com/r/ethereum/comments/ul5t12/cant_find_staking_waitlist_on_coinbase_is_it/",
            "author": "americanyangster",
            "created_utc": 1652028457.0,
            "score": 12,
            "num_comments": 12,
            "subreddit": "ethereum",
            "selftext": "I've looked everywhere to try and find a link where I can sign up for the staking waitlist on Coinbase but can't find it. Even the Coinbase staking page acts like there should be a link there, but nothing is clickable [on the page](https://www.coinbase.com/staking).",
            "stickied": false,
            "comments": [
                {
                    "id": "i7tun3v",
                    "author": "Nonocoiner",
                    "score": 4,
                    "created_utc": 1652036366.0,
                    "response": "There's currently an increasing queue of 17,650 validators to start staking, maybe that's why Coinbase removed the option?\n\nPoor service if they don't inform their customers of course.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7unl9a",
                    "author": "dontuknowpumpitup",
                    "score": 3,
                    "created_utc": 1652049189.0,
                    "response": "I use kraken. no wait-list.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7vc5m3",
                            "author": "Zhuyi1",
                            "score": 3,
                            "created_utc": 1652061338.0,
                            "response": "Smaller cut too (15% vs 25%)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7vcea4",
                    "author": "Zhuyi1",
                    "score": 3,
                    "created_utc": 1652061459.0,
                    "response": "Use layerswap and send eth from coinbase to an L2 for like $3 and buy rETH or stETH on Optimism or Zksync. Airdrop + liquid staking at higher yields",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ukpzzu",
            "title": "Solidity question",
            "url": "https://www.reddit.com/r/ethereum/comments/ukpzzu/solidity_question/",
            "author": "yahboyelias",
            "created_utc": 1651969032.0,
            "score": 3,
            "num_comments": 8,
            "subreddit": "ethereum",
            "selftext": "I'm still new to solidity and still learning but based on what I learned so far once you deploy a contract to the blockchain everyone can see the contract code.\n\nnow I wanted to look at some code for some scam tokens I have in my wallet which I got airdropped, I want to know how they work but when I go to the contract tab on bscscan there is none.\n\nHow does one bypass displaying your contract code on the blockchain and since you can omit that info a certain way isn't the whole concept broken then?\n\ncontract address - 0xD5E3BF9045Cfb1e6dEd4b35D1B9C34be16D6EEc",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ul0f9t",
            "title": "What is happening with UST ?",
            "url": "https://www.reddit.com/r/ethereum/comments/ul0f9t/what_is_happening_with_ust/",
            "author": "HypedBanana0",
            "created_utc": 1652012034.0,
            "score": 220,
            "num_comments": 246,
            "subreddit": "ethereum",
            "selftext": "Basically title, recently the value of UST has been declining against other stablecoins, why is that ? And why is it happening now and not earlier ir later ?\n\nThanks",
            "stickied": false,
            "comments": [
                {
                    "id": "i7tcor3",
                    "author": "tells",
                    "score": 9,
                    "created_utc": 1652028535.0,
                    "response": "From curve https://twitter.com/curvefinance/status/1523170253316005890?s=21&t=64LscPXNlWDxiDleYNuplw \n\nLuna took the hit to restabilize the peg as designed.  The first priority of terra is to protect the peg at all costs even if that means to take value away from Luna. Luna holders (should) know this and see this as noise.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7sjhj1",
                    "author": "HypedBanana0",
                    "score": 167,
                    "created_utc": 1652014863.0,
                    "response": "To the people mocking my question: look at the usual fluctuation and look at the fluctuations in the last hours, have you ever heard of standard deviations ? Nobody taking the time to explain, I feel like I'm surrounded by Luna shillers wtf",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7t96qx",
                            "author": "hiredgoon",
                            "score": 4,
                            "created_utc": 1652027008.0,
                            "response": "What make these fluctuations different from when other stablecoins experienced fluctuations before resuming their peg?  \n\nRight now it is 99.7% of other stablecoins and looks likely to regain 100% without another massive sell off.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7to64q",
                                    "author": "frank__costello",
                                    "score": 8,
                                    "created_utc": 1652033506.0,
                                    "response": "Other stablecoins are backed by other assets.\n\nDai pretty much can't go _below_ $1, because every Dai is backed by over $1 worth of collateral. It can only de-peg upwards",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7sxtb3",
                            "author": "Jacktheman",
                            "score": 148,
                            "created_utc": 1652021985.0,
                            "response": "Maybe r/ethereum is a maxi sub?? but I’m quite surprised not many people know what is happening to UST. \nBasically UST is backed by 2 assets, bitcoin and Luna and with the majority being the latter. The “algo” behind it works like this.. price of Luna is driven by the demand of minting UST, so basically giving everyone that needs stablecoins a chance to get rich by longing Luna. But as prices of all crypto start to fall, people are losing their money on Luna and therefore UST loses its appeal as a stable and gets into a death spiral as everyone cash out of this ponzi. \n\nOh the initial demand for UST came from the terra team offering 20%APY on staked UST. How?? “If you don’t know where the yield comes from, you are the yield”",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7t2xno",
                                    "author": "WhyRUstressed",
                                    "score": 81,
                                    "created_utc": 1652024273.0,
                                    "response": "The yield comes from multi-billion dollar grants from the Luna Foundation. The majority of UST supply is rotary capital farming those liquidity injections. Right now Anchor has ~200 Million USD left in the yield reserve to sustain its APY.\n\nI appreciate that you actually answered OP's question, but maybe stay humble on the parts you haven't done research on.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7tca31",
                                            "author": "kopisiutaidaily",
                                            "score": 20,
                                            "created_utc": 1652028354.0,
                                            "response": "Based yield is about 15%, the rest is from Terra funding anchor reserve. Tbh I’ve used it for a year now and it’s a pretty nice product in the market. Although the recent update, yields are now about 18%. \n\nI would say all these are noise and most of them don’t know how UST works, they get scared follow some Twitter guy screaming depeg. When there’s major fluctuations, all stablecoin will depeg, some depeg and never return to peg, while those that return to peg the quickest are still here. That’s the most important point. How quickly does it return to peg and how it fairs during major volatility periods.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7uazxx",
                                                    "author": "energetic-dad",
                                                    "score": 5,
                                                    "created_utc": 1652043592.0,
                                                    "response": ">Tbh I’ve used it for a year now and it’s a pretty nice product in the market.\n\nThis makes me more confident in my Luna longs. I think the bear market would be a great time to load up on it, as I've heard great things about anchor protocol. My little use of it has been fairly seamless",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i7uppj1",
                                            "author": "Jacktheman",
                                            "score": 7,
                                            "created_utc": 1652050203.0,
                                            "response": "Yeah but it’s not sustainable, you can’t offer 20% APY for ever, the grant won’t sustain as there needs to be value created. Right now either borrowers need to pay for that 20% moving forward or the staking rewards of Luna need to pay for that, but either way it’s seems very unsustainable. \n\nThe problem I have is that terra attracts people with 20% APY and everyone just apes in, of course it’ll work in the short run like much of the DeFi products. Until rewards dry up and people realise no value is captured and distributed.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i7um9g7",
                                            "author": "Zakarovski",
                                            "score": 4,
                                            "created_utc": 1652048557.0,
                                            "response": "I'm not sure if you realize but that's even worse that the yield comes from the foundation. This is not sustainable. Do you realize that?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7uok6x",
                                                    "author": "NoThanks93330",
                                                    "score": 13,
                                                    "created_utc": 1652049651.0,
                                                    "response": "Of course this is not sustainable, but it's not meant to be. It's a fund to kickstart the project.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i7tpqd6",
                                    "author": "FaceDeer",
                                    "score": 16,
                                    "created_utc": 1652034185.0,
                                    "response": "What do you mean by /r/ethereum being a \"maxi sub\" with regards to UST or Luna? Seems to me this is an *Ethereum* sub, maxi or otherwise, I rarely see those other tokens mentioned so I don't see how it could be \"maxi\" in that context.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7t3y6p",
                                    "author": "kryptonite-uc",
                                    "score": 10,
                                    "created_utc": 1652024713.0,
                                    "response": "We are Maxis, Baxis, Taxis and Waxis but if you ever call me Faxi I swear to god we have war",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7u2f3j",
                                    "author": "sluttyseinfeld",
                                    "score": 3,
                                    "created_utc": 1652039788.0,
                                    "response": "Based. I was researching this project a couple weeks ago when I saw the huge run up in price and after about an hour I realized that its all just a large sophisticated ponzi and the crash will be spectacular. Didn’t know it would come this soon tho. LUNAconneeeeeeeeeeeect wasa wasa wasa",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7swwx1",
                            "author": "Naritai",
                            "score": 13,
                            "created_utc": 1652021577.0,
                            "response": "Yeah, I came in here hoping for a realistic discussion of what is actually happening, and just a bunch of shitposts.  Kinda disappointing.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7smwt2",
                    "author": "frank__costello",
                    "score": 52,
                    "created_utc": 1652016704.0,
                    "response": "Well, it's an algo-stablecoin. They've all blown up in the past, as they're not actually backed.\n\nHowever, UST has some super-wealthy backers though, like Jump Capital. I doubt they'll let UST depeg any time soon, the project is too-big-to-fail.\n\nEdit: This didn't age well",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7stj3m",
                            "author": "Swampfoxxxxx",
                            "score": 6,
                            "created_utc": 1652020009.0,
                            "response": "Has Dai had a significant depegging event in its history?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7sux6g",
                                    "author": "frank__costello",
                                    "score": 25,
                                    "created_utc": 1652020656.0,
                                    "response": "Yes, Black Thursday, when COVID crashed the markets in March 2020. Dai shot up to like $1.10.\n\nSince then, MakerDAO has added lots of changes to support the peg, one of the main ones being the \"Peg Stability Module\", which uses USDC to stabilize the peg.\n\nDai gets criticized a lot for being \"centralized\" for using USDC in the system. However, I think using an on-chain mechanism that uses USDC is a lot more decentralized than UST, which has Jump Capital counter-trading to maintain the peg and the Luna Foundation Group purchasing Bitcoin that the company can sell to backstop the peg.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7tdcec",
                                            "author": "kopisiutaidaily",
                                            "score": 7,
                                            "created_utc": 1652028817.0,
                                            "response": "Every stablecoin has issues of depeg at some point in its history. it’s how it returns to peg the most important. How it fair among other major stablecoins.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i7srvra",
                            "author": "nelusbelus",
                            "score": 60,
                            "created_utc": 1652019212.0,
                            "response": "Famous last words. !remindme 5y",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7zo2ia",
                                    "author": "thunderlightlybaby",
                                    "score": 3,
                                    "created_utc": 1652143096.0,
                                    "response": "rip",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7sv6ap",
                                    "author": "frank__costello",
                                    "score": 14,
                                    "created_utc": 1652020776.0,
                                    "response": "I'd be happy to be proven wrong.\n\nI've got a fair amount of UST in Anchor, and a pretty decent bag of LUNA. However, I'm still pretty realistic about the risks of a system like this.\n\nMy investment thesis for Terra is that the big money backing the project won't allow it to fail for at least another year.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7u14om",
                                            "author": "sharkhuh",
                                            "score": 10,
                                            "created_utc": 1652039212.0,
                                            "response": "Doesn't inspire confidence in me that too many projects in crypto are not decentralized and wholly relying on a centralized authority to bail them out.\n\nDid everyone forget why crypto exists? It's to be decentralized. Otherwise, we've just created a very shitty centralized product.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i7szqtn",
                                            "author": "nelusbelus",
                                            "score": 4,
                                            "created_utc": 1652022856.0,
                                            "response": "The one thing I've never heard anyone about; so to counter the death spiral they bought btc. But if we're in a big downturn then that btc will also be worth a lot less just like the luna, which will then probably also get some sell pressure to btc especially if they hold a lot more then they do now. It also feels kinda sketch that luna's price will rise if btc's price rises and them buying btc does probably influence btc price too",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7tg8o5",
                    "author": "xangchi",
                    "score": 6,
                    "created_utc": 1652030061.0,
                    "response": "Because it's an algorithmic stablecoin unlike fully backed stablecoins like USDC, BUSD and EEUR which can be redeemed 1:1 with their underlying asset.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7sv8zt",
                    "author": "TheWiseGrasshopper",
                    "score": 46,
                    "created_utc": 1652020810.0,
                    "response": "Pro-tip for the new people here:\n\nThe measure of a good stable coin is NOT whether is can retain its peg in the short term, but rather how it is economically structured such that it can retain the peg in black swan events AND survive the event. It doesn’t matter if it maintains its peg within 0.01% of the real price during *regular days* if the system fails catastrophically when the market melts down. Invest in stable coins that proved themselves on Black Thursday (covid crash when the market lost 50+% within 24hrs) such as DAI and USDC. We have no need for 30 different ones which are mostly owned by VCs, are highly centralized in their consensus, operate on fractional reserves, and/or have yet to demonstrate they can survive the high volatility of massive bull and bear swings. \n\nPlease think about that. I urge you guys to please just invest in the ones that have proven themselves time and time again: DAI and USDC. They’re all worth $1 regardless - so please just go with the safest option.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7szmti",
                            "author": "HeavyMommyMilkers",
                            "score": 7,
                            "created_utc": 1652022805.0,
                            "response": "What about Gemini dollar",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7t3wal",
                                    "author": "TheWiseGrasshopper",
                                    "score": 9,
                                    "created_utc": 1652024690.0,
                                    "response": "Funny you bring this up: I’m actually looking to open a credit/debit account with Gemini as they offer a FDIC (federally-insured) product with about 7% APY on GUSD. Basically, since they are FDIC insured, they’re functionally no different from a major bank, YET they offer interest rates over 100x higher. Some might say 7% is unsustainable, but I think that ideally (in a healthy market) the interest rate should at least match inflation. Couple this with the efficiency gains of automating many of the currently analogue processes of traditional finance and I think that the crypto exchange banks are here to stay. FDIC insurance will prove to be a brilliant shelling point for the masses.\n\nTLDR: GUSD has my blessing. 👍",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7tjkzf",
                                            "author": "cryptOwOcurrency",
                                            "score": 20,
                                            "created_utc": 1652031492.0,
                                            "response": "> they offer a FDIC (federally-insured) product with about 7% APY on GUSD\n\nGemini Earn is not FDIC insured. You're confusing GUSD itself (insured but no interest) with their Earn product (not insured, but interest).",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7tzwuw",
                                                    "author": "TheWiseGrasshopper",
                                                    "score": 4,
                                                    "created_utc": 1652038672.0,
                                                    "response": "Oh good to know. Thanks for the clarification!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i7usked",
                            "author": "FreeFactoid",
                            "score": 3,
                            "created_utc": 1652051609.0,
                            "response": "USDC is centralized and can be frozen. I urge that we all consider using LUSD as an alternative.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7tnjf4",
                            "author": "Thevsamovies",
                            "score": 5,
                            "created_utc": 1652033225.0,
                            "response": "Ah yes, instead of promoting a decentralized, distributed crypto ecosystem we should instead concentrate more power around USDC.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7u1d4s",
                                    "author": "TheWiseGrasshopper",
                                    "score": 5,
                                    "created_utc": 1652039316.0,
                                    "response": "I didn't say we should exclusively use USDC, in fact I implied quite the opposite. But USDC is audited and has endured enormous black swans. Furthermore, it says quite a lot IMO that Vitalik himself explicitly lists DAI, RAI, and USDC as the only stable coins that we really need. Vitalik. The king of decentralization. Think about that. He's not dumb and he's not being paid to say that. [Source](https://www.youtube.com/watch?v=m4vYEn_Twog) skip to 54min.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7tiznn",
                    "author": "piggybanklol",
                    "score": 4,
                    "created_utc": 1652031233.0,
                    "response": "Someone have a eli5 version of this project?   I kept reading different takes and seems like no one really knows how it works",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7sx8im",
                    "author": "belzarek",
                    "score": 15,
                    "created_utc": 1652021725.0,
                    "response": "I heard about this deppeging and got super worried as I have a huge bag on abracadabra in the looped anchor,and then I saw that it deppeged to 0.98 after someone dumped 285 MILLIONS ust lol,talking about a storm in a tea cup",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7si6wi",
                    "author": "Or1gin91",
                    "score": 71,
                    "created_utc": 1652014096.0,
                    "response": "UST is a top 10 crypto and is catching up to the market cap of luna. \n\nIt’s only got collateral for around 20-30% of its circulating market cap. \n\nThere are safeguards put in place to help keep that $1 peg, but if UST ever passes Tera market cap, I would grab the popcorn.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7swwg7",
                            "author": "Y0rin",
                            "score": 27,
                            "created_utc": 1652021571.0,
                            "response": "Why, though. It's not backed by LUNAs market cap. You can even back it with just one Luna, theoractically. That one Luna would be worth a lot though, but the market cap can still be lower than USTs.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7t1ild",
                                    "author": "Or1gin91",
                                    "score": 14,
                                    "created_utc": 1652023643.0,
                                    "response": "Only 20-30% of ust is backed by anything.\n\nIf the market cap of luna continues to plummet then even more what backs ust goes down. So that 20-30% becomes 15-25%.\n\nWhat’s the LFG solution? Buy more bitcoin\n\nNot a bad idea, but then all of your collateral becomes backed by a volatile asset. Does well when doing bitcoin is doing well and not so well in times like these.\n\nI want the confidence that my stable coins will do well in times like these and in my opinion that’s really only assured with collateral.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7t6ebo",
                                            "author": "Jigge89",
                                            "score": 4,
                                            "created_utc": 1652025790.0,
                                            "response": "UST is in fact not supposed to be backed by anything. That's the point of decentralized, algorithmic stablecoins. It reduces the risks that come from coins being backed by other assets. However it also introduces other risks. What's better long term? Probably remains to be seen",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i7sro7s",
                            "author": "vlatkovr",
                            "score": 5,
                            "created_utc": 1652019108.0,
                            "response": "There is no relationship requiring UST’s MC to be smaller than Luna’s MC.\r  \n\r  \nLuna is not backing UST, so there's no issue with undercollateralization like there would be with something like USDT or USDC.\r  \n\r  \nThe conversion LUNA-UST-LUNA is a transformation, not a trade.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7wb7d5",
                                    "author": "KlopKlop10293",
                                    "score": 4,
                                    "created_utc": 1652085084.0,
                                    "response": "If that was true imagine if luna mcap was 1 dollar, and ust mcap 10trillion, don’t you see there need to be enough mcap to make the transformation actually worth anything?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7sxs6u",
                            "author": "mini_dreamz",
                            "score": 3,
                            "created_utc": 1652021971.0,
                            "response": "UST is not backed by Luna, so I don't see your point",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7t9f41",
                                    "author": "hiredgoon",
                                    "score": 5,
                                    "created_utc": 1652027111.0,
                                    "response": "What is UST backed by?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7tco7z",
                                            "author": "PrawnTyas",
                                            "score": 4,
                                            "created_utc": 1652028528.0,
                                            "response": "That’s kind of up in the air - some would say nothing, some would say LUNA & Bitcoin. Very much in contention at the minute.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7sgydo",
                    "author": "Admirable-Hyena5040",
                    "score": 4,
                    "created_utc": 1652013342.0,
                    "response": "https://mobile.twitter.com/MeetWawa/status/1523269098192338944",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7sngx1",
                            "author": "ResearcherSad9357",
                            "score": 17,
                            "created_utc": 1652016991.0,
                            "response": "lol \"as long as people still want to buy Luna, UST will always maintain its peg.  And people will always want to buy Luna.\" Yeah sure looks like people want to buy Luna rn",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7ta7mx",
                    "author": "anaf28",
                    "score": 5,
                    "created_utc": 1652027460.0,
                    "response": "I recommend asking on r/terraluna for more informative answers tbh.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7tq6t7",
                    "author": "OracularTitaness",
                    "score": 4,
                    "created_utc": 1652034388.0,
                    "response": "UST is propped up by 18% APY",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7sgmx0",
                    "author": "Kike328",
                    "score": 5,
                    "created_utc": 1652013142.0,
                    "response": "? According to some exchanges is like ~0.99$ which is fairly good for an algorithm stablecoin",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ul198z",
            "title": "What are the downsides of zero knowledge proofs when integrated in a crypto?",
            "url": "https://www.reddit.com/r/ethereum/comments/ul198z/what_are_the_downsides_of_zero_knowledge_proofs/",
            "author": "RedEagle_MGN",
            "created_utc": 1652015015.0,
            "score": 19,
            "num_comments": 16,
            "subreddit": "ethereum",
            "selftext": "What are the downsides of zero knowledge proofs when integrated in a crypto? Is it the lack of efficiency? Are there other downsides?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7sn4b8",
                    "author": "frank__costello",
                    "score": 19,
                    "created_utc": 1652016812.0,
                    "response": "Right now, none of them are sustainable, as they require crazy-expensive computation to generate the proofs.\n\nThat's ok right now, because these projects all have tons of VC funding to pay for the servers, but if the projects are ever going to be sustainable, they'll need custom hardware to be developed.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7t4gc9",
                            "author": "RedEagle_MGN",
                            "score": 3,
                            "created_utc": 1652024938.0,
                            "response": "Interesting",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7t6gw9",
                            "author": "cip43r",
                            "score": 3,
                            "created_utc": 1652025821.0,
                            "response": "Oh and qhat about BTC miners?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7t7n9u",
                                    "author": "frank__costello",
                                    "score": 4,
                                    "created_utc": 1652026339.0,
                                    "response": "BTC mining could be done on laptops in the early days\n\nSpecialized hardware (ASICs) wasn't required, but it did give an advantage, which helped ASIC miners dominate the mining market",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7vipfz",
                            "author": "cosmic-comedy",
                            "score": 3,
                            "created_utc": 1652064648.0,
                            "response": "Related: [https://nitter.net/gakonst/status/1514351515963514888](https://nitter.net/gakonst/status/1514351515963514888)\n\nmy understanding: hardware will be developed, and should enable people to take part in it, granted the rollups enable the community to join in being provers",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "ukrcsc",
            "title": "One Fern Between Two Keys",
            "url": "https://www.youtube.com/watch?v=10-VTatrfkg",
            "author": "jMyles",
            "created_utc": 1651973851.0,
            "score": 6,
            "num_comments": 4,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}