{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urf57i",
            "title": "B3, Brazil’s stock exchange to roll out BTC and ETH futures",
            "url": "https://cryptoadventure.com/b3-brazils-stock-exchange-to-roll-out-btc-and-eth-futures/",
            "author": "bdinu89",
            "created_utc": 1652764531.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8wwo18",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1652765413.0,
                    "response": "tldr; Brazilian stock exchange B3 is planning to launch Bitcoin futures trading within six months, according to B3's Chief Financial Officer Andre Milanez. This comes after B3’s Director of Information, Jochen Mielke de Lima, said the exchange would roll out multiple crypto-centric products, including BTC and ETH futures. B3 aims to offer national crypto exchanges a myriad of services.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urf7tz",
            "title": "The reason the public has trust issues with Cryptocurrencies",
            "url": "https://www.reddit.com/r/ethereum/comments/urf7tz/the_reason_the_public_has_trust_issues_with/",
            "author": "usernotavailable0",
            "created_utc": 1652764827.0,
            "score": 0,
            "num_comments": 3,
            "subreddit": "ethereum",
            "selftext": "How can you buy cryptocurrencies? How do you learn about crypto? Where are a lot of scams taking place? Online.\n\nWhere do you usually go to get a loan, or pull money from your account. Your bank. It has a location, people inside. It is real.\n\nCrypto is missing the physical part of interaction let alone one that involves your money. To be able to sell a product, you need a real salesman. You need someone who knows what they are talking about, someone who can inform others. \nYou might have said earlier that you can buy from the crypto ATMs. Crypto dispensers are not the way this will be trusted by a community. If you’ve ever seen one, you’ve probably said “Oh cool!” and walked right past it.\n\nI’m open to hearing others opinions.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8x1k1y",
                    "author": "Perleflamme",
                    "score": 1,
                    "created_utc": 1652769185.0,
                    "response": "\n>Where are a lot of scams taking place?\n\nOn the phone. Really. It's just that you don't hear about it. There are just too many of them and each of them is just too small of a scam to be worth an article. Besides, scammed people feel too much more ashamed than angry to tell the tale on public with a journalist. \n\nWith crypto, all scams are public by default. You don't need people to tell you anything about it. \n\n>Where do you usually go to get a loan, or pull money from your account. Your bank. It has a location, people inside. It is real.\n\nI can retrieve money without getting to any place, even with a bank. \n\nI can even have a credit card and spend cryptocurrencies using it to pay people who want fiat. \n\nLet's be clear: crypto doesn't need people. Some people need crypto, nothing more. Once people will see the benefits, they will use it. No need to force adoption or anything: it's not a Ponzi. If people want to make sure they don't interact with crypto, it's their loss, not yours.\n\nFor those who are interested about crypto, there already are physical events where it's talked about, where there are \"salesmen\", even though it's more about awareness than it is about selling something. It's not a company with products (though some companies are doing exactly that, but they're not building about decentralization anyway, by design).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x3gvd",
                    "author": "Mallardshead",
                    "score": 1,
                    "created_utc": 1652770796.0,
                    "response": "Because exchanges have recreated the banking sector, shitcoins have recreated Lehman Brothers, and central bankers like Vitalik Buterin are demanding bailouts for busted projects.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x6f6a",
                    "author": "abu_alkindi",
                    "score": 1,
                    "created_utc": 1652773375.0,
                    "response": "Im not sure you get it.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}