{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us5t4e",
            "title": "Where does Ethereum's protocol revenue go?",
            "url": "https://www.reddit.com/r/ethereum/comments/us5t4e/where_does_ethereums_protocol_revenue_go/",
            "author": "Texas_243",
            "created_utc": 1652852279.0,
            "score": 12,
            "num_comments": 20,
            "subreddit": "ethereum",
            "selftext": "Hello!\n\nI was looking at token terminal's protocol revenue chart and Ethereum is #1 by a huge margin! ($8.5B in the last year)\n\n[https://tokenterminal.com/terminal/metrics/protocol\\_revenue](https://tokenterminal.com/terminal/metrics/protocol_revenue)\n\nI'm wondering where does all this ETH go? A DAO? ETH miners? Thanks!",
            "stickied": false,
            "comments": [
                {
                    "id": "i91l97r",
                    "author": "MinimalGravitas",
                    "score": 28,
                    "created_utc": 1652854390.0,
                    "response": "Most of it gets burned due to.a mechanism introduced in EIP-1559. A small tip is given to miners currently, but will go to stakers after The Merge.\n\n\nBy burning the base transaction fees the value in effect is going to all ether holders through deflationary pressure.\n\n\nIt's also worth noting that 'burning' in this case doesn't mean sending it to a burn address, but rather it is completely removed from the network.\n\n\nYou can watch the burn at https://watchtheburn.com/.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91naz3",
                            "author": "AESTHTK",
                            "score": 15,
                            "created_utc": 1652856045.0,
                            "response": "Which means that “it goes” straight into the pockets of anybody holding Ethereum - as it directly reduces supply.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91u3v1",
                                    "author": "Key-Cucumber-1919",
                                    "score": 6,
                                    "created_utc": 1652862047.0,
                                    "response": "It's offsetting some eth created by miners, but still more is being created than burned.\n\nSo it's not going straight into the pockets but it's leaving pockets at slower rate.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i91y79b",
                                            "author": "saddit42",
                                            "score": 9,
                                            "created_utc": 1652865907.0,
                                            "response": "Which will change once we merge",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i97j211",
                                    "author": "mrprogrampro",
                                    "score": 1,
                                    "created_utc": 1652972127.0,
                                    "response": "So ... the optimal strategy is to buy ETH and do nothing with it?\n\nSounds kind of silly.... but I guess it's there to limit transaction rate on the network, not just for its own sake.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i97kri5",
                                            "author": "AESTHTK",
                                            "score": 1,
                                            "created_utc": 1652972840.0,
                                            "response": "Optimal is to stake it, or use it on a Layer 2 like Arbitrum or Optimism to generate yield.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i922dsn",
                            "author": "0x_bulldart",
                            "score": 4,
                            "created_utc": 1652869567.0,
                            "response": "This website is also pretty cool: [https://ultrasound.money/](https://ultrasound.money/)  \nI think it was the bankless guys behind it (or maybe sassal)",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i92m0e1",
                            "author": "TemporalAccounts",
                            "score": 3,
                            "created_utc": 1652881220.0,
                            "response": "I’m not trying to create FUD, I’m just dumb.. but if you are essentially giving up your ownership of the Ethereum network by using it, then what would incentivize someone to use the network?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92nuh8",
                                    "author": "MinimalGravitas",
                                    "score": 4,
                                    "created_utc": 1652882068.0,
                                    "response": "Thinking about stuff and questioning it isn't FUD or dumb, it's how you should approach crypto to not get wreaked!\n\nYes, by using Ethereum (the network) you have to pay with ether (the asset), which does in effect give up a bit of your ownership.\n\nBecause of that you would only rationally use it if the transaction you are doing is worth more to you than then cost in ether to do it. For many people this means that Ethereum is not a sensible chain to use for just sending tokens from one place to another, but this is clearly something that a lot of people do with about $29.2 billion just transferred per day [https://money-movers.info/]. \n\nMore obviously valuable are the opportunities available in DeFi [https://defillama.com/chain/Ethereum], with things like decentralized exchanges, lending and borrowing platforms, futures trading etc potentially generating vastly more return than the cost of ether required to use them. People spent almost $2 million in ether just using UniSwap in the last 24 hours [https://cryptofees.info/].\n\nSo the simple answer is that you're right that you have to give up ether to use the network, but if what you're doing generates more profit than you spent doing it then you can just use that to buy back more ether than you started with anyway.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i940m0i",
                                    "author": "domotheus",
                                    "score": 2,
                                    "created_utc": 1652902115.0,
                                    "response": "> then what would incentivize someone to use the network?\n\nThe utility you get out of it, pretty much. If you don't want to \"give up your ownership\" then you can just rebuy the ETH you spent on gas fees.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i91yedn",
                    "author": "ivgur",
                    "score": -4,
                    "created_utc": 1652866092.0,
                    "response": "It goes to Texas no worries",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91t8bv",
                    "author": "Olmops",
                    "score": 1,
                    "created_utc": 1652861239.0,
                    "response": "Did not do the deep dive, but the first question should be what exactly does your graph show?\n\n571m dollars in 30 days - that could just be the newly minted ETH from block rewards.\n\n2 ETH go to the miner who finds a block. That are 30\\*24\\*3600secs/13secs \\~200k ETH in 30 days with 13 seconds block time. Those go to the miners.\n\nMiners can also earn tips (part of the transaction fees). \n\nThis is all independent of the mentioned burned ETH which might positively impact the price.\n\nNote however that the supply will significantly decrease when Ethereum switches to Proof of Stake (estimate a 80%-90%reduction in newly minted ETH) due to a different reward scheme.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91webt",
                    "author": "daxtaslapp",
                    "score": 1,
                    "created_utc": 1652864233.0,
                    "response": "Its decentralised so the people who help run the network which are currently mostly miners, get most of the fees which we pay for called Gas. A portion also burned into oblivion",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92yxlp",
                    "author": "Sorry_Attitude_",
                    "score": 1,
                    "created_utc": 1652886851.0,
                    "response": "Basically most of it is lost, just like burning money and a part of it goes to those that hold up the network. \n\nLess ethereum, more competition, both pushing up the price\n\nIt's also why a lot of people Hodl Eth so it is a feedback loop unless they can find something that can grow faster in value than Ethereum, like Companies building on the network and getting Funding through Angelblock, since small companies have larger potential",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i929byk",
                    "author": "Boxman212",
                    "score": -6,
                    "created_utc": 1652874493.0,
                    "response": "It all goes to my company @ youhavetopayforfailedtransactions. com",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}