{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uy7x01",
            "title": "Do you think we'll be able to implement blockchain learning?",
            "url": "https://www.reddit.com/r/ethereum/comments/uy7x01/do_you_think_well_be_able_to_implement_blockchain/",
            "author": "willsureck",
            "created_utc": 1653572537.0,
            "score": 3,
            "num_comments": 1,
            "subreddit": "ethereum",
            "selftext": " Since we already have virtual real estate, fashion, arts, and play to earn and their markets are constantly expanding, do you think learn-to-earn will be a huge thing too? I have found this [article](https://elearningindustry.com/impact-of-blockchain-technology-on-the-elearning-industry) about the impact of blockchain on Elearning If you think about it, it will be a win-win situation and it will also be helpful for those who don’t have the motivation to learn. Not just by learning about coins like Coinbase where you can start learning by watching videos and answering quiz questions that run for a certain period of time, Binance where a new user who signed up within 3 days can earn popular coins, Coinmarketcap partners with a variety of new cryptocurrencies and protocols trying to get their name out there, but like Kirin metaverse where they will have games that offer programs that reinforce education and reward learning with crypto assets, and I’m not sure if you will earn something from Bloktopia but it will act as a gateway for users to learn about blockchain and how it's helping power the metaverse.   \nDo you think we will have more learn-to-earn programs in the future?",
            "stickied": false,
            "comments": [
                {
                    "id": "ia2dvva",
                    "author": "Wrong_Net_749",
                    "score": 1,
                    "created_utc": 1653573594.0,
                    "response": "Yes, it would be beneficial, but I doubt it would be implemented across multiple metaverses. But let us wait and see what the future has in store for us.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}