{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uphc1r",
            "title": "StaFiHub Teams Up with Comdex to Expand the rToken User Scenario As Collaterals and Explore in…",
            "url": "https://link.medium.com/mwnKzNc5Xpb",
            "author": "OptimalBit5",
            "created_utc": 1652535086.0,
            "score": 4,
            "num_comments": 3,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "upgp9z",
            "title": "50+ Free Web3, Ethereum, NFTs and Blockchain Courses",
            "url": "https://www.theinsaneapp.com/2022/03/best-web3-courses.html",
            "author": "vadhavaniyafaijan",
            "created_utc": 1652533002.0,
            "score": 31,
            "num_comments": 8,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8kx88j",
                    "author": "-Aporia",
                    "score": 1,
                    "created_utc": 1652539141.0,
                    "response": "Very nice. Polygon also has a ton of resources on developing that I think are worth being added to any list like this. Hype.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8kshnp",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1652536805.0,
                    "response": "tldr; Learn Web3 by Doing Solidity, Blockchain, and Smart Contract Course by FreeCodeCamp Full Stack Ethereum Development by Nader Dabit Ultimate NFT Programming Course by Moralis Web3 Web3’s Learn-to-Earn Data Cohort Course by OurNetwork and Dune a16z Crypto Startup School Learn Everything about NFTs by Meta School.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upcizd",
            "title": "best writeups/videos on roll ups and how they may work together?",
            "url": "https://www.reddit.com/r/ethereum/comments/upcizd/best_writeupsvideos_on_roll_ups_and_how_they_may/",
            "author": "dopef123",
            "created_utc": 1652515432.0,
            "score": 4,
            "num_comments": 10,
            "subreddit": "ethereum",
            "selftext": "I listen to a ton of bankless and am an engineer and have some idea off rollups, data sharding, etc.\n\nWhat I'm a little confused by right now are things I've heard of like being able to withdraw your assets from L2s if they crash? Or how liquidity can be quickly moved between L2s?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8k7hk2",
                    "author": "MinimalGravitas",
                    "score": 3,
                    "created_utc": 1652522946.0,
                    "response": "I think the interoperability/composability challenge of using multiple rollups is still an area that is going to need a lot of further work.\n\nStarkWare have a couple of concepts that they are working on, dAMM and ... something else I can't remember!\n\nWill try to find the link for you, don't have the bookmark on my phone.\n\n\nEDIT: here you go\n\nhttps://medium.com/starkware/damm-decentralized-amm-59b329fb4cc3\n\n\nhttps://medium.com/starkware/the-road-to-l2-interoperability-718ff69ec822\n\nPlease don't take this as an endorsement specifically of StarkWare, they just happen to be the team who's articles on this topic I have saved!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rz8nc",
                            "author": "dopef123",
                            "score": 1,
                            "created_utc": 1652670785.0,
                            "response": "Thanks! A good bankless video randomly came out about it too.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8kjoy9",
                    "author": "Perleflamme",
                    "score": 2,
                    "created_utc": 1652531951.0,
                    "response": "Each L2 is a network. But the L1 never sees such network. Rather, to the L1, L2s are just smart contracts on the L1 with people publishing for you a condensed summary of transactions that happen on the L2.\n\nAs such, the L2 can ensure in its smart contract that there are functions you can call so that you can withdraw your funds from it yourself, even if the L2 network stops working (like, if they're being coerced and censored or similar events).\n\nThough, you'd also need to be aware that, as L2s are still in development, most of them are still being upgradable. This means there's a vulnerability where the contract can be changed to remove (or worse) such functions normally letting you withdraw your funds.\n\nThat's why it's important to see the risks associated with each specific L2 before joining.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8kyown",
                    "author": "AESTHTK",
                    "score": 2,
                    "created_utc": 1652539840.0,
                    "response": "Here you go:\n\nhttps://polynya.medium.com/\n\n✌️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8k7g7m",
                    "author": "smithydickson",
                    "score": 1,
                    "created_utc": 1652522913.0,
                    "response": "Uncle Tobys makes some delicious roll-ups.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}