{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyb2b5",
            "title": "I've posted in this subreddit before about this, but it's official now apparently, crypto shillers in NY are gonna have to disclose their interests in what they shill...",
            "url": "https://v.redd.it/86wtgr57gu191",
            "author": "chase_mike86",
            "created_utc": 1653581328.0,
            "score": 77,
            "num_comments": 15,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia2ywih",
                    "author": "CryptoAnarchyst",
                    "score": 20,
                    "created_utc": 1653582168.0,
                    "response": "Wow... what a freaking concept... tell the truth about why you're shilling shitcoins that no one else wants.\n\nAbout freaking time.\n\nI believe in crypto, but I believe in greed of people more... and the greed of people will be the downfall of crypto adoption",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia3lrm8",
                            "author": "Perleflamme",
                            "score": 7,
                            "created_utc": 1653591313.0,
                            "response": "I guess it doesn't apply to JP Morgan, obviously. As always, laws for ones, not for others.\n\nIt's a law specifically intended to rig the rules in favor of a small number of individuals.\n\nThe shilling will continue, simply not from the same people.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5wh7p",
                                    "author": "was437",
                                    "score": 1,
                                    "created_utc": 1653632285.0,
                                    "response": "This might already exist in that world.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia607pf",
                                            "author": "Perleflamme",
                                            "score": 2,
                                            "created_utc": 1653635238.0,
                                            "response": "If so, this law has absolutely no impact, since they're still making several announcements going one way or another depending on what suits them the most, without any legal problems. It's not a law preventing pumps & dumps, clearly, which means it's completely useless.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia3jnba",
                    "author": "TenBillionDollHairs",
                    "score": 7,
                    "created_utc": 1653590446.0,
                    "response": "This is great. Good regulation is good. \n\nNo one even minds if someone shills something they own, *as long as that's disclosed.* Owning something shows you have stake in it, and if you're getting paid, you're at least staking your reputation. \n\nThere's no shame in an honest, by the books plug. just let consumers know.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia3m9tn",
                            "author": "Perleflamme",
                            "score": 3,
                            "created_utc": 1653591522.0,
                            "response": "How is it good regulation? JP Morgan will still announce crypto is worthless or crypto is the future each time they've invested in it or sold and waiting for it to increase its price. \n\nIt's a law intended to rig the game for the benefit of a small number of individuals. Only they should rejoice.\n\nI understand the frustration of seeing many shills on social platforms all the time. But this kind of regulation won't help the ecosystem, quite the contrary.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia3nl7b",
                                    "author": "TenBillionDollHairs",
                                    "score": 2,
                                    "created_utc": 1653592064.0,
                                    "response": "JP Morgan might not be able to announce that anymore since they by this point are likely invested in several tokens. Plus I think Dimon finally ate shit and said he was wrong.\n\nBut I don't think it only applies to shillers who live in NY (though that's not small). It matters because YouTube loads in NY, which means people in NY can go after YouTubers and other media shillers if they don't disclose. When things happen in tiny jurisdictions, sometimes people will try to do end-runs or demonetize themselves just there, but you don't really want to demonetize a state of 20 million people.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia3o9iz",
                                            "author": "Perleflamme",
                                            "score": 4,
                                            "created_utc": 1653592345.0,
                                            "response": "I won't expect JP Morgan to follow this rule, really. If anything, I'd expect the rule to be written or interpreted in such a way that it only hurts YouTubers or people for whom being an influencer is the main job. I could be surprised, but it's quite rare for this kind of laws not to be lobbied so that they discreetly exempt biggest players.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia2wvsb",
                    "author": "chase_mike86",
                    "score": 3,
                    "created_utc": 1653581375.0,
                    "response": "Here the bill btw from Assemblyman Clyde Vanel: https://assembly.state.ny.us/leg/?default\\_fld=&leg\\_video=&bn=A09029&term=0&Summary=Y&Floor%26nbspVotes=Y&Text=Y",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3nrs1",
                    "author": "Conscious-Proof-8309",
                    "score": 1,
                    "created_utc": 1653592139.0,
                    "response": "Lindsay Lohan has exited the chat",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia79naf",
                    "author": "CoinHODL",
                    "score": 1,
                    "created_utc": 1653664235.0,
                    "response": "Thought Crime, Crime Speak yall really think censorship will solve problems 🤨. This law is Orwellian & stupid what happened to you \"Cypher Punks\" in ETH Reddit ur turning into dutiful Statist slime smh.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}