{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqta58",
            "title": "How the LUNA disaster helps ETH.",
            "url": "https://www.reddit.com/r/ethereum/comments/uqta58/how_the_luna_disaster_helps_eth/",
            "author": "cryptopiratematerial",
            "created_utc": 1652698908.0,
            "score": 3,
            "num_comments": 4,
            "subreddit": "ethereum",
            "selftext": "I know ETH will take care of itself but with Luna’s collapse, it pretty much eliminates a major competitor to ETH and increases fear amongst investors in other supposed “ETH killers.” We saw this in relation to how much the prices of SOL, NEAR, AVAX etc tanked in relation to ETH. A fearful market potentially also makes it more difficult for these competitors to catch up with ETH the market leader. What’s everyone’s thoughts on this?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8t1ih7",
                    "author": "HeavyMommyMilkers",
                    "score": 2,
                    "created_utc": 1652699690.0,
                    "response": "Eth #1 baby",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8t1tpk",
                    "author": "Perleflamme",
                    "score": 2,
                    "created_utc": 1652699901.0,
                    "response": "Luna wasn't a competitor at all, regardless of whatever people claimed about it. \n\nBesides, competition is good. It's what ensures markets thrive. You shouldn't celebrate on the death of a competitor, as it brings complacency over the remaining competitors. That's not how best products are provided. \n\nAnd finally, a fearful market is an ineffective market. Frightened investors aren't rational, even with their own knowledge.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8t18du",
                    "author": "Simple_Yam",
                    "score": 1,
                    "created_utc": 1652699491.0,
                    "response": "My thoughts is that hundreds of thousands of people lost money and that you shouldn't celebrate it as if it pumped your portfolio in any meaningful way.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8t1okq",
                            "author": "cryptopiratematerial",
                            "score": 1,
                            "created_utc": 1652699806.0,
                            "response": "Cryptocurrency is a blood sport. Unfortunately not every investor thinks or sees circumstances that way.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uqti3d",
            "title": "Central Bank of Norway doing CBDC experiments with Ethereum",
            "url": "https://twitter.com/MKjrstad/status/1526155015932547072",
            "author": "sandakersmann",
            "created_utc": 1652699696.0,
            "score": 180,
            "num_comments": 56,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8vpjxw",
                    "author": "leduck1",
                    "score": 10,
                    "created_utc": 1652742025.0,
                    "response": "daily reminder to never use a cbdc",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8t1uue",
                    "author": "vernes1978",
                    "score": 20,
                    "created_utc": 1652699922.0,
                    "response": "I can't help but notice two things:  \nThat account is not verified.  \nMarius Kjærstad doesn't work for the Bank of Norway.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8t3c7g",
                            "author": "Maswasnos",
                            "score": 13,
                            "created_utc": 1652700906.0,
                            "response": "Not sure why either of those things matter since they link to a post on the actual bank's website. It absolutely looks legit, although these types of partnerships seem to happen all the time and I'm still not aware of any CBDC running on ETH (or running at all).",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8t3yq6",
                                    "author": "vernes1978",
                                    "score": 1,
                                    "created_utc": 1652701303.0,
                                    "response": "I'll be honest, I didn't even click the link.  \nToday I learned there is such a thing as too much paranoia.  \nI also hope someone now puts a bit more value to that \"verified\" logo.  \n(unless I'm not their target audience)",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8wfxyp",
                                    "author": "user260421",
                                    "score": 1,
                                    "created_utc": 1652755180.0,
                                    "response": "The article mentions that it's only for a small amount of employees, so nothing official - and it's happening on a rollup, so not on the L1.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8yh63t",
                                            "author": "ItsAConspiracy",
                                            "score": 1,
                                            "created_utc": 1652801852.0,
                                            "response": "Almost everything will be on rollups. After sharding, on-chain transactions will still be around 40 per second, and zkrollups will be over 100K/sec.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i90y1r0",
                                                    "author": "user260421",
                                                    "score": 2,
                                                    "created_utc": 1652840411.0,
                                                    "response": "That's getting me really excited!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8wft9s",
                            "author": "user260421",
                            "score": 2,
                            "created_utc": 1652755112.0,
                            "response": "[Here's](https://www.norges-bank.no/en/news-events/news-publications/News-items/2021/2021-04-22-dsp/) their official publication\n\n\nEdit: That post is from last year, but here's one from 3 days ago, it's in Norwegian unfortunately. norges-bank.no/bankplassen/arkiv/2022/eksperimentell-testing-av-digitale-sentralbankpenger/",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8vv6m6",
                            "author": "heart_mind_body",
                            "score": 4,
                            "created_utc": 1652744753.0,
                            "response": "Not sure how I can prove this, but this is in fact true. Marius Kjærstad does not, but the author of the blog-post Peder Østbye does in fact work for The Norwegian Central bank.\n\nSource: Worked as a blockchain consultant in the Norwegian fintech space. I've met Peder on several occasions, as well as had discussions with the central bank about CDBCs. They've  been looking into this for several years since the usage of physical cash in Norway is extremely low.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8t2d65",
                            "author": "oceanside13",
                            "score": -12,
                            "created_utc": 1652700259.0,
                            "response": "And Norway can't afford the gas fees",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8t3ety",
                                    "author": "Maswasnos",
                                    "score": 9,
                                    "created_utc": 1652700952.0,
                                    "response": "Of course they can. Gas fees are negligible for ETH rollups.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8t2gt9",
                                    "author": "vernes1978",
                                    "score": 3,
                                    "created_utc": 1652700326.0,
                                    "response": "Explain how that matters regarding the validity of the news?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8t2u4o",
                                            "author": "oceanside13",
                                            "score": -12,
                                            "created_utc": 1652700574.0,
                                            "response": "The average person isn't using JP Morgan's network because it doesn't make economic sense, so why would a country use it when the rest of the world will be using xrpl.... Btw where is the source of this \" news\"",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8t3ax6",
                                                    "author": "vernes1978",
                                                    "score": 7,
                                                    "created_utc": 1652700883.0,
                                                    "response": "I notice a severe lack of the word \"gas fees\" in your \"explanation\".  \n  \n> Btw where is the source of this \" news\"  \n\nI hope you're not asking me.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8t3vph",
                                                            "author": "oceanside13",
                                                            "score": -8,
                                                            "created_utc": 1652701251.0,
                                                            "response": "Have you used ETH? It's practically unusable on its own it's so expensive, I didn't think that needed clarification. But there you go.\nI'm not asking you for the source, clearly you didn't post that non sense. Not here to argue w maxis, just stating my opinion. I exited my ETH position awhile ago. ETH makes no sense to me and looking like there could be some legal issues down the road.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8t4dsa",
                                                                    "author": "vernes1978",
                                                                    "score": 6,
                                                                    "created_utc": 1652701574.0,
                                                                    "response": "> Not here to argue w maxis\n\nMy name is not maxis, it's vernes, you can omit the number.  \nUnless you're adding more jargon while you're explaining your previous jargon.  \nIn which case I am happy to tell you I am willing to keep this discussion going if you really just want someone to talk to.  \n  \n>  I exited my ETH position awhile ago.  \n\nI didn't ask and I only have a vague idea what this means.  \n\n> ETH makes no sense to me and looking like there could be some legal issues down the road.\n\nAh, well at least now I have an idea where you stand on the subject.  \n  \nI am only here to poke about the validity, but as someone else mentioned, there is a link that leads to what I guess is the official bank of norway website.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8t5ovi",
                                                                            "author": "oceanside13",
                                                                            "score": -1,
                                                                            "created_utc": 1652702389.0,
                                                                            "response": "Well I stand corrected, Im shocked because it doesn't make any sense to me.  But noone cares. Have a wonderful day. I wish you the best in your crypto endeavours.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i8v9pml",
                                                                    "author": "majorpickle01",
                                                                    "score": 2,
                                                                    "created_utc": 1652735013.0,
                                                                    "response": ">Have you used ETH? It's practically unusable\n\nIt's literally the most used chain in the crypto space. The whole reason it's expensive is becuse it's being used like crazy",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i8vhvgu",
                                                                    "author": "sargontheforgotten",
                                                                    "score": 2,
                                                                    "created_utc": 1652738520.0,
                                                                    "response": "Then why are you even here? If you think Eth is useless and unusable then fine. Go on with your life and do something productive.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8vi9n1",
                                                                            "author": "oceanside13",
                                                                            "score": 1,
                                                                            "created_utc": 1652738694.0,
                                                                            "response": "I didn't realize this was the ETH sub, Im sorry if I offended, I unjoined. I have no business here.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8yxq17",
                    "author": "Either-Advantage",
                    "score": 2,
                    "created_utc": 1652808569.0,
                    "response": "I would hope that this is happening on a rollup like Polygon Hermez or the upcoming avail and not on the L1. The fees to interact with your bank might be astronomical if it's being done otherwise. Non-the less this is an incredible step forward for web3. Ethereum continues to remain king.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tn67m",
                    "author": "Feisty-Kitchen2760",
                    "score": 5,
                    "created_utc": 1652711247.0,
                    "response": "bullish",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vnr76",
                    "author": "conformmustconform",
                    "score": 3,
                    "created_utc": 1652741183.0,
                    "response": "time to sell all my ETH for BTC.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vrynk",
                            "author": "harpocryptes",
                            "score": 4,
                            "created_utc": 1652743175.0,
                            "response": "Why would a CBDC (or anything) built as a L2 on top of ethereum affect ETH in any other way than drive up its demand, and therefore its value?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vtj1v",
                                    "author": "conformmustconform",
                                    "score": 2,
                                    "created_utc": 1652743935.0,
                                    "response": "BTC is not just about price go up. \n\nI use and love Bitcoin because of the ability to STEP OUT of the corrupt Central banking system.\n\nfuck supporting any NWO/Great reset agenda driven, CBDC Shitcoin.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8vua07",
                                            "author": "harpocryptes",
                                            "score": 5,
                                            "created_utc": 1652744303.0,
                                            "response": "I understand. I probably did not express this well, but my point was that ethereum is just the technology here, you don't need to ask permission to build something on top of it. In the same way, if a country built a CBDC as a L2 on top of the bitcoin network, I don't think that would make you want to sell your BTC ;)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8vv9tp",
                                                    "author": "conformmustconform",
                                                    "score": 1,
                                                    "created_utc": 1652744798.0,
                                                    "response": "thanks for clarifying your point. I didn't even read the article before commenting. . . but I have been shifting away from ETH for quite a while. since the talk of moving to POS network gathered pace. \n\nI am mining ETH. so for a long time I have been both pro BTC and ETH... there ae a few things that don't particularly sit well with me though. the premine, the POS merge/swap, some of Vitalik comments, some of the ETH bro's in the community.... just a mixture of little things that are all adding up. \n\nbasically there is a reason why Bitcoin maximalism exists. and as much as I hope a lot of ALT coins succeed. the ONLY one of any true importance for the future of humanity is Bitcoin.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8vwsnn",
                                                            "author": "harpocryptes",
                                                            "score": 2,
                                                            "created_utc": 1652745555.0,
                                                            "response": ">there is a reason why Bitcoin maximalism exists\n\nSo at least you agree with some of Vitalik's comments ;)\n\nAll the best!",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8wachd",
                                                                    "author": "conformmustconform",
                                                                    "score": 1,
                                                                    "created_utc": 1652752347.0,
                                                                    "response": "oh I agree with a LOT of what he says. thats why I started mining ETH in the first place. \n\nhowever.  I just don't have enough faith in ETH to trust it with my and my families entire net worth. \n\n1-5% is fine I guess...\n\nBTC on the other hand?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8x88mg",
                                            "author": "mcgravier",
                                            "score": 2,
                                            "created_utc": 1652775043.0,
                                            "response": "And I thought it was about leveling the field for everyone and banks are welcome as much as everyone else",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i91tu35",
                    "author": "8uwotm8",
                    "score": 1,
                    "created_utc": 1652861797.0,
                    "response": "https://standforhealthfreedom.com/action/who-grab/\r  \n\r  \nhttps://news.crunchbase.com/news/cbdcs-the-good-the-bad-and-the-ugly/\r  \n\r  \nma(rti(al(la(w,loc(kdo)wn,u(Npea)cek(ee)peri(nva)si(on october and before this year",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vqfhi",
                    "author": "saigatenozu",
                    "score": -2,
                    "created_utc": 1652742432.0,
                    "response": "damn, thought it read CDBs (crytpodickbutts)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}