{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzsr6i",
            "title": "To the guy in the top post about the Polygon bridge. It is completely 100% safe you just gotta check the mainnet",
            "url": "https://www.reddit.com/r/ethereum/comments/uzsr6i/to_the_guy_in_the_top_post_about_the_polygon/",
            "author": "pihip2",
            "created_utc": 1653761095.0,
            "score": 38,
            "num_comments": 4,
            "subreddit": "ethereum",
            "selftext": "# I'm well aware that he had his problem fixed but some people (especially newcomers) read titles and instantly believe them.\n\nSomeone in the top post is warning everyone in all caps about Polygon’s bridge but in reality, he’s just looking in the wrong place.\n\nThe Polygon/Ethereum bridge is completely safe. Yeah, agreed. I don’t know if you’ve used this bridge before you but what basically happens is that the ETH HAS to be burned on Polygon before it gets released and you’re capable of withdrawing it on the mainnet.\n\nYou basically just panicked over nothing pal. Next time all you have to do is go to [bridge-explorer.polygon.technology](https://bridge-explorer.polygon.technology) and just press the confirm exit button. It's that simple.\n\nSome are pointing out that his post was just FUD but I think its just a genuine mistake honestly. I’m a big Polygon supporter but I still think it’s good that we see posts like these from time to time so that more people can get educated about this.",
            "stickied": false,
            "comments": [
                {
                    "id": "iae6t3a",
                    "author": "degrudv",
                    "score": 2,
                    "created_utc": 1653799611.0,
                    "response": "Thanks",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}