{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "n5wjjq",
            "title": "Wonderful explanation of what's Ethereum.",
            "url": "https://v.redd.it/thu0irm4qex61",
            "author": "jdemdarifali11",
            "created_utc": 1620266343.0,
            "score": 4109,
            "num_comments": 597,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "gx3ykim",
                    "author": "doesitreallymatter26",
                    "score": 39,
                    "created_utc": 1620271075.0,
                    "response": "So it’s not a wonderful explanation of ethereum",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx3wqjn",
                    "author": "ilaunchpad",
                    "score": 27,
                    "created_utc": 1620270055.0,
                    "response": "So if facilitator(Uber) is removed out of the equation then how am I going to find service(Uber) ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gx3yojv",
                            "author": "valschermjager",
                            "score": 35,
                            "created_utc": 1620271138.0,
                            "response": "Exactly.  That’s why the example is weak.  Uber isn’t taking a cut because they’re greedy punx.  They’re taking a cut because they stand up and maintain a value-add service. And that costs money and talent to do.\n\nI mean, they are greedy-punx, but they actually do deserve at least some of it. ;-)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx3zsj1",
                                    "author": "ilaunchpad",
                                    "score": 7,
                                    "created_utc": 1620271774.0,
                                    "response": "Yeah this example is very weak. I\nLike he omits the main point of the video. Also, why is everyone agreeing that this explains ethereum well?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx411mk",
                                            "author": "Hanzburger",
                                            "score": 2,
                                            "created_utc": 1620272501.0,
                                            "response": "It doesn't explain ethereum well, but everyone is also wrong in stating that an app like this can't exist as open source. There ethereum network removes a ton of overhead in terms of data management and coordination. Since its an open sourced dapp you'd be able to do away with the whole legal team and just slap on an \"it is up to the user to abide by their local laws\" disclaimer. Everything else comes from open source and yes it's that easy. I've contributed to a number of open sourced projects and you're also invested in an open source projects where many contribute for free.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx4aqdg",
                                                    "author": "poopcasso",
                                                    "score": 3,
                                                    "created_utc": 1620279020.0,
                                                    "response": "Show me an Uber, snap, insta, YouTube, door dash, eBay, Amazon or whatever service that is open source. Exactly.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gx5fubn",
                                                            "author": "Hanzburger",
                                                            "score": 2,
                                                            "created_utc": 1620309607.0,
                                                            "response": "Bruh, crypto is still in the early stages, but I can promise you they'll appear. There's already a few implementations at Youtube and Twitter though.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "gx5cdwa",
                                                            "author": "Syg",
                                                            "score": 1,
                                                            "created_utc": 1620307964.0,
                                                            "response": "Even if you make it open source, for let's say YouTube, you need hardware, marketing maintenance, content auditing etc etc etc. Open source has nothing to do with this discussion",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gx5g1o5",
                                                                    "author": "Hanzburger",
                                                                    "score": 1,
                                                                    "created_utc": 1620309702.0,
                                                                    "response": "I've never seen any linux ads yet it's doing well. Open source projects are driven by the users. They build it because they want to use it, and because of that the usage is spread by word of mouth to others in that field/whatever.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "gx61w4z",
                                                                            "author": "Syg",
                                                                            "score": 1,
                                                                            "created_utc": 1620319084.0,
                                                                            "response": "I understand that, but the point I'm trying to make is that ethereum is not the same as opensource. It's generalized infrastructure that you can build services on. Some of these will be open source projects and some will be commercial. \n\nBecause of the very open nature, many applications will be stacked and use each other's smart contracts\n\nEdit: also...Linux doesn't run on thin air. If you run it yourself..you have to pay for the hardware. You can't open source a platform like YouTube and then everyone just runs it on their own hardware",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "gx487ro",
                                                    "author": "valschermjager",
                                                    "score": 1,
                                                    "created_utc": 1620277156.0,
                                                    "response": "good points.  hadn’t thought about the app being stood up open source and maintained by the community/users.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "gx4coep",
                                                    "author": "tabac-en-paris",
                                                    "score": 1,
                                                    "created_utc": 1620280496.0,
                                                    "response": "Technically it could be built on an open source platform. Practically it’s unlikely to succeed, because businesses arent just a piece of technology, they have huge quantities of other activity around it like marketing, customer service, product management etc.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gx5gfo1",
                                                            "author": "Hanzburger",
                                                            "score": 1,
                                                            "created_utc": 1620309883.0,
                                                            "response": "Marketing is typically done by word of mouth with open source projects since it's built by the users themselves. PMs aren't necessarily needed, but if they are it's pretty easy to find someone willing to donate a few hours here and there for that. Customer service is typically done by good documentation and a community on standby willing to help.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gx631gv",
                                                                    "author": "tabac-en-paris",
                                                                    "score": 1,
                                                                    "created_utc": 1620319564.0,
                                                                    "response": "> Marketing is typically done by word of mouth with open source projects since it's built by the users themselves\n\nthat might work for tech based activity, but consumer focused stuff usually needs something quite different - hence the lack of large open source projects that deal with consumer services. \n\n> Customer service is typically done by good documentation and a community on standby willing to help\n\nit's difficult to imagine how anyone could imagine this for literally anything consumer related.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "gx67chw",
                                                                            "author": "Hanzburger",
                                                                            "score": 1,
                                                                            "created_utc": 1620321350.0,
                                                                            "response": "I don't see that much different than how things are now. They have troubleshooting info and then the option to speak with support.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "gx67ocr",
                                                                                    "author": "tabac-en-paris",
                                                                                    "score": 1,
                                                                                    "created_utc": 1620321487.0,
                                                                                    "response": "How can you possibly imagine that volunteers will deal with consumer grade customer service enquiries? That is never going to happen in a million years. You are so far away from reality it’s hard to know what to say.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "gx6aqmk",
                                                                                            "author": "Hanzburger",
                                                                                            "score": 1,
                                                                                            "created_utc": 1620322760.0,
                                                                                            "response": "Do you not follow any projects? Go look at doge's discord for example. There's always questions and a bunch of people willing to spend their day helping them out. Sure, you might not be willing, but people are.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "gx543aq",
                                    "author": "Perleflamme",
                                    "score": 2,
                                    "created_utc": 1620303488.0,
                                    "response": "Yes, they're providing a service. As a centralized third-party. Blockchains can provide a decentralized third-party, which means several providers have to directly compete for the money, which drives the prices closer to the costs and helps find the best prices for each quality level.\n\nIf Über takes so much, it is precisely because they are providing a service as a centralized entity within a high friction market and with competitors who are even worse than them in terms of market disruption (like some sort of expensive patents to have the right to be a taxi, in some locations). A better service would be to replace them by a decentralized third-party.\n\nAnd actually, it's exactly what blockchains do: miners are a decentralized third-party handling the cost of computation and competing against each others so that the cheapest ones are favored over the more expensive ones, to the point market prices are closer to cost. The same with Golem services. Or LivePeer ones. And so on.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gx4fps1",
                            "author": "davinci_covid",
                            "score": 1,
                            "created_utc": 1620282951.0,
                            "response": "Probably same as Bitwarden, Ubuntu, etc, open source projects",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gx62q46",
                            "author": "Syg",
                            "score": 1,
                            "created_utc": 1620319434.0,
                            "response": "Like I said elsewhere... The facilitator is never removed. Somebody is building stuff and needs to put effort into bringing demand and offerings together, provide a compelling user experience etc. They also need to get paid for all that effort.\n\nYou could however build a more provable fair Uber, or use blockchain based governance to include network participants to be part of the decision making process",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gx3sbli",
                    "author": "MatthewDesousa",
                    "score": 350,
                    "created_utc": 1620267736.0,
                    "response": "Don’t you still pay fees to make a transaction with Ethereum, I’m all for Ethereum and I think it is great. I’m a new investor and I still don’t think I’ve completely wrapped my head around this. Smart contracts are great and I get that they remove the middle man, and it’s DeFi but if the whole point is to eliminate the fees, and we still pay gas fees to complete Ethereum transactions then doesn’t it somewhat defeat the purpose? I’d love for this to be clarify, someone knowledgeable please help!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gx3u10t",
                            "author": "Njoiyt",
                            "score": 33,
                            "created_utc": 1620268619.0,
                            "response": "Ideally the fees would be negligible. Fees are high now, but should drop again once scaling solutions meet the massive demand.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx3ufx1",
                                    "author": "MatthewDesousa",
                                    "score": 9,
                                    "created_utc": 1620268836.0,
                                    "response": "Yes, I also heard Eth 2.0 will have lower fees?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx3xv7g",
                                            "author": "Njoiyt",
                                            "score": 10,
                                            "created_utc": 1620270679.0,
                                            "response": "There are quite a few things that are being developed in parallel to reduce fees and increase speeds. I recommend checking out the roadmap Vitalik created.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx3yz5w",
                                                    "author": "MatthewDesousa",
                                                    "score": 3,
                                                    "created_utc": 1620271305.0,
                                                    "response": "Definitely will do, thank you, you have no idea how nice it is too know which direction to head, I want to do research but I never know exactly what to research lol",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gx40spb",
                                                            "author": "Njoiyt",
                                                            "score": 4,
                                                            "created_utc": 1620272355.0,
                                                            "response": "Not a problem. If you're familiar with discord, there are a lot of active Ethereum servers with people willing to help. Following the big hitters (Vitalik Buterin/Danny Ryan/Justin drake to name a few) on twitter is good for updates as well.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gx40yzq",
                                                                    "author": "MatthewDesousa",
                                                                    "score": 2,
                                                                    "created_utc": 1620272457.0,
                                                                    "response": "Oh really, I never knew. I’m a pc guy so I’m definitely familiar with it I’ll have to join one of the servers.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "gx4169k",
                                                                            "author": "Njoiyt",
                                                                            "score": 3,
                                                                            "created_utc": 1620272577.0,
                                                                            "response": "https://discord.gg/vSFrZDAh\n\nEthstaker is a great one.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "gx41h3i",
                                                                                    "author": "MatthewDesousa",
                                                                                    "score": 1,
                                                                                    "created_utc": 1620272757.0,
                                                                                    "response": "Wicked! Just joined.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "gx41nvi",
                                                                                            "author": "Njoiyt",
                                                                                            "score": 2,
                                                                                            "created_utc": 1620272870.0,
                                                                                            "response": "The community is pretty solid. Welcome aboard.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "gx411o7",
                                                            "author": "Njoiyt",
                                                            "score": 2,
                                                            "created_utc": 1620272501.0,
                                                            "response": "This is one of the most up-to-date thing I've watched. https://youtu.be/7ggwLccuN5s",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "gx4333d",
                                            "author": "Joe_Doblow",
                                            "score": 2,
                                            "created_utc": 1620273728.0,
                                            "response": "Look up truebit ;)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "gx3tyji",
                            "author": "tbjfi",
                            "score": 495,
                            "created_utc": 1620268584.0,
                            "response": "It's not about eliminating fees. It's about eliminating the middle man controlling data and controlling how that data is used (shared, sold, used to advertise to you, lost, withheld from you, etc) . Also known as third party involvement or counter party risk. Since the middle man is no longer there, the rent seeking behavior and other abuses of your data don't happen any more, and a side effect of this is that things should be cheaper (less fees).",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx3w11e",
                                    "author": "ChubZilinski",
                                    "score": 25,
                                    "created_utc": 1620269667.0,
                                    "response": "So using his example. If the middle man is gone in this case Uber. How do I find and order an Uber? Don’t I still need a middleman to offer the service to find it?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx3xcr8",
                                            "author": "tbjfi",
                                            "score": 29,
                                            "created_utc": 1620270396.0,
                                            "response": "Uber would be replaced with smart contracts that matched users to drivers and handled payments. There are some edge cases that get hairy, like how do you resolve disputes between driver and rider when there is no way to codify resolution rules that depend on real-world data (like if the driver never showed up, but said he did.)  \n\n\nThere could be reputation systems that might alleviate some of these issues, or insurance or credit score type systems that reimburse for disputes.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx427o4",
                                                    "author": "hehethattickles",
                                                    "score": 12,
                                                    "created_utc": 1620273193.0,
                                                    "response": "Is the issue that some Uber execs are getting filthy rich? Isn’t that just getting replaced by the developers who load up on their own tokens before the DAO, meaning we still have a concentration of wealth in the hands of a few (maybe even more pronounced)?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gx42tip",
                                                            "author": "Joe_Doblow",
                                                            "score": 4,
                                                            "created_utc": 1620273563.0,
                                                            "response": "Which developers would get rich from a smart contract Uber sitch?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gx42yx4",
                                                                    "author": "hehethattickles",
                                                                    "score": 7,
                                                                    "created_utc": 1620273655.0,
                                                                    "response": "Whoever develops the Dapp with the NewUbertokens or whatever. They will have a ton of NewUbertokens free or on the cheap before they are released to the public",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "gx51noq",
                                                                            "author": "bretstrings",
                                                                            "score": 6,
                                                                            "created_utc": 1620301961.0,
                                                                            "response": "This is the thing I have yet to be seen addressed.\n\nPeople say the technology reduces transaction costs, but traditional transaction costs don't exist due to tech, they exist due to middlemen providing a service.\n\nSome simple contracts may be able to be handled completely automated, but any transaction of complexity will require the middlemen anyway.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "gx5sp8l",
                                                                                    "author": "brentwilliams2",
                                                                                    "score": 1,
                                                                                    "created_utc": 1620315229.0,
                                                                                    "response": "Exactly.  There still needs to be an interface for matching up drivers and riders, as well as other features like ratings/etc.  So who is creating that?  If it is not for free, then are they not the new middlemen?  And at that point, the blockchain is still relegated to essentially payment processing.  I just don't understand.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "gx5vg2n",
                                                                                            "author": "bretstrings",
                                                                                            "score": 1,
                                                                                            "created_utc": 1620316377.0,
                                                                                            "response": "Oh well, Im buying in for now anyway because there is still money to be made whether its a ponzi or not",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "gx6wn3k",
                                                                                            "author": "TheRadMenace",
                                                                                            "score": 1,
                                                                                            "created_utc": 1620331777.0,
                                                                                            "response": "They create it as an app and hold 10% of the tokens that control the ecosystem. Similar to how the founder of a company holds x% of their stock. The point is to make the service an automated ecosystem where everyone is incentivised to behave. Somewhat like turning a digital service into a commodity",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "gx6wcfe",
                                                                                    "author": "TheRadMenace",
                                                                                    "score": 1,
                                                                                    "created_utc": 1620331654.0,
                                                                                    "response": "What part of the service do you believe can't be automated? Lots of things that seem too complicated to automate can be incentivised by forcing workers to hold stake in the service. If they drop below a 50% rating, take money from them.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "gx72nsu",
                                                                                            "author": "bretstrings",
                                                                                            "score": 3,
                                                                                            "created_utc": 1620334246.0,
                                                                                            "response": "Dispute resolution",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "gx445ff",
                                                                            "author": "Joe_Doblow",
                                                                            "score": 5,
                                                                            "created_utc": 1620274396.0,
                                                                            "response": "Why not just trade fractions of eth for the ride?",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "gx4ow01",
                                                            "author": "reddetacc",
                                                            "score": 1,
                                                            "created_utc": 1620291350.0,
                                                            "response": ">Is the issue that some Uber execs are getting filthy rich? Isn’t that just getting replaced by the developers who load up on their own tokens before the DAO, meaning we still have a concentration of wealth in the hands of a few (maybe even more pronounced)?\n\nThe enrichment of uber executives and the stuffing of a bloated corporate entity to control what is basically a taxi app are a good example of rent seeking.\n\nIf a dev front runs his own app or launch, it's different because that's just akin to investing in yourself. He also doesn't leech off every NewUberInc transaction in perpetuity like current uber does.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "gx6vbm2",
                                                            "author": "TheRadMenace",
                                                            "score": 1,
                                                            "created_utc": 1620331245.0,
                                                            "response": "The point is Uber can be remade as a nonprofit where the only cost is the actual cost to execute the code on the ethereum network. The drivers can still choose their own price to give the ride, but the 15% fee that the Uber execs get is replaced with a transaction cost. Eth transaction costs go down in the long term but Uber has no incentive to reduce their costs. So basically drivers can make more and people getting rides can pay less. \n\nIf you want to get really fancy, you can control the entire system with its own token, released on the ethereum network. This means that the USD price can be the same as before, but drivers are essentially paid in stock. The drivers could sell this stock for USD immediately, or they can hold it if they believe more people will use the system in the future. Riders, drivers, and investors can all benefit from increased use of the Blockchain version of Uber. Unlike the current Uber, where drivers make peanuts and the execs are billionaires. \n\nReduced costs and better incentives than real Uber.\n\nAlso, your comment basically assumes that ether price wont go up more and that everyone who will profit has already profited, which I don't think is true.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "gx40c2v",
                                                    "author": "ChubZilinski",
                                                    "score": 3,
                                                    "created_utc": 1620272085.0,
                                                    "response": "Hmm interesting. Thanks for response",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "gx4b6af",
                                                    "author": "RealBiggly",
                                                    "score": 2,
                                                    "created_utc": 1620279347.0,
                                                    "response": "Well the driver can be tracked via GPS. That would be easy to program.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gx52wuy",
                                                            "author": "tbjfi",
                                                            "score": 2,
                                                            "created_utc": 1620302760.0,
                                                            "response": "GPS coordinates (or any external data) can't be included in smart contracts without a trusted party injecting them.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gx59skz",
                                                                    "author": "RealBiggly",
                                                                    "score": 2,
                                                                    "created_utc": 1620306660.0,
                                                                    "response": "That's what oracles are for, right?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "gx5ach6",
                                                                            "author": "tbjfi",
                                                                            "score": 2,
                                                                            "created_utc": 1620306946.0,
                                                                            "response": "That is the idea of oracles, yes.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "gx42of4",
                                                    "author": "Joe_Doblow",
                                                    "score": 0,
                                                    "created_utc": 1620273476.0,
                                                    "response": "How do you know the driver isn’t a killer murderer ex con?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gx4d3r1",
                                                            "author": "Mirved",
                                                            "score": 8,
                                                            "created_utc": 1620280834.0,
                                                            "response": "How do you know he isn't now?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gx51ukr",
                                                                    "author": "bretstrings",
                                                                    "score": 0,
                                                                    "created_utc": 1620302086.0,
                                                                    "response": "Companies have basic id verification processes that reduces the risk, even if it doesn't remove it entirely.  \n\nFurthermore, if something goes wrong I can sue a registered company with assets instead of some broke random stranger.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "gx54qxz",
                                                                            "author": "Mirved",
                                                                            "score": 3,
                                                                            "created_utc": 1620303876.0,
                                                                            "response": "Ah it says in someones ID if he is a killer?\n\nAnyways that killer could just order an uber kill the driver and take over and drive of the next one. Stop living in fear for extreme unlikely situations.\n\nUber drivers are self employed so you cant sue uber if something goes wrong. You need to sue that broke random stranger cab driver.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "gx7d9te",
                                                    "author": "Icicestparis10",
                                                    "score": 1,
                                                    "created_utc": 1620338791.0,
                                                    "response": "Everything you just said shows how complex human interactions works; I don’t know if smart contracts will be able to solve those issues",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "gx40o96",
                                            "author": "Ok_Doughnut_6718",
                                            "score": 5,
                                            "created_utc": 1620272282.0,
                                            "response": "No someone who is a self employed taxi or taxi with a company who is within the blockchain will receive the request and then be paid in eth when the ride is complete...effectively the smart contact is the middle man or the if/then statement",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx51x6d",
                                                    "author": "bretstrings",
                                                    "score": 1,
                                                    "created_utc": 1620302133.0,
                                                    "response": "And then when something goes wrong you don't have anyone to sue except some random broke stranger.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gx6pt0m",
                                                            "author": "Ok_Doughnut_6718",
                                                            "score": 1,
                                                            "created_utc": 1620329021.0,
                                                            "response": "I get where ur going and yes for things of larger importance yes the smart contact has to be pretty smart to prevent issues but in this example if ur sueing over a taxi ride then something must have gone catastrophically wrong and u prolly have bigger problems as a result",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gx72v3t",
                                                                    "author": "bretstrings",
                                                                    "score": 1,
                                                                    "created_utc": 1620334330.0,
                                                                    "response": ">sueing over a taxi ride then something must have gone catastrophically wrong and u prolly have bigger problems as a result \n\nThat's the whole point, the contract can't handle things going catastrophically wrong.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "gx7yh61",
                                                                            "author": "Ok_Doughnut_6718",
                                                                            "score": 1,
                                                                            "created_utc": 1620349247.0,
                                                                            "response": "Again I do see ur point but believe certain things can be mitigated for just such an occasion and if not then that may be one downside to going defi...cefi give u that safety net but also has a lot of downside...defi doesnt have those downsides but if something does go catastrophically wrong then there is no insurance. I personally dont know enough about any particular platform or ecosystem to say what may be some failsafes to that problem so I cant comment furthur on it",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "gx3uakr",
                                    "author": "MatthewDesousa",
                                    "score": 13,
                                    "created_utc": 1620268759.0,
                                    "response": "Ok now this makes much more sense, I just wasn’t sure what the appeal acc was. Really appreciate the explanation man!",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gx45jv4",
                                    "author": "ChanDroid_",
                                    "score": 11,
                                    "created_utc": 1620275313.0,
                                    "response": "Ethereum is just a protocol layer. You would still need an application or service running on it (ebay or uber ON the ethereum chain).\n\nJust like the Internet is used to communicate all services to pay for the ebay / uber transfer. That one is free btw :)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx5mjrz",
                                            "author": "CB_Ranso",
                                            "score": 1,
                                            "created_utc": 1620312592.0,
                                            "response": "I think this is where people get kind of lost. Correct me if I'm wrong, but I think people get confused since most see Ethereum as just a currency. I'm sure some people think it's literally just another Bitcoin. But in reality it's a network of nodes that can operate and execute smart contracts and the currency or \"fees\" is actually Ether. And Ether or \"fees\" are the incentive for people to get involved and exchange those contracts between other users (Gas).\n\nPeople also ask how is the guy supposed to get an Uber or how am I supposed to find the Rubix cube seller. On Ethereum you can run decentralized apps or dApps as well that could bring the two parties together.  I believe there's even insurance applications that have emerged.  \n\nI imagine many people back before internet also said many of the same things like \"Well how are we gonna do this?\" or \"How is this going to work then?\"",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "gx4ozya",
                                    "author": "devinecreative",
                                    "score": 5,
                                    "created_utc": 1620291456.0,
                                    "response": "And unfortunately, fees have NOT been cheaper depending on which perspective you take. I haven't touched crypto in a while, but yesterday I jumped on uniswap to do an exchange and the gas fees were about $18...... Cheaper some days I get it but the upfront experience is painful sometimes and prevents me from actually doing a transaction. I don't want to have to keep checking the gas station for optimising *when* to transact. I want to *now*. Sometimes I feel this is not what I was promised for using crypto. How much longer in development and accessibility do I have to wait for the vision of clean, instant, and almost zero fee transactions?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx52hdd",
                                            "author": "bretstrings",
                                            "score": 5,
                                            "created_utc": 1620302490.0,
                                            "response": "Because transactions costs don't come from tech like people are pretending.\n\nThey come from middlemen providing a valuable service.\n\nThat will still exist regardless of which transaction system you use.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "gx54d7w",
                                            "author": "tbjfi",
                                            "score": 1,
                                            "created_utc": 1620303650.0,
                                            "response": "We are very new to this ecosystem. Things are being tried for the very first time every day. It's very exciting but there are growing pains. It will get better. Look at how painful it was to send an email in 1994.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "gx3vsks",
                                    "author": "shishkabaab",
                                    "score": 13,
                                    "created_utc": 1620269542.0,
                                    "response": "Wouldn’t you still need to advertise your products on some platform? If I’m selling rubix cubes, wouldn’t it be easier to advertise through Amazon/ebay and have them handle shipping for me? I don’t see how ethereum eliminates that.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx4a5ed",
                                            "author": "Brad_Beat",
                                            "score": 11,
                                            "created_utc": 1620278577.0,
                                            "response": "Honestly, people thinking that smart contracts are going to eliminate well stablished companies like Amazon or eBay are just deluded. Those companies will probably just implement smart contracts on eth or whatever blockchain to improve their operations and provide a simpler interface for the user. \nThere’s no new world order coming, those companies are already investing in some blockchain solution that better fits their bill.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "gx3wzvi",
                                            "author": "Hodlonfordearlif3",
                                            "score": 8,
                                            "created_utc": 1620270200.0,
                                            "response": "You’re referring to a centralized marketplace where people come, meet, exchange goods or services?  This can be decentralized as well.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx44c7i",
                                                    "author": "ChefWetBeard",
                                                    "score": 3,
                                                    "created_utc": 1620274516.0,
                                                    "response": "How can you decentralize the marketplace without sacrificing liquidity?\n\nI might can sell my widget for $100 to another widget collector. But how long am I willing to wait for them? If a widget enthusiast offers me $80, I might feel inclined to sell, creating an opportunity cost. The value of the marketplace is more in timing/efficiency than it is in matchmaking, in my opinion.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "gx52kh6",
                                                    "author": "Hodlonfordearlif3",
                                                    "score": 1,
                                                    "created_utc": 1620302546.0,
                                                    "response": "It has nothing to do with sacrificing liquidity. \n\nIt just means that a centralized marketplace can’t decide to unlist you as a seller for not handing over 30% of your revenue. Example Apple App Store v. Epic games.\n\nYou can still access the marketplace ledger, except that it’s now publicly stored on the blockchain.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "gx3w7gn",
                                            "author": "SeriousTweets",
                                            "score": 8,
                                            "created_utc": 1620269764.0,
                                            "response": "I'm curious of this too. Maybe DAOs (digital autonomous organizations) will take over and replace Ebay and Uber and execute smart contracts on ETH? Not sure how this would be solved otherwise. Maybe pay with ETH on Ebay? But that way they still get our data... great question",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "gx3wo8q",
                                            "author": "tbjfi",
                                            "score": 4,
                                            "created_utc": 1620270019.0,
                                            "response": "What if ebay/amazon decides to stop allowing people to sell rubix cubes?  \n\n\nWhat if you created a huge following on Ebay with thousands of 5 star reviews, but then your audience stopped using Ebay and started using Amazon, you would have to start over with zero reviews because you can't bring your data with you.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx42yfp",
                                                    "author": "Joe_Doblow",
                                                    "score": 3,
                                                    "created_utc": 1620273648.0,
                                                    "response": "Rubixcubez.com",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "gx3ypyx",
                                    "author": "SourceHouston",
                                    "score": 5,
                                    "created_utc": 1620271161.0,
                                    "response": "Fees will be higher based on your comment. The companies get paid in hidden data, so the transaction is cheaper than it should be. Going to a more private scenario would create a more costly transaction.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx3zo5f",
                                            "author": "londongastronaut",
                                            "score": 5,
                                            "created_utc": 1620271705.0,
                                            "response": "Companies also have to pay for massive overheads like buildings and salaries that a DAO doesn't.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx4aotu",
                                                    "author": "Brad_Beat",
                                                    "score": 2,
                                                    "created_utc": 1620278988.0,
                                                    "response": "All you’re telling me is that companies will benefit greatly from using a DAO. That shrinks their costs but doesn’t kill them, probably makes them more profitable.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gx4x5rl",
                                                            "author": "londongastronaut",
                                                            "score": 4,
                                                            "created_utc": 1620298835.0,
                                                            "response": "Companies don't use DAOs, they are an alternative to a company.\n\nUniswap is a DAO, Coinbase is a company.\n\nThey are both exchanges that do a ton of volume (uniswap actually does more volume daily than coinbase). \n\nUniswap employs 13 people and returns the profits from its enterprise to its users. \n\nCoinbase employs like 2000 people and keeps the profits.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "gx40476",
                                    "author": "Spike716",
                                    "score": 3,
                                    "created_utc": 1620271959.0,
                                    "response": "You realize that with Ethereum all of your data is public, right? So now _anyone_ can use the data to advertise to you :)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx53h5f",
                                            "author": "tbjfi",
                                            "score": 3,
                                            "created_utc": 1620303111.0,
                                            "response": "Using encryption you can make dapps that, while the data is public to view, are impossible to learn about the data without an appropriate private key. \n\nFor example, you could store encrypted medical data about yourself on the chain (or on ipfs or elsewhere) and give a private key to a doctor to view only the days they need access to. And you could then have that doctor add additional information about you encrypted with your own keys. Like maybe the doctor prescribes you some medicine and adds that to your record. Then you send a private key to the pharmacist and they verify that the doctor prescribes the medicine and offers you the medicine. This sort of stuff is absolutely life changing to developing countries that don't have infrastructure like this already.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx5wbb3",
                                                    "author": "Spike716",
                                                    "score": 1,
                                                    "created_utc": 1620316731.0,
                                                    "response": "Absolutely. There are definitely cases like this where encryption would solve the issue. But there are also a lot of cases where the actual data itself doesn't matter as much as knowing who is taking which contract actions and when. And that's not something you can encrypt unless you build a VM on top of eth",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "gx7mg8s",
                                                    "author": "Syg",
                                                    "score": 1,
                                                    "created_utc": 1620343118.0,
                                                    "response": "You are kind of on the right track but not exactly. First off, you never ever ever want to store privacy sensitive data on a blockchain, even encrypted. You have to assume the encryption can be broken in the future. So data is stored off chain, by the user.\n\nYou also don't share your private key with the doctor. The moment you do, they can assume your identity in the same vain someone can access your eth wallet if they have access to your private keys. If the doctor wants to add info to your medical file, they sign it with their private key and send it to you",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gx82lrq",
                                                            "author": "tbjfi",
                                                            "score": 1,
                                                            "created_utc": 1620351370.0,
                                                            "response": "You are correct. I simplified for the sake of brevity. \n\nYou don't actually share your private key. You make a new key (possibly one the doctor already holds) that has access to the data you want to share.\n\nAnd yes you could hash the data and store only the hash.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gx8tdgk",
                                                                    "author": "Syg",
                                                                    "score": 1,
                                                                    "created_utc": 1620367831.0,
                                                                    "response": "The flow is something like this:\n\nYou share your identifier (public key) with your doctor. The one with the private key (you) is the only one that can prove ownership of that public identifier. The doctor takes the data (i.e. 'negative on covid') and your identifier and signs it with his private key. \n\nThe result is a signed credential, uniquely tight to your identifier, provable signed by the doctor's identity. \n\nThis credential is then stored by you. The problem with hashes here is twofold: \n1. They are one-way, so you can't get the original data if you only have the hash\n2. They can be brute forced. \n\nAnything on chain is there forever so you have to account for massive compute power in the future to break encryption",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "gx44f3d",
                                    "author": "Theoretical_Action",
                                    "score": 1,
                                    "created_utc": 1620274570.0,
                                    "response": "Why does it matter though if social media will continue to exist? We're not going to be able to blockchain TikTok and Snapchat so our data is still getting pretty massively exposed and sold elsewhere.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx557ew",
                                            "author": "tbjfi",
                                            "score": 1,
                                            "created_utc": 1620304146.0,
                                            "response": "Why can't we decentralize and encrypt social media? Storage and stuff will get cheaper over time",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "gx489q2",
                                    "author": "MerryWalrus",
                                    "score": 1,
                                    "created_utc": 1620277196.0,
                                    "response": "...so you expect everyone to write their own smart contracts? Including what happens in all the exception cases?\n\nOr some developer to do it out of the goodness of their heart?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx54lng",
                                            "author": "tbjfi",
                                            "score": 1,
                                            "created_utc": 1620303789.0,
                                            "response": "A Dev will do it as part of a business model. Devs want to make money on this of course. Freedom and control is not free. Facebook and Gmail etc are free because they use your data to make money. It's a tradeoff.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx574h4",
                                                    "author": "MerryWalrus",
                                                    "score": 1,
                                                    "created_utc": 1620305237.0,
                                                    "response": "Agreed.\n\nBut then we end up in exactly the same place as today but with processes being run on more expensive/wasteful hardware.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gx5aa1r",
                                                            "author": "tbjfi",
                                                            "score": 1,
                                                            "created_utc": 1620306911.0,
                                                            "response": "If the cost is too great, don't use it for that use case. Blockchain solves a small set of problems very well. It's not a cure all.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gx5d9o5",
                                                                    "author": "MerryWalrus",
                                                                    "score": 1,
                                                                    "created_utc": 1620308402.0,
                                                                    "response": "I don't disagree.\n\nHowever it is still being touted as a Panacea, usually by people wanting to build their influencer credentials.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "gx4jtgd",
                                    "author": "michaelb1",
                                    "score": 1,
                                    "created_utc": 1620286522.0,
                                    "response": "The video was about the fees though. Remember, he gave the fat pink stuffed bears the fees.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gx4k07t",
                                    "author": "_www_",
                                    "score": 1,
                                    "created_utc": 1620286694.0,
                                    "response": "The whole video is about eliminating middlemen fees.\n\nYet in ethereum *you still have a middleman charging fees*, it's **the miner** and transactions are freaking costly ( ~12$ / average Tx )\n\nTHIS WHOLE VIDEO MISSES IT'S POINT and opens a way to  harsh backdraft.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gx4ywoa",
                                    "author": "nodeocracy",
                                    "score": 1,
                                    "created_utc": 1620300124.0,
                                    "response": "But a new governance layer appears that is mostly weighted by whales. So there is consolidation in decision making",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gx5brf5",
                                    "author": "Themanimnot",
                                    "score": 1,
                                    "created_utc": 1620307652.0,
                                    "response": "Yessss!!\n\nIt’s about putting the power into the hands of the people. With this new tech; Eth, cardano and others to come, we will no longer need these big tech companies, we can build our own platforms, owned  by the people for the people. \n\nTaxi drivers will be able to make a good living, a great living even. The cost of doing business or rather the amount of money you could earn will go up dramatically.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gx68nkg",
                                    "author": "Beggarsfeast",
                                    "score": 1,
                                    "created_utc": 1620321894.0,
                                    "response": "It’s not just about controlling data, as in computer data. Not sure if that’s what you meant. Before people start to understand the real world uses of smart contracts on blockchain, they need to understand the idea that the financing of debt and risk is just as lucrative as paying for services. Ask anyone in the housing bubble who had their mortgages(another version of data) used as collateral buy the banks issuing them. Their contract was used on the banks ledger to give them leverage. Decentralization of a ledger should in theory lessen the risks of these types of market manipulations. I think? This is my way of thinking along with the points you brought up.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gx3vlqh",
                            "author": "roland23",
                            "score": 12,
                            "created_utc": 1620269442.0,
                            "response": "We pay gas for transactions essentially as tips for the miners (soon to be validators) of the network. The network itself is decentralized and nobody owns it so some people pay higher electric bills to keep it alive. As an incentive for doing so we pay them a bit with every transaction. Gas fees go up during points of congestion as people want their transactions prioritized so pay more and naturally those people who run nodes in the network are incentivized to take the highest they can. basically there are still fees but not because a bank or Uber is being greedy, it's so others will enable you to directly transfer money to another person (or any of the other things you can do with crypto)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx3w5mp",
                                    "author": "LordWeatherby",
                                    "score": 5,
                                    "created_utc": 1620269736.0,
                                    "response": "I’m trying to buy an NFT fit 30$ and I’m trying to decide if the 37$ gas fee is worth it. I hope for 3 and 5$ gas fees.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx3w9y7",
                                            "author": "roland23",
                                            "score": 4,
                                            "created_utc": 1620269801.0,
                                            "response": "Yeah it's a high gas fee for sure but with EIP-1559 and L2 it will come down so it's a temporary problem",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx3wpik",
                                                    "author": "LordWeatherby",
                                                    "score": 3,
                                                    "created_utc": 1620270038.0,
                                                    "response": "It’s already down a bunch from last month. I hope it goes down further otherwise small transactions will be better on other coin. If the transaction is worth a 30 or 100$ gas fee I get it.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "gx3xhmf",
                                            "author": "Hodlonfordearlif3",
                                            "score": 2,
                                            "created_utc": 1620270471.0,
                                            "response": "Would you still buy it if it was $300?\nAnd would the gas fees be worth it then?\nI’m sure there’s a happy equilibrium somewhere.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx3xww6",
                                                    "author": "LordWeatherby",
                                                    "score": 2,
                                                    "created_utc": 1620270705.0,
                                                    "response": "Oh absolutely there is a point that makes it worth it. Right now gas would equal tax for a 300$ purchase. But eventually you may still have to pay tax on certain transactions if there is significant financial gain.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gx3yko1",
                                                            "author": "Hodlonfordearlif3",
                                                            "score": 2,
                                                            "created_utc": 1620271077.0,
                                                            "response": "Never thought of that... first you get taxes, then you get gassed.  \n\nDeath and taxes          .....(and gas)",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gx3zqqv",
                                                                    "author": "LordWeatherby",
                                                                    "score": 2,
                                                                    "created_utc": 1620271745.0,
                                                                    "response": "Lol. Yup. I'm sure avoiding taxes with crypto is a thing but \"they\" will figure it out sooner or later.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "gx52tuz",
                                                                            "author": "bretstrings",
                                                                            "score": 1,
                                                                            "created_utc": 1620302709.0,
                                                                            "response": "Its not even hard to figure out. The transactions are transparent so all the govt has to do is run a bot to collect the data and apply the taxes.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "gx3vzcp",
                                    "author": "MatthewDesousa",
                                    "score": 2,
                                    "created_utc": 1620269642.0,
                                    "response": "Yes, this is something I learned about yesterday!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gx485ah",
                            "author": "manly_",
                            "score": 5,
                            "created_utc": 1620277106.0,
                            "response": "You still need to pay transactional fees, but realize that fees are required conceptually, as otherwise nothing prevents people from spamming/clogging the network with free transactions. The difference between paying Ethereum and paying eBay/PayPal/uber is that in an Ethereum contract you can completely eliminate service fees and replace them with transaction fees. Ethereum has scaling plans which will, in a few years, increase between 100x and 1000x the capacity, which should translate into an equivalent reduction in transaction fees. There’s also layer 2 solutions in the work, which allow scaling beyond this but at different costs (this gets really technical quick, but all solutions have different sacrifices made)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx4b423",
                                    "author": "MatthewDesousa",
                                    "score": 1,
                                    "created_utc": 1620279303.0,
                                    "response": "Thank you, very informative!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gx56r53",
                            "author": "GrilledCheezzy",
                            "score": 3,
                            "created_utc": 1620305030.0,
                            "response": "The point is not to eliminate fees it is to eliminate the middlemen. This is honestly a terrible explanation but it’s a difficult concept to explain. You have to pay fees because a miner is being rewarded for processing your transaction. I think a better explanation along the same lines would be if the Uber was like a self driving electric car where you had to pay for the energy used to take you to your destination and the route the car takes and/or the code that controls the driving is the smart contract and the electricity used in the car is the ethereum fee.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx5ao7d",
                                    "author": "MatthewDesousa",
                                    "score": 1,
                                    "created_utc": 1620307111.0,
                                    "response": "Yes and this is much clearer, this is something I think I grasped much better before the video, all though after I watched it and seen the praise OP gave for the video lead me to believe the advantage to eth was about fees, which I guess In away it is, trying to eliminate service fees and solely have transaction fees.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gx6idin",
                            "author": "TheRadMenace",
                            "score": 3,
                            "created_utc": 1620325882.0,
                            "response": "I'm going to put this explanation in terms of ethereum 2.0, the upgrade that is already up and running but hasn't been implemented yet ( planned for later this year but we will see)\n\nEssentially ethereum lowers the cost of the fee to a 100% market based rate. eBay has to pay a CEO, board of directors, HR department, accounting department, ect, and has to make a profit on top of paying for these costs.  Eth replaced all of those business costs with \"ethereum stalkers\", or people who maintain the ethereum network in exchange for getting paid in inflation. There is no profit / loss statement for ethereum itself, just an inflation rate and a burn rate (a small amount of eth is destroyed on each exchange, acting somewhat like a stock buyback and returning some money to investors). \n\nThe cost has a few benefits in itself. #1 it provides incentives for the stakers (workers for the eth network) to maintain the network. #2 secures the network, since to hack the Blockchain you need 51% of the money, #3 stops people from spamming the network like they do on the normal internet, since spam would cost them money, #4 properly aligns incentives between users and the workers and the investors for the eth network. You are the product on services like google / twitter / Facebook, so those companies incentives are to get as many users as possible and then slowly screw them over with more ads and stuff. \n\nYou gotta think of eth as digital oil. Essentially you burn oil to run your car, oil itself is a commodity where anyone could buy some oil and create a product or usecase with it. Ethereum is a digital commodity where anyone can buy it and use it to create their own product or usecase around it. \n\nNot sure if this helps but it's how I think about it",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx7nmyd",
                                    "author": "Syg",
                                    "score": 2,
                                    "created_utc": 1620343704.0,
                                    "response": "This is incorrect. Stakers and miners secure the network and they get rewarded for that. You are correct on that part.\n\nA company deciding to build a decentralized eBay that runs on ethereum still has an HR department, CEO and everything you mentioned. Eth doesn't come with any build in services, it's a protocol that allows you to build stuff on top of it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx7ow0f",
                                            "author": "TheRadMenace",
                                            "score": 1,
                                            "created_utc": 1620344337.0,
                                            "response": "I'm talking about building a dapp on top of eth\n\nhttps://ethereum.org/en/dapps/",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx8s0sn",
                                                    "author": "Syg",
                                                    "score": 1,
                                                    "created_utc": 1620366772.0,
                                                    "response": "Yes, that's what I mean by companies building on top of ethereum. Those are dapps. An EBay dapp still has a CEO, hr department etc. \n\nI think I might be missing your point",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "gx7owu2",
                                                    "author": "dadbot_3000",
                                                    "score": 1,
                                                    "created_utc": 1620344349.0,
                                                    "response": "Hi talking about building a dapp on top of eth\n\nhttps, I'm Dad! :)",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "gx4g0ce",
                            "author": "BornToBeHwild",
                            "score": 2,
                            "created_utc": 1620283191.0,
                            "response": "This video makes it sound like decentralization offered by Ethereum makes a service cheaper, which is not true. Fees still need to be paid, just to a different party as you pointed out.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gx5hg2v",
                            "author": "superradguy",
                            "score": 2,
                            "created_utc": 1620310346.0,
                            "response": "With Eth 2.0 moving to proof of stake soon, the gas fees will be much much cheaper",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gx3vjj2",
                            "author": "Zachincool",
                            "score": 3,
                            "created_utc": 1620269409.0,
                            "response": "EIP 1559",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx3vqwv",
                                    "author": "MatthewDesousa",
                                    "score": 2,
                                    "created_utc": 1620269518.0,
                                    "response": "I’ve read this a few time, could you explain what it actually means?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx3vsl9",
                                            "author": "Zachincool",
                                            "score": -15,
                                            "created_utc": 1620269542.0,
                                            "response": "No you can look it up sorry",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx3w24b",
                                                    "author": "MatthewDesousa",
                                                    "score": 10,
                                                    "created_utc": 1620269683.0,
                                                    "response": "No worries, completely understandable as it must be a deeper and complex idea that may not be easily explained, if it’s not well that’s ok too lol.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gx3yti0",
                                                            "author": "SourceHouston",
                                                            "score": 5,
                                                            "created_utc": 1620271216.0,
                                                            "response": "They are trying to eliminate fees to miners. If it goes through we’ll see what the effect on the chain security remains",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gx52yfm",
                                                                    "author": "bretstrings",
                                                                    "score": 1,
                                                                    "created_utc": 1620302787.0,
                                                                    "response": "How will that address transaction fees?\n\nThat only reduces the cost \"creating\" the currency, not its trade.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "gx5klee",
                                                                            "author": "c0horst",
                                                                            "score": 2,
                                                                            "created_utc": 1620311741.0,
                                                                            "response": "It won't address transaction fees. EIP1559 will drive the price of ETH up by making it scarcer and potentially deflationary, but it won't change anything with transaction fees.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "gx3zzji",
                                                            "author": "londongastronaut",
                                                            "score": 2,
                                                            "created_utc": 1620271885.0,
                                                            "response": "Not the person you're responding to. His reply was unnecessarily rude but you really are better off doing your own research on this.\n\nIt doesn't always mean lower fees, but it does mean more predictable fees and the whole idea really is more complex than can be explained easily on reddit.\n\nThere was a good bankless podcast on this with Justin Drake that you can Google to understand more. If you have an hour to spare, it's worth the listen.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gx40bo9",
                                                                    "author": "MatthewDesousa",
                                                                    "score": 4,
                                                                    "created_utc": 1620272079.0,
                                                                    "response": "Thank you very helpful, and yes idk if you could sense the tone in my comment back to him lol. I really appreciate the reply tho and the information!",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "gx41pr8",
                                                                            "author": "londongastronaut",
                                                                            "score": 4,
                                                                            "created_utc": 1620272901.0,
                                                                            "response": "Tbh if he cant explain what it is, I'm glad he didn't attempt to. There's a ton of misinformation on what it actually does.\n\nI just looked up the podcast, and my bad it's not with Justin Drake it's with Hasu.\n\nFind it here:\n\nhttps://bankless.libsyn.com/website/58-eip-1559-hasu",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "gx41rm2",
                                                                                    "author": "MatthewDesousa",
                                                                                    "score": 3,
                                                                                    "created_utc": 1620272931.0,
                                                                                    "response": "Thanks!",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "gx4xtij",
                                                            "author": "BecauseYouAreMine",
                                                            "score": 2,
                                                            "created_utc": 1620299339.0,
                                                            "response": "This video explained it pretty well for me. Can definitely recommend the whole channel if you want to dive deeper into ethereum and defi\n\n[https://www.youtube.com/watch?v=MGemhK9t44Q](https://www.youtube.com/watch?v=MGemhK9t44Q)",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gx66fsz",
                                                                    "author": "MatthewDesousa",
                                                                    "score": 1,
                                                                    "created_utc": 1620320974.0,
                                                                    "response": "Woah just watch that video, what an incredible explanation, sub to the channel and definitely plan on using it as a source thanks so much man!",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "gx6dejk",
                                                                            "author": "BecauseYouAreMine",
                                                                            "score": 2,
                                                                            "created_utc": 1620323843.0,
                                                                            "response": "No worries, happy to help!",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "gx3w1ll",
                            "author": "Cam_Ron21",
                            "score": 1,
                            "created_utc": 1620269675.0,
                            "response": "EIP1559 I believe will burn 70% of fees. The other 30% goes to ETH stakers that secure the network",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx3w4n9",
                                    "author": "MatthewDesousa",
                                    "score": 1,
                                    "created_utc": 1620269721.0,
                                    "response": "Oh woah this sounds great!",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gx46uav",
                                    "author": "Joe_Doblow",
                                    "score": 1,
                                    "created_utc": 1620276180.0,
                                    "response": "What do you think about truebit?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gx3v1eu",
                    "author": "birddropping",
                    "score": 13,
                    "created_utc": 1620269146.0,
                    "response": "Curious, there are also certain benefits to having a middle man such as accountability. Poor and unsatisfactory services can be reported, bad actors can be downvoted and penalised, customer service can stand in the gap and mediate between parties. How will this work in a decentralised system?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gx5d2nq",
                            "author": "Syg",
                            "score": 1,
                            "created_utc": 1620308306.0,
                            "response": "As said somewhere else..all decentralized apps have a company behind them that provide these services.\n\nBut we are still in phase 1 of this new model. DAO's which are essentially decentralized company's give voting power to their users for instance. Aragon is also developing a decentralized court. \n\nIt's going to be a long transition, but it can bring a lot more transparency and 'power' to the people actually using the system instead of being at the mercy of a company that can change the terms and conditions as they see fit",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gx3smrj",
                    "author": "valschermjager",
                    "score": 81,
                    "created_utc": 1620267897.0,
                    "response": "Great job. Nice video. I have a question about the first sentence.\n\n>> “Ethereum is a cryptocurrency”\n\nThis is false... (right?)\n\nEthereum is not a cryptocurrency.  Ethereum is a blockchain platform that provides smart contract capability.  Many solutions can be, and have been, developed and implemented on this platform—Ether (a cryptocurrency) is one those.  Other crypto currencies are also built on the Ethereum platform.\n\n**Is this right?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gx3u6ye",
                            "author": "ColtraneBlueNile",
                            "score": 69,
                            "created_utc": 1620268706.0,
                            "response": "Ethereum is a blockchain platform and $ETH is the cryptocurrency for Ethereum. So it is a platform with its own cryptocurrency",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx3wiyb",
                                    "author": "RonPaulConstituENT",
                                    "score": 25,
                                    "created_utc": 1620269938.0,
                                    "response": "And ETH is the “gas” that runs ethereum right? It pays the blockchain mangers to keep running the network?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx3wz8q",
                                            "author": "Vacremon2",
                                            "score": 11,
                                            "created_utc": 1620270190.0,
                                            "response": "Correct!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx3xr7h",
                                                    "author": "RonPaulConstituENT",
                                                    "score": 15,
                                                    "created_utc": 1620270617.0,
                                                    "response": "Sweet. I’m slowly but surely understanding more and more. Also why I wanna keep investing more in ETH than Bitcoin since ETH is actually a commodity and not just a store of value.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gx41thk",
                                                            "author": "Vacremon2",
                                                            "score": 6,
                                                            "created_utc": 1620272961.0,
                                                            "response": "Ethereum is a triple point asset! Read more here:\n\nhttps://newsletter.banklesshq.com/p/-4-ether-the-triple-point-asset",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "gx42qtn",
                                                    "author": "cjbrigol",
                                                    "score": 1,
                                                    "created_utc": 1620273517.0,
                                                    "response": "So eth is use and ethereum is ebay?? Oh no!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "gx3wvbq",
                                            "author": "valschermjager",
                                            "score": 1,
                                            "created_utc": 1620270128.0,
                                            "response": "That I don’t know. I’m still learning. Hopefully someone will weigh in on that.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "gx3w68m",
                                    "author": "valschermjager",
                                    "score": 5,
                                    "created_utc": 1620269745.0,
                                    "response": "Yeah, that’s what I thought, thanks.\n\nThing is, the first two examples given in the video involve *paying* for something with currency, so it risks missing the point by possibly having the viewer infer that it’s a payment platform.  You can use smart contracts on Ethereum without involving any currency payment in either direction.  In fact, when some payment is involved in the contract, it doesn’t even have to be Ether.  I mean, it can be, because like you said, Ethereum is also the blockchain behind Ether/$ETH.\n\nI mean, the video was great, very nice work.  I’m just concerned that leading with “Ethereum is a cryptocurrency” (not really), and the only tangible examples given involve payment of some currency (not really), it risks misleading the viewer on two of the most fundamental parts of what Ethereum is.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gx3tdrn",
                            "author": "rasmapes",
                            "score": 10,
                            "created_utc": 1620268287.0,
                            "response": "That makes sense. Thank you for that breakdown. I've never really understood it. I just know its important so I buy it haha",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx3wqd9",
                                    "author": "valschermjager",
                                    "score": 6,
                                    "created_utc": 1620270052.0,
                                    "response": "Ha! Yeah me too. ;)\n\nBut what you said is an awesome example of contrasting these two ideas:\n\n1) Using the Ethereum blockchain to create and process a smart contract.\n\n2) Buying (or investing) in Ether/$ETH for spending (or hodl’ing)\n\nThese two ideas seem to overlap a lot less than I originally thought, and quite frankly don’t have to overlap at all if you don’t want them to.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gx4fczo",
                            "author": "twinklehood",
                            "score": 3,
                            "created_utc": 1620282660.0,
                            "response": "This is not right. Ether is not developed on ethereum like other coins (generally erc20 contracts).\n\nIt is an integral part of the platform and language of smart contracts - calls in ethereum can be payable in ether, and it is also the gas that runs those contracts.\n\nIt's also part of the incentive model that secures the platform, and the platform depends on it's value for it's security.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx544ku",
                                    "author": "valschermjager",
                                    "score": 1,
                                    "created_utc": 1620303509.0,
                                    "response": "Thanks!\n\nSo, contrary to what I first asserted above, would you say it actually ***is*** correct to say “*Ethereum is a cryptocurrency*”?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx5mcge",
                                            "author": "twinklehood",
                                            "score": 2,
                                            "created_utc": 1620312505.0,
                                            "response": "Hm, fair question. Bitcoin blurred the lines by not having a differentiated name in it's entirety than in it's token.\n\nI guess strictly speaking ethereum is not a cryptocurrency, but ether is _the_ cryptocurrency in the ethereum protocol.\n\nSo probably the better designation would be the cryptocurrency of ethereum. \n\nYou are definitely not doing a disservice by pointing out that there's a difference, but i guess the reality of the difference will go over the head of many.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx6cegi",
                                                    "author": "valschermjager",
                                                    "score": 1,
                                                    "created_utc": 1620323440.0,
                                                    "response": "Thanks.  I didn't want to sound too confident about what I was saying if I was wrong.  (I'm reminded of the saying: \"*If you're going to be smug, first be right.*)\n\n;-)\n\nThat said, you bring up a good point. Bitcoin is both the unit name of the currency as well as the blockchain it runs on.  \n\nAnother difference is that it seems the sole purpose of the Bitcoin blockchain platform is to handle transactions of Bitcoin currrency, while Ethereum is a lot more than just a blockchain handling transactions of Ether.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "gx4a9ej",
                            "author": "gsd6",
                            "score": 1,
                            "created_utc": 1620278662.0,
                            "response": "A crypto currency!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gx3ylox",
                    "author": "SourceHouston",
                    "score": 9,
                    "created_utc": 1620271094.0,
                    "response": "This just shows a lack of understanding of Uber, eBay, and Ethereum\n\nThere are fees for Ethereum\n\nThe reason Uber and eBay take fees is because they provide value, you would not have known about the items or services without said companies, or you would spend all your time looking for it and then negotiating a smart contract. \n\nSmart contracts are basically escrow with a third party intermediary that you program to release funds if xyz is met. Sadly though you often need a third party to do that. So really Ethereum is just minimizing fees on these types of transactions, that is if you have an ironclad smart contract and gas fees don’t kill you",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx3tl8h",
                    "author": "gimpleg",
                    "score": 180,
                    "created_utc": 1620268395.0,
                    "response": "Do you guys think smart contracts are some magical force of nature that get willed into existence? No! they require time and expertise to build and maintain, same as any software system. blockchain apps and services have front ends, marketing teams, legal teams, and all of the actors of a regular company. Uber doesnt take a cut because \"company bad.\" they take a cut because they offer a service with a competitive advantage which people are willing to pay for.\n\nThe more I learn about this community, the more ignorance I discover. Sorry, but ethereum is not a magical secret sauce to an anarcho capitalist utopia.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gx3wmlx",
                            "author": "Scarfaceswap",
                            "score": 43,
                            "created_utc": 1620269993.0,
                            "response": "Yeah I was thinking the same thing. Isn’t there always going to be a middle man? Ethereum doesn’t have its own magical taxi service like Uber that doesn’t charge you fees.. You will still need a company full of people to create these services. The only difference is that they may operate on Ethereum rather than the App Store so to speak. I think there are a lot of amazing uses for smart contracts but I’m not sure this is what it would be used for.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx3xwmx",
                                    "author": "valschermjager",
                                    "score": 10,
                                    "created_utc": 1620270701.0,
                                    "response": "Seems true, that is unless *you* are the developer.  But then that’s like saying if you don’t want to buy a car you can always build your own.  I mean, do able, but not very accessible.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx3zkb3",
                                            "author": "c0horst",
                                            "score": 5,
                                            "created_utc": 1620271644.0,
                                            "response": "Right, but it probably does make it a lot easier to build a platform for that developer. Handling credit card payments and keeping that data secure is a big pain in the ass. Having Ethereum there to facilitate that side of the development work could certainly make it faster to develop a payment system, and using something like USDC as a currency over the network makes payment more secure than a credit card ever could.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx4axm1",
                                                    "author": "poopcasso",
                                                    "score": 2,
                                                    "created_utc": 1620279171.0,
                                                    "response": "Except when you handle payments by using an external service API you're able to take any kind of standardised payments. While handling Ethereum only takes Ethereum. Guess how many uses Ethereum as de facto payment?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gx5v72w",
                                                            "author": "cakemuncher",
                                                            "score": 1,
                                                            "created_utc": 1620316274.0,
                                                            "response": ">While handling Ethereum only takes Ethereum.\n\nNot necessarily. You can have a system that you pay using USD and in the background converts it to whatever coin needs to be used to pay that service, Ethereum in your example.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "gx493hb",
                            "author": "jet2686",
                            "score": 15,
                            "created_utc": 1620277793.0,
                            "response": "Aren't you aware, theres this magical entity called \"Open Source\". Apparently it just builds software, all kinds. Not only does it build, ship, and maintain anything \"code\" but it's also; bug free, super optimized, 100% secure, etc..\n\n/s incase I need to be obvious lol\n\nOn the real though, please don't assume everyone here believes all this stuff. This video is a nice, dumbed down explanation of things ethereum can do. These ideas have been around for a long time now, and shut down pretty hard too for the exact reasons you mentioned (and more).\n\nThere have been some clever usages of smart contracts through out the years, and this is something the community, and the world, is still discovering.\n\nPersonally I'm still waiting for that one use case that makes me say \"ahh yes! This is it!\". In the end though, if things go really well, there might be several of these scenarios. \n\nWith the potential ethereum has, and some creative problem solving, I feel it's just a matter of time.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx53qf7",
                                    "author": "bretstrings",
                                    "score": 6,
                                    "created_utc": 1620303270.0,
                                    "response": "I think SMART CONTRACTS are a great idea and there will absolutely be a place for them in standardized, low-value transactions.\n\nBut the people claiming they will reduce transaction fees across the board seem to not understand where transaction costs come from for traditional currency.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gx5sqkx",
                                    "author": "gimpleg",
                                    "score": 3,
                                    "created_utc": 1620315244.0,
                                    "response": "Yeah, I have participated in some hackathons and I know the core community of developers is absolutely brilliant and passionate. Unfortunately the reddit community is not reflective of that, and I haven't really found a centralized place (which I guess is kind of fitting lol) for more educated discussion aside from various discords.\n\nI'm in the same boat, as a professional software developer the tech is absolutely mesmerizing, but I have yet to see any real game changers. DeFi is close, but it's still all very self-referential. With L2 and potentially the collateralization of real world assets I think we could start seeing some cool things.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gx40dvl",
                            "author": "Hanzburger",
                            "score": 6,
                            "created_utc": 1620272114.0,
                            "response": "I continue ~~stuff~~ contributing to open source projects for free and there's many others like me. Not everybody is out to nickle and dime and milk society for every penny possible.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gx4xr8x",
                            "author": "Outji",
                            "score": 2,
                            "created_utc": 1620299291.0,
                            "response": "The fact that this is a top post on ethereum subreddit just proves your point of how ignorant these people are",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gx41b5g",
                            "author": "Vacremon2",
                            "score": 0,
                            "created_utc": 1620272658.0,
                            "response": "Yes but, this majorly disrupts the ridesharing space. It's unlikely that Uber will still have the opportunity to take 50% of the ride cost when all of the software and network infrastructure can be run on the blockchain. All you would need (theoretically) is a customer support centre.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx43qpr",
                                    "author": "gimpleg",
                                    "score": 4,
                                    "created_utc": 1620274140.0,
                                    "response": "There is just no reason to believe this to be the case. The vast majority of business logic is incredibly poorly suited to the blockchain, where every state change is slow and costs money. If anything, transplanting novel application like a rideshare service are far MORE complex because they require hybrid solutions. Software - even boring, traditional software - is extremely hard to make. That's why people get paid tons of money to make it. Don't get me wrong, I am hopeful that ethereum will be home to some practical applications in the future, especially with layer 2 becoming more accessible. But it's just plain wrong to think blockchain makes writing software easier.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gx4fv9g",
                            "author": "cubemackie",
                            "score": 1,
                            "created_utc": 1620283077.0,
                            "response": "Agree. The more I am exposed to these projects the more it appears to be an echo-chamber. There is no incentive for people to create things if they are not going to be rewarded for it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx52jz9",
                                    "author": "LavoP",
                                    "score": 1,
                                    "created_utc": 1620302537.0,
                                    "response": "Open source is kind of the counterpoint to this argument. People build out sophisticated open source tools and platforms even though they don't directly benefit. There's other reasons to build things. If you provide tools to build things, people will build regardless of whether they get directly rewarded. \n\nEthereum is basically open source money.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gx52d5c",
                            "author": "LavoP",
                            "score": 1,
                            "created_utc": 1620302416.0,
                            "response": "Ethereum provides all the infrastructure and maintenance. Once you deploy your smart contracts, you don't have to do anything to maintain it. It just runs. Sure you need front ends, but that's significantly easier to build, and if it's a simple dapp front end, you can let the community build it and even have different versions (see Yearn for an example of this). Sure the large, complicated protocols need a lot of work to get going, that's why they launch tokens, fund their work, then decentralize. Look at Maker for example. There is no real company actively maintaining it now, all the decisions are made through governance by the token holders. Because of this, you get loans for the \"true\" interest rate, not marked up by banks. \n\nAs the \"money Legos\" keep getting more sophisticated, it becomes easier and cheaper to build cooler and cooler stuff. I have no doubt that open source APIs plus blockchain powered tech will make the next Uber and it'll be a fairer system overall. I do think that's still pretty far off though.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx5rp1f",
                                    "author": "gimpleg",
                                    "score": 2,
                                    "created_utc": 1620314800.0,
                                    "response": ">Ethereum provides all the infrastructure and maintenance\n\nI'm sorry but this is just fundamentally misunderstanding how software is built. Maintenance is not the literal sense of squeezing some lubrication onto squeaky parts every few months. Maintenance is preventing and fixing the inevitable bugs and regressions that arise during active development. It's fixing invalid state or cleaning up data. It's refactoring to pave the way for future expansions. Sure, if you have a dead simple app that never changes or offers new features, your maintenance costs will be very low. But do you really think a product like Uber remains stagnant over 10 years? They are constantly refining the user experience, adjusting to changing regulatory frameworks across dozens of  countries and languages, etc. Uber wouldn't be spending millions every month on software developers if they didn't need to.\n\nMaker, and DeFi in general, is dead simple and cannot be compared to a consumer service like Uber. DeFi is beautifully suited to the blockchain because it's confined to rigid, high value transactions. The only off-chain elements of DeFi are price oracles.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx5sy26",
                                            "author": "LavoP",
                                            "score": 2,
                                            "created_utc": 1620315331.0,
                                            "response": "I develop software every day, so I am not speaking from ignorance. Dev ops is a huge part of software maintenance which does not exist when you are talking about smart contracts. Also, the point of smart contracts is immutability, so once you deploy, you are making the assumption that you won't be changing anything. \n\nI do agree with you, Uber has wayyy more moving pieces than anything on the blockchain right now. I definitely would not call Maker \"dead simple\", it has a lot of moving pieces as well.\n\nHowever, I could see a future where the big pieces of Uber are automated through smart contracts and open source APIs. The marketplace aspect required to connect drivers to passengers in real-time can be handled by blockchain-based tooling (once L2 is working well).",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx6i93q",
                                                    "author": "gimpleg",
                                                    "score": 1,
                                                    "created_utc": 1620325831.0,
                                                    "response": "Contract state history is immutable but logic is not - e.g, openzeppelin's upgradeable proxies. Perhaps youre right that devops is more manageable. Personally I think its unlikely and premature to imagine blockchain development being cheaper in the long run. Just different.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "gx5dwqh",
                            "author": "spirgnob",
                            "score": 1,
                            "created_utc": 1620308709.0,
                            "response": "You're absolutely right. The one advantage in both of these examples is that contracts can be written to guarantee the money is available from the buyer and held by an intermediary (blockchain) until the transaction is complete, then the seller can release the payment to the seller. That would still require a platform to generate those contracts, which would cost money to produce.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gx6knrm",
                            "author": "Backitup30",
                            "score": 1,
                            "created_utc": 1620326843.0,
                            "response": "You are forgetting the part where a lot of that work can be done once with a few iterations and then run like that forever, without any additional support. If its done correctly and works, then it just runs until there is a need for a change.  \n\n\nThis is way different than how IT currently runs, which is not efficient at all.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gx3zjhv",
                    "author": "kdubdub702",
                    "score": 6,
                    "created_utc": 1620271632.0,
                    "response": "Person A: Here is $20 for the cube...\n\nPerson B: Thanks!\n\nEth: The miner fee will be $42.10. The network is heavy right now",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx3tszi",
                    "author": "MeditatePeacefully",
                    "score": 19,
                    "created_utc": 1620268504.0,
                    "response": "Right... that's why DeFi fees and ethereum fees are so low. Oh and everyone is working for free to build and maintain all the services. Look, my portfolio is probably 80% ETH and I strongly believe in it but this is just BS. Even if we move to PoS and keep building, this is utopia imo...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx3u5gi",
                    "author": "Bernie_Lomax69247",
                    "score": 41,
                    "created_utc": 1620268685.0,
                    "response": "This is where I struggle? Someone still has to be the middleman to write the smart contract and build the app for it. They ain’t doing this pro bono. Maybe cheaper, but not free. Middle men seem kinda necessary no matter what.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gx3yhuv",
                            "author": "jet2686",
                            "score": 12,
                            "created_utc": 1620271032.0,
                            "response": "I agree with this.\n\nThe idea of a \"uber on ethereum\" is not new, its been tossed around and shut down pretty hard.\n\nUber provides a value for being the middle man, and that is the orchestration it puts into it. Whether it be logistics, trust, or just pretty apps that are always updated. This list is not exhaustive of course, needless to say there is a lot Uber does as a company that's simply not feasible to build as open source. Not to mention tons of optimizations that can be had if there is a centralized authority..\n\nBottom line, can you achieve Uber on Ethereum? Yes.. yes you can..\n\nIs it feasible? I personally don't think so, at least not in a competitive way.\n\nThat said, yes this video explains what Ethereum can do.. However I feel it misses the true essence of Ethereum in our society and world. Though arguably, I cant put it in much better words, haha.. once this is is conclusively agreed upon we'll know the true value of this platform.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gx3wxo8",
                            "author": "Aierou",
                            "score": 16,
                            "created_utc": 1620270165.0,
                            "response": "Free and open source software is a thing.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx3yy98",
                                    "author": "SourceHouston",
                                    "score": 9,
                                    "created_utc": 1620271291.0,
                                    "response": "Someone has to write the code for the specific smart contract though, these are more bespoke contracts so it’s not like it’s just going to be free",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx404ol",
                                            "author": "Hanzburger",
                                            "score": -7,
                                            "created_utc": 1620271967.0,
                                            "response": "Look around you, they're everywhere",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx4gohz",
                                                    "author": "Greedy-Locksmith-801",
                                                    "score": 6,
                                                    "created_utc": 1620283755.0,
                                                    "response": "I’ve been looking around me for a while and I still don’t see any ethereum smart contracts that enable me to hail a cab easily and securely without paying a middleman. Please help me find these floating free smart contract wonders",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gx5gkwl",
                                                            "author": "Hanzburger",
                                                            "score": 1,
                                                            "created_utc": 1620309950.0,
                                                            "response": "I was referring to free dapps, not uber-like dapps",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "gx4b3b6",
                            "author": "poopcasso",
                            "score": 8,
                            "created_utc": 1620279288.0,
                            "response": "You don't struggle, the video is bad and at best is a paid propaganda ad.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx51she",
                                    "author": "Bernie_Lomax69247",
                                    "score": 3,
                                    "created_utc": 1620302048.0,
                                    "response": "Haha it felt that way, right? I personally feel like nothing is more detrimental to the movement than these low quality shill videos. Anyone with any sense of discernment can see right through it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gx3z356",
                            "author": "Vacremon2",
                            "score": -1,
                            "created_utc": 1620271369.0,
                            "response": "But it will be pro bono because smart contracts are open source. If someone tries to charge for one, someone will copy it and make it free, or as cheap as possible",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx52sho",
                                    "author": "LavoP",
                                    "score": 2,
                                    "created_utc": 1620302685.0,
                                    "response": "People who launched truly novel products on Ethereum and intelligently designed a token are rich beyond belief.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx716tf",
                                            "author": "Vacremon2",
                                            "score": 1,
                                            "created_utc": 1620333639.0,
                                            "response": "I agree, what I said did not exclude that as a possibility. The user of these dapps does not necessarily pay for the developers to become rich, speculators can achieve that outcome.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "gx5bwd0",
                            "author": "Syg",
                            "score": 1,
                            "created_utc": 1620307719.0,
                            "response": "In any blockchain ecosystem there are third parties, they build the protocols, the smart contracts the user interfaces etc.\n\nThe difference is that transactions on the platform are disintermediated and transparent. So the third party doesn't actually have to be involved in the transactions taking place. I pay my Uber driver directly, maybe the smart contract takes a small fee.\n\nSo the money is a thing here, but it gets more interesting with governance. Uber onboards the drivers and customers, they set the 30% fee they take. It's not up to me to decide if this is fair, but an alternate model is to decentralize this governance. A smart contract can be used for payments, but it can also be used to determine what the fee should be in a transparent and democratic way. There's a lot more to it, but I hope you get the point!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx5u35a",
                                    "author": "Silbb",
                                    "score": 1,
                                    "created_utc": 1620315814.0,
                                    "response": "So if Uber allowed you to set the fee would eth be any better?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx616j7",
                                            "author": "Syg",
                                            "score": 1,
                                            "created_utc": 1620318784.0,
                                            "response": "Fees are just an example. Governance decisions can be made of any variation and in an ecosystem system type service like Uber, i do feel that everyone would be better off if more parties would be included in the governance, more transparency and even privacy would be introduced",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "gx63j25",
                                            "author": "Syg",
                                            "score": 1,
                                            "created_utc": 1620319770.0,
                                            "response": "Btw. The way you write this makes this sound like a small thing, but the point is that a middleman could decide to change that 30% to 40% overnight. So if you can remove that option..than yes that would be great.\n\nLet the record show I have nothing against Uber, I'm just trying to demonstrate that the power of a company like Uber in regards to users and drivers can be a problem, as well as a lack of transparency. How do you know rates are fair for instance? Blockchain could help with both these instances",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx67pjs",
                                                    "author": "Silbb",
                                                    "score": 1,
                                                    "created_utc": 1620321501.0,
                                                    "response": "It is a small thing because most customers will just use the cheapest option. If Uber raised their fee and Lyft was cheaper then they would just use Lyft since it provides the same service at a cheaper rate. I don’t really get how ethereum changes that.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gx3xyad",
                    "author": "Capable-Theory",
                    "score": 27,
                    "created_utc": 1620270727.0,
                    "response": "Cringe",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx3vqua",
                    "author": "fturriaf",
                    "score": 13,
                    "created_utc": 1620269517.0,
                    "response": "Explanation is wrong. Ethereum is NOT a cryptocurrency",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gx3yec9",
                            "author": "valschermjager",
                            "score": 6,
                            "created_utc": 1620270978.0,
                            "response": "Exactly.  Kinda rough when the first sentence of the video makes you wince saying “ooo, umm, that’s not right”.  ;-)",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gx4yy5l",
                            "author": "pok3ey3",
                            "score": 1,
                            "created_utc": 1620300152.0,
                            "response": "Ethereum is a cryptocurrency and a network. ETH is the currency used to pay fees on the Ethereum network",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx85791",
                                    "author": "fturriaf",
                                    "score": 1,
                                    "created_utc": 1620352695.0,
                                    "response": "No. Please check https://ethereum.org/en/what-is-ethereum/",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gx42eys",
                    "author": "mrfatbush",
                    "score": 3,
                    "created_utc": 1620273317.0,
                    "response": "How do you prove the uber arrived, or that the journey is completed properly?\n\nHow do you prove your parcel has arrived in the condition you expect?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gx4krts",
                            "author": "bad-john",
                            "score": 4,
                            "created_utc": 1620287400.0,
                            "response": "There is another blockchain called chain link that supplies real world information to block chains. I’m still learning about all this but I’m assuming you could link gps data to solve the problem of proving that the “Uber” showed up and delived you to your destination. Still tons of problems to solve. Idk how you could remedy your parcel example.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gx4h8b6",
                            "author": "Greedy-Locksmith-801",
                            "score": 2,
                            "created_utc": 1620284221.0,
                            "response": "Exactly. People talk about ethereum smart contracts as if there is an all seeing, all knowing ethereum god who in real time decides when contract conditions are met. \n\nIn reality, you would need a third party (read: a middle man) to make these decisions.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gx3u1si",
                    "author": "Smellyjelly12",
                    "score": 7,
                    "created_utc": 1620268631.0,
                    "response": "Okay now explain to me like i'm 5",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gx3vibq",
                            "author": "SmoothOpawriter",
                            "score": 27,
                            "created_utc": 1620269392.0,
                            "response": "You have an orange but want an apple. Your friend Jimmy has an apple but wants an orange. You agree to trade. Without a parent present to watch the exchange and make sure it's fair Jimmy could just beat you up, steal your orange, run away, and eat it. On Etherium blockchain, Jimmy will only get your orange if he gives you his apple, no parent required.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx3w9j1",
                                    "author": "PoorBean",
                                    "score": 7,
                                    "created_utc": 1620269795.0,
                                    "response": "How does the network know if he gave me the Apple?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx3y2ba",
                                            "author": "blaseblaseblah",
                                            "score": 9,
                                            "created_utc": 1620270790.0,
                                            "response": "Smart contracts themselves have code that dictate the trade rules that are visible to everyone. A developer who is interested in creating this AppleForOranges trading mechanism may choose to define some if-then rules:\n\nIF my apple balance would increase by 1, THEN give apple sender 1 orange.\n\nThis transaction is executed automatically if the conditions are met. The triggers can be verified by all parties. In non-ethereum world, you have perhaps a Fruit Broker that is responsible for watching everyone's fruit balances and verifying the exchange happens. In ethereum world, all parties say \"okay these if-then rules are what I want. If conditions are met, do it automatically\".",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "gx3y5hz",
                                            "author": "valschermjager",
                                            "score": 3,
                                            "created_utc": 1620270840.0,
                                            "response": "If the rules describing the fulfillment of the contract is scriptable, and knowledge of the delivery of the product/services agreed upon is digitally accessible to that script, it can be automated.  Just handing an apple or Rubik’s cube to someone is so oversimplified it is misleading.  It’s an analogy, not a working example.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx3yfyx",
                                                    "author": "SmoothOpawriter",
                                                    "score": 3,
                                                    "created_utc": 1620271003.0,
                                                    "response": "Well, he did ask for a 5-year old level of comprehension :)",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "gx40vy3",
                                            "author": "Vacremon2",
                                            "score": 3,
                                            "created_utc": 1620272408.0,
                                            "response": "Depends on whether or not you're talking about physical goods or virtual goods.\n\nVirtual goods: the computer code makes the transaction happen between both people immediately.\n\nPhysical goods: Real life apples and oranges would require a system of checks and balances to ensure that both individuals send the goods.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "gx3wx47",
                                            "author": "SmoothOpawriter",
                                            "score": 6,
                                            "created_utc": 1620270156.0,
                                            "response": "That asset that is being exchanged is defined in the contract. In theory, the apple can be tokenized, like an NFT. Or you could have an app on your phone that either a) scans a bar code sticker on your apple or b) uses computer vision to confirm that you are holding an apple. That confirmation can then be linked to a contract on Ethereum.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx3x6wi",
                                                    "author": "SmoothOpawriter",
                                                    "score": 5,
                                                    "created_utc": 1620270307.0,
                                                    "response": "Theoretically, Jimmy could still beat you up after and steal your fruit, but then you could have a permanent complaint record filed against Jimmy on Ethereum, that would bar him from trading in the future",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gx3xi0d",
                                                            "author": "SmoothOpawriter",
                                                            "score": 2,
                                                            "created_utc": 1620270477.0,
                                                            "response": "This example is much easier if you substitute apple and orange with purely digital assets, OR, something in the real world that can be reliably tokenized via an NFT",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gx3y12m",
                                                                    "author": "SmoothOpawriter",
                                                                    "score": 8,
                                                                    "created_utc": 1620270771.0,
                                                                    "response": "For example, you buy a pair of really expensive (collectible) sneakers that have a unique identifier for that specific pair. Once that identifier is tokenized, it can be forever connected to you and your ownership of the shoes. As long as that unique identifier can be digitally read (could be hidden inside the shoe as an RFID tag) then you can forever claim indisputable ownership, even in case of theft (will make proving ownership a breeze in court if the shoes are recovered). Also, if you decide to sell those shoes, The ownership will not transfer to the buyer until the funds he pays for the shoes are in your digital wallet. In this example, creating an NFT linked to you and your shoes is a smart contract. Transferring ownership is also a smart contract.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "gx3w3am",
                                    "author": "tshirtbag",
                                    "score": 3,
                                    "created_utc": 1620269701.0,
                                    "response": "And this is an example of the smart contract?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx3wmkn",
                                            "author": "SmoothOpawriter",
                                            "score": 6,
                                            "created_utc": 1620269993.0,
                                            "response": "yes, a very simple smart contract fit for a 5-year-old",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "gx58scy",
                                    "author": "timmystwin",
                                    "score": 1,
                                    "created_utc": 1620306127.0,
                                    "response": "So what you're saying is this whole thing is based around something literally any reputable business already does?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx5xcw2",
                                            "author": "SmoothOpawriter",
                                            "score": 1,
                                            "created_utc": 1620317168.0,
                                            "response": "Yes, that's exactly the point. To do exactly what reputable businesses already do without the need for the reputable businesses to exist. The fees that the reputable businesses collect now, then go to the facilitators instead and the whole thing is done at a much lower cost due to efficiency of not needing a large business to be there.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx5zarr",
                                                    "author": "timmystwin",
                                                    "score": 1,
                                                    "created_utc": 1620317989.0,
                                                    "response": "But Ebay's fee isn't just for making the payment. \n\nIt's for advertising, hosting, support etc. \n\nCard machines charging for it is a better example... but it's still for the service of actually getting the money and putting it in your account, in whatever currency you need, as opposed to crypto, where fuck knows what it'll be worth by the time you shift it.\n\nI genuinely can't think of the last time I was concerned the other party would renege on their deal when buying something. Seems rather pointless.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gx62okm",
                                                            "author": "SmoothOpawriter",
                                                            "score": 1,
                                                            "created_utc": 1620319416.0,
                                                            "response": "That's 1st world logic. We have it nice because people are generally well off and trust is not an issue - no one is trying to screw anyone over continuously and the status quo is to be honest and generally fair, i.e. trust is built into the culture. Take for example my home country - Ukraine. It's a 2nd world country, we had multiple bank failures in 10 years (90s and 2000s), multiple currencies in 10 years (the 90s), jailed politicians, and an overall corrupt financial system. No one trust anybody - not banks, not other people. For that reason lending it still not really a thing there, you either have the cash or not. Credit cards are starting to appear now but it's still uncommon. Most people use debit cards linked directly to their bank. So while for you it seems pointless, you have to look outside of your immediate scope. Etherium can, and to some extent already does solve the aforementioned issues- trustless lending, credit, investment, etc. And Ukraine isn't even that bad, its not 3rd world. There are countries where currencies regularly inflate 1000s of % and the governments just exist for the sake of corruption. Those people can't even start dreaming about a reliable bank account, let alone Amazon or eBay. And as unstable as ether may seem, its a whole lot better than some of those fiats. The 1st world doesn't need what ETH has to offer, but I believe that the rest of the world could use some of what we have.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gx69196",
                                                                    "author": "timmystwin",
                                                                    "score": 1,
                                                                    "created_utc": 1620322050.0,
                                                                    "response": "That just makes it sound like it's being used as a cryptocurrency more than a payment system. Something not exactly known to be financially stable either. \n\nI get what you're saying, and maybe ETH is better... but people trying to explain it in ways such as the video are very much aiming it, or at least explaining it, in a first world mindset... where it doesn't really work.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "gx6f38x",
                                                                            "author": "SmoothOpawriter",
                                                                            "score": 1,
                                                                            "created_utc": 1620324528.0,
                                                                            "response": "I agree with you, people get too hung up on Ethereum replacing EVERYTHING, but that's clearly not practical in the real world, and is very much a maximalist view. However, the fact that we are able to perform transactions similarly to a financial system without a central authority is an extremely powerful concept on its own. There is a lot of hype now so it's hard to tell what functionality will stay and what will disappear. And don't get me wrong, centralized institutions are not only necessary, they are vital to certain aspects of the economy.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "gx5h16t",
                                    "author": "ChadBitcoiner",
                                    "score": 1,
                                    "created_utc": 1620310159.0,
                                    "response": "Jimmy can beat you up with or without ethereum.\neTheEruM SoLvEs CrImE",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx5xfqa",
                                            "author": "SmoothOpawriter",
                                            "score": 1,
                                            "created_utc": 1620317201.0,
                                            "response": "See comments below the original thread lol. I anticipated you ;)  \n[https://www.reddit.com/r/ethereum/comments/n5wjjq/wonderful\\_explanation\\_of\\_whats\\_ethereum/gx3x6wi?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/ethereum/comments/n5wjjq/wonderful_explanation_of_whats_ethereum/gx3x6wi?utm_source=share&utm_medium=web2x&context=3)",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "gx5xr75",
                                            "author": "SmoothOpawriter",
                                            "score": 1,
                                            "created_utc": 1620317337.0,
                                            "response": "It doesn't solve crime, but it does make exchange of \\*certain\\* goods and services more efficient and trustless. Financial services are particularly fitting, but really, any good that is fully digital works really well. Real world items could be problematic, depending on what it is and how it's being exchanged",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gx5xwrd",
                                                    "author": "SmoothOpawriter",
                                                    "score": 1,
                                                    "created_utc": 1620317403.0,
                                                    "response": "I am by no means an ETH shill, I just see the potential. Etherium is not an end all be all technology its just an exciting and disruptive innovation.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gx3waen",
                    "author": "Wololo242",
                    "score": 3,
                    "created_utc": 1620269808.0,
                    "response": "This is a great video that applies to any working programmable blockchain, eg eth, tezos, avalanche, eos, terra, and others",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx3xz1w",
                    "author": "WakandaWarLord",
                    "score": 3,
                    "created_utc": 1620270738.0,
                    "response": "What a lovely thread, genuine questions answered with respect and kindness",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx432f2",
                    "author": "Doobie-us",
                    "score": 3,
                    "created_utc": 1620273716.0,
                    "response": "It’s not about the transaction fee lol, it’s about dependable, reliable, safe quality of service. How does ethereum ensure any of that? I’m a hodler for what it’s worth, but this comparison is unrefined and needs to be challenged",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx43ync",
                    "author": "OhOkYeahSureGreat",
                    "score": 3,
                    "created_utc": 1620274277.0,
                    "response": "This was an awful description of what Ethereum is. This might actually kill the price; quick, delete the video.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4wrhn",
                    "author": "Outji",
                    "score": 3,
                    "created_utc": 1620298522.0,
                    "response": "This post getting so many upvotes just shows most people are either new here or dont understand the purpose of smart contracts. Ebay and Uber examples are shit lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx58lma",
                    "author": "timmystwin",
                    "score": 3,
                    "created_utc": 1620306026.0,
                    "response": "This explains literally nothing. \n\nWhat is a smart contract? How is it going to facilitate no fees? You're still going to have to pay state taxes if a seller etc, and whoever writes these contracts, whatever they are, is going to need to be paid right? Also, how is it transparent, if it's blockchain based how do you know whose address is what?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx5f6h9",
                    "author": "realcoinsonly",
                    "score": 3,
                    "created_utc": 1620309298.0,
                    "response": "lmao awful example.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx3w3qh",
                    "author": "04ChevyAveo",
                    "score": 6,
                    "created_utc": 1620269708.0,
                    "response": "I understand the crypto hype right now\nBut why the fuck is Ethereum classic ripping so high\nI sold like 200 of them back at 20 because I heard it would be old tech and that it goes against Ethereum \nAny truth?\nEither way that transaction got me a lot of doge 🚀🚀",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gx3wixh",
                            "author": "nedflandersz",
                            "score": 7,
                            "created_utc": 1620269938.0,
                            "response": "Normies want to be able to say they own a full ETH",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx3yg6v",
                                    "author": "valschermjager",
                                    "score": 2,
                                    "created_utc": 1620271006.0,
                                    "response": "unit bias",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gx417cq",
                            "author": "ALiteralHamSandwich",
                            "score": 2,
                            "created_utc": 1620272595.0,
                            "response": "Ethereum Classic almost makes it sound more legitimate. Like Coca-Cola Classic",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx41cl9",
                                    "author": "04ChevyAveo",
                                    "score": 4,
                                    "created_utc": 1620272681.0,
                                    "response": "God damnit",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gx5p8w2",
                            "author": "PRIGK",
                            "score": 2,
                            "created_utc": 1620313757.0,
                            "response": "Currently a company in the Bahamas is buying up every crypto they can with counterfeit money.  When people see the price rise, they get excited and buy in, hoping it'll go up more.  The fraud company can then sell the tokens at an inflated price to newcomers, and turn their counterfeit money into real money.  Most people turn a blind eye to it because their actions make the price go up, so if you've been in the game longer than 2 months you're guaranteed to be up on your investment.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gx3zbd3",
                            "author": "Bigwiggs3214",
                            "score": 1,
                            "created_utc": 1620271503.0,
                            "response": "There's a company that went balls deep in etc. So hopes are high.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx41b7e",
                                    "author": "Hanzburger",
                                    "score": 1,
                                    "created_utc": 1620272659.0,
                                    "response": "Miners last hope",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gx3zxmm",
                    "author": "kaosmuppet",
                    "score": 6,
                    "created_utc": 1620271854.0,
                    "response": "Ebay = pay 3 dollars for facilitating a trade. Ethereum = pay $20 to covert fiat to ETH, then pay $20 to convert ETH to WETH. Buy an NFT for $20 pay $30 in gas fees and seller pays original artist and opensea a huge cut. Finally pay $200+ extra to do your taxes because of multiple taxable events for one purchase.\n\nI'm super bullish on Ethereum but anyone who uses it knows this video is completely bullshit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx42asp",
                    "author": "t-han72",
                    "score": 6,
                    "created_utc": 1620273246.0,
                    "response": "I don’t think this guy understands ethereum",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx3vwe8",
                    "author": "an_internet_denizen",
                    "score": 2,
                    "created_utc": 1620269598.0,
                    "response": "Does anyone have real world applications for smart contracts that doesn’t require intimate knowledge of ethereum to transact?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gx41jb2",
                            "author": "Vacremon2",
                            "score": 2,
                            "created_utc": 1620272794.0,
                            "response": "Applications that currently exist?\n\nYes, argent wallet would be the simplest avenue that I am aware of.\n\nIt allows you to participate in decentralized finance without intimate knowledge of ethereum itself.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gx3ysji",
                    "author": "Iohet",
                    "score": 2,
                    "created_utc": 1620271201.0,
                    "response": "So why does ethereum have value if it's just a medium to track execution of contracts?  Is it a distributed cost of computing?  Essentially virtual equity in the computing power?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gx4kxyp",
                            "author": "bad-john",
                            "score": 1,
                            "created_utc": 1620287558.0,
                            "response": "I feel like there is value in tracking execution of contracts. Bitcoins only value is in tracking who has Bitcoin right?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gx493yp",
                    "author": "MerryWalrus",
                    "score": 2,
                    "created_utc": 1620277803.0,
                    "response": "Awful explanation.\n\nEthereum is a public cloud computer on which you can buy runtime on using ETH.\n\nThere are more unique features but that is the level 0 of what it is.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx53ogd",
                    "author": "Dohts75",
                    "score": 2,
                    "created_utc": 1620303238.0,
                    "response": "So what you're saying is I cannot do shady shit with Ethereum",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx56c3x",
                    "author": "sacredlunatic",
                    "score": 2,
                    "created_utc": 1620304797.0,
                    "response": "You literally did not explain Ethereum whatsoever.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx5b4nb",
                    "author": "charlestontime",
                    "score": 2,
                    "created_utc": 1620307337.0,
                    "response": "eBay has recourse. What is the built in recourse with Ethereum?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx5g0zr",
                    "author": "Mashalot",
                    "score": 2,
                    "created_utc": 1620309693.0,
                    "response": "Bitcoin layer 2 solutions will include smart contracts. So then why should ethereum exist any more when that happens???",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx3s1ts",
                    "author": "jdemdarifali11",
                    "score": 5,
                    "created_utc": 1620267598.0,
                    "response": "P.S: I didn't make this tiktok video.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gx4b16v",
                            "author": "poopcasso",
                            "score": 9,
                            "created_utc": 1620279244.0,
                            "response": "Glad you're not retarded. Edit: actually you are, since you wrote that retarded title.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gx3tpvh",
                    "author": "obsd92107",
                    "score": 2,
                    "created_utc": 1620268460.0,
                    "response": "Uber only taking $5 out of $20 fare? That was the case years ago. Now they are taking 50% off every ride! The ride sharing space is ripe for eth disruption.\n\n\nAlso a decentralized platform like eth allows driver to connect with a much larger body of riders, not just those that signed up specifically to be uber users.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gx4gw4o",
                            "author": "Greedy-Locksmith-801",
                            "score": 3,
                            "created_utc": 1620283932.0,
                            "response": "Yeah you just need a company that specialises in aggregating a vast number of drivers with an even bigger number of customers through an easy and secure ride hailing interface. Something like Uber.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gx5numo",
                    "author": "FurrieBunnie",
                    "score": 2,
                    "created_utc": 1620313155.0,
                    "response": "This video, and the other posts from Vitalik, are so incredibly naive.  Clearly this person doesn't understand the value of the middle man.  Is every driver really going to set up their own app, call center, complaint resolution process, etc etc?  ETH does facilitate value transfer, but THATS IT.  It doesnt help individuals -do business-.  It doesnt create the support infrastructure that Uber, Ebay and all the other \"middlemen\" provide.  How is the Uberless driver ever going to get work?  Who is going to call him without the brand?  Is ETH going to magically create a bridge to his customers?  No.  This video is misleading and just plain dumb.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4a2hw",
                    "author": "binarygold",
                    "score": 1,
                    "created_utc": 1620278516.0,
                    "response": "There are two main unsolved problems around deterministic (smart is the wrong word to use) contracts:\n\n**First, you can't have both trustless execution and ability to intervene in case of a bug.**\n\nYou either create a smart contract which executes no matter what after it's been deployed and nobody has the ability to change it. As a participant you can trust it will do what the code says that it will do. The problem here is that if the contract is complex, you can't verify the code yourself with high confidence, especially if you don't know programming.\n\nEven if you have code that is mathematically provably correct and has no bugs, the real world changes and the contract may become obsolete in the new real world conditions. Bugs or real world changes may mean that the inability to change the contract can create a situation where the contract is harmful and in a big way. This happened in Ethereum contracts many times. The biggest blunder was the DAO, where a bug allowed an attacker syphon out insane amounts of funds from people's accounts. This attack forced the Ethereum community to fork the code leaving the unforked original chain as Ethereum Classic, and the forked one became Ethereum. This is a hugely disruptive event, and you can't keep forking every time. It's unsustainable.\n\nThe other option is that you leave a publicly known backdoor for a few trusted developers who can change the contract in case there is a bug or other urgent need to change the code. However, the more developers have keys to make such a code the less you can trust the contract. The less people have the keys the bigger the chance the keys are lost and the contract becomes like the first scenario. Also, the whole point of deterministic contracts is that you don't need to trust anyone. If you have to trust some people you may not even know personally, people who may have changing motivations and circumstances you may as well just run a mysql database much more efficiently and cheaply to run the same application. No need for \"smart\" contracts.\n\n**Second, you can't tie contracts to real world events efficiently and trustlessly.**\n\nFor example, how do you verify that the toy was sent and received and thus the payment to the vendor can be released? You have to rely on the post office or the buyer to verify that manually within the contract, which means the vendor relies on third parties. The deterministic contract can still help the process, the dependence on an oracle (somebody who can tell you real world events happened) is still a significant issue.\n\nThis is why \"tokenize the world\" is frankly mostly vaporware. You can't trust a tokenized banana to verify its origin, because you need to trust every participant in the supply chain that they will not cheat by replacing the original fair trade banana with another random one. And if you trust every participant, you can just run a regular database yet again. No blockchain needed.\n\nI know there are projects that are attempting to solve the oracle issue, but it's not there yet. We need a breakthrough idea to resolve it, and it may not even be a computer science problem.\n\nWhat you CAN do now is create contracts that depend on events that are not tied to real world events like the delivery of a toy, instead depend on things that are easy to check with high confidence right on the blockchain without an oracle. For example you can tie a contract to a block height (effectively timed), or a certain amount of funds on a specific account. It's limited, but still useful.\n\nFor example, you can make a contract that automates retirement funds. You pay funds to an account for many years (which may get staked) and at the end of the contract you will start receiving funds back until the funds run out. Or you can do a lottery where everybody pays in to a contract a small amount and only one person wins based on an unpredictable number like the hash of a block in a future time.\n\n**Final thoughts**\n\nIt's important to note that contracts tied to blockchain events are not new. Bitcoin had it from the very beginning. And with the upcoming taproot upgrade such complex contracts will become more efficient and confidential. Both options have benefits and both communities have taken ideas from each other. It's a mutually beneficial ecosystem. Bitcoin and Ethereum are in a healthy competition, like two training partners both training for the Olympics, where they have to face the worldwide economy.\n\nUltimately, blockchains have one significant use case so far: **store of value that is resistant to any censorship from any authority (digital gold).** This is what Bitcoin is optimizing for successfully so far. We will see in another 5 years if Ethereum can do it too. (One has to be careful not to be overly optimistic in a bull market.)\n\nA secondary important use case is **cheap, scalable and trustless transfer for of value (payments)**, which is what the Bitcoin Lightning Network is optimizing for, somewhat successfully so far. However it's way too early to tell. L2 solutions similar to LN also started to appear within the Ethereum ecosystem.\n\nAll the other use cases, like Time stamping, Tokens, DeFi, NFTs, etc. are all exciting and fun, but uncomparable in significance to the digital gold and payments use cases. This is especially true that these secondary use cases typically suffer from the above two problems.\n\nThe hard truth is that all the alternative use cases are basically just marketing talking points for most coins, and not much beyond. Most coins are mostly just used for gambling in a giant worldwide casino. Gambling is big business and this is just the beginning of a huge change in the world, so not putting anything down, but it's important to be cognisant of this reality.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx3ux3v",
                    "author": "TeeeRekts",
                    "score": 1,
                    "created_utc": 1620269084.0,
                    "response": "I mean you still pay a % to opensea for NFTs so same shit as paying Uber and EBay lol",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gx41qiy",
                            "author": "Hanzburger",
                            "score": 3,
                            "created_utc": 1620272913.0,
                            "response": "Because opensea is a company. There's a distinct difference between open source dapps and private for profit products built on open source software.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx44pld",
                                    "author": "TeeeRekts",
                                    "score": 1,
                                    "created_utc": 1620274756.0,
                                    "response": "Uber and EBay aren’t companies, got it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx45nfs",
                                            "author": "Hanzburger",
                                            "score": 1,
                                            "created_utc": 1620275378.0,
                                            "response": "They are companies. And so is OpenSea, which is why I was pointing that out since you brought it up and it didn't make any sense.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gx3wf35",
                    "author": "Few-Bullfrog-4653",
                    "score": 1,
                    "created_utc": 1620269879.0,
                    "response": "finally, people using these video soc media for education than for a popularity contest.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx3y4gp",
                    "author": "hamathon24",
                    "score": 1,
                    "created_utc": 1620270824.0,
                    "response": "Gas!!!!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx3y6a2",
                    "author": "hifarrer",
                    "score": 1,
                    "created_utc": 1620270852.0,
                    "response": "Need to send this video to my mom...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx3ya3b",
                    "author": "LordWeatherby",
                    "score": 1,
                    "created_utc": 1620270912.0,
                    "response": "I'm in love with ETH and NFT but as an artist who is selling in that 300$ range Gas is a hefty tax and a selling issue. Anything into the thousands that is traceable is absolutely worth it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx3yale",
                    "author": "heartagrahamcracker",
                    "score": 1,
                    "created_utc": 1620270920.0,
                    "response": "so it’s the platform that smart contracts run on? if so then what makes something like that continue to increase in value?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx3z3x6",
                    "author": "connorisblue",
                    "score": 1,
                    "created_utc": 1620271382.0,
                    "response": "Isn’t this literally the purpose of blockchain? This ain’t unique to ETH.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gx65zi8",
                            "author": "wreckfromtech",
                            "score": 1,
                            "created_utc": 1620320784.0,
                            "response": "Blockchain isn’t the same thing as smart contracts.\n\nBlockchain = common knowledge and decentralized ledger. \n\nSmart contracts = enable P2P transactions without intermediaries.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gx3zl13",
                    "author": "kikiwows",
                    "score": 1,
                    "created_utc": 1620271656.0,
                    "response": "What kind of smart contracts",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4087y",
                    "author": "-cloudster-",
                    "score": 1,
                    "created_utc": 1620272023.0,
                    "response": "okay i am confused all of this was already very confusing and now i am even more confused , does anyone have a video that explains everything clearly i would love to watch it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx40wjh",
                    "author": "Taraforming",
                    "score": 1,
                    "created_utc": 1620272418.0,
                    "response": "I just farm apples man. Miss me with this fiat bullshit",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx41oev",
                    "author": "Shillofnoone",
                    "score": 1,
                    "created_utc": 1620272879.0,
                    "response": "What about the gas fee",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx42b05",
                    "author": "alvingjgarcia",
                    "score": 1,
                    "created_utc": 1620273249.0,
                    "response": "No, you give Uber money and Ebay money for protection. You crash your car during a ride - Uber helps, You need some car maintenance, Uber can help in certain cases. As a driver and rider you are protected from certain things. Ebay gives you protection in case you get scammed, etc. So no your not just paying for them to facilitate things. Its also about the protection. Go ahead and give someone the $20 on Ethereum to drive you somewhere and crash, and now its on your insurance. Very bad video that really explain shiiiiiit",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx42jq8",
                    "author": "FluffyGlass",
                    "score": 1,
                    "created_utc": 1620273397.0,
                    "response": "Ethereum cures cancer - full stop!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx42n1j",
                    "author": "jeffog",
                    "score": 1,
                    "created_utc": 1620273453.0,
                    "response": "How do I stop someone from claiming some real world event even if it hasn’t occurred? Like if I bought that rubiks cube online and seller delivers the item but I claim not to have received it and don’t pay?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gx6a4mm",
                            "author": "wreckfromtech",
                            "score": 2,
                            "created_utc": 1620322506.0,
                            "response": "Not as familiar with Ethereum smart contracts as I am with Algorand’s single transaction architecture, but here’s an example. \n\nI’d appreciate if folks can edit/correct where appropriate:\n\n1. Person A has a million dollars to buy a house.\n\n2. Person B is selling their house for 1 million dollars.\n\n3. The smart contract conditions are distributed across the blockchain, and state IF person A pays 1 million, THEN they receive person B’s house. \n\n4. Person A sends 1 million to the smart contract. \n\n4. Person B signs ownership to person B in the smart contract.\n\n5. The smart contract determines if person A and person B’s conditions are met, if yes, the transaction completion is written to the blockchain. Person A received a house and person B receives the money.\n\n6. If the smart contract conditions are not met (usually with a time limit), the 1 million dollars are returned to person A.\n\nPerson A should have trust in the blockchain and smart contract, because if the conditions are not met the money is still technically theirs according to the public ledger.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx7ldia",
                                    "author": "jeffog",
                                    "score": 1,
                                    "created_utc": 1620342590.0,
                                    "response": "Ah, so in something like online shopping, the seller usually sends some sort of proof of delivery like a fedex tracking number by email. I guess this could be a smart contract condition “if seller uploads a 16-digit number, then release payment” (or something more robust I’m sure). Thanks!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gx44jrx",
                    "author": "TjThundaa",
                    "score": 1,
                    "created_utc": 1620274653.0,
                    "response": "In my very humble opinion I don’t really see the need for blockchain technology to be utilize in this middle man market e.g. Uber, lyft, ebay, amazon, etsy, etc. they’re competitive meaning transactions fees are fair imo.\n\nThat brings me to the conclusion that first world countries real benefit from blockchain is the investment part of it, we have just about every commodity at the tip of our fingers like sending money, receiving money, buying, trading, communicating, etc.  \n\nNow I don’t want to sound like a shill but Cardanos approach to blockchain and the implementation part is more feasible or realistic for financial solutions on developing countries, i mean giving financial identity to millions of people in places where they lack of technology that makes life a bit easier is a great benefit for the world over all, fighting counter fit products is also a very good way to implement blockchain by uploading live data of the product as it is being produce, handle and ship all the way to your doorstep’s. \n\nI love the concept of implementing blockchain on our every day life but I think those changes need to start in developing countries, in more advanced countries with stronger economies makes more sense to support it the investment side.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx44tek",
                    "author": "Venomous0425",
                    "score": 1,
                    "created_utc": 1620274824.0,
                    "response": "I am sure this dude read the quote from Vitalik and made the video out of it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx45f5m",
                    "author": "EmanEwl",
                    "score": 1,
                    "created_utc": 1620275224.0,
                    "response": "Except I dont ever give Uber an extra $5 . They should give the driver $5 to the driver as a tip.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx45lzu",
                    "author": "frogg616",
                    "score": 1,
                    "created_utc": 1620275351.0,
                    "response": "Awesome! Instead of my Uber being 20$ (15+5 to Uber) it’s now 65$ with a chance of a failed transaction bringing it to 115$ 😬",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx46v19",
                    "author": "Funkywurm",
                    "score": 1,
                    "created_utc": 1620276193.0,
                    "response": "This makes ethereum sound very redundant.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx49aca",
                    "author": "bronkula",
                    "score": 1,
                    "created_utc": 1620277933.0,
                    "response": "That honestly explained very little about ethereum. It merely explianed what a contract is, not at all how ethereum facilitates that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx49btu",
                    "author": "b3rn13mac",
                    "score": 1,
                    "created_utc": 1620277964.0,
                    "response": "So it ensures that middlemen get their dues? Probably the least appealing way to introduce the concept.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx49loy",
                    "author": "GCPerfectShot",
                    "score": 1,
                    "created_utc": 1620278168.0,
                    "response": "It's expensive too!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx49w5n",
                    "author": "MostlyLegMusic",
                    "score": 1,
                    "created_utc": 1620278385.0,
                    "response": "Lol you think the uber driver gets 15$ out of the 20$? More like 10$",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4b5p3",
                    "author": "Desinfektol",
                    "score": 1,
                    "created_utc": 1620279335.0,
                    "response": "What happens when your eth uber leaves you on the side of the highway?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4c6y7",
                    "author": "AlexForeroHB",
                    "score": 1,
                    "created_utc": 1620280123.0,
                    "response": "😳What did he just say?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4dv1r",
                    "author": "Mapumbu",
                    "score": 1,
                    "created_utc": 1620281443.0,
                    "response": "So who vet the UBER drivers if you make the deal peer to peer on the Ethereum network. Who monitors the star ratings? What about feedback profile and disputes that eBay has? Will they be on the Ethereum network?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4eomf",
                    "author": "Cryptopher_Reeve",
                    "score": 1,
                    "created_utc": 1620282109.0,
                    "response": "https://youtu.be/JZzGhqPsurw",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4f21p",
                    "author": "iethrb0i",
                    "score": 1,
                    "created_utc": 1620282411.0,
                    "response": "I don't understand why this got any traction. Eth is so much more and like other comments pointed out the current state of fees isn't a selling point.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4fiyr",
                    "author": "cubemackie",
                    "score": 1,
                    "created_utc": 1620282799.0,
                    "response": "Question: What is the incentive for someone to create a new and disruptive service if it's simply going to be released to the market and they won't benefit? All this is doing is moving the reward for any new service from the person who did the hard-work creating it, onto people who own Ethereum and benefit from transaction fees.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4fssz",
                    "author": "AdministrativeYam632",
                    "score": 1,
                    "created_utc": 1620283021.0,
                    "response": "I thought ethereum was non-profit though but it still doesn't make sense how every crypto has different uses in the real modern future world.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4h9av",
                    "author": "joanmiro",
                    "score": 1,
                    "created_utc": 1620284247.0,
                    "response": "Totally misleading. The current situation is paying a 50$ gas fee for any kind of contract interaction. Sorry guys but paying 3$ to amazon is far better. My only hope is Ethereum 2.0.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4hbfq",
                    "author": "import-antigravity",
                    "score": 1,
                    "created_utc": 1620284297.0,
                    "response": "Uhm... This is a very bad explanation of ethereum.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4hdsx",
                    "author": "Nielspro",
                    "score": 1,
                    "created_utc": 1620284356.0,
                    "response": "I’m wondering how customer support will happen",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4iste",
                    "author": "Uberzwerg",
                    "score": 1,
                    "created_utc": 1620285603.0,
                    "response": "This is only \"helpful\" if you already fully understood it before.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4j8lk",
                    "author": "dnick",
                    "score": 1,
                    "created_utc": 1620286001.0,
                    "response": "Except that both the money, the product/service, and the means to validate them all have to be in a digital format within ethereum or under its control, otherwise you still have to rely on an external 'something', and potentially pay for that service. \n\nFor things like gambling and crypto exchange that works great, but it doesn't really work at all for either service described in these examples. I mean how do you validate that I did or didn't give you a rubiks cube in order to release your funds to me? How does ethereum verify if you showed up in the car, or I showed up for the ride? \n\n Ethereum can do is part wonderfully, but it's part doesn't really encompass all that much of the real world just yet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4je8w",
                    "author": "coryfernandez",
                    "score": 1,
                    "created_utc": 1620286142.0,
                    "response": "This guy knows his stuff.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4jprc",
                    "author": "solori12",
                    "score": 1,
                    "created_utc": 1620286432.0,
                    "response": "The ethereum network in 2021:\n\n\"Oh i like that virtual land, can I buy it for $10?\"  \nError: transaction costs $39 ($28 gas fee to purchase the land)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4jqm4",
                    "author": "michaelb1",
                    "score": 1,
                    "created_utc": 1620286453.0,
                    "response": "Every time he says ethereum he shouldn’t instead say decentralized apps on the blockchain.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4jxk7",
                    "author": "masteraybe",
                    "score": 1,
                    "created_utc": 1620286627.0,
                    "response": "And I still don't understand.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4kluh",
                    "author": "jake123123",
                    "score": 1,
                    "created_utc": 1620287250.0,
                    "response": "/u save-video",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4l3o8",
                    "author": "occupanther",
                    "score": 1,
                    "created_utc": 1620287708.0,
                    "response": "Lol.  User ride costs 20 dollars, ETH fees for said transaction 140 dollars. \n\nADA,BNB, HBAR, TRC20 all better than ETH in this respect \n\nETH better shape up",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4lxiu",
                    "author": "spicyshit91",
                    "score": 1,
                    "created_utc": 1620288499.0,
                    "response": "The title is not a great explanation of what’s this video.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4mtxo",
                    "author": "percyhiggenbottom",
                    "score": 1,
                    "created_utc": 1620289357.0,
                    "response": "Same transaction in Ethereum, 65$ in gas fees...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4o2es",
                    "author": "Upstairs-Report",
                    "score": 1,
                    "created_utc": 1620290556.0,
                    "response": "This is a terrible video. Let's have a look:\n\nThe Uber example: Ok so you make $20 and Uber takes $5 leaving you with a total of $15. Uber is providing you with the platform to make that $20 from that ride. Without Uber you wouldn't be able to get that ride from the customer in the first place. Good luck setting up your own taxi service, advertising and gaining a customer base that will cost less than the fees Uber takes.\n\nThe eBay example: Ok the selling sells you the Rubik's cube for $20. eBay takes $3 leaving you with $17. Again, they are providing the platform to sell that Rubik's cube. Good luck stumbling across someone who at the time of selling said Rubik's cube wants to buy one. Next, what happened if the Rubik's cube is faulty? The contract has been completed, you can't reverse the transaction now. The fees over you and the seller to protect both of you.\n\nThese examples actually make Ethereum look BAD. Please reconsider making it sharing more videos like this because they're a terrible example.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4p0tc",
                    "author": "choccysmeg",
                    "score": 1,
                    "created_utc": 1620291479.0,
                    "response": "Say a decentralised Uber was created, who resolves disputes between riders and drivers? Same thing with eBay.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4qpvm",
                    "author": "Supersymm3try",
                    "score": 1,
                    "created_utc": 1620293120.0,
                    "response": "He spent too much time explaining how the stuff everyone knows works, and not enough time emphasising that eth is decentralised, the ledger is public and immutable and that the contracts exercise no matter what. Those last points would have been better to focus on than explaining how 2 things everyone uses works.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4r04y",
                    "author": "Acdc7",
                    "score": 1,
                    "created_utc": 1620293393.0,
                    "response": "Well that doesnt explain anything",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4sd8b",
                    "author": "2NineCZ",
                    "score": 1,
                    "created_utc": 1620294696.0,
                    "response": "What's missing in this video is the $50 fee for an ETH transaction :D",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4sfth",
                    "author": "pokopants33",
                    "score": 1,
                    "created_utc": 1620294764.0,
                    "response": "Sorry I still couldn't understand....But in case of ebay and uber also, the fee is getting deducted automatically right ? So how is it different from that ? Also will we be still paying that fees ?\n\nIn case of eBay, if any thing go sour, i can contact their customer support. How will that be in case of smart contract ? I am not taking a diss at the technology, i'm just curious.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4slhr",
                    "author": "proonjooce",
                    "score": 1,
                    "created_utc": 1620294908.0,
                    "response": "This is some bullshit, what you're paying for with eBay and Uber isn't them physically transferring the money from one person to another. \n\nIt's the app and infrastructure in Ubers case, tracking and allocating drivers, planning routes etc. and in eBays case it's the marketplace website that joins buyer and seller.\n\nNot saying that they don't take too large a percentage and that these things couldn't be collectivized and open sourced but Ethereum alone doesn't solve this.\n\nIf anything it cuts out stuff like PayPal which does take an extortionate fee, but then there's gas fees on ETH as well so again, this is some bullshit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4sp91",
                    "author": "gdavis1997",
                    "score": 1,
                    "created_utc": 1620295004.0,
                    "response": "this video makes ethereum seem useless to people that he is trying to reach",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4tzqj",
                    "author": "beechmonkey",
                    "score": 1,
                    "created_utc": 1620296179.0,
                    "response": "well done",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4u9eb",
                    "author": "darthmcdarthface",
                    "score": 1,
                    "created_utc": 1620296420.0,
                    "response": "This is a pretty poor set of examples. How could you ever write a smart contract that would know if a person has received that Rubik’s cube in acceptable condition? \n\nAlso it is ignorant of all of the reasons why people want “middle men” involved in such transactions. They help connect buyers and sellers and provide a degree of customer protections and service. For all intents and purposes, shops like Ebay and Amazon are more advanced versions of smart contracts themselves. The fees they collect are their “gas fees”. \n\nI can’t see why an average person or even a business would use smart contracts. \n\nI’ve been lurking around trying to get a bug for ETH but I’ve been struggling to see the value in it apart from the great looking chart. I don’t invest in charts alone though.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4ugjk",
                    "author": "sosanlx",
                    "score": 1,
                    "created_utc": 1620296591.0,
                    "response": "So how does the uber driver or the eBay person know that I want a ride or a Rubix cube with Etherium?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4uw1k",
                    "author": "Lynx77",
                    "score": 1,
                    "created_utc": 1620296968.0,
                    "response": "1. eth miners take the fee instead of Uber / eBay\n2. if your item doesnt show up or your ride is bad then you have someone to complain too and get a refund, in ETH you just take the L\n\n&#x200B;\n\nthis isn't an improvement, its worse",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4w8va",
                    "author": "TCBinaflash",
                    "score": 1,
                    "created_utc": 1620298105.0,
                    "response": "This was best left on Tik Tok",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4xi9o",
                    "author": "Strong_Wheel",
                    "score": 1,
                    "created_utc": 1620299102.0,
                    "response": "Escrow?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4y97s",
                    "author": "commo64dor",
                    "score": 1,
                    "created_utc": 1620299665.0,
                    "response": "This is a terrible explanation and the examples are useless as there is no trust conflict with Uber nor Ebay. TikTok is dumbing down everything.\n\n\"A Smart Contract is everything you don't understand about finances combined with everything you don't understand about computer science\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4zlqr",
                    "author": "sagerap",
                    "score": 1,
                    "created_utc": 1620300607.0,
                    "response": "This is a terrible explanation on multiple levels",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx4zxcg",
                    "author": "CorneredSponge",
                    "score": 1,
                    "created_utc": 1620300826.0,
                    "response": "[Here's the best, in-depth explanation I've ever read](https://newsletter.thedefiant.io/p/ether-is-the-best-model-for-money)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx518ls",
                    "author": "DelawareDawg",
                    "score": 1,
                    "created_utc": 1620301693.0,
                    "response": "This video is missing some scenes. I really understand Ebay and Uber, now do ETH",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx51b4z",
                    "author": "daniel_ricciardo",
                    "score": 1,
                    "created_utc": 1620301738.0,
                    "response": "Welp this just made it worse lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx52ttt",
                    "author": "Bovinius__Cudd",
                    "score": 1,
                    "created_utc": 1620302709.0,
                    "response": "Commerce since the beginning of time.  Thats what was explained in this video.  He even used dollars, ffs.\n\nSomebody else said it, but I'm borrowing the term.  Dogeshit.\n\nNo mention of interest, cutting out the middleman, if Uber guy drives off without giving you a ride - contract isn't satisfied and money comes back.. can't prove the item from eBay is unique.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx5855a",
                    "author": "Realistic_Squirrel_3",
                    "score": 1,
                    "created_utc": 1620305782.0,
                    "response": "Does someone actually have an example that could make me go like “oh wow that’s so beneficial”?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx5amwv",
                    "author": "Mr-IT-Guy",
                    "score": 1,
                    "created_utc": 1620307093.0,
                    "response": "Yea but what is Ethereum?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx5b8jh",
                    "author": "Bozqezawsr",
                    "score": 1,
                    "created_utc": 1620307391.0,
                    "response": "Yay, I’d love to pay $65 gas fees instead of $5 to Uber!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx5ey2z",
                    "author": "ChadBitcoiner",
                    "score": 1,
                    "created_utc": 1620309190.0,
                    "response": "wonderful????? this is terrible and misleading.\n\nthe problem is, it still requires external trust. if I don't pay the uber driver, how does the ethereum blockchain protect against anything?\n\nif the ebay seller sends the wrong item how does the ethereum blockchain protect the buyer?\n\nebay and uber are succesful companies because they have network effect and provide a useful service that includes a trusted 3rd party arbitration for sellers and buyers, and they won't do it for free.\n\n\nethereum's smart contract narrative is that it will remove the middleman, but it does no such thing. ethereum doesn't fix this.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gx5poxg",
                            "author": "TheAlmightyBungh0lio",
                            "score": 1,
                            "created_utc": 1620313949.0,
                            "response": "Ethereum can stake an amount before the transaction occurs",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gx5sf63",
                                    "author": "ChadBitcoiner",
                                    "score": 1,
                                    "created_utc": 1620315111.0,
                                    "response": "and who is the arbiter if there is a dispute?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gx5u391",
                                            "author": "TheAlmightyBungh0lio",
                                            "score": 1,
                                            "created_utc": 1620315815.0,
                                            "response": "Who is the arbiter when you have a mortgage or credit card dispute? An arbitrator appointed by the credit company, and in 99 out of 100 times they tell you to eat shit. Eth is not perfect but it will reduce criminal element in the banking industry.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gx5grj0",
                    "author": "Cecilia_Wren",
                    "score": 1,
                    "created_utc": 1620310036.0,
                    "response": "What I'm confused about is how this tiktok is more than a minute long.\n\nDid they remove the length cap?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx5hlod",
                    "author": "maddogstonks",
                    "score": 1,
                    "created_utc": 1620310416.0,
                    "response": "This guy's explanation of anything finance is so cringe to me. He does a s**t job in my opinion and lacks all the important details over simplifying what is actually occurring.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx5p599",
                    "author": "jalapina",
                    "score": 1,
                    "created_utc": 1620313714.0,
                    "response": "These fees are higher than Ubers lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx5rnpd",
                    "author": "RickSanchezzC137",
                    "score": 1,
                    "created_utc": 1620314784.0,
                    "response": "By that logic ETH would become obsolete in a predictable amount of time lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx5s5a0",
                    "author": "ITriedLightningTendr",
                    "score": 1,
                    "created_utc": 1620314993.0,
                    "response": "...\n\nThis didn't explain anything.\n\nThis is exactly how point of sale works.  It's exactly the same as paying with cash, credit, or debit.  There's a balance, there's a payment processor, payment processor indicates balance has been paid, done.\n\n\"What's ethereum?  It's a thing you can pay for things with, we call this smart contracts\"\n\nGreat.\n\nJust saying the word \"smart contract\" in context of something else doesn't mean it's explained.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx5smv0",
                    "author": "ohmygodbeats7",
                    "score": 1,
                    "created_utc": 1620315201.0,
                    "response": "This is a horrible explanation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx5vfwy",
                    "author": "Modern_chemistry",
                    "score": 1,
                    "created_utc": 1620316375.0,
                    "response": "How would the app work? This is my major question.  Would a group of altruistic developers create an open sourced app which is updated periodically? Would it take into account insurance costs, wear and tare on the car? How about maintenance of the app? Would developers get paid? This doesn’t seem like removal of a middle man, but just a different kind of “decentralized” middle-man. \n\nIf someone could try to explain HOW this concept could possibly work - I would be very grateful.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx5y3wv",
                    "author": "dotspread",
                    "score": 1,
                    "created_utc": 1620317486.0,
                    "response": "the damn gas fees are tooooooo damn high! -insert too damn high meme",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx5ydc3",
                    "author": "svirfneblyad",
                    "score": 1,
                    "created_utc": 1620317597.0,
                    "response": "Soooo who’s gonna build and finance the running of the platform that enables people to advertise their goods and services? What a moronic video.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx61dzq",
                    "author": "Butch201",
                    "score": 1,
                    "created_utc": 1620318871.0,
                    "response": "Ok (sort of), but why did ETH go up in price from, say, $1 to $3,500/coin?\nThe gas fee isn’t $3,500, right?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx66e2h",
                    "author": "Beggarsfeast",
                    "score": 1,
                    "created_utc": 1620320954.0,
                    "response": "I’ve always looked at examples that discuss concepts like “Docusign” or general legal agreements (settling on a house or another matter) as introducing the benefits of blockchain smart contracts.\n\nEbay has a website, an interface that provides that service. Uber has a network to coordinate drivers. I don’t understand the follow through with OP’s post, although maybe I’m jist not understanding the concepts.\n\nTo me smart contracts are going to first affect larger financial and contractual obligations, ones where a bank must be present, or a lawyer paid for to just sit and witness. Maybe settling financial obligations while overseas or across the country, or making an agreement that doesn’t have to sit on someone’s ledger like Fanny Mae, only for them to use it as collateral for other market making. I still can’t comprehend the full scale utilization of smart contracts on block chain as revolutionary, but as I begin to learn more about the nuances, I think it’s important to bring people up to the level of comprehension of larger financial instruments rather than try to discuss things like Uber when the real world implementation still doesn’t sit with my brain.\n\nCorrect me if I’m wrong or off base, I still love learning about blockchain and I’m invested in some, but it’s going to take more than a tik tok style video to get these concepts across.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx66ska",
                    "author": "gunnerdown15",
                    "score": 1,
                    "created_utc": 1620321123.0,
                    "response": "I am getting into development, where do I start for developing on ETh?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx66zd9",
                    "author": "bitpologetics",
                    "score": 1,
                    "created_utc": 1620321201.0,
                    "response": "1) Why can't this functionality be programmed into CBDCs, backed by government?\n\n2) Why can't this functionality be programmed on Bitcoin, which is a dumb open protocol that cannot be manipulated by any one participant or stakeholder, and is far more decentralized, and will not \"upgrade\" to a 2.0 which privileges certain participants over others?\n\n3) Why are some of you tempted to reply with 2017 Bitcoin energy FUD, instead of finding all the arguments refuting those claims?\n\nNew investors: at about $1.86, Doge flippens Ethereum. Just because a lot of people are convinced of some marketing, it doesn't mean what they're promoting is going to work.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx6berh",
                    "author": "LouBricant",
                    "score": 1,
                    "created_utc": 1620323038.0,
                    "response": "Anyone else more confused?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx6d6ot",
                    "author": "Bluzzyyy",
                    "score": 1,
                    "created_utc": 1620323755.0,
                    "response": "Great run down tbh haha",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx6dq3u",
                    "author": "ndy856",
                    "score": 1,
                    "created_utc": 1620323973.0,
                    "response": "we don't want transparent because that mean the gov can tax it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx6mwpf",
                    "author": "carpediem-88",
                    "score": 1,
                    "created_utc": 1620327804.0,
                    "response": "Are any Ethereum holders or Dogecoin holders of coin shifting to Ethereum Classic for the upward swing? The swing of ETC looks similar to Ethereum upward swing of 2017 and 2018. I am not a financial advisor",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx6rw9m",
                    "author": "Choice-Advertising-2",
                    "score": 1,
                    "created_utc": 1620329899.0,
                    "response": "He didn't talk about dAPPs",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx7fl4v",
                    "author": "kreuzguy",
                    "score": 1,
                    "created_utc": 1620339851.0,
                    "response": "In both examples (eBay and Uber) you would still need a central authority to define if the terms were accomplished (the user arrived at the destination and the good arrived at my house). How would that step would not be centralized in some arbitror?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx7s5ug",
                    "author": "vitale20",
                    "score": 1,
                    "created_utc": 1620346008.0,
                    "response": "I thought this shit was money",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx7sq72",
                    "author": "AryanPandey",
                    "score": 1,
                    "created_utc": 1620346302.0,
                    "response": "isnt 70% ethereum premined?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx81snx",
                    "author": "uclatommy",
                    "score": 1,
                    "created_utc": 1620350961.0,
                    "response": "I don't think this is a great explanation. How can you replace uber or ebay as centralized facilitators of a transaction in which a good or service was exchanged with a smart contract? That's still unclear.\n\nI think the answer to this is as follows:  \nYou can build a smart contract in which a person requesting a ride pays for the ride to the contract. The contract has inputs to listen to the status of the ride being given. When the ride is concluded, it triggers the contract to pay the driver. In this case, there is no centralized authority but there is a need for some datasource that informs the contract when to transfer eth from rider to driver.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gx8d2ih",
                    "author": "Thediamondhandedlad",
                    "score": 1,
                    "created_utc": 1620356858.0,
                    "response": "Eth will be worth 1 million in 15 years. Just watch",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}