{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uutkb6",
            "title": "“Why I am not going to buy a computer” - Wendell Berry essay from 1987. Does this type of thinking seem familiar?",
            "url": "https://classes.matthewjbrown.net/teaching-files/philtech/berry-computer.pdf",
            "author": "sleepapneainvestor",
            "created_utc": 1653159452.0,
            "score": 326,
            "num_comments": 126,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9hvtdu",
                    "author": "uncle_dennis",
                    "score": 135,
                    "created_utc": 1653170145.0,
                    "response": "To be fair to Berry, he actually lived a solution to the problems he wrote about.\n\nHe has an absolute masterful collection of essays regarding the state of agriculture in North America and the collapse of what were once thriving local economies.\n\nEveryone should care somewhat about his message if you care about eating and food sovereignty. Arable soil is a finite resource and we are losing large amounts of it year over year to poor farming practices that are the result of corporate farming and mono cropping. \n\nHe is / was a major proponent of \"decentralized farming\". Preserving the small farm with resilient local economies / communities, which are almost entirely eradicated. \n\nI understand how this quote could be cherry picked to get sympathy from the crypto crowd but it is important to understand the broader context of his work and how it is more similar than not to what Ethereum is trying to do with decentralized, resilient internet communities and peer to peer exchange of resources.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hyib1",
                            "author": "GenoPax",
                            "score": 16,
                            "created_utc": 1653171542.0,
                            "response": "True!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9jicqp",
                            "author": "NONcomD",
                            "score": 2,
                            "created_utc": 1653206693.0,
                            "response": ">Arable soil is a finite resource and we are losing large amounts of it year over year to poor farming practices that are the result of corporate farming and mono cropping\n\nSmall farming was never going to achieve the efficiency of farming we have now.\nSmall farms have the niche to grow ecologic vegetables and somewhat survive though. But in these times everybody ia bought by the bigger whale.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9jzrj6",
                                    "author": "uncle_dennis",
                                    "score": 4,
                                    "created_utc": 1653221503.0,
                                    "response": "This comment is exactly to Berry's point. \"There aren't enough people that can even diagnose what's wrong\".\n\nI am a small farmer growing what the USDA defines as \"specialty crops\": vegetables. You know the stuff that actually provides our nutrition.\n\nBig farming corporations are the result of short sighted efficiency. Sure, you can farm more acres with less people but the soil degradation is far worse, the product is worse and we still can't get it to everyone that needs it. So it may be efficient in one way but it is highly inefficient when considering the impact it has over time.\n\nHis point is that the small farm economies actually served the people in these regions. Now, there are food deserts everywhere and the vast majority of people are eating corn and soy products out of the gas station because they can't get to a grocery store.\n\nAlso we waste an absurd % of the food we grow anyway so, once again - efficiency, but in service to who? It isn't the people that need it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9j0iqy",
                            "author": "powellquesne",
                            "score": -2,
                            "created_utc": 1653192527.0,
                            "response": "> To be fair to Berry, he actually lived a solution to the problems he wrote about.\n\nNot unless he refused all medical care, never bought groceries, and never travelled. Also, the only reason we are reading his words right now is because we got them for free over the internet powered by electricity and computers, and packaged in a PDF file. Even in his day, to be a widely read 'essayist' required an electrically run paper mill, at least. I think Wendell was living a convenient lie.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9jbycx",
                                    "author": "PutItAllIn",
                                    "score": 8,
                                    "created_utc": 1653201094.0,
                                    "response": "This way of thinking though basically just leads to “if I can’t fix all of my issues, I may as well fix none of them”",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9jnsvd",
                                            "author": "powellquesne",
                                            "score": 0,
                                            "created_utc": 1653211741.0,
                                            "response": "He could have easily fixed all his issues. Just get a different job. I guess being a writer was more important to him than his principles after all. Continuing to submit typewritten manuscripts during a time when everyone was doing the work of upgrading was literally the easiest, laziest way for him to signal the exact opposite of what he was actually doing: living off the exploits of the printing press and the electrically driven publishing industry.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9jycaq",
                                                    "author": "uncle_dennis",
                                                    "score": 2,
                                                    "created_utc": 1653220521.0,
                                                    "response": "He farmed and wrote about it.. farming was his job",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9jzof9",
                                                            "author": "powellquesne",
                                                            "score": 1,
                                                            "created_utc": 1653221442.0,
                                                            "response": "Farming was a pastime for him. His primary career was as a novelist and columnist. Go look at his Wikipedia page.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9i7ewn",
                            "author": "navidshrimpo",
                            "score": -2,
                            "created_utc": 1653176242.0,
                            "response": "Everyone I know who is deep into crypto (professionally) is highly anti-technology.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hjwb3",
                    "author": "powellquesne",
                    "score": 184,
                    "created_utc": 1653164108.0,
                    "response": "It seems *very* familiar, especially since Berry's Luddism is ostensibly environmentally conscious. From the essay:\n\n> I would hate to think that my work as a writer could not be done without a direct dependence on strip-mined coal. How could I write conscientiously against the rape of nature if I were, in the act of writing, implicated in the rape? For the same reason, it matters to me that my work is done in the daytime, without electric light.\n\nSo this dude wasn't just anti-computer. He was anti-electricity. In *1987*. That is hardcore.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hk70m",
                            "author": "sleepapneainvestor",
                            "score": 15,
                            "created_utc": 1653164256.0,
                            "response": "I know of a lot of older people that are still alive today in the US south that grew up without running water or a flushable toilet. That must be a different perspective and hard to cope with in our present age.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9jvfu8",
                                    "author": "UncertainlyUnfunny",
                                    "score": 4,
                                    "created_utc": 1653218369.0,
                                    "response": "My Dad was a successful writer in the 60’s-80’s. His custom word processor was like a Ferarri: a guy came over to tune it up every few weeks. it was as big as two pizza boxes, had dedicated editing keys (find, delete, insert, etc). It had a blue and black 10 in monitor and eventually an 16k floppy drive, cost him about 20k.\nI don’t know the emery of computers vs pencil and paper over a lifetime from a materials standpoint. But I do know this luddite essay isn’t *Dante’s Inferno* either and was not reprinted with pencil and paper by the Accursive Monks of Ticonderoga.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9jxgw8",
                                            "author": "powellquesne",
                                            "score": 2,
                                            "created_utc": 1653219894.0,
                                            "response": "Ha ha! Great comment. I remember those old 'word processor' machines too. People today think we were happy to write with pen and paper before general computers came along. No we hated it because it took forever and there were many many products before computers designed to save us all that time.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9hlm99",
                                    "author": "powellquesne",
                                    "score": 2,
                                    "created_utc": 1653164968.0,
                                    "response": "I have some older people with a 'rustic' background in my family as well. Not sure ole Wendell would approve of writing on a flush john. Sounds like he refused even to work by candlelight, since he confined it to the daytime. (Perhaps he thought a fringe benefit would be hiding from all the succubi and other night spirits?)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9jsubi",
                                            "author": "mienaikoe",
                                            "score": 2,
                                            "created_utc": 1653216240.0,
                                            "response": "Aw but those are the best ones for writing ideas",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9izw24",
                                    "author": "ThreeDubWineo",
                                    "score": 1,
                                    "created_utc": 1653192113.0,
                                    "response": "My dad had an outhouse until he was like 10. The last 50 years has been a technology supernova",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9j8um6",
                                            "author": "hhhhhjhhh14",
                                            "score": 3,
                                            "created_utc": 1653198551.0,
                                            "response": "The equivalent for us is gonna be not having access to broadband internet for a part of our lives",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9jp0mf",
                                                    "author": "DarkChocolatRaisinet",
                                                    "score": 5,
                                                    "created_utc": 1653212851.0,
                                                    "response": "Yeah, I straddle that line (early-end of \"Millennial\") and I've actually come to see it as an advantage; to have lived before, during, and after the creation of the internet. Has given me a relatively unique perspective imo.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9jebn0",
                                                    "author": "jarfil",
                                                    "score": 1,
                                                    "created_utc": 1653203129.0,
                                                    "response": "It is already. Some years ago I tried to remember what did I use to do all day without Internet, Google, or Wikipedia... and I can no longer fully figure it out.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9hp9rg",
                            "author": "AmericanDervish",
                            "score": 94,
                            "created_utc": 1653166781.0,
                            "response": "Where did he think all the fucking paper he used to write with came from, the Paper Fairy?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9htni9",
                                    "author": "falsealzheimers",
                                    "score": 63,
                                    "created_utc": 1653169026.0,
                                    "response": "Maybe maaaayyybe he made his own out of old pulp?\n\nIn daylight of course.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ipzj5",
                                            "author": "user260421",
                                            "score": 3,
                                            "created_utc": 1653186351.0,
                                            "response": "Sure thing\n\n\nYou never know what was happening in the back of the barn",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9l3asb",
                                                    "author": "PumpkinSpice2Nice",
                                                    "score": 1,
                                                    "created_utc": 1653240337.0,
                                                    "response": "I’m pretty sure my university degree is printed on animal skin to make it more special or some shit.  \n\nPerhaps he is skinning and drying his enemies skin in the barn and writing on *that*?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9hwsj1",
                                            "author": "AmericanDervish",
                                            "score": 0,
                                            "created_utc": 1653170648.0,
                                            "response": "😂",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9i36on",
                                    "author": "Ok-Nefariousness1340",
                                    "score": 25,
                                    "created_utc": 1653173979.0,
                                    "response": "tbf using lumber products is pretty different than burning coal environmentally.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9iwoou",
                                            "author": "Trakeen",
                                            "score": -1,
                                            "created_utc": 1653190100.0,
                                            "response": "Metal used to make the type writer. Which is about the same as mining coal",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9jdu3d",
                                    "author": "feketegy",
                                    "score": 5,
                                    "created_utc": 1653202713.0,
                                    "response": "You gotta draw that hypocrisy line somewhere. He did it at paper and pen.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9i1wws",
                                    "author": "bakura693",
                                    "score": 2,
                                    "created_utc": 1653173309.0,
                                    "response": "You made me laugh, thanks.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9ijp5y",
                                    "author": "SMAMtastic",
                                    "score": 1,
                                    "created_utc": 1653182930.0,
                                    "response": "What do you think the horses were for?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9igf9v",
                            "author": "L0ckeandDemosthenes",
                            "score": 8,
                            "created_utc": 1653181182.0,
                            "response": "Well to be honest electricity is pretty dumb and caused most of our problems. Computers are stoopid boxes and just replaced the dumb TV box with a dumber chat box. Without electricity the world could truly chill. Man, electricity is dumb the Amish got it figured out.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9izzeu",
                                    "author": "powellquesne",
                                    "score": 8,
                                    "created_utc": 1653192174.0,
                                    "response": "Have you read any of the history of the world from before electricity? It was not \"chill\" at all.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9jlchq",
                                            "author": "L0ckeandDemosthenes",
                                            "score": 2,
                                            "created_utc": 1653209445.0,
                                            "response": "Without electricity i wouldn't have had to read this comment and my life would be infinity better. I feel dumber for having read it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9jnnop",
                                                    "author": "powellquesne",
                                                    "score": 1,
                                                    "created_utc": 1653211605.0,
                                                    "response": "Clearly.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9k2c7t",
                                                            "author": "L0ckeandDemosthenes",
                                                            "score": 1,
                                                            "created_utc": 1653223166.0,
                                                            "response": "And for the record history is dumb. It's all stuffed that already happened and doesn't matter anymore. Don't even know why they teach it. So dumb.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9k5eq1",
                                                                    "author": "powellquesne",
                                                                    "score": 2,
                                                                    "created_utc": 1653224973.0,
                                                                    "response": "> for the record\n\nLmao",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9lbsdn",
                                                                            "author": "Conversiongfx",
                                                                            "score": 1,
                                                                            "created_utc": 1653244047.0,
                                                                            "response": "gottem",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9jf0n2",
                                    "author": "nabetse7deuce",
                                    "score": -2,
                                    "created_utc": 1653203738.0,
                                    "response": "You are a troll, but if you really think so go live in Haiti",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9iq4k9",
                            "author": "user260421",
                            "score": 1,
                            "created_utc": 1653186431.0,
                            "response": "Imagine how people are going to read reddit threads 100 years from now and wonder wtf was in our heads",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9j01kb",
                                    "author": "powellquesne",
                                    "score": 0,
                                    "created_utc": 1653192214.0,
                                    "response": "I can absolutely guarantee that 100 years from now, people will still be using electricity and computers.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9jessj",
                                            "author": "jarfil",
                                            "score": 1,
                                            "created_utc": 1653203548.0,
                                            "response": "Well, people still use sticks and stones... but computers seem likely to become photonic-based instead of electricity-based. That light might still come from an electric source, but also might not, like maybe a bioluminescent source.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9jn6zo",
                                                    "author": "powellquesne",
                                                    "score": 1,
                                                    "created_utc": 1653211173.0,
                                                    "response": "Regardless of how computers store data in the future (probably some quantum based system) they would still require electricity to power. We cannot have any significant technology without electricity because all work requires energy, and every single possible source of energy we know about, including solar power, wind power, and nuclear, is just another way of generating electricity.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9joxvh",
                                                            "author": "jarfil",
                                                            "score": 1,
                                                            "created_utc": 1653212779.0,
                                                            "response": "There can be light without electricity, there are even some [self-replicating non-electrical light sources](https://youtu.be/eWIhn16RsHU) in the wild right now. A computer that worked on light, could just as well use a (bio)chemical battery with light output instead of electricity.\n\nNowadays we use electricity as a versatile medium to quickly move energy over large distances, but it is far from being the only solution or even the most efficient one. A simple example would be a natural gas vs. electric stove: if your target energy form is heat, it makes more sense to supply gas and burn it for heat, instead of capturing that heat into water to move a generator than transfers electricity over the power grid to turn back to heat in a stove.\n\nFewer energy transformations and transfers mean fewer losses, so a chemical battery that could be charged with sunlight and glowed in the dark to power a photonic computer, would make a lot of sense.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9jpl3b",
                                                                    "author": "powellquesne",
                                                                    "score": 0,
                                                                    "created_utc": 1653213375.0,
                                                                    "response": "Light is just another form of electromagnetism so its energy is based on electric charge as well. There is no fundamental difference between beaming energy out with light vs radio/micro waves, they are all just electromagnetic waves of different frequencies.\n\nThe fact is that electrical energy is one of the most environmentally friendly aspects of technology. Electric charge cannot be linked with any particular source because it is simply the energetic language of the universe. Electricity is just as good and useful whether it originates from burning coal or from a solar cell.\n\nElectricity is not the problem.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9js04w",
                                                                            "author": "jarfil",
                                                                            "score": 1,
                                                                            "created_utc": 1653215524.0,
                                                                            "response": ">Light is just another form of electromagnetism\n\nKeyword: form.\n\nElectricity is not light, even if both arise from electromagnetism. If your argument was to claim that we'll be using electromagnetism in 100 years... well, sure, and gravity, and atomic forces, and most of physics. I'm saying that in 100 years there likely will be computers operating on light, and ways to provide it with fewer energy trans-form-ations.\n\nAs for the environment... either get air scrubbers, or biodomes. In 100 years, it's likely that biodomes will offer better living conditions than what air scrubbers would have managed to fix outside.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9jscv3",
                                                                                    "author": "powellquesne",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653215826.0,
                                                                                    "response": "1. Do you sincerely believe that people will be using exclusively photonic energy in 100 years or do you just want to talk about photonic energy? Seems like the latter.\n\n2. I highly doubt that Wendell Berry would approve of the environmental impact of your battery technology and much less of solving our problems with air scrubbers instead of some idyllic 'going back to nature' so what are we even talking about?\n\n3. Nuclear is clearly the only non-carbon-spewing source of energy that can actually meet global demand. And it's electrical, so it's very clear that either human civilisation will go fully nuclear and therefore *fully electrical*, or it will perish. Photonics are likely to be a footnote in this scenario.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9jtlpj",
                                                                                            "author": "jarfil",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653216882.0,
                                                                                            "response": "1. Will you accept that there are more ways to produce and transport energy than electricity, or do you just want to claim that everything is electricity?\n2. I don't care about Wendell Berry, I'm talking about your 100 year prediction. The environmental impact is already done, even if all of humanity vanished right this instant.\n3. [Nuclear can provide heat without electricity](https://www.dw.com/en/czech-researchers-develop-revolutionary-nuclear-heating-plant/a-57072924). No, the future is not \"fully electrical\", and there will be more and more ways to avoid the conversion to and back fr electricity.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9hth3x",
                    "author": "bustersdrum",
                    "score": 50,
                    "created_utc": 1653168934.0,
                    "response": "I wish people would actually read Wendell Berry before dismissing him as a luddite…it is not so much his disdain for technology, but rather a love for the natural world and a sense of loss in the wake of what he perceives to be the perpetual settling/civilization of wild places.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hyh77",
                            "author": "GenoPax",
                            "score": 9,
                            "created_utc": 1653171527.0,
                            "response": "I've read and love the work of Wendell Berry. But he's the closest luddite spokesperson we have in the modern world. He definitely loved nature, but he loved how man could cultivate nature in an agrarian system too. He just wasn't sure were the modern world went wrong and explored it in numerous essays, most trying to persuade the modern world wasn't good for kids, families and health.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9j0suy",
                            "author": "powellquesne",
                            "score": 4,
                            "created_utc": 1653192717.0,
                            "response": "He's exactly the kind of hypocrite he pretends not to be. His career would not have been possible without the printing press, which certainly required electricity in 1987. Lots of it!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9jykiy",
                                    "author": "bustersdrum",
                                    "score": 0,
                                    "created_utc": 1653220681.0,
                                    "response": "My point is that it’d be really nice if people actually read/understood Berry before casting sweeping statements about his life and thought. \n\nEveryone is a hypocrite in some form. You could call literally everyone a hypocrite and then dismiss everything and everyone without any real understanding.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9k0lx7",
                                            "author": "powellquesne",
                                            "score": 2,
                                            "created_utc": 1653222066.0,
                                            "response": "That's a bit too blanket a statement but I agree that hypocrisy can be hard (though not impossible) to avoid. However, Wendell Berry in this essay made a special point of saying that he is avoiding computers specifically in order to avoid hypocrisy, but he hadn't genuinely done so, had he? So his explanation seems facetious and inadequate. I don't believe that it's the real reason for his resistance. Look, the guy was already over 50 years old by this point, set in his ways, and computers must have seemed to him like a young person's thing. It would have been easy for him to dismiss, given his views, but the motivation was likely not avoiding hypocrisy, as he claimed, but merely technophobia. Who wants to have to relearn the tools of their trade after the age of 50? It's a bit of a nightmare but time marches past all of us in the end.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9hxs0w",
                    "author": "Briyo2289",
                    "score": 28,
                    "created_utc": 1653171161.0,
                    "response": "I live one town over from Wendell and his family.  I'd suggest you actually take the time to become familiar with his thought before you make him some posterboy for what you consider old fashioned or out of touch.   It's a bit ignorant.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9i2l4u",
                            "author": "randomkeystrike",
                            "score": 5,
                            "created_utc": 1653173659.0,
                            "response": "Missed a chance to hear him speak about 1.5 hours from my house because a friend invited me but I had an iron clad commitment to be elsewhere. I have no idea what the commitment was but I still think of this every time I hear about Wendell Barry. That was over 10 years ago.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9i34o0",
                            "author": "uncle_dennis",
                            "score": 12,
                            "created_utc": 1653173950.0,
                            "response": "I'm happy there are multiple comments in this thread with support of Berry.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hse40",
                    "author": "whyNadorp",
                    "score": 8,
                    "created_utc": 1653168370.0,
                    "response": "The situation with crypto is similar, but there are many differences also. I don’t think the average joe will ever want to get paid in crypto. The idea of terra to create a stable coin and mirror stock market and other stuff had a lot of potential, but they f’d up big time. For now the best crypto offers is high volatility. The other good point is independence from banks, but I don’t care much about that and have had good experiences till now with centralised exchanges. Scams and charlatans everywhere don’t help to popularise the tech. No idea what could trigger widespread adoption.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9jtsym",
                            "author": "Dry-Hurry-7598",
                            "score": 3,
                            "created_utc": 1653217054.0,
                            "response": "Dude this is like saying in the 1990s why would I ever read the news on the internet, because In the 1990s websites were slow and clunky and had bad ui, and most of all aren’t portable. It took the internet 24 years to be really mass adopted by significant amount of people, we have been in this space 13 years. The tech is only getting stronger, and projects will get more scrutinised and checked for bad code or poor fundamentals, if you allow yourself to judge the state of the tech now you might look back and think the opportunity you missed",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ke6wn",
                                    "author": "whyNadorp",
                                    "score": 1,
                                    "created_utc": 1653229458.0,
                                    "response": "yeah, but this internet comparison is just a marketing pitch. there’s no reason why crypto and internet should follow the same evolution path or have a similar timeline. crypto might stay in a niche for very long time, nobody knows.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9kenpv",
                                            "author": "Dry-Hurry-7598",
                                            "score": 1,
                                            "created_utc": 1653229680.0,
                                            "response": "True, nobody knows but we can reference the path, if we would have judged bitnet when it was first released we also would have called it a niche system with nothing to come out of it, but clearly it was the bedrock of the internet, and allowed all this innovation to start. \n\nI guess like you said time will tell",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9hsf04",
                            "author": "Paid-Not-Payed-Bot",
                            "score": 6,
                            "created_utc": 1653168382.0,
                            "response": "> to get *paid* in crypto.\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hwa2y",
                                    "author": "whyNadorp",
                                    "score": 8,
                                    "created_utc": 1653170387.0,
                                    "response": "Thanks bot, do you get payed to do this?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hwaw8",
                                            "author": "Paid-Not-Payed-Bot",
                                            "score": 3,
                                            "created_utc": 1653170399.0,
                                            "response": "> you get *paid* to do\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9i2wtb",
                                                    "author": "358476278464",
                                                    "score": 4,
                                                    "created_utc": 1653173831.0,
                                                    "response": "This bot sounds like it has a hard time getting layed.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9i24vm",
                                                    "author": "Rife29",
                                                    "score": 2,
                                                    "created_utc": 1653173425.0,
                                                    "response": "I'll definitely reflect on this new learning as I cover my deck with tar or resin later... I've been so busy this spring, it has yet to be paid.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9i7j7s",
                    "author": "navidshrimpo",
                    "score": 8,
                    "created_utc": 1653176307.0,
                    "response": "ITT: people with context; people without context.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9iej9n",
                    "author": "cubsfan2154",
                    "score": 3,
                    "created_utc": 1653180154.0,
                    "response": "Yeah... on this very sub when it comes to NFTs",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jwxsw",
                    "author": "No_I-D",
                    "score": 3,
                    "created_utc": 1653219507.0,
                    "response": "He’s using technological advances (typewriter, pencil, etc) to criticize technological advances…",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9lbh8e",
                            "author": "Current_Crow_9197",
                            "score": 1,
                            "created_utc": 1653243904.0,
                            "response": "What? You don’t use the paper and pen tree for all your environment friendly writing needs?! For shame, Sir!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hsv6q",
                    "author": "jazzfruit",
                    "score": 10,
                    "created_utc": 1653168619.0,
                    "response": "FWIW Wendell Berry it’s an excellent writer and poet, one of the best in the naturalist genre. Edward Abbey is another great naturalist writer with Luddite and gate keeping tendencies. I guess it comes with the territory. They basically worshipped pure nature and wilderness and maintained that the highest experience of nature is through raw interaction. They lived very different lives than probably everyone reading r/ethereum.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ijt8j",
                    "author": "orion2145",
                    "score": 4,
                    "created_utc": 1653182992.0,
                    "response": "The dripping sarcasm in the response is amazing:\n\nWendell Berry provides writers enslaved by the computer with a handy alternative: Wife - a low-tech energy-saving device. Drop a pile of handwritten notes on Wife and you get back a finished manuscript, edited while it was typed. What computer can do that? Wife meets all of Berry's uncompromising standards for techno- logical innovation: she's cheap, repairable near home, and good for the family structure. Best of all, Wife is politically correct because she breaks a writer's \"direct dependence on strip-mined coal.\"\nHistory teaches us that Wife can also be used to beat rugs and wash clothes by hand, thus eliminating the need for the vacuum cleaner and washing machine, two more nasty machines that threaten the act of writing.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9lb0tm",
                            "author": "Current_Crow_9197",
                            "score": 1,
                            "created_utc": 1653243697.0,
                            "response": "Hahah I need one of these!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9jti1q",
                    "author": "Dry-Hurry-7598",
                    "score": 2,
                    "created_utc": 1653216794.0,
                    "response": "It’s also very similar to how people see peoples comments about the 1990 internet, most people knew about it but because of internet speed limitations, and computer limitations, most websites were clunky and slow, and they were deemed inferior solutions to their counterpart. \n\nFor example articles on early web days was so inferior compared to a news paper, because it was slow to load, the format was not user friendly with clunky ui, and most of all it was portable, so I couldn’t take it anywhere with me like a normal paper. \n\nSame thing is happening here, people think what’s the point of crypto, it’s inferior technology and isn’t as good as the services we use today. But as mainnet gets better you’ll see new possibilities with crypto",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jwk4n",
                    "author": "towjamb",
                    "score": 2,
                    "created_utc": 1653219228.0,
                    "response": "Some people are just afraid of change.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jxkwy",
                    "author": "TertlFace",
                    "score": 2,
                    "created_utc": 1653219979.0,
                    "response": "“It should use some form of solar energy, such as that of the body”\n\n[*tries self-initiate stellar fusion, shits pants*]",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9kiqkr",
                    "author": "Letsmakeitawsome",
                    "score": 2,
                    "created_utc": 1653231544.0,
                    "response": "Plot twist: he did",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9lbtz9",
                            "author": "Current_Crow_9197",
                            "score": 1,
                            "created_utc": 1653244066.0,
                            "response": "Then he hired a younger person to operate it, whilst railing said younger person for not working hard like olden days as the computer does ALL the work for them.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ks9iz",
                    "author": "CultureVulture629",
                    "score": 2,
                    "created_utc": 1653235734.0,
                    "response": "Every emerging technology/product has critics. Most of them were right, but you don't remember because the products they criticized faded away into oblivion.\n\nI don't know if crypto will (or should) become as ubiquitous as computers, but it's way too early to run a victory lap. It's just a matter of if the general public is willing to deal with the downsides in favor of the upsides. Things like reality TV, social media, micro-transactions, and yes even computers have many societal downsides that people are not quiet about, but obviously the majority of people (or at least, enough to sustain it) are willing to overlook them in favor of the positives.\n\nI'm skeptical of crypto. Yes, I've invested, in case I'm wrong, but at this time I don't see the public at large finding much use for the technology. Maybe crypto will stick around for good, but I'm not sure it will see wide scale use like many of its loudest proponents are projecting.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9l6gcm",
                    "author": "DJ_Crunchwrap",
                    "score": 2,
                    "created_utc": 1653241698.0,
                    "response": "Old people hate change and think the world was perfect when they were 30. It's always been like this and it will always be like this. Don't listen to them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hiqwa",
                    "author": "H4y3s_",
                    "score": 9,
                    "created_utc": 1653163536.0,
                    "response": "‘It’s all a bunch of liberal BS! Mark my words Charlie in 20 years no one will have a computer!’",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hhdti",
                    "author": "s_arme",
                    "score": 4,
                    "created_utc": 1653162861.0,
                    "response": "Computer, Internet, mobile phone, smartphone, and now crypto \nI missed many more in between",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hihom",
                            "author": "Noob313373",
                            "score": 3,
                            "created_utc": 1653163413.0,
                            "response": "What are these things?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9i0m26",
                                    "author": "Rapidlysequencing",
                                    "score": 3,
                                    "created_utc": 1653172630.0,
                                    "response": "Basically typewriters.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9jfdfr",
                                            "author": "FucksWithCats2105",
                                            "score": 1,
                                            "created_utc": 1653204041.0,
                                            "response": "How did people watch porn on a typewriter? They sound useless to me.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9jysti",
                                                    "author": "powellquesne",
                                                    "score": 1,
                                                    "created_utc": 1653220843.0,
                                                    "response": "Here's a nice rabbit hole for you to explore: ASCII porn. It was a whole early subculture and typewriter compatible.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9iaaac",
                                    "author": "ELCNYTROID",
                                    "score": 2,
                                    "created_utc": 1653177829.0,
                                    "response": "Ways to diversify your expenses",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9hyspm",
                                    "author": "TheMailNeverFails",
                                    "score": 1,
                                    "created_utc": 1653171687.0,
                                    "response": "Different ways you can pay your bills lol",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9idr9q",
                    "author": "KlopKlop10293",
                    "score": 2,
                    "created_utc": 1653179732.0,
                    "response": "There are actually some good points, computers at that time weren’t that useful for the average John writer that just wanted to write, it was indeed probably just easier to use paper and pen",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9j0zex",
                            "author": "powellquesne",
                            "score": 1,
                            "created_utc": 1653192841.0,
                            "response": "This is so wrong. Typewriters were a thing.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9k2489",
                                    "author": "KlopKlop10293",
                                    "score": 1,
                                    "created_utc": 1653223026.0,
                                    "response": "I’d prefer using a pen and pencil then one of these, and if you prefer typewriters then cool it’s not the same for anyone",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9k2kbt",
                                            "author": "powellquesne",
                                            "score": 1,
                                            "created_utc": 1653223302.0,
                                            "response": "Typewriting was several times faster already but what I prefer is computers; they are the fastest of all because you don't ever have to apply brush-on white-out and you never have to throw away and retype a page due to editing or errors, something I remember having to do quite a bit before I had a computer.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9kg4xo",
                                                    "author": "KlopKlop10293",
                                                    "score": 1,
                                                    "created_utc": 1653230365.0,
                                                    "response": "Cool that’s for you not for him, let people have their own opinion",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9kt84t",
                                                            "author": "powellquesne",
                                                            "score": 1,
                                                            "created_utc": 1653236152.0,
                                                            "response": "I'm not stopping anyone from having their own opinion, am I? So let me have mine.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9ktgf3",
                                                                    "author": "KlopKlop10293",
                                                                    "score": 1,
                                                                    "created_utc": 1653236254.0,
                                                                    "response": "i havent start replying to you saying his opinion arent ok",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ipfbt",
                    "author": "dompomcash",
                    "score": 1,
                    "created_utc": 1653186033.0,
                    "response": "If you thought that ETH would act as a Stablecoin rather than a holding that could increase in value, would you own it? I’d be willing to be that 90% of this sub would not. The point in asking the question is to demonstrate that the utility portion comes second for most holders. It’s the speculative nature and the potential for huge earnings that cause most to even use that damn blockchain. At the same time, the speculative/volatile nature will also dissuade mass adoption. It’s a double edge sword and I don’t think it’s irrational to bet against mass adoption. I certainly am not convinced",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9i314p",
                    "author": "358476278464",
                    "score": -1,
                    "created_utc": 1653173894.0,
                    "response": "I certainly wouldn't want to write on a computer from 1987, either.\n\nThat being said, a computer is way less expensive than a wife.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9jf7vn",
                            "author": "jarfil",
                            "score": 2,
                            "created_utc": 1653203915.0,
                            "response": "I'd rather write on a computer from 1987 than on a typewriter, for a simple reason: you can't edit text on a typewriter.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9im90l",
                    "author": "cam_breakfastdonut",
                    "score": -1,
                    "created_utc": 1653184314.0,
                    "response": "As a general rule, Wendell Berry is right and other people are wrong",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hxvpe",
                    "author": "ethosproject",
                    "score": 1,
                    "created_utc": 1653171213.0,
                    "response": "https://nerdyseal.com/why-i-am-not-going-to-buy-a-computer-by-wendell-berry/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jb5jx",
                    "author": "tamhenk",
                    "score": 1,
                    "created_utc": 1653200430.0,
                    "response": "Commas, commas, everywhere! It's, very, annoying.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jffwh",
                    "author": "Reddit5678912",
                    "score": 1,
                    "created_utc": 1653204098.0,
                    "response": "Except computers weren’t pyramid schemes. Computers offered services and had use cases to the common person. You didn’t buy a computer, lock it up in your closet, then just eventually sell it for a profit or loss to the next gullible Schmoe.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9jugmi",
                            "author": "Dry-Hurry-7598",
                            "score": 1,
                            "created_utc": 1653217577.0,
                            "response": "To who a few accountants, scientist ? You forget many skeptics believed the computer was just a niche device only made for enterprise. You suffer from hein sight so you’ll obviously have a bias. \n\nAnd the same niche application is in crypto as the technology is in its infancy, being able to transfer money cheaper and faster that’s it. Ofcourse you can’t find a use case, if everyone could find one it would already be here. Most of these great advancements came from people thinking outside the box and now they’re the current billionaires",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9kqmrt",
                                    "author": "Reddit5678912",
                                    "score": 1,
                                    "created_utc": 1653235029.0,
                                    "response": "It still had a huge use case. My point is crypto doesn’t. It’s only valuable because it’s “new” a decade of crypto and it’s still only a pyramid scheme.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9kzf8w",
                                            "author": "Dry-Hurry-7598",
                                            "score": 1,
                                            "created_utc": 1653238718.0,
                                            "response": "I guess time will tell that’s all we can do.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9jqmeb",
                    "author": "Sorry_Attitude_",
                    "score": 1,
                    "created_utc": 1653214304.0,
                    "response": "It's always hilarious seeing people use such bullshit arguments as these articles \n\nIt is a good reinforcement of belief for us though, shows us that naysayers will always naysay\n\nI will happily participate and help push Crypto, Get into Fundraising for building on blockchain  through Angelblock, and make money while at it, because otherwise it does defeat the purpose, money makes the planet work in the end, want it or not",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9kbxkm",
                    "author": "TheOmegaKid",
                    "score": 1,
                    "created_utc": 1653228366.0,
                    "response": "I wonder if he ever did buy a computer?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ii9ob",
                    "author": "Dismal_Ad_7318",
                    "score": -1,
                    "created_utc": 1653182167.0,
                    "response": "he explains why he is happy with his typewriter.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j0ttc",
                    "author": "RTGold",
                    "score": -1,
                    "created_utc": 1653192735.0,
                    "response": "I'm sure for every example where someone doubted a technology and it took off, you could find dozens where people doubted a technology and it failed. We don't remember the failures though because well, they failed.                       \nI'd also like to add, what could a computer in 1987 do for the average person? I doubt there was much it could do that would actually make their lives better. This was probably a normal opinion at the time and as the technology grew and changed, I imagine so did his opinion of it. It's okay to change your opinion.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9j26hd",
                            "author": "powellquesne",
                            "score": 2,
                            "created_utc": 1653193648.0,
                            "response": "Computers in 1987 could do word processing, complex databases, spreadsheets, and people's taxes. The idea that they weren't useful back then is just offbase. They would not have taken off otherwise. By 1987, everyone I knew under 30 had access to and used a computer and printer, and most older people as well. Avoiding them categorically was no longer a normal opinion. Maybe in 1977, sure.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9juo0m",
                                    "author": "Dry-Hurry-7598",
                                    "score": 1,
                                    "created_utc": 1653217747.0,
                                    "response": "Very niche and only really\nGood for enterprise level, know where near the main adoption it has today. Many skeptics believed that the computer was a niche device only for businesses. \n\nCrypto has same thing, it allows for fast transactions across the world very cheaply, and it allows people to access services in defi they couldn’t get in normal finance because their country restricts it. Yes seems very very limited but so was the internet and computers back then",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9jw7vg",
                                            "author": "powellquesne",
                                            "score": 1,
                                            "created_utc": 1653218966.0,
                                            "response": "> Very niche and only really Good for enterprise level\n\nAlso wrong. You are describing the 1970s, at the end of which the **personal** computer revolution began. By 1987, personal computers had been on the market for ten years. I had one for school. My father had a separate one for work. All his co-workers had computers at home for work as well. All my friends regardless of socioeconomic status used computers to print out their essays and school reports.\n\nThe ones who didn't have computers of their own would just go to the school's computer labs to type up their work and print it, labs which existed ever since the start of the personal computer revolution. I myself taught the basics of how to use personal computers to other students and even to some of the teachers, in these computer labs starting around 1979, and I kept doing it until the late '80s when it was no longer necessary because most people, students and teachers alike, understood the basics by then.\n\nPeople really have a wrong impression of what the computing scene was like in the '80s. It was taking the world *by storm*. I expect that's why Wendell Berry felt the need to write a contrarian essay about his refusal to jump on everybody's bandwagon.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9kehcg",
                                                    "author": "Dry-Hurry-7598",
                                                    "score": 1,
                                                    "created_utc": 1653229597.0,
                                                    "response": "True but tbh idk why I’m sticking up for the computer narrative, I think I meant the internet tbh, many critics assumptions are based on the limited use cases of crypto. The issue is the infrastructure for applications to be built on eth for example is still being made. \n\nIf we were going to judge bitnet when it was first released we’d say it’s a very inferior product and nothing would come out of it, but it’s literally the bedrock of the internet. Just give it time, yes I could be wrong but the amount of money and now developers in the space gives me confidence that the space would flourish in decentralising and ultimately making things much cheaper and fairer because we can remove middle men",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9koknx",
                                                            "author": "powellquesne",
                                                            "score": 2,
                                                            "created_utc": 1653234140.0,
                                                            "response": "ARPANET was the original form of the internet starting from 1969. I agree that the internet is a better analogy for cryptocurrencies than general computing. Crypto seems to be at around the 1990 stage of internet development: adopted by certain niche sectors of society (back then it was universities) but has not yet found its killer app that will lead to a skyrocketing userbase (back then it was Netscape Navigator).",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ji87p",
                    "author": "Russianbot123234",
                    "score": -1,
                    "created_utc": 1653206583.0,
                    "response": "The dude was right. I get it we live in a world that's ruled by tech but that doesn't mean it's right.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9jz847",
                            "author": "powellquesne",
                            "score": 1,
                            "created_utc": 1653221126.0,
                            "response": "Technology is a tool. It is neither right nor wrong. The first technology was language.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}