{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvbq32",
            "title": "SEBI proposes ban on celebrity endorsement of cryptocurrency/NFTs",
            "url": "https://sanatancharacters.blogspot.com/2022/05/sebi-prposes-ban-on-celebrity-endorsememt-of-cryptocurrency-nft.html",
            "author": "SanatanCharacters",
            "created_utc": 1653228567.0,
            "score": 1,
            "num_comments": 9,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9kgwgt",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1653230718.0,
                    "response": "tldr; The Securities and Exchange Board of India (Sebi) has red-flagged prominent public figures, including celebrities, sportsmen, etc. endorsing crypto products in any kind of advertisement. SEBI said that crypto assets are neither defined as securities under Securities Contracts (Regulation) Act, 1956 or SCRA, nor are they notified as securities by the Central Government. As on date, crypto is not regulated and has been named as virtual digital assets for taxation purpose only.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lkk8k",
                    "author": "Perleflamme",
                    "score": 1,
                    "created_utc": 1653248033.0,
                    "response": "Will they also ban endorsement of fiat, too? And endorsement of the stockmarket? And the endorsement of shares? No? \n\nNo, thank you, we don't need yet another Ministry of Truth.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9osu75",
                            "author": "Bigbadbuck",
                            "score": 1,
                            "created_utc": 1653317115.0,
                            "response": "Then you prolly gotta enforce some consumer protection on these rugs",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9pvwid",
                                    "author": "Perleflamme",
                                    "score": 1,
                                    "created_utc": 1653333710.0,
                                    "response": "Absolutely not. State enforced \"consumer protection\" means censorship. It doesn't mix with a censorship resistant ecosystem. \n\nAnd it only \"protects\" against some scams instead of all of them by wasting lots of your own money in the process. \n\nPeople simply need to learn. Better awareness tools, notably, would be welcomed.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9q02mo",
                                            "author": "Bigbadbuck",
                                            "score": 1,
                                            "created_utc": 1653335486.0,
                                            "response": "If I tel you I’m selling you a car and it’s a lemon it’s fraud. Crypto seems to be the only industry where this type of thing is ok because of the libetarianian streak",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}