{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urfgqu",
            "title": "ForThePlayers.gg - I compiled a list of top play-to-earn games and calculated ROI + minimum investment for each so you don't get burned. Mostly EVM based (Polygon, BSC, Wax)",
            "url": "https://www.reddit.com/r/ethereum/comments/urfgqu/fortheplayersgg_i_compiled_a_list_of_top/",
            "author": "Parker_in_HK",
            "created_utc": 1652765808.0,
            "score": 2,
            "num_comments": 2,
            "subreddit": "ethereum",
            "selftext": "# [FORTHEPLAYERS.gg](https://fortheplayers.gg/)\n\nHey all, I'm a crypto developer and even though I deeply understood how crypto works, I found PTE games to be super confusing. Things like incentivized liquidity for founder exits, out-of-control inflation, character max-use limits, and token pre-sales when there's no product/game yet - all of these can be harmful to users.\n\nMy latest project has been to break down top crypto play to earn games so that you can visualize what the return-on-investment is if you're spending your hard-earned money to play. You can see:\n\n* Minimum Investment required\n* Earnings per day\n* Return on investment (in days)\n* Optimal strategy\n* How-to-play guide\n* Token price\n\n[**FORTHEPLAYERS.gg**](https://fortheplayers.gg/)\n\nI made the calculators with a knowledgable game researcher and the game communities themselves. The calculators are **updated every 10 min using the latest token and NFT prices.** Here's an example of one that we made- [Link to Calculator](https://docs.google.com/spreadsheets/d/1SNG3DFxo9s7VLYu4XwtbjsGRWzE2U7T1mCxzhh1t1jw/edit#gid=406151422). We've played all these games ourselves to make sure our information is solid.\n\nThanks for checking it out! Is there something that's missing? Is there a game you'd like to see listed? Let me know in the comments.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8x6aqt",
                    "author": "AESTHTK",
                    "score": 1,
                    "created_utc": 1652773267.0,
                    "response": "Feel free to post on: r/EthGamers ✌️",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urfft9",
            "title": "Novogratz Goes Silent on Twitter After Collapse of Coin He Promoted",
            "url": "https://archive.ph/4mjzM",
            "author": "inasacu",
            "created_utc": 1652765709.0,
            "score": 43,
            "num_comments": 53,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8x9sjm",
                    "author": "Lynx77",
                    "score": 5,
                    "created_utc": 1652776494.0,
                    "response": "He’s probably getting that awful tattoo covered too, the lunatic",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xcqvs",
                    "author": "Papazio",
                    "score": 3,
                    "created_utc": 1652779214.0,
                    "response": "Neuvogrets",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xiosc",
                    "author": "Johndrc",
                    "score": 3,
                    "created_utc": 1652784275.0,
                    "response": "Hes done.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wxufv",
                    "author": "mezcal_1",
                    "score": 19,
                    "created_utc": 1652766283.0,
                    "response": "Even he got scammed",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x2xf1",
                            "author": "Y0rin",
                            "score": 18,
                            "created_utc": 1652770326.0,
                            "response": "Why do people insist that Luna was a scam? It was a mechanism that failed and formed a death spiral that killed it, but it was a legit experiment and could have worked with a few alterations.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8x4w63",
                                    "author": "GoingMenthol",
                                    "score": 35,
                                    "created_utc": 1652772019.0,
                                    "response": "*\"The whole system relies on the idea that no matter what happens, Luna always has some value. And as its value falls you can issue more and more of them until you have issued enough to keep Terra's value at a dollar*\n\n*But of course there's no reason to believe that you can issue an infinite number of coins at a positive price point. A coin that is backed by nothing but the faith of investors*\n\n*If this type of idea worked, companies like Lehman Brothers would have never gone bust, as they could have always just issued billions of dollars of new shares if even at a fraction of a cent and use that capital to pay off debt holders*\n\n*The structure of the Terra/Luna pair is remarkably similar to what's technically known as Fixed Value Convertible Bonds, but which are referred to in the industry as \"Death Spiral\" bonds\"*\n\nSource: [Patrick Boyle](https://youtu.be/iisPX_xVMV8)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8x5345",
                                            "author": "Y0rin",
                                            "score": 2,
                                            "created_utc": 1652772189.0,
                                            "response": "True, but doesn't make it a scam right? Or am I missing something?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8x6odv",
                                                    "author": "GoingMenthol",
                                                    "score": 10,
                                                    "created_utc": 1652773611.0,
                                                    "response": "Terra is an uncollateralized asset (algorithmic only). The way it keeps to $1 is by allowing people to buy UST at $0.99 or lower and sell at £1.00 or higher for profit\n\nThe idea is that price fluctuations don't last long because someone will buy when UST is below $1 (pushing the price back up to $1), and sell when UST is worth over $1 (pushing the price back down to $1)\n\nThis would technically stabilise the value at about $1 on average. But this also means the following: *You get higher profits when the value of 1 UST is far away from $1*\n\nYou can crash the price down by constantly selling, and buy back in at $0.01 in order to make a bigger profit when UST goes back to $1... But if everyone is selling to push the price down (causing the value to crash)... How will the value of 1 UST recover back to $1? In short, it doesn't. That's the death spiral.\n\n*\"This feature is where the problem lies: the bond investor might sell some stock short in order to hedge the bond, but this would push down the stock price, meaning that the bond holder is now guaranteed more stock upon conversion, so they then sell even more stock short. this cycle continues on, until the stock price hits zero\" -*  [Patrick Boyle again](https://youtu.be/iisPX_xVMV8)",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8x70ae",
                                                            "author": "Y0rin",
                                                            "score": 3,
                                                            "created_utc": 1652773908.0,
                                                            "response": "Again, this was known to everyone that invested. Nothing was promised otherwise.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8xbin8",
                                                                    "author": "Pixeltoir",
                                                                    "score": 6,
                                                                    "created_utc": 1652778082.0,
                                                                    "response": "Wait so if everyone knew, then why are they crying when it came crashing down??????  \n\n\nI mean they knew it would crash",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i8x7j85",
                                                                    "author": "GoingMenthol",
                                                                    "score": 9,
                                                                    "created_utc": 1652774402.0,
                                                                    "response": ">Why do people insist that Luna was a scam?\n\n&#x200B;\n\n>but doesn't make it a scam right?\n\n&#x200B;\n\n>Again, *this was known to everyone that invested*. Nothing was promised otherwise\n\nAre you telling me that Terra/Luna is not a scam because everyone who invested already knew about the death spiral they were investing in?\n\nWhat exactly is your argument over why Terra is *not* a scam?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8x9p2o",
                                                                            "author": "Y0rin",
                                                                            "score": 6,
                                                                            "created_utc": 1652776404.0,
                                                                            "response": "To me a scam is a team that is intentionally scamming people out of their money. \n\nThe team did show ways of strenghening the mechanism. For instance, by building a BTC reserve (which wasn't online at the time of the crash) and they were moving into a large liquidity pool (the 4 pool).\n\nThe attack happened when they were at their weakest (they withdrew the liquidity from the 3 pool to move to the 4pool and the BTC couldn't be used to exit yet).  This could have been prevented by the team, but doesn't sgnal 'SCAM' to me. It just sounds like the mechanism that it was all built upon wasn't enough to secure the peg.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8xh9yw",
                                                                                    "author": "Green_L3af",
                                                                                    "score": 3,
                                                                                    "created_utc": 1652783158.0,
                                                                                    "response": "So I don't really know much about this, but if I'm understanding what your saying, it sounds like basically  - \n\n\"the thing that everyone was saying could/would happen, actually happened, right before the team was putting in place mechanisms to prevent said thing?\" \n\nSounds a bit fishy but could be a coincidence. For me it's just the more I learn about Do Kwon, his past projects and current response to this...just all seems off. Guess we will see how it all shakes out.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "i8xhkyw",
                                                                                    "author": "everythingbiig",
                                                                                    "score": 0,
                                                                                    "created_utc": 1652783410.0,
                                                                                    "response": "The same team created basis cash which failed for the same reason. They didn’t disclose this to investors and were warned repeatedly Terra could fail in the exact way it did. It was a scam.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8x847g",
                                    "author": "monkeyhold99",
                                    "score": 8,
                                    "created_utc": 1652774927.0,
                                    "response": "Because the team knew it would fail? This same mechanism has been tried and failed numerous times. They went ahead anyways to make money off the fools",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xdw80",
                                            "author": "Far_Perception_3815",
                                            "score": 2,
                                            "created_utc": 1652780268.0,
                                            "response": "Indeed",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8xjrn9",
                                            "author": "iiJokerzace",
                                            "score": 1,
                                            "created_utc": 1652785090.0,
                                            "response": "There's going to be hundreds of \"projects\" and all of them are going to claim they \"failed\".\n\nWhat else are they going to say? We got you good? They literally do sometimes.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8xbtbn",
                                    "author": "TheHorseshoeCrab",
                                    "score": 5,
                                    "created_utc": 1652778348.0,
                                    "response": ">could have worked with a few alterations.\n\nUh oh, here we go again...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xk3jh",
                                            "author": "asuds",
                                            "score": 0,
                                            "created_utc": 1652785325.0,
                                            "response": "To be fair, little to nothing can actually survice a bank run.  Let’s not forget that money market funds broke the buck in 2008. \n\nAnd over collateralized stablecoins could have the same problem if the overall market shock is really bad enough (even usdc although that is by far the least likely.)\n\nUST just had the most risky of the  stablecoin mechanisms.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8xnavd",
                                    "author": "PinkPuppyBall",
                                    "score": 1,
                                    "created_utc": 1652787494.0,
                                    "response": "They where minting ust from luna which was only valuable because of ust. New money was constantly required in order for ust to keep the peg.\n\nForthermore it created an \"infinite money\" loop, where minting ust drove price of luna up, even though it should drive it down. Selling one billion dollars worth of luna? Tanks price because of market forces. Convert it to a stable coin and so the same? No down force, because its \"stable\". \n\nFor these reasons it was a ponzi scheme. It only works when new capital flows in. It stops to function completely. Ust stable at 1 dollar was the function.\n\nAnchor was run by the same people to keep people in the scheme. To call it separate is to excuse these scammers.\n\nI've been calling it a ponzi and warned about its collapse for months.\n\nThis was a scam. It had smoke and mirrors that apparently still fool some. But it was always a scam by all accounts.\n\nStop excusing the people behind luna.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8xnod5",
                                    "author": "Satoshiman256",
                                    "score": 2,
                                    "created_utc": 1652787733.0,
                                    "response": "People warned them multiple times it could fail and they were told to stfu..",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8xbqpi",
                                    "author": "WildRacoons",
                                    "score": 0,
                                    "created_utc": 1652778285.0,
                                    "response": "It was an experiment with less-than-honest parameters, and predatory marketing by parties who should have been way more responsible with their messaging.\n\nLuna may not have been a scam, but a lot of promoters were scammers.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8xcroi",
                                    "author": "Noob313373",
                                    "score": 2,
                                    "created_utc": 1652779232.0,
                                    "response": "Because it was a ponzi to sustain the 20% return?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xczuf",
                                            "author": "Y0rin",
                                            "score": 2,
                                            "created_utc": 1652779441.0,
                                            "response": "But anchor had nothing to do with Luna/UST failing? Anchor was being used as a marketing tool to attract people to UST.\n\nThe peg was lost, not because Anchor was not sustainable, but because an attack on the liquidity caused a depeg and panic in the market.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xeb93",
                                                    "author": "Noob313373",
                                                    "score": -1,
                                                    "created_utc": 1652780640.0,
                                                    "response": "Because it was a ponzi",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8x4pcw",
                                    "author": "jwmoz",
                                    "score": 0,
                                    "created_utc": 1652771855.0,
                                    "response": ">experiment",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8x84i3",
                                    "author": "Enschede2",
                                    "score": 0,
                                    "created_utc": 1652774935.0,
                                    "response": "The mechanism failed because it was a ponzi",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xbbs0",
                                            "author": "Y0rin",
                                            "score": 1,
                                            "created_utc": 1652777912.0,
                                            "response": "That's simply not true, though. Please explain: how was it a ponzi? Do you even understand what a ponzi is?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8xh5w7",
                                    "author": "yndkings",
                                    "score": 1,
                                    "created_utc": 1652783065.0,
                                    "response": "Exactly and there are many more like it, ready to suffer the same. Stable coins are not a good idea",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8xndiw",
                                    "author": "Mytur_Benesderti",
                                    "score": 1,
                                    "created_utc": 1652787543.0,
                                    "response": "You got scammed. Just accept it.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8xr304",
                                    "author": "Sirius-AB",
                                    "score": 1,
                                    "created_utc": 1652789795.0,
                                    "response": "Magic 20% interest not a scam ponzi huh, guess Bitconnect magic bot wasn't a scam ponzi either.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xr6rm",
                                            "author": "Y0rin",
                                            "score": 1,
                                            "created_utc": 1652789856.0,
                                            "response": "The 20% on anchor was not why Luna failed, though.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8x1or4",
                            "author": "Perleflamme",
                            "score": 0,
                            "created_utc": 1652769288.0,
                            "response": "It's entirely possible. And I guess it will be his defense in courtz if it ever ends up in courts.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8xjmgc",
                            "author": "OfficialMarsCurrency",
                            "score": 1,
                            "created_utc": 1652784982.0,
                            "response": "There was little escape for anyone involved in this.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xi4vh",
                    "author": "afternoon_delights",
                    "score": 2,
                    "created_utc": 1652783845.0,
                    "response": "He’s busy getting his tattoo lasered off",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x6lmo",
                    "author": "SuperCryptoBr0",
                    "score": 5,
                    "created_utc": 1652773540.0,
                    "response": "#The guy is a salesman, nothing more.  No extra intelligence or know how.  Just lucky and privileged.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x7629",
                            "author": "Adamn27",
                            "score": -5,
                            "created_utc": 1652774058.0,
                            "response": "I don't know this guy nor his coin but this how losers talk: \"Just lucky and privileged\"\n\nThis is some anti-responsibility woketard talk.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8x83tb",
                                    "author": "HEX_helper",
                                    "score": 2,
                                    "created_utc": 1652774917.0,
                                    "response": "[Normally you’d be right but….](https://twitter.com/novogratz/status/1478535972560195585)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8x9arq",
                                            "author": "Adamn27",
                                            "score": 1,
                                            "created_utc": 1652776032.0,
                                            "response": "What makes him lucky and priviliged about this tatoo?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xbceh",
                                                    "author": "HEX_helper",
                                                    "score": -1,
                                                    "created_utc": 1652777928.0,
                                                    "response": "Not the tattoo \n\nThe fact that he did this shows he has no extra intelligence or know-how",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8xhdxv",
                                                            "author": "Adamn27",
                                                            "score": 1,
                                                            "created_utc": 1652783249.0,
                                                            "response": "How does this post shows that he has no extra intelligence or know-how?  \n\n\nAnd again, I'm not saying the opposite is true, but what are we talking about exactly here?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8xnrhr",
                                                                    "author": "HEX_helper",
                                                                    "score": 1,
                                                                    "created_utc": 1652787788.0,
                                                                    "response": "Novagratz is respected as if he’s something special. Like a particularly smart guy.\n\nThe fact that he tattooed something on his body, then that project went to zero a few months later shows that his due diligence is poor\n\nHe’s obviously just been lucky in the past\n\nWhy do I have to spell this out",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8xmmqt",
                            "author": "pepsirichard62",
                            "score": 0,
                            "created_utc": 1652787059.0,
                            "response": "Saying things like this makes us all dumber",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xq4xn",
                    "author": "PandemoniumX101",
                    "score": 1,
                    "created_utc": 1652789244.0,
                    "response": "Saying promoted is an understatement. Guy has it tattooed on his upper arm.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x3asm",
                    "author": "Mallardshead",
                    "score": -19,
                    "created_utc": 1652770650.0,
                    "response": "Clown. Imagine what Buterin is going to look like when ETH de-collateralizes",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x85ce",
                            "author": "HEX_helper",
                            "score": 12,
                            "created_utc": 1652774956.0,
                            "response": "Eth isn’t collateralised you pleb",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xfcei",
                                    "author": "Mallardshead",
                                    "score": -9,
                                    "created_utc": 1652781537.0,
                                    "response": "They're called stabelcoins dipshit, because 85% of all Ethereum network volume is from stablecoins. That's what happens when nothing in the entire system has established itself as money except for stablecoins—*Gresham's Law*. And when you design something so foolishly that several coins-tokens-scams travel on the base layer along with the gas token ETH, you get an orgy of swaps, wraps, burns, mints and stakes run by dapps that do nothing but optimize token interactions to keep the orgy going. A collateralized scam, dipshit.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}