{
    "subreddit": "ledgerwallet",
    "queries": [
        "Bitcoin",
        "Ethereum",
        "Cryptocurrency",
        "coin"
    ],
    "type": "public",
    "posts": [
        {
            "title": "Changelly issues",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/u21p4v/changelly_issues/",
            "author": "Mysterious_Base1149",
            "created_utc": 1649777178.0,
            "id": "u21p4v",
            "score": 8,
            "num_comments": 39,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "TattooedPolitician",
                    "score": 9,
                    "response": "I’ve seen more posts like this recently, it seems you’ve fallen into the “KYC/frozen funds loop”. They’re going to make you jump through a ton of hoops in an attempt to get back that crypto and odds are they won’t or it will take a long time. Hopefully you didn’t send to much. Ledger and other brands need to take Changelly off their approved partners list.",
                    "comments": [
                        {
                            "author": "Mysterious_Base1149",
                            "score": 9,
                            "response": "I sent quite a bit. Kinda bugging out",
                            "comments": []
                        }
                    ]
                },
                {
                    "author": "shazvaz",
                    "score": 5,
                    "response": "KYC is the biggest danger in crypto. We were much safer before governments got involved.",
                    "comments": []
                }
            ]
        },
        {
            "title": "Scammers Changelly are your swap partner, why Ledger?",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/u0eqa8/scammers_changelly_are_your_swap_partner_why/",
            "author": "klimauk",
            "created_utc": 1649585731.0,
            "id": "u0eqa8",
            "score": 10,
            "num_comments": 13,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "StunningZucchinis",
                    "score": 5,
                    "response": "They should not even allow you to swap unless KYC is processed and accepted from the beginning. \n\nTaking the coins then requiring KYC isn’t a good look. The money should be returned.",
                    "comments": []
                },
                {
                    "author": "btchip",
                    "score": 6,
                    "response": "Moral of the story is that you shouldn't use a centralized platform if you aren't prepared to go through a painful AML/KYC process, not that Changelly are scammers",
                    "comments": []
                }
            ]
        },
        {
            "title": "Ledger Nano S Plus Capabilities Review",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/twy79x/ledger_nano_s_plus_capabilities_review/",
            "author": "tmytro",
            "created_utc": 1649174247.0,
            "id": "twy79x",
            "score": 66,
            "num_comments": 92,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "BartholomewPimpson",
                    "score": 11,
                    "response": "good review, thank you",
                    "comments": []
                },
                {
                    "author": "LedgerSupport_Muto",
                    "score": 9,
                    "response": "Hi! Some apps for the Nano S+ that are developed by external parties are still in their final testing phase. They will be progressively released, as soon as possible. Thank you for the trust you put in our products, and for your patience! 🙏",
                    "comments": []
                },
                {
                    "author": "flaco545",
                    "score": 6,
                    "response": "A few people that purchased it have already mentioned this a few days ago, but yea it sux that they didn’t inform us of the lack of important apps before selling their product to us",
                    "comments": []
                },
                {
                    "author": "Unable_Permission749",
                    "score": 8,
                    "response": "This is a real world review, what no one tells you and you MUST know before to spend your money and worse of all to lose your time trying not figure out thing that you are paying for Ledger to figure them out for you.",
                    "comments": []
                },
                {
                    "author": "AmeerAftab",
                    "score": 9,
                    "response": "Is it just me, or is this sub usually this toxic?\n\nAs per my understanding, Ledger device, OS and integrations with key wallets like Metamask, Phantom etc is Ledger team's job. However, and I could be totally wrong, but the 3rd party apps like Polkadot, Cosmos, Monero etc are managed by their respective teams. Those are NOT Ledger employees and if their app isn't working with Nano S+, shouldn't you all be shouting at them instead?\n\nI thought maybe there are build issues or OS level bugs with Nano S+. But these are just ill-informed rantings. Plz do your homework before creating FUD.",
                    "comments": [
                        {
                            "author": "jvsephii",
                            "score": 5,
                            "response": "This!\n\nI was hoping to actually read something, not \"*this is not working, this is not available, this is not seen*\" all through. Updates will happen.\n\nI'll be putting in my order for the S+ soon even",
                            "comments": []
                        },
                        {
                            "author": "tmytro",
                            "score": 6,
                            "response": "Why should I care of WHO is responsible to develop the integrations? This is not my concern at all, who promised me things is Ledger, it’s not 3 party teams. Most of 3 party wallets clients are open source and it may be Ledger team that makes the integrations as well. \n\nI choose this exact ledger model because thought that it will be ok for my needs, but at the moment it os almost useless for me. It’s just a question notifying the customer - if I knew when I was to buy it that nano s plus will not be able to work with blockchains that I need, I could just buy another model like nano x, because I need it right now, not in the future when they decide to polish it. So if the manufacturer is not informing people about it, I will.",
                            "comments": []
                        }
                    ]
                },
                {
                    "author": "Massive_Fish_2872",
                    "score": 9,
                    "response": "it is even worse that they announced the official release of the normal version… while not even being partially ready with the apps.",
                    "comments": [
                        {
                            "author": "btchip",
                            "score": 13,
                            "response": "Many coins are supported by third parties. Helping them to update their applications to support the Nano S+ is of course a top priority of our teams",
                            "comments": [
                                {
                                    "author": "Massive_Fish_2872",
                                    "score": 8,
                                    "response": "should have been made prior to shipping the devices… i have a useless genesis edition at home… pointless",
                                    "comments": [
                                        {
                                            "author": "btchip",
                                            "score": 7,
                                            "response": "This is unfortunate but as I've mentioned not under our control. The applications will be updated as fast as possible.",
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "Stupid noob question, after getting a bitcoin receiving address from Ledger, will it stay the same after I receive a payment? It won't automatically change or anything?",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/ta985b/stupid_noob_question_after_getting_a_bitcoin/",
            "author": "Opposite-Effective10",
            "created_utc": 1646836807.0,
            "id": "ta985b",
            "score": 5,
            "num_comments": 11,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "I have my seed phrase, but wonder if it will restore the bitcoin if the seed phrase is from metamask",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/t8pi91/i_have_my_seed_phrase_but_wonder_if_it_will/",
            "author": "TreeHuggerWRX",
            "created_utc": 1646660600.0,
            "id": "t8pi91",
            "score": 10,
            "num_comments": 33,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "greenlimejuice",
                    "score": 23,
                    "response": "Also... You didn't stuff any security into your ledger. Sorry to break it to you but your ledger is worthless because of the way you set it up.\n\nThat seed is still on a computer vulnerable to malware. \n\nYou need to generate a new seed and account (on a cold wallet) and transfer everything over. \n\nThis article will help explain how to keep your MetaMask safe: https://youtu.be/2Yuq9u27O94",
                    "comments": [
                        {
                            "author": "be_bo_i_am_robot",
                            "score": 5,
                            "response": "“Worthless” is strong phrasing. I get it, but it’s a bit strong.\n\nYes, a seed phrase that has never been on a computer or smartphone has a far smaller likelihood of potential theft than a phrase that has been. Malware is a thing. So is being sloppy (having photos of the phrase in iCloud, or a text file synced to cloud storage, or whatever).\n\nHowever, a phrase that has been on a computer at some point is not guaranteed to have been compromised. Most have not been, and will never be.\n\nLet’s say, you buy a coin or token on your computer, using Metamask on your PC, and it blows up in value (not a problem the past few weeks lol). You decide it’s high time for a hardware wallet because you want to keep it safer, because it’s actually worth something now, and you’re a HODLer.\n\nBut, alas, gas fees / tokenomics / what have you are costly, to simply move your coins/tokens to a new wallet address.\n\nSo, now you do a quick risk/likelihood calculation: is the potential Risk of having had a seed phrase on a computer for a little bit of time greater than the potential loss via gas fees or what have you?\n\nRisk = Impact x Likelihood\n\nIf you think that the Likelihood that your personal computer has been at all compromised in the past 7 days or whatever is relatively low, it might be an ok move to switch the very same phrase to a hardware wallet, and wipe the phrase off the computer. It’s not necessarily “worthless” to do so per se. Especially if you’ve been careful, never visit shady sites or porn or whatever on that machine, and/or run a secure OS, and all that. It’s like unprotected sex - you’ll *probably* be ok and not get herpes. How careful are you? How well do you know her? Was this one-time, or a 2-month daily rabbit fest?\n\nOP will probably be ok, and moving a seed phrase from a computer to a hardware wallet, and then wiping the phrase from the computer, is statistically much safer than never using a hardware wallet at all. OP just reduced their risk surface exposure by doing this. Just not to 0, is all. Yes, 0 is best, and if OP can generate a new phrase on the hardware device, and then transfer their tokens from Metamask on their PC to it, that is optimal, you are correct.\n\nThere are gradients of Risk, is what I’m saying. OP is probably fine. But, eyes open.",
                            "comments": []
                        }
                    ]
                },
                {
                    "author": "N0365417",
                    "score": 6,
                    "response": "The whole point of a Ledger is to only ever type the seed phrase in on the secure Ledger device which contains a hardware security module to protect your key and never touches the internet.\n\nMetamask is a hot wallet which is internet connected, if you use that seed on the Ledger you’ve not got ANY additional protection by using a Ledger.\n\nTo remedy your issue leave the seed phrase in Metamask, reset the Ledger and generate a new seed phrase using the Ledger - do not take a photo of this phrase, do not store this phrase on a computer, do not put this phrase into Metamask, write it on paper and put it in a safe (or even better buy a steel wallet).\n\nThen send all crypto from Metamask to your newly generated Ethereum/ERC address on the ledger. Your Ethereum/ERC tokens are now secure.\n\nNow each blockchain has different methods of accessing it, Metamask is for Ethereum and Ethereum tokens (known as ERC-20) and a few other cryptocurrencies outside the scope of this post (Cronos/polygon/BSC) but does not cater for Bitcoin. You’ll need to download a Bitcoin wallet such as electrum and set that wallet up with your old Metamask seed phrase in order to access your Bitcoin and to send this to a new Bitcoin address on your Ledger in order to protect your Bitcoin properly.\n\nHope this helps\n\nEDIT: to answer your further question re: seed phrases and Bitcoin:\n\nYou’re correct, Bitcoin cannot be stored on Metamask BUT a seed phrase can be used to generate an address on nearly every chain because they are chain agnostic. Therefore whilst your Bitcoin can be stored on your “Metamask seed phrase” it can’t be accessed via Metamask and you would need to access it as I outlined above.",
                    "comments": []
                },
                {
                    "author": "be_bo_i_am_robot",
                    "score": 5,
                    "response": "Yes.\n\nMetamask itself doesn’t support Bitcoin, but the seed phrase used to generate your Bitcoin private key in Ledger is the same one used in Metamask for Ethereum and/or BSC.\n\nThe different blockchains might use different algorithm/derivation paths to turn a seed phrase into a private key, but for each blockchain, it’ll work the same way every time.\n\nUse the same seed phrase on any Bitcoin wallet, hardware or software, and you’ll get the same exact private key for Bitcoin. Same for ETH, Monero, Nano, DogeInuElonMoonShit, or what have you.",
                    "comments": []
                }
            ]
        },
        {
            "title": "Question about sending Bitcoin",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/t3mnk8/question_about_sending_bitcoin/",
            "author": "patoshinakamoto",
            "created_utc": 1646073923.0,
            "id": "t3mnk8",
            "score": 9,
            "num_comments": 15,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "VariousJackfruit",
                    "score": 11,
                    "response": "No, you wouldn't lose anything. Every format of Bitcoin address is compatible with each other on the blockchain.",
                    "comments": []
                },
                {
                    "author": "Accomplished-Ad-5291",
                    "score": 6,
                    "response": "Preferably choose native segwit.",
                    "comments": []
                }
            ]
        },
        {
            "title": "Ledger Nano S From 4 years ago.",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/t3lzzw/ledger_nano_s_from_4_years_ago/",
            "author": "Urkellitow",
            "created_utc": 1646072244.0,
            "id": "t3lzzw",
            "score": 8,
            "num_comments": 23,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "Sync issue/impossible to add accounts with Bitcoin forks - Unexpected '<'",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/svfu4u/sync_issueimpossible_to_add_accounts_with_bitcoin/",
            "author": "altercrypt1",
            "created_utc": 1645184129.0,
            "id": "svfu4u",
            "score": 7,
            "num_comments": 16,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "Silly question about approving receiving addresses",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/snmdsp/silly_question_about_approving_receiving_addresses/",
            "author": "turick",
            "created_utc": 1644332761.0,
            "id": "snmdsp",
            "score": 7,
            "num_comments": 18,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "seahorseas",
                    "score": 8,
                    "response": "Let me clear a thing for you. All Addresses in Ledger are already predefined when you generate a seed phrase. The seed determines all addresses that can be made (deterministic wallet) . So it doesn't matter if you add an account in Ledger live or not, they are already there - used or not. By adding account in Ledger live you are only telling the wallet which addresses you want to use out of dozens available. You can delete the account in Ledger live and then set it up again, if there was a balance, it will still be there.\n\nI've written an [article about basics of seed phrases](https://getcoinplate.com/en_US/blog/Is-a-seed-phrase-the-same-as-a-private-key-The-ultimate-guide-to-private-keys-and-recovery-seed-phrases/7?utm_source=reddit.com&utm_medium=comment&utm_campaign=r1)  that could be helpful to get a better grasp of how this all works.",
                    "comments": []
                },
                {
                    "author": "LedgerSupport_Muto",
                    "score": 6,
                    "response": "Hi! The \"verifying\" step is important because it allows you to verify if the address displayed on your computer's screen (which is not safe, and which can potentially be compromised by malware) is the same as the address safely derived by your ledger device from your private key. \n\nYou should always trust what is displayed on your Ledger's screen, as what it displayed is safely restricted by the Secure Element of your Nano device. \n\nSending coins to a recipient address A (generated in Ledger Live), that you have not verified on your Ledger's screen, could result in a loss only in the scenario where a malware had swapped your real address with the hacker's address (by exploiting your computer weaknesses). \n\nHope that answers your question 😃\n\nMore on that: \nhttps://blog.ledger.com/trusted-display/",
                    "comments": []
                }
            ]
        },
        {
            "title": "Newly created bitcoin accounts in ledger live mobile. Change no showing in ledger desktop?",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/saucnc/newly_created_bitcoin_accounts_in_ledger_live/",
            "author": "big4570",
            "created_utc": 1642946661.0,
            "id": "saucnc",
            "score": 6,
            "num_comments": 6,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "VariousJackfruit",
                    "score": 8,
                    "response": "You need to add the accounts on each copy of Ledger Live. There is no automatic syncing of the list of accounts between different copies of Ledger Live. \n\nhttps://support.ledger.com/hc/en-us/articles/360014053240-Use-Ledger-Live-on-multiple-devices?docs=true",
                    "comments": []
                }
            ]
        },
        {
            "title": "If in Electrum my Bitcoin has a series of received and change but reads zero as balance, does that mean I don’t have anything? I had fractionals on my Nano S years ago but when recovered to Nano X now there’s nothing. I’m still new. Thanks!",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/s8crkl/if_in_electrum_my_bitcoin_has_a_series_of/",
            "author": "Stocks123456",
            "created_utc": 1642661667.0,
            "id": "s8crkl",
            "score": 11,
            "num_comments": 11,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "gabridome",
                    "score": 8,
                    "response": "One possibility (pretty common) is that when you have created your Electrum wallet and  indicated that you had a Ledger device, you have then mistaken the address derivation in which your money is.  \n\n\nThe choices are three:  \n1.Legacy or BIP44\n\n2. P2SH/P2WPKH or BIP49\n\n3. P2WPKH or BIP84\n\nTry to create a wallet for each one (I would bet on the first if the wallet was created before 2018).",
                    "comments": []
                }
            ]
        },
        {
            "title": "Paranoid about Ledger setup and future retrieval",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/saz1jo/paranoid_about_ledger_setup_and_future_retrieval/",
            "author": "DarthHan",
            "created_utc": 1642959626.0,
            "id": "saz1jo",
            "score": 5,
            "num_comments": 13,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "Mahoganyjoint",
                    "score": 8,
                    "response": "The device is irrelevant once you have your 24 word seed set up. If your device gets lost or breaks in the future you can just buy a new one and restore using your 24 seed phrase (and it doesn't even have to be a Ledger). The device is only there to manage your seed. \n\nI know there is always some paranoia when managing your crypto, but you have followed every step correctly. Just remember that your 24 word seed and passphrase are the only things you need to access your coin. Keep them safe and seperate. But also remember, if you lose one of them your funds are gone.\n\nAlso, one thing that people fail to remember. If you have a temporary Passphrase you have to enter it every time you boot up the device in order to access your funds (Unless you've attached the Passphrase to a PIN)",
                    "comments": []
                }
            ]
        },
        {
            "title": "Full public support of BTC Taproot accounts is now live!",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/s8lwi2/full_public_support_of_btc_taproot_accounts_is/",
            "author": "olivia_ledger",
            "created_utc": 1642693640.0,
            "id": "s8lwi2",
            "score": 35,
            "num_comments": 17,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "GFZDW",
                    "score": 6,
                    "response": "I'm curious... what changed about the Algorand implementation?",
                    "comments": []
                },
                {
                    "author": "retirementdreams",
                    "score": 7,
                    "response": "What does this Taproot do for us as BTC hodlers?",
                    "comments": []
                }
            ]
        },
        {
            "title": "Somewhat new to crypto - just bought a ledger -",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/s8uei7/somewhat_new_to_crypto_just_bought_a_ledger/",
            "author": "Downtown_Geologist35",
            "created_utc": 1642716669.0,
            "id": "s8uei7",
            "score": 6,
            "num_comments": 8,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "I had Nano S in 2017 with Bitcoin in 2017. Lost my Nano S. I hadn’t opened Ledger since 2022 when I bought Nano X. All of my coins restored. But Bitcoin zero balance. I looked up in blockchain and the balance reads zero. What does that mean? Any suggestions about how to restore my balance?",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/rxgrrh/i_had_nano_s_in_2017_with_bitcoin_in_2017_lost_my/",
            "author": "Stocks123456",
            "created_utc": 1641481815.0,
            "id": "rxgrrh",
            "score": 8,
            "num_comments": 44,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "Deminero30",
                    "score": 12,
                    "response": "You probably had a legacy account, so you’ll need to restore a legacy account.",
                    "comments": []
                },
                {
                    "author": "NoHelpdesk",
                    "score": 5,
                    "response": "Does you Ledger show any transactions? My ledges shows transactions from years ago. Any transactions visible on the blockchain?\n\n/edit: don’t reply to users in your DM, as you’ll probably have a few by now",
                    "comments": []
                },
                {
                    "author": "LedgerSupport_Muto",
                    "score": 9,
                    "response": "Hi! Could you please follow the instructions in the article below to increase the address gap limit to 50? It will probably solve the issue 😃\n\n[https://support.ledger.com/hc/en-us/articles/360010892360-Address-gap-limit?docs=true](https://support.ledger.com/hc/en-us/articles/360010892360-Address-gap-limit?docs=true)\n\nIf the issue persists, please connect your device to Electrum as explained here:\n\n[https://support.ledger.com/hc/en-us/articles/115005161925-Set-up-and-use-Electrum?docs=true](https://support.ledger.com/hc/en-us/articles/115005161925-Set-up-and-use-Electrum?docs=true)",
                    "comments": []
                }
            ]
        },
        {
            "title": "Question about multiple devices",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/s059fx/question_about_multiple_devices/",
            "author": "Chap_stick_original",
            "created_utc": 1641772221.0,
            "id": "s059fx",
            "score": 7,
            "num_comments": 16,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "Brettanomyces78",
                    "score": 6,
                    "response": "Why buy a second?  Just uninstall and reinstall apps as needed.  Problem solved.",
                    "comments": []
                }
            ]
        },
        {
            "title": "Lots of 101 Ledger questions",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/u83u3i/lots_of_101_ledger_questions/",
            "author": "poetic_dwarf",
            "created_utc": 1650481413.0,
            "id": "u83u3i",
            "score": 7,
            "num_comments": 11,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "nagydk",
                    "score": 7,
                    "response": "First of all, do not reply to dms. They are probably trying to scam you.\n\nSo you have different kind of wallets. They are custodial vs non-custodial. Custodial means you leave your coins on an exchange. This has its pros and cons but this is another topic. Custodial eallets are hot and cold wallets. Hot wallets are those where your recovery seed is generated and then stored on a device which is connected to the internet. Cold wallet is one where the recovery seed is generated and stored offline (nowadays mostly on a device like ledger). This means that cold wallets are much safer but using them requires a bit more a time.\n\nSo after this your questions\n\n1 - what you mean here is that nobody will have access to your private keys, because they are stored offline. \n\n2 - never do this. You will make a hot wallet from your cold wallet this way. You should only enter your seed in another hardware device. Both wallets (metamask and terra) have options to sync them with your ledger.\n\n3 - you can check your funds in ledger live without connecting the device to your computer.\n\n4 - unfortunately ledger nano s has limited memory so you basically always have to delete/install apps. You can only use apps that are installed currently but that doesnt mean for example you lose your btc if you delete btc app. This only means that you cant send btc as long as the btc app is not installed again.",
                    "comments": []
                },
                {
                    "author": "kyle_thornton",
                    "score": 5,
                    "response": "These are all great questions, and some good answers in the thread already.  I'll take a shot at them too.\n\n\\`1. The Ledger gives you a mechanism to generate a seed phrase offline, off a computer, and allows you to *keep it that way* forever.  As long as you keep up your end of the deal, your seed phrase will stay safe.  You're right that attackers could still ask you for your seed phrase (and they will!), but they'll never get it from you unless you intentionally give it to them.  Obviously you won't do that. \n\nYou also can use your Ledger to sign transactions with malicious scam applications.  These scam applications will try to trick you into signing away your valuables to them while you're not paying attention.  Even if fall for one of these tricks, the signature itself occurs safely and securely, and in no way exposes your seed phrase to anyone.   A single scam transaction can't wipe out your entire account either.  It can take something valuable from you though which can be still cause pain.\n\nLedger tries to protect you from this by putting as many safe-signing features as possible into Ledger Live.  The NFT features, for example, let you transfer NFTs in a way that very clearly shows you on your Ledger's screen what's going on every step of the way.  Lots more features to come, but for now being careful with what you're signing is good practice.\n\n2. Ledger seed phrases follow a standard called BIP39, which is the same standard used by every hardware and software wallet provider.  This means that your seed phrase is ultimately portable, and you could take your ledger-generated seed phrase and import it into Metamask, or import it into a competing hardware wallet, no problem.  Your seed phrase is all you need to transact your assets on the blockchain, which means if it falls into the wrong hands, or gets exposed to a computer with malware, you're flirting with disaster.  I would never recommend you put your seed phrase into a computer for any reason ever.  To answer your question directly though, it is possible.\n\n3. Absolutely.   Zerion and Rainbow are both mobile apps that let you \"watch\" wallet addresses without needing your Ledger around.  You can't transact with watched addresses, but it does a great job at monitoring them.  Zerion can be set up to push-notify you anytime anything happens with the wallet address that you're watching which is really handy for monitoring for anything funky going on (or if you're someone who gets gifted assets pretty often!).  Rainbow is really great a showcasing your NFT collection on the go.  [Zapper.fi](https://Zapper.fi) is also a great website that lets you track your portfolio if you do a lot of DeFi.  Plenty of applications to choose from, and they're all totally fine watching Ledger-based accounts, no problem!\n\n4. The Ledger \"apps\" are often misunderstood, and frankly not well explained by our current literature.  The way to think of the apps as simply teaching your device how to talk to a given blockchain.  The Terra app teaches it how to talk to Terra, the Ethereum app teaches it how to talk to Ethereum.  You can add and remove them at will, and your accounts will always be there waiting for you when you reinstall the app later.  This is because your accounts are tied to your seed phrase, which remains on the device no matter which apps are installed at any given moment.  Feel free to swap apps out whenever/wherever you'd like :)\n\n&#x200B;\n\nSorry for the wall of text, but some great questions and I wanted to get you some good answers!",
                    "comments": []
                }
            ]
        },
        {
            "title": "Wanted to mint my Nano S plus NFT to Ethereum network. I know that Ethereum gas fee is expensive, but is it really this expensive?",
            "url": "https://i.redd.it/pogcl42onxr81.jpg",
            "author": "lakatosbruno_bajnok",
            "created_utc": 1649261497.0,
            "id": "txpqxx",
            "score": 18,
            "num_comments": 47,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "48656c6c6f576f726c64",
                    "score": 11,
                    "response": "Same here for me, I think I'll just keep the NFT on the xDai chain for now",
                    "comments": []
                },
                {
                    "author": "busa1",
                    "score": 5,
                    "response": "Why not keeping it on xDai??",
                    "comments": []
                },
                {
                    "author": "danimfernandes",
                    "score": 5,
                    "response": "Lucky you, my link/QR-code for the NFT says the code doesn't even exist...",
                    "comments": []
                },
                {
                    "author": "Stanley083",
                    "score": 9,
                    "response": "I'm not sure what you are trying to mint. But sometimes if you are not on the \"whitelist\" or \"allowlist\", you'll get a ridiculously high gas fee. It's an error of sorts. When you see this, abort! Don't confirm lol",
                    "comments": []
                }
            ]
        },
        {
            "title": "Sent a Solana NFT to my LedgerX; how do I retrieve it?",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/txv9n1/sent_a_solana_nft_to_my_ledgerx_how_do_i_retrieve/",
            "author": "PermaBare",
            "created_utc": 1649276460.0,
            "id": "txv9n1",
            "score": 7,
            "num_comments": 3,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "Accidentally hid my IMX account on Ledger Live...can't find it anymore",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/tnb8yc/accidentally_hid_my_imx_account_on_ledger/",
            "author": "Equivalent_Media1537",
            "created_utc": 1648173026.0,
            "id": "tnb8yc",
            "score": 5,
            "num_comments": 4,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "Metamask Networks from wallet not showing on Ledger Live",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/tkgoxu/metamask_networks_from_wallet_not_showing_on/",
            "author": "Userquery",
            "created_utc": 1647992981.0,
            "id": "tkgoxu",
            "score": 5,
            "num_comments": 6,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "Ledger Nano S From 4 years ago.",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/t3lzzw/ledger_nano_s_from_4_years_ago/",
            "author": "Urkellitow",
            "created_utc": 1646072244.0,
            "id": "t3lzzw",
            "score": 9,
            "num_comments": 23,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "loupiote2",
                    "score": 6,
                    "response": "It is possible to recover at least Bitcoin and Ethereum relatively easily.\n\nFor Bitcoin:\n\nAll BTC accounts created with ledger devices with Bitcoin app version 1.0.2 and later can be recovered using Electrum, connected to the ledger device.\n\nOn win 10/11, you may have to run Electrum in admin mode (right-click the Electrum icon, then select Run as administrator). Also make sure to close Ledger Live.\n\nMake sure your ledger device is connected, unlocked, and in the Bitcoin app (make sure that \"Browser Support is OFF in the Bitcoin app settings). In Electrum, follow: new account > standard account > use hardware device > select your ledger > select \"legacy\", then Next.\n\nThis will go to legacy account #0, i.e. derivation path m/44'/0'/0'\n\nIf your account is segwit (addresses start with \"3\") or native segwit type (addresses start with \"bc1q\"), select \"p2sh-segwit\" or \"native segwit\" instead of \"legacy\".\n\nIf you have multiple BTC legacy accounts (or if your account is not account #0), you can reach your other accounts by changing the derivation path to m/44'/0'/n' (where n is the account number). E.g. to reach account #1, use m/44'/0'/1' . The account number is the 3rd number in the derivation path (this is also true with p2sh-segwit and native segwit accounts).\n\n\\-----\n\nFor Ethereum and ERC20 tokens, recovery can be done using custom low-level tools, read:\n\n[https://www.reddit.com/r/ledgerwallet/comments/kz2eob/successful\\_recovery\\_story\\_how\\_we\\_recovered\\_100/](https://www.reddit.com/r/ledgerwallet/comments/kz2eob/successful_recovery_story_how_we_recovered_100/)\n\n[https://www.reddit.com/r/ledgerwallet/comments/nbcukn/nano\\_s\\_with\\_12\\_firmware\\_vs\\_eip155\\_successful/](https://www.reddit.com/r/ledgerwallet/comments/nbcukn/nano_s_with_12_firmware_vs_eip155_successful/)\n\n\\-----\n\nFor Litecoin and Ripple, recovery is likely possible but would require even more efforts, so it depends how much you have on your accounts, as it may not be worth the recovery efforts.\n\nFido U2F is an app unrelated with crypto (it's for signing in securely on some systems, like yubikey), so you can ignore it.",
                    "comments": []
                }
            ]
        },
        {
            "title": "Ledger Nano S Storage",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/szqxc1/ledger_nano_s_storage/",
            "author": "Xpertbasterd",
            "created_utc": 1645647678.0,
            "id": "szqxc1",
            "score": 6,
            "num_comments": 8,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "Multiple wallets on one ledger - what if one is compromised?",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/swwvr2/multiple_wallets_on_one_ledger_what_if_one_is/",
            "author": "MichiZH",
            "created_utc": 1645346886.0,
            "id": "swwvr2",
            "score": 17,
            "num_comments": 9,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "N0365417",
                    "score": 7,
                    "response": "Let’s deal with this in parts \n\nAll wallets on ledger live using the same recovery phrase have the same private key. recovery phrase = private key.\n\nThe reason that you can have multiple accounts using one private key is because they can have different derivation paths (places the ledger can derive a key from) \n\nIn the manner you’ve described (bad smart contract) then only the account you sign a transaction with is potentially compromised and it is only compromised to the extent that the malicious contract allows. I.e. if you sign a transaction giving unlimited spend permissions for USDT, the malicious contract can never take your ETH.\n\nPhishing attempts which successfully get your recovery words/private key CAN drain all other accounts using the same private key/recovery words even if they have different derivation paths \n\n\nTLDR: No only the one is compromised",
                    "comments": []
                },
                {
                    "author": "limegreenzx",
                    "score": 6,
                    "response": "No. Only the address on that blockchain would be compromised.\nSo the same address on a different blockchain would not be affected by a bad contract.",
                    "comments": []
                }
            ]
        },
        {
            "title": "NFT Support is now available on Ledger Live Desktop!",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/snjxjy/nft_support_is_now_available_on_ledger_live/",
            "author": "olivia_ledger",
            "created_utc": 1644326022.0,
            "id": "snjxjy",
            "score": 54,
            "num_comments": 25,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "EN3RGIX",
                    "score": 8,
                    "response": "Will Ledger Live support NFTs on Binance Smart Chain or do they need to be bridged to Etherium?\n\nIf not, are there plans to support BSC NFTs in the future?",
                    "comments": [
                        {
                            "author": "LedgerSupport_Muto",
                            "score": 5,
                            "response": "Hi! Our goal is to support the largest number of infrastructures. We don't have any estimated time of arrival for BSC NFTs yet but be sure we're on it 😃",
                            "comments": []
                        }
                    ]
                },
                {
                    "author": "RothePro88",
                    "score": 5,
                    "response": "Nice",
                    "comments": []
                },
                {
                    "author": "Uberg33k",
                    "score": 6,
                    "response": "Oh wow.  Y'all are on fire rolling out the updates today.  Beer and pizza for everyone on the dev team!",
                    "comments": []
                },
                {
                    "author": "gwaelodsynth",
                    "score": 5,
                    "response": "Need #Tezos $XTZ NFTs also please",
                    "comments": []
                }
            ]
        },
        {
            "title": "How are you storing Ethereum with your ledger nano?",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/sk16hi/how_are_you_storing_ethereum_with_your_ledger_nano/",
            "author": "MarcusOctavius",
            "created_utc": 1643940083.0,
            "id": "sk16hi",
            "score": 9,
            "num_comments": 49,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "DarthBen_in_Chicago",
                    "score": 16,
                    "response": "I transferred to Ledger a couple of years ago and paid the gas fees then. I haven’t moved anywhere else since because of the gas fees.",
                    "comments": [
                        {
                            "author": "Purritoboots",
                            "score": 8,
                            "response": "Forced to hodl. Nice",
                            "comments": []
                        },
                        {
                            "author": "KevSanders",
                            "score": 8,
                            "response": "I have a HODL strategy as well. I buy the crypto. I throw a chair through the window of a police station.\n\nI will then have no emergency expenses for medical housing or even car repairs.\n\nFor three years I get free medical dental housing clothing and food and no access to my crypto!",
                            "comments": []
                        }
                    ]
                },
                {
                    "author": "fraganegra",
                    "score": 6,
                    "response": "Staking with Lido",
                    "comments": []
                }
            ]
        },
        {
            "title": "Create eth wallet without Ledger Live",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/sir77f/create_eth_wallet_without_ledger_live/",
            "author": "altompkins",
            "created_utc": 1643815222.0,
            "id": "sir77f",
            "score": 6,
            "num_comments": 20,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "loupiote2",
                    "score": 6,
                    "response": "You can create accounts for virtually every existing cryptos without using Ledger Live.\n\nTo create an ETH account, you can use any ETH front-end connected to your ledger device, like Rabby, MetaMask, MyCryptos, MyEtherWallet etc.\n\nWith MetaMask, you should select Ledger Live if you want the account to also be accessible with Ledger Live. Otherwise, I advise to select legacy",
                    "comments": []
                }
            ]
        },
        {
            "title": "Ledger Nano S Plus Capabilities Review",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/twy79x/ledger_nano_s_plus_capabilities_review/",
            "author": "tmytro",
            "created_utc": 1649174247.0,
            "id": "twy79x",
            "score": 69,
            "num_comments": 92,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "BartholomewPimpson",
                    "score": 11,
                    "response": "good review, thank you",
                    "comments": []
                },
                {
                    "author": "LedgerSupport_Muto",
                    "score": 9,
                    "response": "Hi! Some apps for the Nano S+ that are developed by external parties are still in their final testing phase. They will be progressively released, as soon as possible. Thank you for the trust you put in our products, and for your patience! 🙏",
                    "comments": []
                },
                {
                    "author": "flaco545",
                    "score": 6,
                    "response": "A few people that purchased it have already mentioned this a few days ago, but yea it sux that they didn’t inform us of the lack of important apps before selling their product to us",
                    "comments": []
                },
                {
                    "author": "Unable_Permission749",
                    "score": 7,
                    "response": "This is a real world review, what no one tells you and you MUST know before to spend your money and worse of all to lose your time trying not figure out thing that you are paying for Ledger to figure them out for you.",
                    "comments": []
                },
                {
                    "author": "AmeerAftab",
                    "score": 11,
                    "response": "Is it just me, or is this sub usually this toxic?\n\nAs per my understanding, Ledger device, OS and integrations with key wallets like Metamask, Phantom etc is Ledger team's job. However, and I could be totally wrong, but the 3rd party apps like Polkadot, Cosmos, Monero etc are managed by their respective teams. Those are NOT Ledger employees and if their app isn't working with Nano S+, shouldn't you all be shouting at them instead?\n\nI thought maybe there are build issues or OS level bugs with Nano S+. But these are just ill-informed rantings. Plz do your homework before creating FUD.",
                    "comments": [
                        {
                            "author": "tmytro",
                            "score": 6,
                            "response": "Why should I care of WHO is responsible to develop the integrations? This is not my concern at all, who promised me things is Ledger, it’s not 3 party teams. Most of 3 party wallets clients are open source and it may be Ledger team that makes the integrations as well. \n\nI choose this exact ledger model because thought that it will be ok for my needs, but at the moment it os almost useless for me. It’s just a question notifying the customer - if I knew when I was to buy it that nano s plus will not be able to work with blockchains that I need, I could just buy another model like nano x, because I need it right now, not in the future when they decide to polish it. So if the manufacturer is not informing people about it, I will.",
                            "comments": []
                        }
                    ]
                },
                {
                    "author": "Massive_Fish_2872",
                    "score": 8,
                    "response": "it is even worse that they announced the official release of the normal version… while not even being partially ready with the apps.",
                    "comments": [
                        {
                            "author": "btchip",
                            "score": 13,
                            "response": "Many coins are supported by third parties. Helping them to update their applications to support the Nano S+ is of course a top priority of our teams",
                            "comments": [
                                {
                                    "author": "Massive_Fish_2872",
                                    "score": 9,
                                    "response": "should have been made prior to shipping the devices… i have a useless genesis edition at home… pointless",
                                    "comments": [
                                        {
                                            "author": "btchip",
                                            "score": 8,
                                            "response": "This is unfortunate but as I've mentioned not under our control. The applications will be updated as fast as possible.",
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "SandBox x Ledger collaboration",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/tw62yk/sandbox_x_ledger_collaboration/",
            "author": "Droidex_bot",
            "created_utc": 1649089266.0,
            "id": "tw62yk",
            "score": 5,
            "num_comments": 1,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "Ledger Nano S limited capacity",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/sh2rr2/ledger_nano_s_limited_capacity/",
            "author": "BrindleFly",
            "created_utc": 1643640082.0,
            "id": "sh2rr2",
            "score": 11,
            "num_comments": 23,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "workerdrone_actual",
                    "score": 23,
                    "response": "Nope, that's the way it's designed, on purpose.  But you can delete and install apps as often as you want, if you delete an app the crypto will not be affected, you'll just need to reinstall that app when you want to transact again.",
                    "comments": []
                },
                {
                    "author": "Yavuz_Selim",
                    "score": 12,
                    "response": "The Ledger only stores your private keys (via the recovery phrase). As the private keys prove that you're the owner of the coins, that's all that's needed to access your coins. \n\n&nbsp;\n\nThe apps allow you to interact with these private keys. When you install the Ethereum app for example, you can interact with all your Ethereum accounts and the addresses tied to these accounts. An app itself does not store your coinsl; the apps check your private keys and know which addresses are yours, and allow you to send and receive coins. \n\n&nbsp;\n\nWhen you need to interact with a cryptocoin (either on Ledger Live or another wallet client like MetaMask), you can install the app and make your transactions. So, you can install the Ethereum app, do your thing, and then if needed delete it. By deleting the app, you do not delete any of your coins, you only delete the app that makes it possible to interact with the coins. Your coins are tied to the private keys, and those stay 'stored' on the Ledger even after you delete an app.\n\n&nbsp;\n\nSo, if you need to install an app, but you don't have the required space on your Ledger device, just make space available by deleting on or more of the installed apps. And then install the app that you need.\n\n&nbsp;\n\nIf you notice that you need many apps installed at a time, you can upgrade to the Nano X; that one can handle many more apps at once. You can also wait for the Nano S Plus, which is not yet available. The Nano S is the improved version of  the regular S that has more space available for the apps.",
                    "comments": []
                }
            ]
        },
        {
            "title": "LEDGER NANO S PLUS... AND THEY QUOTE \"THE NANO X ON STEROIDS\"... Q1-Q2 2022!",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/s5ohn8/ledger_nano_s_plus_and_they_quote_the_nano_x_on/",
            "author": "RealTalkTraders",
            "created_utc": 1642375000.0,
            "id": "s5ohn8",
            "score": 5,
            "num_comments": 17,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "TammiKeach",
                    "score": 12,
                    "response": "For anyone looking to buy the Nano S Plus, the [Ledger OTG kit is $17.99](https://creditbit.org/ledger/r) and means you get free shipping which saves you $20.",
                    "comments": []
                },
                {
                    "author": "panthersfan61",
                    "score": 5,
                    "response": "I thought the X was still supposed to be the premium buy. Interesting.",
                    "comments": []
                }
            ]
        },
        {
            "title": "Pretty sure the OP of that post in r/cryptocurrency is just trying to launch a FUD campaign against Ledger now",
            "url": "https://i.redd.it/vxk3mgcnx8981.jpg",
            "author": "Goldkoron",
            "created_utc": 1641116991.0,
            "id": "ru6hc0",
            "score": 100,
            "num_comments": 68,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "btchip",
                    "score": 57,
                    "response": "Consider native assets (ETH, MATIC) were also stolen this is not an approval only hack, so the most likely option is that OP entered his mnemonic into something malicious",
                    "comments": [
                        {
                            "author": "essjay2009",
                            "score": 53,
                            "response": "They admitted there’s malware on the computer they use. I’d bet my net worth that the malware asked them to enter their mnemonic to “verify” their wallet and they did. \n\nNow they’re too far down the rabbit hole for their ego to let them admit they screwed up. Tale as old as time. \n\nAnd why on earth were they unlocking and connecting their ledger just to check their balances?!",
                            "comments": [
                                {
                                    "author": "casablancas2",
                                    "score": 17,
                                    "response": "This is pure logic.\nThe absolute basics behind ledger and the mathematical improbability of someone brute forcing a seed phrase (it works with all hardware wallets not just ledger.....) is ridiculous. \nHe is saving face for sure",
                                    "comments": []
                                },
                                {
                                    "author": "KillerDr3w",
                                    "score": 11,
                                    "response": "My bet is they saved their 12 word recovery phrase as a file on their computer.",
                                    "comments": [
                                        {
                                            "author": "wol",
                                            "score": 11,
                                            "response": "My bet is he gave the phrase to one of the people \"helping\" him.",
                                            "comments": []
                                        },
                                        {
                                            "author": "CornCheeseMafia",
                                            "score": 9,
                                            "response": "Ummm I’ll have you know my computer is password protected and I named the file something would never be able to guess. \n\nUntitled (3).txt",
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "rndcryptoacc",
                            "score": 6,
                            "response": "Could even be the other way round and OP first created a software wallet mnemonic in MetaMask and then imported it in the Ledger - which defeats the purpose of a hardware wallet, but then again OP occurred to be confused about quite a few things in his post.",
                            "comments": []
                        }
                    ]
                },
                {
                    "author": "Goldkoron",
                    "score": 20,
                    "response": "But just in case, I hope someone can prove he is lying or just fucked up with a malicious contract or seed phrase exposure.",
                    "comments": [
                        {
                            "author": "adequate_redditor",
                            "score": 5,
                            "response": "What's the best way to protect ourselves against malicious contracts? (other than not approving any I suppose? :)). \n\nAre contracts limited to their own blockchain? For example, if I approve a contract in blockchain X, could other coins on the same wallet be at risk too?",
                            "comments": [
                                {
                                    "author": "casablancas2",
                                    "score": 8,
                                    "response": "What I do. It might not be the most efficient way.\nIs that I literally only use my ledger to send and receive funds to. I use it for nothing else, I connect it to nothing else.\nIf i want to send something to MM then I will do that,  but not connect my ledger to it. Just send funds. \nI'm mainly a HODLR so this might not be as practical for everyone",
                                    "comments": [
                                        {
                                            "author": "P99163",
                                            "score": 6,
                                            "response": "Does it mean you're not using DeFi at all or not using DeFi with Ledger? Why not use two addresses on Ledger: one for DeFi and the other for HODLing? Even if you stumble upon a malicious smart contract and sign your (DeFi) funds away, your other (HODL) address will still be safe.\n\nThe bottom line is that Ledger is as safe as it can practically be. No malware can extract the seed from the Ledger or force it to sign a transaction without a user's physical input. And that is regardless if the Ledger is locked or unlocked.",
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Crypto-Guide",
                    "score": 18,
                    "response": "These threads pop up every week in the Ledger/Trezor and it away comes down to user error, they likely got pished...\n\nThe OP normally stops responding once they have worked out what they actually did...",
                    "comments": []
                },
                {
                    "author": "dickey1331",
                    "score": 14,
                    "response": "\"computer forensics expert\" lol",
                    "comments": []
                },
                {
                    "author": "skatehabitat24",
                    "score": 40,
                    "response": "Please someone from the team or someone with pull do something about this fud. A fucking malware that infects ledger? What does it physically press the buttons too? Come on!!! He deals in nfts and sketchy airdrops now bashing ledger the whole cc community is smashing ledger rep right now with multiple people claiming tezos the only way. This dude gave his crypto away after receiving a sketch airdrop or he never had the funds in the first place. Look at his account history. Went from a young kid in nofap sub who couldn’t build an 800 pc or set up his internet to having 120k in crypto across 4 wallets!!!??",
                    "comments": [
                        {
                            "author": "mayorOfArlington",
                            "score": 15,
                            "response": "This. It's kinda sad really, that these are the kind of posts we're getting now. What people do for attention nowadays just make me sad.",
                            "comments": []
                        },
                        {
                            "author": "VisibleNinja",
                            "score": 6,
                            "response": "I guess crypto is really life changing! Haha",
                            "comments": []
                        }
                    ]
                },
                {
                    "author": "WySphero",
                    "score": 10,
                    "response": "Lol. It is super obvious once \"forensic computer expert\" is mentioned.",
                    "comments": []
                },
                {
                    "author": "Sixsignatory",
                    "score": 9,
                    "response": "I think the whole thing is \"tax loss\" cover.  One big 'boat accident' and all these posts are meant for IRS documentation.",
                    "comments": []
                },
                {
                    "author": "pifumd",
                    "score": 9,
                    "response": "idk, i never say never, but one thing ive noticed is pretty common with people who ghost once they realize where they fucked up is vague promises to \"update when they can\".\n\nGuess we'll see.\n\n*edit 3 days later - they've edited the post twice now, once yesterday once today, and all they changed was to remove the part about a \"forensic expert\". typical ghosting.",
                    "comments": []
                },
                {
                    "author": "Sobutie",
                    "score": 8,
                    "response": "This guy is bullshit",
                    "comments": []
                },
                {
                    "author": "whitepurls",
                    "score": 7,
                    "response": "I read their post yesterday and my gut tells me it’s fake. The way it is written, it’s super long without saying much. They only responded to the comments that sympathized with them.",
                    "comments": [
                        {
                            "author": "bambeezzy",
                            "score": 5,
                            "response": "This. He states that he donates to ppl in these situations then asks for donations and hints at suicide. It’s clearly a larp looking for a hand out. Also why does he need to connect his ledger to check the balance? Ledger live doesn’t require it. An easier option is bookmarking your address on etherscan. It’s bullshit.",
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "title": "Ledger Live and Tokens needs more regular updates",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/qlhcay/ledger_live_and_tokens_needs_more_regular_updates/",
            "author": "kebabforalle",
            "created_utc": 1635896035.0,
            "id": "qlhcay",
            "score": 5,
            "num_comments": 1,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "If you are thinking about buying a Ledger Nano, read this!",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/q3djcz/if_you_are_thinking_about_buying_a_ledger_nano/",
            "author": "Lanky-Toe-6467",
            "created_utc": 1633626151.0,
            "id": "q3djcz",
            "score": 27,
            "num_comments": 8,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "HODL_monk",
                    "score": 29,
                    "response": "And of course, 3. never take a picture of your seed sheet and / or post it here...\n\n&#x200B;\n\nIts not a real seed sheet, but actual n00bs might not know that.",
                    "comments": []
                }
            ]
        },
        {
            "title": "Recovering wallets from a seed-phrase",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/px39yx/recovering_wallets_from_a_seedphrase/",
            "author": "Whitehatnetizen",
            "created_utc": 1632824167.0,
            "id": "px39yx",
            "score": 6,
            "num_comments": 7,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "Crypto-Guide",
                    "score": 9,
                    "response": "Your seed can regenerate all addresses associated with your Ledger. The wallet basically scans this when you add an account. (I talk about it a bit here: [https://www.youtube.com/watch?v=X3\\_t6wO2f5M](https://www.youtube.com/watch?v=X3_t6wO2f5M)) \n\nIn terms of which cryptos you have, your will need to have some record of that as there is no sure-fire way to know which cryptos are associated with a given seed. (So it would be a case of going through and adding the apps and then adding accounts, assuming it was all in Ledger Live... Which it may not be if you used stuff like ADA)",
                    "comments": []
                }
            ]
        },
        {
            "title": "Cardano (ada) on Ledger - recovery",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/pjakt8/cardano_ada_on_ledger_recovery/",
            "author": "thedutchone13",
            "created_utc": 1630968985.0,
            "id": "pjakt8",
            "score": 7,
            "num_comments": 22,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "Warning: do not pay for your Ledger using crypto - ordered canceled by Ledger and $15 fee for the refund",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/pby8u3/warning_do_not_pay_for_your_ledger_using_crypto/",
            "author": "iamshifter",
            "created_utc": 1629979977.0,
            "id": "pby8u3",
            "score": 30,
            "num_comments": 39,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "Top-Stunna7298",
                    "score": 15,
                    "response": "Usually not advisable to purchase your hardware wallet from a 3rd party site.",
                    "comments": [
                        {
                            "author": "iamshifter",
                            "score": 10,
                            "response": "I agree, hence why their site was my first choice, but I decided to Oder from Amazon, since it was sold by ledger official, but fulfilled by Amazon. \n\nIf you do this you will want to make sure you do not use the first set of seeds you are given, and verify it’s Authenticity via the desktop app.",
                            "comments": [
                                {
                                    "author": "ItsAConspiracy",
                                    "score": 9,
                                    "response": "Fwiw, items \"fulfilled by Amazon\" all go into one big bin holding the same item from all vendors selling it. There have been a lot of issues with counterfeit items, which Amazon can't easily track down because they don't know which vendor put that specific item in the bin.\n\nCounterfeit supplements have been one issue I've seen reports on. I buy my pills from vendors' own websites now. I haven't seen specific reports on hardware wallets yet.\n\nSomewhere on Ledger's site they have instructions for opening up your Nano and ruling out at least the most obvious modifications someone might make.",
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "_swirled",
                    "score": 5,
                    "response": "I used Crypto.com when I bought my Ledger Nano X, paid using CRO and got the cash back. My X is defective though so I am currently in the process of sending it back lol",
                    "comments": []
                },
                {
                    "author": "btchip",
                    "score": 7,
                    "response": "Could you describe more precisely what those $15 are for ? (with a screenshot maybe)",
                    "comments": [
                        {
                            "author": "iamshifter",
                            "score": 5,
                            "response": "I emailed the screenshot to my customer service  correspondence. request (983231)",
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "title": "Ledger Nano S empty box",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/oru0rg/ledger_nano_s_empty_box/",
            "author": "TiredDanijel",
            "created_utc": 1627285415.0,
            "id": "oru0rg",
            "score": 23,
            "num_comments": 61,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "btchip",
                    "score": 18,
                    "response": "Please provide your ticket number and I'll link it to support",
                    "comments": [
                        {
                            "author": "TiredDanijel",
                            "score": 9,
                            "response": "Ticket ID is: 932945\n\nThank you",
                            "comments": []
                        }
                    ]
                },
                {
                    "author": "jfsoaring",
                    "score": 6,
                    "response": "I don’t think your out, I believe Ledger is just very slow in general. At least that is all i see on Reddit.  Hopefully they will get back to you sooner than later.  \n\nI seemed to be the exception to the case. I ordered my X and I got it within 10days. So I guess it’s just hit and miss.",
                    "comments": [
                        {
                            "author": "flyingkiwi46",
                            "score": 6,
                            "response": "I got mine within 15 days (received yesterday)\n\nThe sad part is the device USB C port has a defect... I can only charge my nano X if I apply pressure on the port area while tilting my charging cable.\n\nLooking at how the user above,  when he says that has been trying to contact the support for few months now has me extremely worried \n\nI will wait 2 weeks if I don't get a reply by then I might have open a dispute with my credit card company",
                            "comments": []
                        }
                    ]
                },
                {
                    "author": "SnoozelX",
                    "score": 13,
                    "response": "Hi\n\nYou did the right thing posting to reddit as they don't reply to email but do seem to eventually respond if you post here.\n\nI'm not sure what had happened to ledger but both the support and quality seems to have become terrible. \n\nI got a defective unit and it's now going on months since my original order trying to get what I paid for. It may just be quicker to take this up via your credit card company and dispute the charge rather than trying to deal with ledger support. I'm about to do just that if it's not too late for me.",
                    "comments": [
                        {
                            "author": "btchip",
                            "score": 5,
                            "response": "Sorry about that, please provide your ticket number and I'll link it to support.",
                            "comments": [
                                {
                                    "author": "SnoozelX",
                                    "score": 6,
                                    "response": "Thanks, it's 903400",
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "24 word recovery phrase per cryptocurrency or per wallet?",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/obwi17/24_word_recovery_phrase_per_cryptocurrency_or_per/",
            "author": "thenextbigthing937",
            "created_utc": 1625177380.0,
            "id": "obwi17",
            "score": 6,
            "num_comments": 10,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "sudomatrix",
                    "score": 5,
                    "response": "This is a little tricky, but basically most well known cryptocurrencies use the same standards for HD wallets and use the same SEED PHRASE (usually 24 words from the BIP39 word list). But each cryptocurrency uses a different \"derivation path\", which just means they start with the same SEED but make some different choices in how to generate the private keys and addresses under that seed. You usually won't have to think about his and can just use the same SEED for all of your crypto.\n\nOnce in a while you may find an unusual cryptocurrency that doesn't use the same standards or even more confusing a wallet that doesn't use the same derivation path as most wallets. In that case you could restore your seed to a different wallet and have a bit of a panic when you don't see you coins. But they are still there, you would just have to manually look up and enter the \"derivation path\" that the original wallet used.\n\nIf the coin and wallet state they use the standards you should be fine. The standard generally referred to as \"HD-Wallets\" is also known as BIP-32, BIP-39 and BIP-44. If your wallet and coin use those they should be compatible.\n\nAnd certainly if you are sticking to one wallet or device you shouldn't have any problem using ONE seed for all of your coins, even if you replace that wallet or device with another from the same vendor.",
                    "comments": []
                }
            ]
        },
        {
            "title": "Just got my first Nano S, any tips/suggestions?",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/obwj6c/just_got_my_first_nano_s_any_tipssuggestions/",
            "author": "Artistap",
            "created_utc": 1625177485.0,
            "id": "obwj6c",
            "score": 7,
            "num_comments": 29,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "joannew99",
                    "score": 5,
                    "response": "Test out ur seed by resetting device.",
                    "comments": []
                }
            ]
        },
        {
            "title": "Criminals are mailing altered Ledger devices to steal cryptocurrency",
            "url": "https://www.bleepingcomputer.com/news/cryptocurrency/criminals-are-mailing-altered-ledger-devices-to-steal-cryptocurrency/",
            "author": "d9jj49f",
            "created_utc": 1624285708.0,
            "id": "o4wd6e",
            "score": 121,
            "num_comments": 42,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "d9jj49f",
                    "score": 22,
                    "response": "I know this is an article about a thing that was already reported on Reddit, but it's a nice summary for anyone that missed it. Now if someone could write an article about me post the link to this article we could get a proper feedback loop.",
                    "comments": [
                        {
                            "author": "cryptoripto123",
                            "score": 5,
                            "response": "The important thing about this fake device is that it doesn't actually run some fake firmware on it that breaks the current Ledger security. It's asking you to run some fake Ledger Live app that is stored on the device which is a phishing tool to simply send the keys to the attacker.\n\nI would be more worried if people were actually managing to make fake devices with a whole fake UI loaded, which is feasible, but probably takes a little bit more effort.",
                            "comments": []
                        }
                    ]
                },
                {
                    "author": "CryptoConceal",
                    "score": 5,
                    "response": "I want one!",
                    "comments": []
                }
            ]
        },
        {
            "title": "Nano X Charging-Discharging Problem",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/o6aa70/nano_x_chargingdischarging_problem/",
            "author": "Queasy-Entrance-7050",
            "created_utc": 1624444995.0,
            "id": "o6aa70",
            "score": 9,
            "num_comments": 25,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "Self-custody staking",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/no01wn/selfcustody_staking/",
            "author": "OculoDoc",
            "created_utc": 1622335520.0,
            "id": "no01wn",
            "score": 5,
            "num_comments": 6,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "Last night I was the victim of a SIM swap.",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/nmfzd2/last_night_i_was_the_victim_of_a_sim_swap/",
            "author": "Vmn551",
            "created_utc": 1622145183.0,
            "id": "nmfzd2",
            "score": 206,
            "num_comments": 140,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "pifumd",
                    "score": 18,
                    "response": "ouch. technically this was a port out, not a sim swap, since they moved your number to a new carrier. i know various carriers have optional port-out locks you can put on your lines to help prevent this. \n\nthis is partly why i use different email accounts for crypto, that are for crypto related use only. so the email that was in the ledger leak is not the one i use at coinbase, for example.\n\nwith gmail you can also use custom addresses with '+' eg if your address is myemail@gmail.com you can use myemail+randowebsite@gmail.com. helpful to see when websites sell your data or get breached. tho i wouldn't rely on that for crypto.",
                    "comments": []
                },
                {
                    "author": "Libley",
                    "score": 46,
                    "response": "Get a yubikey. It’s a physical 2FA device that can not be hacked and without physical possession of it no one can get into your stuff. I have one and have it on everything.",
                    "comments": [
                        {
                            "author": "VariousJackfruit",
                            "score": 28,
                            "response": "Better yet, buy at least two of them so you have a backup in case 1 of them is broken or lost.",
                            "comments": []
                        },
                        {
                            "author": "IndigoFlashcard",
                            "score": 10,
                            "response": "But… you already have a Ledger…?",
                            "comments": [
                                {
                                    "author": "Libley",
                                    "score": 8,
                                    "response": "I have 3 of them. But I need to insure whatever coin I leave on an exchange for quick dip purchases or my banking and personal info is safe at all times.",
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Environmental-Owl383",
                    "score": 33,
                    "response": "I don't use Google Authenticator, but Authy, and I've disabled \"multiple devices\". I encourage everybody to disable \"multiple devices\".",
                    "comments": [
                        {
                            "author": "Kalehxc",
                            "score": 10,
                            "response": "Authy or yubikey",
                            "comments": []
                        },
                        {
                            "author": "dsjm2005",
                            "score": 8,
                            "response": "What do you mean by this?",
                            "comments": [
                                {
                                    "author": "Environmental-Owl383",
                                    "score": 10,
                                    "response": "You can configure Authy to be used with your codes on multiple devices, but it is risky (for example, SIM swap).",
                                    "comments": [
                                        {
                                            "author": "Shubb",
                                            "score": 18,
                                            "response": "You are supposed to enable it only for the 2 minutes while setting up a backup device, so if you loose your phone you have easy access to your 2FA. Basically you enable multiple devices, then set it up on your ipad/old phone, then you disable multiple devices on both devices again.",
                                            "comments": [
                                                {
                                                    "author": "FrontHandNerd",
                                                    "score": 6,
                                                    "response": "Yep. This is what I do. I have it on multiple devices but the option disabled so it can’t be added onto new devices.\n\nOne of the devices is wifi only and locked in a safe in my house for worst case scenario",
                                                    "comments": []
                                                },
                                                {
                                                    "author": "flav9",
                                                    "score": 5,
                                                    "response": "If you use google Authenticator you simply scan a QR generated on your main phone with your backup phone. No selection of “multiple-device” is necessary.",
                                                    "comments": [
                                                        {
                                                            "author": "gigadigit",
                                                            "score": 6,
                                                            "response": "What happens if I lose my main phone with Google authenticator?  Any ways to restore my accounts?",
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Huijausta",
                    "score": 25,
                    "response": "Woah. Thank you for the detailed account of the events, this is very informative.\n\nI don't know how they handled that, but if this weren't the case, Ledger should have compensated the victims of this leak.",
                    "comments": [
                        {
                            "author": "TreeburnerCT",
                            "score": 12,
                            "response": "How do you compensate victims of a leak of personal data?  You can't quantify what it costs for someone to be exposed as a holder of cryptocurrencies as they don't suffer financial loss until the personal info is used to attack the person and then it's very difficult to prove that the info from the leak was related considering how many companies have had breaches of personal data.",
                            "comments": []
                        }
                    ]
                },
                {
                    "author": "Karyo_Ten",
                    "score": 9,
                    "response": "Terrifying story.\n\nFor hardware wallet I prefer andOTP. Open-source and with a backup system.",
                    "comments": []
                },
                {
                    "author": "FutureByte",
                    "score": 7,
                    "response": "I've never understood why people prefer Google Authenticator over SMS until now.\nThank you for sharing!",
                    "comments": []
                },
                {
                    "author": "xTheWiseOnex",
                    "score": 6,
                    "response": "use google voice as your 2factor if you have to use a phone, they can't SIM swap google voice!",
                    "comments": []
                },
                {
                    "author": "ruthasacre",
                    "score": 6,
                    "response": "I am curious if every sim swap occurs to T-mobile users only? That seems to be the only phone service provider I come across that has this issue again & again.",
                    "comments": []
                },
                {
                    "author": "farqueue2",
                    "score": 5,
                    "response": "Sim swaps where the existing sim is connected should require 2FA or manual approval or 24 hour delay.",
                    "comments": []
                },
                {
                    "author": "dlerium",
                    "score": 5,
                    "response": "I think most people completely misstate the risk of 2FA SMS. SIM Swaps are an absolute risk but it also relies on your password getting hacked. If you do a good job by using password managers with strong passwords, your passwords are virtually uncrackable. **The problem here illustrated is password resets via SMS which is not 2FA anymore but 1 factor.** In fact take Gmail for example. You can setup to use a hardware key and or Google Authenticator, but [if you provide a recovery phone # then your hardware key is useless](https://support.google.com/accounts/answer/183723). The fact that someone can reset a password or regain access to an account with only a phone # is super concerning",
                    "comments": []
                },
                {
                    "author": "indass",
                    "score": 6,
                    "response": "I'm going to add: BUY YUBIKEY for another layer of online protection. :) \n\nI personally started to use the post box in my local post office, so I never expose my home address again, as well as I bought an additional phone number that I'm using for online shit. \n\nWe are living in the new era, just need to adjust a couple of things and we are good to go :) \n\nThere is no fault in a ledger, well there is, but You can either use hot wallets what is 100 times unsecured or You can just stay safe with adjusting and playing safe from your side. :)",
                    "comments": []
                }
            ]
        },
        {
            "title": "Is there an alternative to ledger live when checking gain or loss?",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/n65qsi/is_there_an_alternative_to_ledger_live_when/",
            "author": "Quelliom",
            "created_utc": 1620302816.0,
            "id": "n65qsi",
            "score": 5,
            "num_comments": 9,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "Article: \"The IRS Wants Help Hacking Cryptocurrency Hardware Wallets\"",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/n1s9f8/article_the_irs_wants_help_hacking_cryptocurrency/",
            "author": "ikukuru",
            "created_utc": 1619783783.0,
            "id": "n1s9f8",
            "score": 40,
            "num_comments": 29,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "btchip",
                    "score": 44,
                    "response": "That's the reason why we decided to use smartcard chips for our products, since they have demonstrated for over 40 years that they're the most difficult chips to hack with physical access",
                    "comments": [
                        {
                            "author": "ikukuru",
                            "score": 11,
                            "response": ">\"There is a portion of this cryptographic puzzle that continues to elude organizations—millions, perhaps even billions of dollars, exist within cryptowallets.\"\n\n\"There is a portion of this cryptographic puzzle that continues to elude organizations\"  Yeah, that portion is math...",
                            "comments": []
                        },
                        {
                            "author": "eurobuoy",
                            "score": 9,
                            "response": "Now if we're continuing our topic of trezor vs ledger in this context, I'd say ledger wins in a landslide.",
                            "comments": []
                        },
                        {
                            "author": "olliec420",
                            "score": 5,
                            "response": "Like the ones in satellite TV access cards?",
                            "comments": [
                                {
                                    "author": "btchip",
                                    "score": 6,
                                    "response": "It was one side market with less security requirements, which still crosses over with the commercial banking/telecom smartcards from time to time",
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "loupiote2",
                    "score": 8,
                    "response": "\\>  millions, perhaps even billions of dollars, exist within cryptowallets.\" \n\nThat's shows that they still don't understand that the crypto are on the blockchains, not in hardware wallets! :)",
                    "comments": []
                },
                {
                    "author": "pixelrage",
                    "score": 16,
                    "response": "Fuck the IRS, bunch of stasi criminal scumbags",
                    "comments": []
                },
                {
                    "author": "Karyo_Ten",
                    "score": 5,
                    "response": "They need to pay mathematicians more.",
                    "comments": []
                },
                {
                    "author": "andrewgreat87",
                    "score": 5,
                    "response": "What if the irs company offer trezor money for implementation of a backdoor?\n\nOr better you install a spy agent in a hardwarewallet company. Is that possible? There was a rumor that apple gonna implement a hardware wallet in the Secure Enclave of the newer Apple devices!",
                    "comments": [
                        {
                            "author": "veganic11",
                            "score": 5,
                            "response": "Or worse they make it law to add a backdoor and illegal to declare it. Hence why open source is the only way to trust what you're using.",
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "title": "Ledger Live 2.26.1 released",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/n0zk8y/ledger_live_2261_released/",
            "author": "saman_ledger",
            "created_utc": 1619683061.0,
            "id": "n0zk8y",
            "score": 30,
            "num_comments": 27,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "sciencetaco",
                    "score": 6,
                    "response": "Is there somewhere we can see a roadmap of upcoming changes? I see pull requests on their GitHub page but I’m interested in something higher level and longer term.",
                    "comments": []
                },
                {
                    "author": "Reddittellmewhy",
                    "score": 6,
                    "response": "Can we stop to have weekly updates ? Just want to store my BTC and I don’t dance polka",
                    "comments": []
                }
            ]
        },
        {
            "title": "Safemoon on ledger?",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/mjhe4k/safemoon_on_ledger/",
            "author": "TheRealDragonOP",
            "created_utc": 1617484288.0,
            "id": "mjhe4k",
            "score": 13,
            "num_comments": 16,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "Experimental apps, risks?",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/mj70uq/experimental_apps_risks/",
            "author": "TragedyStruck",
            "created_utc": 1617450641.0,
            "id": "mj70uq",
            "score": 5,
            "num_comments": 8,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "btchip",
                    "score": 5,
                    "response": "No, an application cannot get the seed phrase - the OS is designed to make this extremely difficult. Applications are also isolated from each other by their derivation path - they cannot derive a key that'd belong to another application. So you're right, the worse thing that can happen is to lose assets associated to this application.",
                    "comments": []
                }
            ]
        },
        {
            "title": "Over $40k of CryptoCurrency Stolen",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/me1j5n/over_40k_of_cryptocurrency_stolen/",
            "author": "wuay",
            "created_utc": 1616801943.0,
            "id": "me1j5n",
            "score": 110,
            "num_comments": 340,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "stevethegodamongmen",
                    "score": 84,
                    "response": "Just want to throw this out there, every few weeks/months someone posts on this sub that their wallet was hacked, never wrote down the seed phrase or shared with anyone. I saw this happen at least 3 times that I can recall, every time a week or two later they delete the post and sometimes delete the account.  \n\n\nMy guess for this behavior is they realize their mistake and delete because they feel dumb, lets just see what happens here.  \n\n\n RemindMe! Two Weeks",
                    "comments": [
                        {
                            "author": "RemindMeBot",
                            "score": 6,
                            "response": "I will be messaging you in 14 days on [**2021-04-10 03:09:25 UTC**](http://www.wolframalpha.com/input/?i=2021-04-10%2003:09:25%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/ledgerwallet/comments/me1j5n/over_40k_of_cryptocurrency_stolen/gsdl1kb/?context=3)\n\n[**23 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fledgerwallet%2Fcomments%2Fme1j5n%2Fover_40k_of_cryptocurrency_stolen%2Fgsdl1kb%2F%5D%0A%0ARemindMe%21%202021-04-10%2003%3A09%3A25%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20me1j5n)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                            "comments": []
                        },
                        {
                            "author": "Caponcapoffstillon",
                            "score": 13,
                            "response": "Well you were right, it was them not a hack.",
                            "comments": []
                        }
                    ]
                },
                {
                    "author": "mreed911",
                    "score": 52,
                    "response": "Was the trust wallet passphrase the same as the ledger passphrase?  You say “separate” but I want to make sure.",
                    "comments": [
                        {
                            "author": "mtlatl",
                            "score": 32,
                            "response": "This is a critical question",
                            "comments": []
                        },
                        {
                            "author": "RandoStonian",
                            "score": 23,
                            "response": "Oh dang, I hadn't even considered that angle. If OP used the same seed in both places, that'd be a pretty solid explanation for how they managed to hit all the seemingly separate accounts they did during such a small window.",
                            "comments": []
                        },
                        {
                            "author": "redpillfinance_tv",
                            "score": 11,
                            "response": "Yeah, if I had to bet, I would say this is likely scenario. Otherwise it is way too coincidental. Point of the ledger is to provide offline verification. The only probable way this happened is if the passphrase was the same and therefore supercedes the ledger in that the recovery phrase is the master key to recover/access funds ultimately. \n\n**To anyone**: your recovery phrase / passphrase is \\*\\*\\*\\*ing important. Try not to enter it at all unless you absolutely need to. Don't think oh it's fun to connect it up on this and that wallet so you can see all your funds, it's not worth the risk.",
                            "comments": [
                                {
                                    "author": "rockflagandeagle-",
                                    "score": 5,
                                    "response": "are you talking about the 24 words when you say recovery phrase / passphrase?",
                                    "comments": [
                                        {
                                            "author": "corytos",
                                            "score": 5,
                                            "response": "yes",
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "loupiote2",
                    "score": 85,
                    "response": "Their Trust wallet (a software wallet) got hacked:  *The passphrase for the Trust Wallet is saved as a screenshot on my iPhone*\n\nSince the OP took a photo / screen shot of their Trust wallet seed, it is likely that they also took a photo of their Ledger seed.\n\nCommon causes of leaked seeds (unauthorized access)\n\nHave you ever:\n\n\\- used a seed that came pre-printed on a card with your ledger (the common pre-seeded ledger scam)\n\n\\- taken a phone photo of your words? (this is the most common source of leakage)\n\n\\- entered your words on your computer or phone (i.e. typed it on your keyboard), e.g. sending an email to yourself (second most common source of leakage)\n\n\\- entered your seed in \"Ledger Live\" when you updated your computer, to recover from \"damaged ledger memory\" or to \"unlock your ledger account\"?\n\n\\- entered your words it in a computer or phone notebook or notepad or any app or website, or on the cloud?\n\n\\- have your words in sight of any webcam, laptop cam, phone cam etc.\n\n\\- printed or photocopied your words using a computer printer or wireless printer or a commercial copy machine?\n\n\\- digitalized your words or encrypted them in anyway with a computer?\n\n\\- used off-line or on-line tools to generate or check your seed or to verify it or to access other software or phone wallets?\n\n[https://www.reddit.com/r/ledgerwallet/comments/kmq68s/psa\\_learn\\_the\\_importance\\_of\\_your\\_24word\\_seed/](https://www.reddit.com/r/ledgerwallet/comments/kmq68s/psa_learn_the_importance_of_your_24word_seed/)",
                    "comments": [
                        {
                            "author": "blevok",
                            "score": 34,
                            "response": "You forgot to mention one big thing that affects a million times more people than all of what you mentioned combined... Re-using passwords.  \nOf course entering the seed for a hardware wallet in any digital form is a very bad idea, but that generally has to be combined with at least one more bad practice to result in a loss, and password re-use is a big one, so i try to mention it whenever an opportunity arises.  \n  \nOP might have what he calls \"my password\", and uses that one password for everything. It's absolutely shocking how many people use a password for more than one site. It was a terrible idea even in the 90's, and it's just plain stupid now.  \n  \nSo maybe he used his one and only password to setup his icloud account, and his google account, and his ebay account, and his paypal account, and his bank account, and his teamviewer account, and literally everything else.  \n  \nThen one of those sites (that has bad security practices) gets their database stolen, and some hacker runs a script that uses the credentials in that database to try to log in to whatever he thinks is the most common site that everyone uses. Then he finds one that works, so he starts using that set of credentials to log into every popular site, and a lot of them work. At that point it's just a guessing game to find out what sites OP uses, and when he finds one, he's pretty much guaranteed to get in. But no doubt some of the first sites he tries will be google, apple, paypal, and teamviewer. He gets into google and apple, starts looking through photos, and finds the pic of OP's seed phrase (which OP is probably not being truthful about), and steals his crypto. Then he goes to paypal and steals cash. Then he tries teamviewer for the possible big score of literally everything OP has.  \n  \nIt wouldn't be at all surprising if OP starts discovering a lot of other accounts have been compromised.  \n  \nPeople, don't re-use passwords. Seriously bad idea that will almost certainly result in some sort of loss at some point.",
                            "comments": [
                                {
                                    "author": "CaptainCaveSam",
                                    "score": 17,
                                    "response": "Password manager is where it’s at",
                                    "comments": [
                                        {
                                            "author": "StopCountingLikes",
                                            "score": 6,
                                            "response": "Which one though? Really asking. How do you lock that down?",
                                            "comments": [
                                                {
                                                    "author": "DecadeMoon",
                                                    "score": 16,
                                                    "response": "I use Bitwarden. It's free, works on all devices, and syncs your passwords between devices.",
                                                    "comments": []
                                                },
                                                {
                                                    "author": "fiocalisti",
                                                    "score": 5,
                                                    "response": "KeepassXC and Keepassium",
                                                    "comments": []
                                                },
                                                {
                                                    "author": "taytayssmaysmay",
                                                    "score": 10,
                                                    "response": "Keepass or bitwarden",
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "loupiote2",
                                    "score": 8,
                                    "response": "true\n\nand you also need to have a strong 2FA over the password. like time-based 2FA. not text-based 2FA!!!",
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "c_games_official",
                    "score": 19,
                    "response": "The Trust Wallet saved as a screenshot is a no brainer. The ledger passphrase is definitely a concern. Since they happened at the same time, likely the bad actor obtained the words for one of the wallets and waited until they were ready to take your other wallet so that they can steal at the same time before you can detect and save one of them. \n\n* How many people know that you have bitcoin stored on a hardware wallet (friends, family, coworkers, fellow students)?\n* Did you just set up the device with the passphrase once or did you perform regular recovery exercises using the recovery app or resetting it altogether?\n* Have you ever typed the phrase on a computer (even if it was Notepad and you never saved the file), on a phone, whispered it to yourself while entering the phrase near a recording device?\n* Is it possible someone found the paper it was written on, snapped a photo of it and put it back without your knowledge?\n\nI know it sucks and I sympathize but the fact that you said \"I never entered anywhere - not even my phone\" sounds naive. 40k is a lot of money, but since you were saving for college tuition, I am hoping you are young enough to rebuild.",
                    "comments": []
                },
                {
                    "author": "IndigoFlashcard",
                    "score": 65,
                    "response": "Read the post guys, OP lost funds from an iOS software wallet at exactly the same time. This isn't a Ledger problem or a 24 words problem.",
                    "comments": [
                        {
                            "author": "Drifter5533",
                            "score": 31,
                            "response": "Came here to say this. Either the phone, his PC, his home network, or his home itself (e.g. room mate, family, friends) has been compromised in some way.",
                            "comments": []
                        },
                        {
                            "author": "IronCladAutist",
                            "score": 21,
                            "response": "Your right man shit I didn't even see that. I'm panicking and it's not even my wallet.",
                            "comments": [
                                {
                                    "author": "MaracujaPT",
                                    "score": 24,
                                    "response": "Same, fuck i hate and feel sad when see stuff like this",
                                    "comments": []
                                },
                                {
                                    "author": "Penguins83",
                                    "score": 12,
                                    "response": "Remember seeing the post of some guys wife who stole the funds?? Scary",
                                    "comments": [
                                        {
                                            "author": "ChrisR109",
                                            "score": 5,
                                            "response": "The wife's BF.",
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "mreed911",
                            "score": 16,
                            "response": "If it’s a different 24 words it is...",
                            "comments": []
                        }
                    ]
                },
                {
                    "author": "sciencetaco",
                    "score": 14,
                    "response": "A lot of talk around seed words here. But something else is missing:\n\nWhere is your actual, physical, Ledger Nano device? Is it possible somebody had access to the device and could know the PIN?\n\nAlso check to see if your personal details were in the recent Ledger data leaks. You could have been targeted from that.",
                    "comments": []
                },
                {
                    "author": "Oye_Beltalowda",
                    "score": 12,
                    "response": "Did your Trust Wallet have the same seed phrase (24 words) as the Ledger wallet?",
                    "comments": []
                },
                {
                    "author": "StatisticalMan",
                    "score": 10,
                    "response": "Nobody can know for sure but the most likely scenario is someone came across your hidden seed phrase (seed phrase not passphrase).  Hiding a seed phrase is a horrible horrible idea.  All it takes is for someone to notice it and have a few seconds alone.  Take a photo with their smartphone and put it back.  Now they can steal from you at their convenience.",
                    "comments": [
                        {
                            "author": "xTheWiseOnex",
                            "score": 7,
                            "response": "so how do you suggest storing the seed?",
                            "comments": [
                                {
                                    "author": "StatisticalMan",
                                    "score": 19,
                                    "response": "The same level of security one would secure $40,000 cash.  A fireproof burglary safe or safe deposit box or even better a copy of the seed in both.",
                                    "comments": [
                                        {
                                            "author": "RandoStonian",
                                            "score": 17,
                                            "response": "> Just use a 25th word you don't write down anywhere. With a 25th word, even if your seed is stolen, your funds are totally safe.\n\n(Reposing this, because I don't think enough people know about the ultra easy-to-use 25th word functionality)",
                                            "comments": [
                                                {
                                                    "author": "r_a_d_",
                                                    "score": 5,
                                                    "response": "I would not recommend not writing it down.  This is the type of thing that locks people out of their wallets.",
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "imnotabotareyou",
                                    "score": 8,
                                    "response": "I store a fake 24 seed paper with my ledger in case it ever got stolen. Real one is in a safe. Maybe.",
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "UsmanUrRehmanAhmed",
                    "score": 10,
                    "response": " “The greatest enemy will hide in the last place you would ever look.”\n\n\\-  **Julius Caesar**\n\nDo please think who else did know about your earnings and had access to your phone...",
                    "comments": []
                },
                {
                    "author": "jcr991",
                    "score": 23,
                    "response": "For sure you were hacked man, seriously hacked. I “could understand” your ledger being hacked, but both ledger and trust at the very same time. Someone got access to your computer and phone and hijacked it, installed a malware or some crazy shady shit on it.",
                    "comments": [
                        {
                            "author": "Caponcapoffstillon",
                            "score": 12,
                            "response": "Could also be someone he personally knows that did that. Even family members can be malicious when it comes to money",
                            "comments": []
                        },
                        {
                            "author": "redpillfinance_tv",
                            "score": 5,
                            "response": "Yeah, very suspicious it happening so close together. There must be a link and I'm suspecting same phrase.",
                            "comments": []
                        }
                    ]
                },
                {
                    "author": "jonklinger",
                    "score": 8,
                    "response": "Sorry to say, OP, but if what you claim is true, this has to be an inside job. Meaning, it doesn't seem like your ledger was compromised (because it wouldn't affect your Trust Wallet) or that your phone or PC were compromised, but that you were.\n\n&#x200B;\n\nThis could be a friend, relative, or ex-boyfriend/girlfriend that wants to get back at you; and is more likely due to lax security issues. You said \"I recorded that passphrase on a piece of paper and hid it.\"; well \"hid it\" and \"a piece of paper\" is not enough.\n\nWhy? because someone may have had access to that piece of paper if it wasn't in a safe or locked away. It also means that someone else might have gotten a copy of the paper and used it. I mean, people forget what they did. Could it be that you gave a copy to a friend to save? or it might have been seen by your parents who took a screenshot? Could it be that your house was bugged?\n\n&#x200B;\n\nI mean, it's a shame, it is a big loss of funds. I am sorry for you, but you have to look back and reiterate everything to help others now understand what you did wrong so we can learn from your mistakes.",
                    "comments": []
                },
                {
                    "author": "minutecomb",
                    "score": 6,
                    "response": "OP, you ever gonna reply to comments? If not I'm just gonna assume you figured it out",
                    "comments": []
                },
                {
                    "author": "Inevitable_Moment_11",
                    "score": 12,
                    "response": "Sounds like your seed on Ledger and trust wallet was compromised.  The odds are in the trillions for 2 seeds to be compromised.",
                    "comments": [
                        {
                            "author": "ElGuano",
                            "score": 11,
                            "response": "Trillions? I would imagine much higher than that! The fact that they were compromised at the same time suggests a massive failure with OP's security, not the Ledger.",
                            "comments": []
                        }
                    ]
                },
                {
                    "author": "Caboun6828",
                    "score": 6,
                    "response": "User error got you robbed",
                    "comments": []
                }
            ]
        },
        {
            "title": "Hedera HBAR: Given how complex it is to create a HBAR account, and the fact that the account cannot be recovered from just the BIP39 seed, I'm not sure I'd recommend securing HBAR coins with the Ledger",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/mg2gbc/hedera_hbar_given_how_complex_it_is_to_create_a/",
            "author": "loupiote2",
            "created_utc": 1617060299.0,
            "id": "mg2gbc",
            "score": 6,
            "num_comments": 11,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "Transferring cryptocurrencies from Legder Nano S to my exchange",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/m67zqx/transferring_cryptocurrencies_from_legder_nano_s/",
            "author": "valdomirobarros",
            "created_utc": 1615897894.0,
            "id": "m67zqx",
            "score": 10,
            "num_comments": 11,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "VariousJackfruit",
                    "score": 5,
                    "response": "Ledger support is correct. You need to contact your exchange's support if the blockchain shows the transfer went through.",
                    "comments": []
                }
            ]
        },
        {
            "title": "Recovery phrase correct but wallet empty",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/lzoq04/recovery_phrase_correct_but_wallet_empty/",
            "author": "CasteliusMax1970",
            "created_utc": 1615115931.0,
            "id": "lzoq04",
            "score": 6,
            "num_comments": 30,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "A quick modification request inside Ledger-Live App",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/u6rvc1/a_quick_modification_request_inside_ledgerlive_app/",
            "author": "I-Know-What-To-Do",
            "created_utc": 1650327906.0,
            "id": "u6rvc1",
            "score": 5,
            "num_comments": 10,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "How to leave loved ones a guide for all that crypto?",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/u18qlr/how_to_leave_loved_ones_a_guide_for_all_that/",
            "author": "heyheymrrobot",
            "created_utc": 1649686451.0,
            "id": "u18qlr",
            "score": 16,
            "num_comments": 27,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "SucaMofo",
                    "score": 6,
                    "response": "I don't have a Ledger. I have been looking into getting one for some of my defi. Still trying to figure out how to secure all that in a way like I do with my BTC. That's why I am here browsing this sub. \n\nFor my BTC I have a Trezor. I set up a passphrase so it's like a 13th word. I gave someone my 12 word seed to store and I gave another person my passphrase to store. If something happens they will have to work together to recover my BTC. Both are kept in a safe by each party. \n\nI trust these two people with my life. One person is my father so I am not worried about them going behind my back. My father does not need my money. \n\nMaybe this will help you or others.",
                    "comments": []
                },
                {
                    "author": "Yogicorgi",
                    "score": 7,
                    "response": "Basically bury seed phrase somewhere and talk of lore of buried treasure at family get togethers. Make up stories but always shrug off when asked if the stories are real.  Then create an elaborate scavenger hunt/geo caching adventure  which hints to certain POIs only your family  would know about. At the end they will find a treasure map to your buried seed phrase and you will be remembered forever as a legend",
                    "comments": []
                },
                {
                    "author": "Interesting_Green709",
                    "score": 5,
                    "response": "I thought we are supposed to sell, the day before we leave! 🥺",
                    "comments": [
                        {
                            "author": "VariousJackfruit",
                            "score": 10,
                            "response": "At least in the USA, it's often better tax-wise to not sell right before you die. Your tax basis resets to the value on the date of death, so if your beneficiaries later sell the inherited crypto, they will be able to avoid a bunch of taxes if your crypto had appreciated since you purchased it. They'll only owe taxes on the increase from the value when you died.",
                            "comments": []
                        }
                    ]
                },
                {
                    "author": "LoftySJ",
                    "score": 15,
                    "response": "Just don’t die.",
                    "comments": []
                },
                {
                    "author": "VariousJackfruit",
                    "score": 6,
                    "response": "Wills can be kept secret until when you die, and then they are often required to be filed publicly. If you still want to keep the details of your crypto assets secret, it's better to setup a revocable trust now and put the crypto in there. You then list the beneficiaries inside the trust document. The advantage is that trusts are not required to be made public, so 3rd parties won't have any information about your assets even after you die, and your beneficiaries can inherit without everyone else knowing how much they received. \n\nTalk to an estate & trusts lawyer about setting this up, it should be relatively inexpensive.\n\nYou also want to create a well-written guide for your beneficiaries on how they will actually access your crypto. And maybe run through some drills with them so they will have some idea on what they should do in the event of your death.",
                    "comments": []
                }
            ]
        },
        {
            "title": "Wallet address in ledger live and Ledger Nano S on all apps are not the same anymore on trying to receive coins namely BTC and BNB. It was OK few days ago I could receive/send as the the address matched. I never get the address that matched anymore even on many re-verifications. Is my device buggy?",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/tv84uu/wallet_address_in_ledger_live_and_ledger_nano_s/",
            "author": "HellknowsJS",
            "created_utc": 1648988821.0,
            "id": "tv84uu",
            "score": 6,
            "num_comments": 23,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "Ledger Nano S Plus Capabilities Review",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/twy79x/ledger_nano_s_plus_capabilities_review/",
            "author": "tmytro",
            "created_utc": 1649174247.0,
            "id": "twy79x",
            "score": 67,
            "num_comments": 92,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "BartholomewPimpson",
                    "score": 10,
                    "response": "good review, thank you",
                    "comments": []
                },
                {
                    "author": "LedgerSupport_Muto",
                    "score": 9,
                    "response": "Hi! Some apps for the Nano S+ that are developed by external parties are still in their final testing phase. They will be progressively released, as soon as possible. Thank you for the trust you put in our products, and for your patience! 🙏",
                    "comments": []
                },
                {
                    "author": "flaco545",
                    "score": 6,
                    "response": "A few people that purchased it have already mentioned this a few days ago, but yea it sux that they didn’t inform us of the lack of important apps before selling their product to us",
                    "comments": []
                },
                {
                    "author": "vazhan",
                    "score": 5,
                    "response": "I think I'll wait a few months before buying it. Want to see more reviews like this",
                    "comments": []
                },
                {
                    "author": "Unable_Permission749",
                    "score": 8,
                    "response": "This is a real world review, what no one tells you and you MUST know before to spend your money and worse of all to lose your time trying not figure out thing that you are paying for Ledger to figure them out for you.",
                    "comments": []
                },
                {
                    "author": "AmeerAftab",
                    "score": 12,
                    "response": "Is it just me, or is this sub usually this toxic?\n\nAs per my understanding, Ledger device, OS and integrations with key wallets like Metamask, Phantom etc is Ledger team's job. However, and I could be totally wrong, but the 3rd party apps like Polkadot, Cosmos, Monero etc are managed by their respective teams. Those are NOT Ledger employees and if their app isn't working with Nano S+, shouldn't you all be shouting at them instead?\n\nI thought maybe there are build issues or OS level bugs with Nano S+. But these are just ill-informed rantings. Plz do your homework before creating FUD.",
                    "comments": [
                        {
                            "author": "jvsephii",
                            "score": 5,
                            "response": "This!\n\nI was hoping to actually read something, not \"*this is not working, this is not available, this is not seen*\" all through. Updates will happen.\n\nI'll be putting in my order for the S+ soon even",
                            "comments": []
                        },
                        {
                            "author": "tmytro",
                            "score": 7,
                            "response": "Why should I care of WHO is responsible to develop the integrations? This is not my concern at all, who promised me things is Ledger, it’s not 3 party teams. Most of 3 party wallets clients are open source and it may be Ledger team that makes the integrations as well. \n\nI choose this exact ledger model because thought that it will be ok for my needs, but at the moment it os almost useless for me. It’s just a question notifying the customer - if I knew when I was to buy it that nano s plus will not be able to work with blockchains that I need, I could just buy another model like nano x, because I need it right now, not in the future when they decide to polish it. So if the manufacturer is not informing people about it, I will.",
                            "comments": []
                        }
                    ]
                },
                {
                    "author": "Massive_Fish_2872",
                    "score": 9,
                    "response": "it is even worse that they announced the official release of the normal version… while not even being partially ready with the apps.",
                    "comments": [
                        {
                            "author": "btchip",
                            "score": 12,
                            "response": "Many coins are supported by third parties. Helping them to update their applications to support the Nano S+ is of course a top priority of our teams",
                            "comments": [
                                {
                                    "author": "Massive_Fish_2872",
                                    "score": 8,
                                    "response": "should have been made prior to shipping the devices… i have a useless genesis edition at home… pointless",
                                    "comments": [
                                        {
                                            "author": "btchip",
                                            "score": 7,
                                            "response": "This is unfortunate but as I've mentioned not under our control. The applications will be updated as fast as possible.",
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "Few security questions with Nano S",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/twstc4/few_security_questions_with_nano_s/",
            "author": "kondor89",
            "created_utc": 1649158334.0,
            "id": "twstc4",
            "score": 7,
            "num_comments": 18,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "tigrb8",
                    "score": 5,
                    "response": "Restoring the seed in the new ledger makes that ledger basically an exact replica of the lost one. The private keys are generated the exact same otherwise you couldn’t interact with the coins on the chains. \n\nYes they can both still validate against the accounts so if someone happens to guess your pin code on the lost ledger then they could transact against the account. For maximum security I would move the coins once you restore the account to a new set of ledger generated seeds / new accounts. You can do this with the same ledger by using the passcode feature and adding a 25th word. This will generate all new keys and you will basically have two ledgers in one. I prefer the 25th word as it just adds an even higher level of security.",
                    "comments": []
                }
            ]
        },
        {
            "title": "I tried to move Apecoin from coin base to my ledger nano x— it’s not showing up.",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/tngyna/i_tried_to_move_apecoin_from_coin_base_to_my/",
            "author": "LuftDrage",
            "created_utc": 1648195021.0,
            "id": "tngyna",
            "score": 5,
            "num_comments": 7,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "Accidentally hid my IMX account on Ledger Live...can't find it anymore",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/tnb8yc/accidentally_hid_my_imx_account_on_ledger/",
            "author": "Equivalent_Media1537",
            "created_utc": 1648173026.0,
            "id": "tnb8yc",
            "score": 5,
            "num_comments": 4,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "After adding my Solana account I cannot see staked coins. :(",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/thp0kj/after_adding_my_solana_account_i_cannot_see/",
            "author": "Turbulent-Squirrel-8",
            "created_utc": 1647670132.0,
            "id": "thp0kj",
            "score": 8,
            "num_comments": 7,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "Value for the BEP20 coins",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/th2ixa/value_for_the_bep20_coins/",
            "author": "Comrade__Yuri",
            "created_utc": 1647613399.0,
            "id": "th2ixa",
            "score": 5,
            "num_comments": 5,
            "subreddit": "ledgerwallet",
            "comments": []
        },
        {
            "title": "Can a ledger nano x be used as an upgrade to replace a ledger nano s with existing crypto accounts on ledger live?",
            "url": "https://www.reddit.com/r/ledgerwallet/comments/thnjud/can_a_ledger_nano_x_be_used_as_an_upgrade_to/",
            "author": "False_Lime_7003",
            "created_utc": 1647664134.0,
            "id": "thnjud",
            "score": 15,
            "num_comments": 22,
            "subreddit": "ledgerwallet",
            "comments": [
                {
                    "author": "Wolfos9",
                    "score": 6,
                    "response": "You can have as many backup Nanos as you want to access your crypto/ Ledger live etc as long as your setting them up with the original seed Phrase from the first nano you used.",
                    "comments": []
                }
            ]
        }
    ]
}